{"title":"Batman - The Killing Joke Deluxe Edition (1988, Digital, Zone-E)","uid":9538247,"size":79641934,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:002168799f7b922b945e6000b595d84e7a89a0fc&amp;dn=Batman+-+The+Killing+Joke+Deluxe+Edition+%281988%2C+Digital%2C+Zone-E%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1390975358,"description":"For more information about this famous story, please check the link here: &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Batman:_The_Killing_Joke&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Batman:_The_Killing_Joke&lt;/a&gt;\n\nOf all Alan Moore's considerable work, &quot;The Killing Joke&quot; may be the most divisive, and has probably been analyzed more than any other comic aside from Moore's own &quot;Watchmen&quot;. The story is brutal and cruel, and especially caused quite a controversy over it's callous treatment of Barbara Gordon - the relative merits of which continue as a debate even today. Moore himself has in recent years distanced himself from the work for that same reason. Many feminists have argued that it THE most classic example of Women in Refrigerators Syndrome, or using women as mere props and tools to be discarded as necessary to move a plot forward. Modern writers like Gail Simone and Kelly Sue DeConnick - both lauded in their own right - have decried Moore's crippling of Gordon as vile and unnecessary. Whatever your opinion may be, the fact remains that this is a significant Batman story equal in impact to &quot;A Death in the Family&quot; in terms of emotion, as well as unexpectedly turning Barbara Gordon into the quintessential disabled hero - Oracle, a role in which she excelled for over 20 years. Moore takes us through the Joker's own twisted history (and makes us doubt it every step of the way) as well as turning Commissioner Gordon's life upside down and sending him on a tortuous hellride - quite literally. Batman is forced to reconsider killing the Joker once again - and the story ends on an intriguing and famous note (the titular &quot;Killing Joke&quot; - itself a lightning rod of criticism). All of this is rendered by the underrated Brian Bolland, who has many iconic panels in this TPB including the image I have used above.\n\nWhile there are many torrents that contain this book out there, this is the recent digital edition and the colors really pop, so it may be worth re-reading or, even better, reading for the first time. To my knowledge this version has yet to be posted separately, so I thought I'd add it here. This digital copy is thanks to Zone-Empire. Please seed, and take care! :-)","torrent":{"xt":"urn:btih:002168799f7b922b945e6000b595d84e7a89a0fc","amp;dn":"Batman+-+The+Killing+Joke+Deluxe+Edition+%281988%2C+Digital%2C+Zone-E%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"002168799f7b922b945e6000b595d84e7a89a0fc","infoHashBuffer":{"type":"Buffer","data":[0,33,104,121,159,123,146,43,148,94,96,0,181,149,216,78,122,137,160,252]},"announce":[],"urlList":[]}}