{"title":"David Gilmour Rattle That Lock Tour Live in Concert (2015) 720p","uid":13099217,"size":2641606451,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:0050e76379f9c6f098ea30e7a9bda541860f68ca&amp;dn=David+Gilmour+Rattle+That+Lock+Tour+Live+in+Concert+%282015%29+720p+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"SCSA420","files":4,"time":1451196568,"description":"GandalfTheGray and SCSA420 presents for the David Gilmour and Pink Floyd fans around the world this 720p HD video of the 2015 David Gilmour Rattle That Lock tour here on the Echoes Hub, KAT and ThePirateBay.mn\r\n\r\n\r\nDavid Gilmour Rattle That Lock Tour Live in Concert (2015) 720p HD-GTG-SC-SDH\r\n\r\n\r\nThis is a 720p HD video of David Gilmour of Pink Floyd Live in concert on the Rattle That Lock tour 2015 from Various nights on the tour in different places in Europe and South America. Each song is listed below in order of the beginning of the show to the end of show and also locations of shows. Enjoy the show David Gilmour and Pink Floyd Fans!!! This rrunning time of this 720p HD video is 2:16:20 and is 2.45 GB in size.\r\n\r\n\r\n\r\n01 - 2015-09-12 David Gilmour 5AM at Arena Pula, Croatia \r\n\r\n02 - 2015-12-12 David Gilmour Rattle That Lock Live Allianz Parque in São Paulo, Brazil \r\n\r\n03 - 2015-12-12 David Gilmour Faces Of Stone Live Allianz Parque in São Paulo, Brazil \r\n\r\n04 - 2015-12-16 David Gilmour Wish You Were Here Live Arena Do Gremio in Porto Alegre, Brazil \r\n\r\n05 - 2015-12-12 David Gilmour A Boat Lies Waiting - The Blue Live Allianz Parque in São Paulo, Brazil \r\n\r\n06 - 2015-12-20 David Gilmour Money Live Estadio Nacional in Santiago, Chile \r\n\r\n07 - 2015-09-15 David Gilmour Us And Them Live Ippodromo Del Visarno Florence (Firenze) Italy \r\n\r\n08 - 2015-09-19 David Gilmour In Any Tongue Live Konig Pilsener Arena Oberhausen, Germany \r\n\r\n09 - 2015-12-12 David Gilmour High Hopes Live Allianz Parque in São Paulo, Brazil \r\n\r\n10 - 2015-12-12 David Gilmour Astronomy Domine Live Allianz Parque in São Paulo, Brazil \r\n\r\n11 - 2015-12-14 David Gilmour Shine On You Crazy Diamond Live Pedreira Paulo Leminski in Curitiba, Brazil \r\n\r\n12 - 2015-12-20 David Gilmour Fat Old Sun Live Estadio Nacional in Santiago, Chile \r\n\r\n13 - 2015-09-15 David Gilmour Coming Back To Life Live Ippodromo Del Visarno Florence (Firenze) Italy \r\n\r\n14 - 2015-09-12 David Gilmour On an Island Live in Pula, Croatia \r\n\r\n15 - 2015-12-18 David Gilmour The Girl in The Yellow Dress Live Hipódromo de San Isidro in Buenos Aires, Argentina \r\n\r\n16 - 2015-09-19 David Gilmour Today Live Konig Pilsener Arena Oberhausen, Germany \r\n\r\n17 - 2015-09-15 David Gilmour Sorrow Live Ippodromo Del Visarno Florence (Firenze) Italy \r\n\r\n18 - 2015-12-11 David Gilmour Run Like Hell Live Allianz Parque in São Paulo, Brazil \r\n\r\n19 - 2015-12-20 David Gilmour Time Live Estadio Nacional in Santiago, Chile \r\n\r\n20 - 2015-10-03 David Gilmour Comfortably Numb Live Royal Albert Hall London, England, UK \r\n\r\n\r\nThis video release is in H264 AVCHD MP4 format with 48khz 384 kbps AAC 2 channel stereo audio. This release is playable with Sony Playstation 3, Xbox 360, Samsung Galaxy SIII, S4, S5, S6 smartphones, iPhone, iPad, VLC player as well as Media Player Classic, Windows Media Player, and any other devices capable of playing 720p HD MP4 video files with AAC 2 channel 384 KB/s stereo audio.\r\n\r\n\r\nEnjoy the video and share freely!!!\r\n\r\n\r\nGandalfTheGray on Echoes Hub and \r\nand SCSA420 on KAT and TPB\r\nDecember 26, 2015","torrent":{"xt":"urn:btih:0050e76379f9c6f098ea30e7a9bda541860f68ca","amp;dn":"David+Gilmour+Rattle+That+Lock+Tour+Live+in+Concert+%282015%29+720p+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0050e76379f9c6f098ea30e7a9bda541860f68ca","infoHashBuffer":{"type":"Buffer","data":[0,80,231,99,121,249,198,240,152,234,48,231,169,189,165,65,134,15,104,202]},"announce":[],"urlList":[]}}