{"title":"Multi-Objective Optimization","uid":12153180,"size":7415316,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:009aa032da04c943163f95a669dc0790d33d38d9&amp;dn=Multi-Objective+Optimization&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"clouderone","files":1,"time":1437689514,"description":"Advances in Process Systems Engineering Vol. 1 - Multi-Objective Optimization - Techniques and Applications in Chemical Engineering (World Scientific, 2009).pdf\n\nISBN 9789812836519\n\nOptimization has been playing a key role in the design, planning and operation of chemical and related processes for nearly half a century. Although process optimization for multiple objectives was studied by several researchers back in the 1970s and 1980s, it has attracted active research in the last 10 years, spurred by the new and effective techniques for multi-objective optimization. In order to capture this renewed interest, this monograph presents the recent and ongoing research in multi-optimization techniques and their applications in chemical engineering.\nFollowing a brief introduction and general review on the development of multi-objective optimization applications in chemical engineering since 2000, the book gives a description of selected multi-objective techniques and then goes on to discuss chemical engineering applications. These applications are from diverse areas within chemical engineering, and are presented in detail. All chapters will be of interest to researchers in multi-objective optimization and/or chemical engineering; they can be read individually and used in one s learning and research. Several exercises are included at the end of many chapters, for use by both practicing engineers and students","torrent":{"xt":"urn:btih:009aa032da04c943163f95a669dc0790d33d38d9","amp;dn":"Multi-Objective+Optimization","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"009aa032da04c943163f95a669dc0790d33d38d9","infoHashBuffer":{"type":"Buffer","data":[0,154,160,50,218,4,201,67,22,63,149,166,105,220,7,144,211,61,56,217]},"announce":[],"urlList":[]}}