{"title":"J. M. G. Le Clezio - Nobel Prize in Literature, 2008 (8 books)","uid":13841410,"size":11048582,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:00d320af0272bf62a8eefdf925c3b1e4b7a8237f&amp;dn=J.+M.+G.+Le+Clezio+-+Nobel+Prize+in+Literature%2C+2008+%288+books%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"workerbee","files":15,"time":1457801520,"description":"\nJEAN-MARIE GUSTAVE Le CLÉZIO (b. 1940) is a French-Mauritian writer and professor.  Le Clézio was awarded the 2008 Nobel Prize in Literature as an &quot;author of new departures, poetic adventure and sensual ecstasy, explorer of a humanity beyond and below the reigning civilization.&quot;\r\n\r\nFrom 1963 to 1975, Le Clézio explored themes such as insanity, language, nature and writing.  He received much attention with his first novel, THE INTERROGATION (1963), which won the Prix Renaudot and was shortlisted for the Prix Goncourt.  London's Sunday Telegraph called it &quot;a brilliant and fascinating literary debut, flecked throughout with an originality and a freshness of thought which stirs the imagination.&quot;  As a young writer in the aftermath of existentialism and the nouveau roman, he was a conjurer who tried to lift words above the degenerate state of everyday speech and to restore to them the power to invoke an essential reality.\r\n\r\nHis debut novel was the first in a series of descriptions of crisis, which includes the short story collection FEVER (1965) and THE FLOOD (1966), in which he points out the trouble and fear reigning in the major Western cities.  Even early on Le Clézio stood out as an ecologically engaged author, an orientation that is accentuated with the novels like TERRA AMATA (1967) and WAR (1970).  \r\n\r\nDuring the late 1970s, Le Clézio's style changed drastically; he abandoned experimentation, and the mood of his novels became less tormented as he used themes like childhood, adolescence, and traveling, which attracted a broader, more popular audience.\r\n\r\nHis definitive breakthrough as a novelist came with DESERT (1980), for which he received the Grand Prix Paul Morand from the Académie Française.  This work contains magnificent images of a lost culture in the North African desert, contrasted with a depiction of Europe seen through the eyes of unwanted immigrants.  The main character, the Algerian guest worker Lalla, is a utopian antithesis to the ugliness and brutality of European society.\r\n\r\nThis collection also includes THE AFRICAN (2004), a short autobiographical essay, and the Nobel Prize acceptance speech.\r\n\r\n\r\nThe following books are in ePUB format unless otherwise noted:\r\n\r\n* The African ( David R. Godine, 2013).  Translated by C. Dickson.\r\n\r\n* Desert (David R. Godine, 2009).  Translated by C. Dickson.\r\n\r\n* Fever (Penguin Classics, 2008).  Translated by Daphne Woodward.\r\n\r\n* The Flood (Penguin Classics, 2008).  Translated by Peter Green.\r\n\r\n* The Interrogation (Penguin Classics, 2008).  Translated by Daphne Woodward.\r\n\r\n* &quot;In the Forest of Paradoxes&quot;: The Nobel Prize Lecture (Nobel Foundation, 2008). -- PDF\r\n\r\n* Terra Amata (Penguin Classics, 2008).  Translated by Barbara Bray.\r\n\r\n* War (Vintage, 2008).  Translated by Simon Watson Taylor.\r\n\r\n_____________________________________________________________________________\r\n\r\n\r\nCONTACT ME: You can reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\r\n                       \nhttps://pirates-forum.org/User-workerbee  \r\n\r\nPLEASE HELP TO SEED!  If you like these books and want others to have access to them, please help to seed for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:00d320af0272bf62a8eefdf925c3b1e4b7a8237f","amp;dn":"J.+M.+G.+Le+Clezio+-+Nobel+Prize+in+Literature%2C+2008+%288+books%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00d320af0272bf62a8eefdf925c3b1e4b7a8237f","infoHashBuffer":{"type":"Buffer","data":[0,211,32,175,2,114,191,98,168,238,253,249,37,195,177,228,183,168,35,127]},"announce":[],"urlList":[]}}