{"title":"Polymer Engineering Science and Viscoelasticity","uid":12428683,"size":18573398,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:00e3787c63c678f8b89cedfac821812efc01f3dc&amp;dn=Polymer+Engineering+Science+and+Viscoelasticity&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"clouderone","files":1,"time":1442423756,"description":"Polymer Engineering Science and Viscoelasticity - An Introduction 2nd ed - Hal F. Brinson, L. Catherine Brinson (Springer, 2015).pdf\n\nISBN 978-1-4899-7484-6\n\nThis book provides a unified mechanics and materials perspective on polymers: both the mathematics of viscoelasticity theory as well as the physical mechanisms behind polymer deformation processes. Introductory material on fundamental mechanics is included to provide a continuous baseline for readers from all disciplines. Introductory material on the chemical and molecular basis of polymers is also included, which is essential to the understanding of the thermomechanical response. This self-contained text covers the viscoelastic characterization of polymers including constitutive modeling, experimental methods, thermal response, and stress and failure analysis. Example problems are provided within the text as well as at the end of each chapter.\n\nNew to this edition:\n\n. One new chapter on the use of nano-material inclusions for structural polymer applications and applications such as fiber-reinforced polymers and adhesively bonded structures \n. Brings up-to-date polymer production and sales data and equipment and procedures for evaluating polymer characterization and classification\n\n. The work serves as a comprehensive reference for advanced seniors seeking graduate level courses, first and second year graduate students, and practicing engineers","torrent":{"xt":"urn:btih:00e3787c63c678f8b89cedfac821812efc01f3dc","amp;dn":"Polymer+Engineering+Science+and+Viscoelasticity","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00e3787c63c678f8b89cedfac821812efc01f3dc","infoHashBuffer":{"type":"Buffer","data":[0,227,120,124,99,198,120,248,184,156,237,250,200,33,129,46,252,1,243,220]},"announce":[],"urlList":[]}}