{"title":"Claude Simon - Nobel Prize in Literature, 1985 (4 books)","uid":11345791,"size":5982773,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:01055caf13ed6e68b6de81e79556f990f95515f5&amp;dn=Claude+Simon+-+Nobel+Prize+in+Literature%2C+1985+%284+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"workerbee","files":-1,"time":1414855730,"description":"\nCLAUDE SIMON (1913-2005) was a French novelist and recipient of the 1985 Nobel Prize in Literature for &quot;combin[ing] the poet's and the painter's creativeness with a deepened awareness of time in the depiction of the human condition&quot;.  He is often associated with the nouveau roman movement exemplified in the works of Alain Robbe-Grillet and Michel Butor, and while his fragmented narratives certainly contain some of the formal disruption characteristic of that movement -- in particular TRIPTYCH (1973) -- he nevertheless retains a strong sense of narrative and character.\n\nSimon's work is thematically and stylistically highly original.  More often than not, Simon depicts a reality of death and dissolution, with war a common presence.  He is also preoccupied with the ways in which humans experience time, and the novels often dwell on images of old-age, which are frequently seen through the uncomprehending eyes of childhood.  Simon rejects the conventional novels of the nineteenth century and embraces Dostoyevsky, Conrad, Joyce, Proust, and Faulkner, whose highly charged, evocative use of language he draws upon.  Objects and scenes echo each other, are repeated, turned over and examined in minute detail from many angles; time flows backward, forward, and back again with changing points of view.\n\n\nThe following books, all improved versions of older scans, are in PDF format:\n\n* CONDUCTING BODIES (Grove, 1987).  Translated by Helen R. Lane.\n\n* TRIPTYCH (John Calder, 1977).  Translated by Helen R. Lane with an Introduction by John Fletcher.\n\n* THE TROLLEY (New Press, 2002).  Translated by Richard Howard.\n\n* THE WORLD ABOUT US (Ontario Review, 1983).  Translated by Daniel Weissbort with an Introduction by Mark W. Andrews.\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                           &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!","torrent":{"xt":"urn:btih:01055caf13ed6e68b6de81e79556f990f95515f5","amp;dn":"Claude+Simon+-+Nobel+Prize+in+Literature%2C+1985+%284+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01055caf13ed6e68b6de81e79556f990f95515f5","infoHashBuffer":{"type":"Buffer","data":[1,5,92,175,19,237,110,104,182,222,129,231,149,86,249,144,249,85,21,245]},"announce":[],"urlList":[]}}