{"title":"Apple Aperture 3.4.5 (Apple Store)","uid":8558507,"size":560824453,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:011cb441daf9262d19893e681977cee10d30a716&amp;dn=Apple+Aperture+3.4.5+%28Apple+Store%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"ZeRoLiMi","files":2,"time":1370823672,"description":"Apple Aperture 3.4.5 Mac OSX | 1.12 GB\n\n\nDescription\nAperture is designed for iPhoto users who want to get more out of their photos. It includes powerful tools for refining images, showcasing your work, and managing massive libraries on your Mac. Enhanced Faces and Places provide new ways to organize images.\n\n Nondestructive brushes with built-in edge detection make precision retouching of photographs intuitive and fast. Choose from dozens of built-in adjustment presets, or create your own to give your photos a custom look. Advanced slideshows support HD video and give you complete control over text, transitions, and timing. And stunning full-screen views let you use every inch of your Mac display to navigate and browse your entire library.\n\nOrganize photos using Faces and Places\n** Use face detection and recognition to organize your photos by the people in them\n** Explore photos based on where you took them, using robust GPS support\n** Drag photos to an interactive map to add location data easily\n** Preserve all your Faces and Places data when importing photos from iPhoto\n\nPerfect images with brushes\n** Retouch photos nondestructively using edge-aware brushes\n** Handle the most common touch-up tasks with a set of 10 Quick Brushes\n** Easily paint adjustments into specific parts of the image using built-in edge detection\n\nAdd professional imaging effects with adjustment presets\n** Apply any combination of adjustment settings with a single selection\n** Choose from dozens of ready-to-use presets or create and share your own presets\n** See results of any preset in a live preview window before applying it to an image\n\nCreate stunning multimedia slideshows\n** Use professionally designed themes to weave together photos and HD video clips\n** Add text to slides using your choice of fonts, styles, and colors\n** Build a layered soundtrack with location audio clips and music tracks\n\nPhoto Stream\n** Photo Stream view displays recent photos taken on your iOS devices\n** Automatically import Photo Stream photos into your Aperture library\n** Automatically send newly imported photos to all your iOS devices\n\nRequirements: Mac OS X 10.7.5 or later\nMore info:www.downarchive.ws/user/xidau123/news/\nWhat's New in Version 3.4.5\nAddresses an issue that could cause Aperture to quit unexpectedly when deleting items from a camera or memory card after import\nMemory cards are now ejected correctly when using the Delete Items option after import\nIncludes stability improvements\n","torrent":{"xt":"urn:btih:011cb441daf9262d19893e681977cee10d30a716","amp;dn":"Apple+Aperture+3.4.5+%28Apple+Store%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"011cb441daf9262d19893e681977cee10d30a716","infoHashBuffer":{"type":"Buffer","data":[1,28,180,65,218,249,38,45,25,137,62,104,25,119,206,225,13,48,167,22]},"announce":[],"urlList":[]}}