{"title":"Richard II by Wm Shakespeare Starring David Tennant - Royal Shak","uid":11411160,"size":1572641859,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:01703eada1ce75293efb08bfa7b09b4332af9227&amp;dn=Richard+II+by+Wm+Shakespeare+Starring+David+Tennant+-+Royal+Shak&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"loninappleton","files":4,"time":1415492723,"description":"Richard II by William Shakespeare from Opus Arte Productions (2013)\nPerformed Live by The Royal Shakespeare Company at Stratford\n\nRuntime  166 minutes.  Presented in two parts\nIMDb tt3328054\n\nCast\n\nKing Richard II       David Tennant\nThe Queen             Emma Hamilton\nJohn of Gaunt         Michael Pennington\nHenry of Bolingbroke  Nigel Lindsey\nDuke of York          Oliver Ford Davies\n\nComplete cast list in the end credits.\n\nFor the Production:\n\nDirected by                    Gregory Doran\nMusic                          Paul Englishby\nDirected for the Screen by     Robin Lough\n\nSummary from the DVD\n\nOriginally produced Live from Stratford-upon Avon, a collaboration between the Royal Shakespeare Company and Picturehouse Cinemas.  Broadcast live from Stratford-upon-Avon November 2013.\n\nSummary \n\n&quot;Richard is King. A monarch ordained by God to lead his people. But he is also a man of very human weakness. A man whose vanity threatens to divide the great houses of England and drag his people into a dynastic civil war that will last 100 years&quot;--Container.\n\nMy notes\n\n   Viewers of the other torrents in this collection such as those from the Globe will see a marked difference in style from previous entries.  Whether it be the &quot;Julius Caesar&quot; directed by Gregory Doran or the numerous plays from the Globe directed for the screen by Robin Lough,  this live production for video is of a more traditional variety.\n\n   Fans of David Tennant will of course enjoy seeing him in traditional theater.\nFor those who are not much acquainted with his performances outside of BBC television, the film of &quot;Casanova&quot; with Peter O'Toole should not be missed.\n\n   As always, support these offerings by requesting that your libraries acquire them.  The dvd offers multiple language translations and features with the director.  Also much can be learned from the scenography, lighting and sound.  I did not change the sound from the original for volume  levels.  The choral works and instrumentation are an important element of this production.\n\nNotes written  November 9,  2014","torrent":{"xt":"urn:btih:01703eada1ce75293efb08bfa7b09b4332af9227","amp;dn":"Richard+II+by+Wm+Shakespeare+Starring+David+Tennant+-+Royal+Shak","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01703eada1ce75293efb08bfa7b09b4332af9227","infoHashBuffer":{"type":"Buffer","data":[1,112,62,173,161,206,117,41,62,251,8,191,167,176,155,67,50,175,146,39]},"announce":[],"urlList":[]}}