{"title":"The Beatles Movie Collection","uid":8448571,"size":3402951204,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:017cb9b24338d8952f4878313bffeb193a75e9f5&amp;dn=The+Beatles+Movie+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":4,"uploader":"chuckyancey","files":4,"time":1367944518,"description":"\n\nA Hard Days Night B/W\n\nThe Beatles--the world's most famous rock and roll band starring in their first full-length, hilarious action-packed film--travel from their home town of Liverpool to London to perform in a television broadcast. Along the way they must rescue Paul's unconventional grandfather from various misadventures and drummer Ringo goes missing just before the crucial concert.\n\nDirector: Richard Lester\n\nStars:  John Lennon, Paul McCartney, George Harrison and Ringo Starr\n\n\nHelp!\n\nAn Eastern cult discovers that the sacrificial ring is missing. Ringo, drummer of The Beatles band has it; sent by the girl (who's to be sacrificed) as a gift. Clang, Ahme, Bhuta and several cult members leave for London to retrieve the ring. After several failed attempts to steal the ring, they confront him in an Indian restaurant. Ringo learns that if he does not return the ring soon, he will become the next sacrifice. Ringo then discovers that the ring is stuck on his finger. Its a race against time; John, Paul, and George try to protect their friend while they're all being chased not only by Clang and his minions, but also by two mad scientists and the chief inspector of Scotland yard. Will Ringo be saved, or will he be sacrificed?\n\n\nDirector: Richard Lester\n\nStars:  John Lennon, Paul McCartney, George Harrison and Ringo Starr\n\n\n\nMagical Mystery Tour\n\nThe Beatles first film since &quot;Help&quot; was largely Paul McCartney's project. The story follows a bus load of eccentric characters on a magic journey through the English countryside. Rather than a unified narrative, it becomes a series of psychedelic clips promoting various songs including &quot;The Fool on the Hill,&quot; &quot;Blue Jay Way,&quot; &quot;Your Mother Should Know,&quot; &quot;I Am the Walrus&quot; and &quot;Magical Mystery Tour.&quot; The Bonzo Dog Doo-Dah Band are seen in a strip club playing &quot;Death Cab for Cutie.&quot; \n\nDirected by:\nGeorge Harrison\t \nBernard Knowles\t \t\nJohn Lennon\t \t\nPaul McCartney\t \t\nRingo Starr\t \n \nWriting credits:\nGeorge Harrison\t \nJohn Lennon\t \t\nPaul McCartney\t \nRingo Starr\t \t\n\n\n\nYellow Submarine / cartoon\n\n\nThe Beatles agree to accompany Captain Fred in his Yellow Submarine and go to Pepperland to free it from the music hating Blue Meanies. \n\nThe singing group, The Beatles, at the height of their popularity, agree to accompany Captain Fred in his Yellow Submarine and go to Pepperland to free it from the music hating Blue Meanies. They are recruited by an escapee to come and bring joy (and music) back to the land. The techniques are quite psychedelic in the cartoons and much care was taken to have the walks and mannerisms of the individual Beatles cartoons match the originals.\n\nDirected by: George Dunning\t \t\n \nWriting credits:\nLee Minoff\t \t(story)\nLee Minoff\t \t(screenplay) and\nAl Brodax\t \t(screenplay) &amp;\nJack Mendelsohn\t \t(screenplay) and\nErich Segal\t \t(screenplay)\n\nCast:\n\nThe Beatles\t... \tThemselves (as Sgt. Pepper's Lonely Hearts Club Band)\nJohn Clive\t... \tJohn's (voice)\nGeoffrey Hughes\t... \tPaul's (voice\nPeter Batten\t... \tGeorge's (voice)\nPaul Angelis\t... \tRingo's (voice)/ Chief Blue Meanie\nDick Emery\t... \tJeremy Hilary Boob, Ph.D - Nowhere Man / Lord Mayor / Max \nLance Percival\t... \tYoung / Old Fred (voice)\n \n\n\n","torrent":{"xt":"urn:btih:017cb9b24338d8952f4878313bffeb193a75e9f5","amp;dn":"The+Beatles+Movie+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"017cb9b24338d8952f4878313bffeb193a75e9f5","infoHashBuffer":{"type":"Buffer","data":[1,124,185,178,67,56,216,149,47,72,120,49,59,255,235,25,58,117,233,245]},"announce":[],"urlList":[]}}