{"title":"Rage Against The Machine - 1992 - Self-Titled","uid":3463172,"size":50874885,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0288577367d76ad37168a28e01fc2d4c4bf88cfc&amp;dn=Rage+Against+The+Machine+-+1992+-+Self-Titled&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"KindTorrents","files":11,"time":1143538134,"description":"[b]Cover:[/b]\n\n[img]http://images.amazon.com/images/P/B0000028RR.01.LZZZZZZZ.jpg[/img]\n\n[b]Artist:[/b]\n\nRage Against The Machine\n\n[img]http://image.allmusic.com/00/amg/pic200/drp200/p229/p229606wslv.jpg[/img]\n\n[b]Album:[/b]\n\nRage Against The Machine\n\n[b]Bio[/b]\n\nRage Against the Machine earned acclaim from disenfranchised fans (and not insignificant derision from critics) for their bombastic, fiercely polemical music, which brewed sloganeering leftist rants against corporate America, cultural imperialism, and government oppression into a Molotov cocktail of punk, hip-hop, and thrash. Rage formed in Los Angeles in the early &amp;#039;90s out of the wreckage of a number of local groups: vocalist Zack de la Rocha (the son of Chicano political artist Beto) emerged from the bands Headstance, Farside, and Inside Out; guitarist Tom Morello (the nephew of Jomo Kenyatta, the first Kenyan president) originated in Lock Up; and drummer Brad Wilk played with future Pearl Jam frontman Eddie Vedder. Rounded out by bassist Tim Bob (aka Tim C., born Tim Commerford), a childhood friend of de la Rocha&amp;#039;s, Rage debuted in 1992 with a self-released, self-titled 12-song cassette featuring the song &quot;Bullet in the Head,&quot; which became a hit when reissued as a single later in the year.\n\nThe tape won the band a deal with Epic, and their leap to the majors did not go unnoticed by detractors, who questioned the revolutionary integrity of Rage Against the Machine&amp;#039;s decision to align itself with the label&amp;#039;s parent company, media behemoth Sony. Undeterred, the quartet emerged in late 1992 with their eponymous official debut, which scored the hits &quot;Killing in the Name&quot; and &quot;Bombtrack.&quot; After touring with Lollapalooza and declaring their support of groups like FAIR (Fairness and Accuracy in Reporting), Rock for Choice, and Refuse &amp; Resist, Rage spent a reportedly tumultuous four years working on their follow-up; despite rumors of a breakup, they returned in 1996 with Evil Empire, which entered the U.S. album charts at number one and scored a hit single with &quot;Bulls on Parade.&quot; During 1997, the group joined forces with hip-hop supergroup the Wu-Tang Clan for a summer tour and remained active in support of various leftist political causes, including a controversial 1999 benefit concert for death-row inmate Mumia Abu-Jamal. The Battle of Los Angeles followed later in 1999, also debuting at number one and going double platinum by the following summer. In early 2000, de la Rocha announced plans for a solo project, and the band performed an incendiary show outside the Democratic National Convention in August. The following month, bassist Commerford was arrested for disorderly conduct at MTV&amp;#039;s Video Music Awards following his bizarre disruption of a Limp Bizkit acceptance speech, in which he climbed to the top of a 15-foot set piece and rocked back and forth.\n\nPlans for a live album were announced shortly thereafter, but in October, de la Rocha abruptly announced his departure from the band, citing breakdowns in communication and group decision-making. Surprised but not angry, the remainder of Rage announced plans to continue with a new vocalist, while de la Rocha re-focused on his solo album, which was slated to include collaborations with acclaimed hip-hop artists including DJ Shadow and El-P of Company Flow. December 2000 saw the release of de la Rocha&amp;#039;s final studio effort with the band, the Rick Rubin-produced Renegades; it featured nearly a dozen covers of hip-hop, rock, and punk artists like EPMD, Bruce Springsteen, Devo, the Rolling Stones, the MC5, and more. By 2001, Morello, Wilk, and Commerford had formed Audioslave with former Soundgarden frontman Chris Cornell, and the group released an eponymous album by the end of 2002. With a de la Rocha solo album still not announced, Epic finally released the long-promised concert album Live at the Grand Olympic Auditorium on CD and DVD in time for Christmas 2003. \n\n[b]Review:[/b]\n\nThe first album to successfully merge the amazingly disparate sounds of rap and heavy metal, Rage Against the Machine&amp;#039;s self-titled debut was groundbreaking enough when it was released, and many would argue that its importance and influence remains unchallenged and unsurpassed to this day. The living embodiment of this culture clash, guitar wizard Tom Morello fuses his roots in &amp;#039;80s metal-style shredding with an unprecedented array of six-string acrobatics and rhythmic special effects, most of which no one has even tried to imitate. And from vocalist Zack de la Rocha, the group receives the meaningful rhymes and emotionally charged delivery that white-boy metal could never hope to achieve. Still, despite the unique elements upon which they are built, songs like &quot;Bombtrack,&quot; &quot;Take the Power Back,&quot; and &quot;Know Your Enemy&quot; are immediately memorable, surprisingly straightforward slabs of hard rock. And one need not look further than the main riff of the venomous &quot;Wake Up&quot; -- lifted straight out of Zeppelin&amp;#039;s &quot;Kashmir&quot; -- for conclusive proof of Morello&amp;#039;s influences. Even more impressive is the group&amp;#039;s talent for injecting slowly mounting tension into such highlights as &quot;Settle for Nothing&quot; and &quot;Bullet in the Head,&quot; both of which finally explode with awesome power and rage. In contrast, the band manages to convey their message with even more urgency through stubborn repetition, as seen on &quot;Freedom&quot; and their signature track, &quot;Killing in the Name.&quot; With its relentlessly rebellious mantra of, &quot;F*ck you, I won&amp;#039;t do what you tell me,&quot; the song is a rallying cry of frightening proportions and the unequivocal climax of their vision. A stunning debut that remains absolutely essential.\n\n[b]Tracks:[/b]\n\n   1.  Bombtrack\n   2. Killing In The Name\n   3. Take The Power Back\n   4. Settle For Nothing\n   5. Bullet In The Head\n   6. Know Your Enemy\n   7. Wake Up\n   8. Fistful Of Steel\n   9. Township Rebellion\n  10. Freedom\n\n[b]Rating (of 10):[/b]\n\n9\n\n[b]Release Date:[/b]\n\nNov 3, 1992\n\n[b]Label:[/b]\n\nEpic\n\n[b]Genre:[/b]\n\n    * Rock\n\n[b]Styles:[/b]\n\n    * Heavy Metal\n    * Alternative Pop/ Rock\n    * Alternative Metal\n    * Rap-Metal\n\n[b]Bitrate:[/b]\n\n128kbps\n\n[b]File format:[/b]\n\nmp3\n\n[b]File size:[/b]\n\n48.5 MB","torrent":{"xt":"urn:btih:0288577367d76ad37168a28e01fc2d4c4bf88cfc","amp;dn":"Rage+Against+The+Machine+-+1992+-+Self-Titled","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0288577367d76ad37168a28e01fc2d4c4bf88cfc","infoHashBuffer":{"type":"Buffer","data":[2,136,87,115,103,215,106,211,113,104,162,142,1,252,45,76,75,248,140,252]},"announce":[],"urlList":[]}}