{"title":"Infernal Restraints--Barrel of Fun  Rain DeGrey High Pics","uid":15681464,"size":2664027045,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:02cc6ac689de5eaa196fec52ddce6346eb65d0f5&amp;dn=Infernal+Restraints--Barrel+of+Fun++Rain+DeGrey+High+Pics&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":3,"uploader":"merzedes","files":132,"time":1472324573,"description":"Barrel of Fun | Rain DeGrey\r\n\r\nAugust 26, 2016\r\n\r\n\r\nHigh MP4 + Pics.\r\n\r\n\r\nGorgeous Girl Punished Piece By Piece \r\n \r\nRain DeGrey is always a great time. She's cheerful, she's loud, she's animated, and she lets us do pretty much whatever fucked up thing we can think to do with her gorgeous body. And we have a lot planned for today. We are going to take some time for each side of Rain, her top and her bottom, and the best way we can think to do that is to stick her inside the barrel with whichever part of her we want to play with exposed.\r\n\r\nWe start her out upside down with only her ass and pussy pointing up for us to see and play with. Her flexibility is impressive since she has to be folded completely in half for both her legs and head to be encased in the tight dark metal cylinder at the same time. We take advantage of this first position to let Rain have some fun. O.T. takes out the hitachi, the most powerful handheld vibrator we have, and starts rubbing it on her clit. The combination of the discomfort of her position and the sheer pleasure of the hitachi overtake Rain. Her moans can be heard echoing out of the barrel is her body shakes against it. \r\n\r\nThen we turn Rain back upright so that only her head is poking out of the hole at the top. This is where things start to get bad for Rain. Most girls can barely handle the feeling of a whip on their ass or their back, but Rain is tougher than most girls. Rain is going to be taking lashes directly to the face. That kind of pain is just excruciating, and you can really tell. Once she's done with that she's earned a treat for a ll her hard work. And what better treat to give a good animal than a hearty helping of dog food? \r\n \r\nScreens \nhttp://www.infernalrestraints.com/device/bondage/trailer.php?y=2016&amp;p=08_26rdegrey18&amp;u=InfernalRestraints-Rain-DeGrey-Barrel-of-Fun\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n22 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://s4.postimg.org/5zaprzep9/Merzedes_Shallow2_FAQ2_1337_X_3.jpg\r\n \nhttp://s32.postimg.org/ym8wkx6hx/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:02cc6ac689de5eaa196fec52ddce6346eb65d0f5","amp;dn":"Infernal+Restraints--Barrel+of+Fun++Rain+DeGrey+High+Pics","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02cc6ac689de5eaa196fec52ddce6346eb65d0f5","infoHashBuffer":{"type":"Buffer","data":[2,204,106,198,137,222,94,170,25,111,236,82,221,206,99,70,235,101,208,245]},"announce":[],"urlList":[]}}