{"title":"Caribbean Festival Arts (Art Ebook).pdf","uid":12386295,"size":41213589,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:02fd86642b60b9147f7cab0af961241885ebf5a3&amp;dn=Caribbean+Festival+Arts+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"STBGD","files":1,"time":1441831645,"description":"Caribbean Festival Arts\nSt Louis Art Museum, University of Washington | 1988 | ISBN 0295967021 | Eng | 228 pag | PDF | 39.3 MB\n\nNunley, curator of Arts of Africa, Oceania and the Americas at the St. Louis Art Museum, and Bettelheim, professor of art history at San Francisco State University, here introduce the festival arts of the Caribbean, wherein elements of dance, sculpture, painting, music and poetry intermingle. Vibrant photos--of Jonkonnu, a Christmas parade in Jamaica, the Lenten carnival of Rara in Haiti, the Hosay celebration of Trinidad, New Orleans' Caribbean-inspired Mardi Gras and others--illustrate this in-depth study. An examination of festival incarnations on the various Caribbean islands explores the inter-island differences and the socio-political implications of the masquerade. The authors, as they trace the roots and influences of the mas , also consider the present-day parades of London, Toronto and Brooklyn, now twice removed, they assert, from their African beginnings. This attractive, scholarly study, while recognizing the party and tourist-attraction elements of Caribbean festivals, goes beyond them to deal with the underlying themes and historical evolution of the phenomenon","torrent":{"xt":"urn:btih:02fd86642b60b9147f7cab0af961241885ebf5a3","amp;dn":"Caribbean+Festival+Arts+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02fd86642b60b9147f7cab0af961241885ebf5a3","infoHashBuffer":{"type":"Buffer","data":[2,253,134,100,43,96,185,20,127,124,171,10,249,97,36,24,133,235,245,163]},"announce":[],"urlList":[]}}