{"title":"Grand Theft Auto Episodes from Liberty City-RELOADED","uid":5506186,"size":15782379688,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:03374470061762310264518c11c235eacad9b855&amp;dn=Grand+Theft+Auto+Episodes+from+Liberty+City-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":8,"uploader":".BONE.","files":171,"time":1271819777,"description":"GTA Grand Theft Auto Episodes from Liberty City-RELOADED\n\nGrand Theft Auto: Episodes from Liberty City (c) Take 2 Interactive\nRELEASE.DATE....: 04/2010\nPROTECTION ....: Securom + Custom\nDISC(S).....: 1\nGAME.TYPE ........: Action, Crime\n\n\nWe would like to explain why our recent Solidshield cracks are not using any\nkind of emulator, workaround or protection bypass. As it seems, crackers of\na couple of groups failed to reverse-engineer or understand this awesome\npiece of work! To give a quick overview of how we managed to defeat this\nprotection:\n* Created a set of tools which decompiled the solidshield vm into a set of\nraw x86 programs (including all stolen functions)\n* Stripped all calls to TAGES from those functions and compiled them into\nx86 blocks (with relocation info included).\n* Created our own &quot;dvm.dll&quot; library, which decrypts those precompiled and\nfully reversed stolen functions (they are added as overlay data in the dll),\nmoves them to alloced buffers, fixes relocations and adds E9 jmps from all\nof the protected modules to point to them.\nThat's it! Was it really so hard to check this? We had some mild respect\nto your crackers, but hey - it's all gone now.\n\n\nGame info:\n\nGrand Theft Auto: Episodes from Liberty City includes two complete games -\nThe Lost and Damned &amp; The Ballad of Gay Tony - together on disc for\nPlayStation 3 computer entertainment system and Games for Windows. In The\nLost and Damned, experience Liberty City as Johnny, a veteran member of The\nLost, a notorious biker gang. Johnny has been creating business\nopportunities for The Lost in Liberty City but his first loyalty must be to\nthe patch he wears on his back and to Billy Grey, the club's President.\nHowever, when Billy returns from rehab hell-bent on bloodshed and debauchery,\nJohnny finds himself in the middle of a vicious turf war with rival gangs\nfor control of a city torn apart by violence and corruption. Can the\nbrotherhood survive? The Ballad of Gay Tony injects Liberty City with an\noverdose of guns, glitz, and grime. As Luis Lopez, part-time hoodlum and\nfull-time assistant to legendary nightclub impresario Tony Prince (a.k.a.\n&quot;Gay Tony&quot;), players will struggle with the competing loyalties of family\nand friends, and with the uncertainty about who is real and who is fake in\na world in which everyone has a price.\n\n\n1. Unrar.\n2. Burn or mount the image.\n3. Install the game.\n4. Run the included update to update your game to version 1.1.1.0.\n5. Copy over the cracked content.\n6. Play the game by starting LaunchEFLCc.exe.\n7. Support the software developers. If you like this game, BUY IT!","torrent":{"xt":"urn:btih:03374470061762310264518c11c235eacad9b855","amp;dn":"Grand+Theft+Auto+Episodes+from+Liberty+City-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03374470061762310264518c11c235eacad9b855","infoHashBuffer":{"type":"Buffer","data":[3,55,68,112,6,23,98,49,2,100,81,140,17,194,53,234,202,217,184,85]},"announce":[],"urlList":[]}}