{"title":"FIFA 13_[R.G. Catalyst]","uid":7980198,"size":4404210862,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0347f827f5f78e72dde6e99d4810c4bbb91a8f74&amp;dn=FIFA+13_%5BR.G.+Catalyst%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"Taker009","files":12,"time":1357149432,"description":"FIFA 13 (ENG/RUS) Repack by RG Catalyst  \n\n\n\nReleased: 2012 \nGenre: Sport (Soccer) / 3D \nDeveloper: EA Canada \nPublisher: Electronic Arts \nGame Version: 1.6 \nLanguage: English, Russian \nSound language: English, Russian \nPublication Type: Repack \nCRACK: from RELOADED \n\n\nOperating System: Microsoft Windows Â® XP SP3 / Windows Â® Vista SP2 / Windows Â® 7 \nProcessor: Intel Core 2 Duo processor with a clock frequency of 1.8 GHz \nRAM: 2 GB \nVideo: 256 MB VRAM \nSound Card: DirectX 9.0c compatible \nFree hard drive space: 6 GB \n\n\nDESCRIPTION: \n\nFive revolutionary changes presented in a fresh season of the famous football simulator, output to a new level of artificial intelligence system \n\ndribbling control of the ball and the power struggle. Now compete for the ball at every area of the field will be even more intense and \n\nunpredictable - just like in real football. In addition, the game has two new transfer of the ball. Referees are better determine fouls and \n\nreasonably issue warnings, goalkeepers - act more clearly, and in defense tactics put option, which allows protective orders move across the \n\nfield. Added new animation Airstrike and with 180 degrees, and jubilation at the goal scored.FIFA 13 does not change the authenticity of the \n\ntradition: the game features over 500 officially licensed clubs and 15,000 athletes. \n\n\n&quot;Intelligence attacker. \nIn FIFA 13 much &quot;wiser&quot; artificial intelligence. Virtual players now able to analyze the situation and to vary their actions accordingly. They \n\nwill work much harder than before, have a lot of pressure on the defense and calculate their effect on the two steps ahead. Attackers have \n\nlearned taking away defenders and thus open area for teammates. \n&quot;Total dribble. \nIn FIFA 13 it is crucial every touch of the ball! Players are getting faster and more precise control of the ball, even when rotated 360 degrees. \n\nTread, threatening to break through the enemy's defenses, get out of tackles or turns his back, hiding the ball from the defender. \n&quot;The first touch. \nImproved system for control of the ball and will be times when a player gets it after the first contact, which means that the defenders were more \n\nlikely to select ball, plus they skillfully use the enemy's mistakes. What will be the first contact, depends on several factors, including the \n\npressure, the trajectory and speed of the ball. Players, perfect control of the ball, and so rare, and in FIFA 13 chance of making a bad pass and \n\nlose the ball increased, which levels the playing attacking and playing defense. \n&quot;The tactics of penalty kicks. \nIn FIFA 13 there was lots of ways you can create a dangerous combination for the drawing penalties. Now you will be able to deceive the opponent \n\n- for example, to set the ball up to three players, run forward and use different types of passes. In this case, the opponent is free to change \n\nthe number of players in the wall, move it to the ball or to appoint one of his players to intercept a pass and block the kick. \n&quot;The engine Player Impact Engine second generation. \nTurns ordinary clash a real battle between the players. Defenders can fight for position, pushing, or pushing an opponent in the side to take \n\nadvantage of the growth and mass, forcing the opponent to make a mistake by dribbling or to receive the ball. \n\n\nDo not recoded / cut other localization \nYou can download only the desired voice acting: \nenglish.catalyst - English voice \nrussian.catalyst - Russian voice \nInstallation time ~ 25 minutes \n","torrent":{"xt":"urn:btih:0347f827f5f78e72dde6e99d4810c4bbb91a8f74","amp;dn":"FIFA+13_%5BR.G.+Catalyst%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0347f827f5f78e72dde6e99d4810c4bbb91a8f74","infoHashBuffer":{"type":"Buffer","data":[3,71,248,39,245,247,142,114,221,230,233,157,72,16,196,187,185,26,143,116]},"announce":[],"urlList":[]}}