{"title":"The Creating Brain: The Neuroscience of Genius","uid":8728476,"size":3363659,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0380950c22857436893cb75f494a9ce6ec9cfd63&amp;dn=The+Creating+Brain%3A+The+Neuroscience+of+Genius&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"mdusanjay","files":-1,"time":1374551228,"description":"\nNancy C. Andreasen - The Creating Brain: The Neuroscience of Genius\nPublished: 2005-11-30 | ISBN: 1932594078 | PDF | 197 pages | 3 MB\n\n\nMichelangelo was raised in a rustic village by a family of modest means. Shakespeare's father was a middle-class businessman. Abraham Lincoln came from a family of itinerant farmers. Yet all these men broke free from their limited circumstances and achieved brilliant careers as creative artists and leaders. How such extraordinary creativity develops in the human brain is the subject of renowned psychiatrist Nancy Andreasen's The Creating Brain.\nAndreasen explains here how the brain produces creative breakthroughs in art, literature, and science, revealing that creativity is not the same thing as intelligence. She scrutinizes the complex factors involved in the development of creativity, including the role of patrons and mentors, &quot;non-standard&quot; educations, and the possession of an &quot;omnivorous&quot; vision. A fascinating interview with acclaimed playwright Neil Simon sheds further light on the creative process.The relationship between genius and insanity also plays an important role in Andreasen's examination. Drawing on her studies of writers in the Iowa Writers' Workshop and other scientific evidence, Andreasen asserts that while creativity may sometimes be linked to mental disorders and may be partially due to familial/genetic factors, neither is inevitable nor needed for creativity to flourish.","torrent":{"xt":"urn:btih:0380950c22857436893cb75f494a9ce6ec9cfd63","amp;dn":"The+Creating+Brain%3A+The+Neuroscience+of+Genius","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0380950c22857436893cb75f494a9ce6ec9cfd63","infoHashBuffer":{"type":"Buffer","data":[3,128,149,12,34,133,116,54,137,60,183,95,73,74,156,230,236,156,253,99]},"announce":[],"urlList":[]}}