{"title":"The Complete Guide to Building With Rocks &amp; Stone","uid":12150735,"size":4224459,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:041f26c632f0a00bd5ad950d506f31f5f47a1f3a&amp;dn=The+Complete+Guide+to+Building+With+Rocks+%26amp%3B+Stone&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"mdusanjay","files":1,"time":1437626436,"description":"The Complete Guide to Building With Rocks &amp; Stone: Stonework Projects and Techniques Explained Simply (Back to Basics Building) by Brenda Flynn\n\nEnglish | 2011 | ISBN: 1601383703 | 288 pages | PDF | 4 MB\n\n\nHumans have been building with stone for thousands of years, dating back to the ancient pyramids and the Sphinx. Compiled in 2007, based on the votes of people worldwide, the official New7Wonders of the World list includes Chichen Itza, Brazil s Christ Redeemer statue, the Colosseum, the Taj Mahal, the Great Wall of China, Petra in Jordan, and Machu Picchu all structures made of stone.\n\nThe fact that every one of these iconic structures is made of stone is a testament to the beauty and resilience of this building material. You can bring the aesthetics of stonework to your house and property with help from The Complete Guide to Building with Rocks &amp; Stone: Stonework Projects and Techniques Explained Simply. This book is designed to walk homeowners through the process of developing, planning, and implementing a stone building project. Starting with the basics, you will learn about the common types of stone and where natural stone is found throughout the United States, as well as how to gather your own fieldstone","torrent":{"xt":"urn:btih:041f26c632f0a00bd5ad950d506f31f5f47a1f3a","amp;dn":"The+Complete+Guide+to+Building+With+Rocks+%26amp%3B+Stone","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"041f26c632f0a00bd5ad950d506f31f5f47a1f3a","infoHashBuffer":{"type":"Buffer","data":[4,31,38,198,50,240,160,11,213,173,149,13,80,111,49,245,244,122,31,58]},"announce":[],"urlList":[]}}