{"title":"Frozen Heat by Richard Castle (Nikki Heat Book 4)","uid":7649990,"size":1200953,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:04811297dcf551c8e8f9b5c52fab8c58b2c73da7&amp;dn=Frozen+Heat+by+Richard+Castle+%28Nikki+Heat+Book+4%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":2,"uploader":"azizex666","files":-1,"time":1347995502,"description":"Hot on the heels of Richard Castle's #1 New York Times bestseller Heat Rises comes the fourth novel in the Nikki Heat series, Frozen Heat. Nikki Heat and Jameson Rook are together again, facing an unsolved murder mystery that has haunted Nikki for ten years.\n\n\nNYPD Homicide Detective Nikki Heat arrives at her latest crime scene to find an unidentified woman stabbed to death and stuffed inside a suitcase left on a Manhattan street. Nikki is in for a big shock when this new homicide connects to the unsolved murder of her own mother. Paired once again with her romantic and investigative partner, top journalist Jameson Rook, Heat works to solve the mystery of the body in the suitcase while she is forced to confront unexplored areas of her mother's background.\nFacing relentless danger as someone targets her for the next kill, Nikki's search will unearth painful family truths, expose a startling hidden life, and cause Nikki to reexamine her own past. Heat's passionate quest takes her and Rook from the back alleys of Manhattan to the avenues of Paris, trying to catch a ruthless killer. The question is, now that her mother's cold case has unexpectedly thawed, will Nikki Heat finally be able to solve the dark mystery that has been her demon for ten years?\n\n\n                              Format 1 - .ePUB\n\n                              Format 2 - .Mobi\n\n\n            **Support Your Favorite Authors By Buying Their Books**\n\n               Check out all my Magazine and ebook uploads here.\n\n                    &lt;a href=&quot; https://thepiratebay.se/user/azizex666/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/user/azizex666/&lt;/a&gt;","torrent":{"xt":"urn:btih:04811297dcf551c8e8f9b5c52fab8c58b2c73da7","amp;dn":"Frozen+Heat+by+Richard+Castle+%28Nikki+Heat+Book+4%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04811297dcf551c8e8f9b5c52fab8c58b2c73da7","infoHashBuffer":{"type":"Buffer","data":[4,129,18,151,220,245,81,200,232,249,181,197,47,171,140,88,178,199,61,167]},"announce":[],"urlList":[]}}