{"title":"The Bug - London Zoo 2008 (dubstep)","uid":5197713,"size":74081236,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:04d89046d43b4407fc23a155a3ba9977a4b6a32b&amp;dn=The+Bug+-+London+Zoo+2008+%28dubstep%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"tzanev","files":13,"time":1260005895,"description":"The Bug's music draws influence from dancehall, noise, grime, and hip hop. More subtle influences include dubstep and the dubtronica and broken techno of Basic Channel and Pole.\nThe Bug's first album, Tapping The Conversation, was released in 1997 on the seminal Wordsound label. The album was conceived as an alternative soundtrack to the 1974 Francis Ford Coppola film The Conversation. In this incarnation The Bug consisted of Kevin Martin.\nFrom 2001-2004 The Bug collaborated with UK reggae soundsystem veteran The Rootsman on a number of limited edition 7&quot; singles, released on the Razor X label. These releases were characterised by their harsh, aggressive nature both musically and vocally (vocal artists including Jamaican MCs such as He-Man and Wayne Lonesome).\nThe Bug's second album, Pressure was released on Rephlex Records in 2003. It included a number of more ambient, dub-influenced tracks alongside the ragga-tinged onslaughts.\nThe Razor X singles were compiled on the Killing Sound album (along with newer material) which was released by Rephlex in 2006.\nBug projects have included collaborations with a number of singers and MCs including Cutty Ranks, Flow Dan, Warrior Queen and Ras B. In 2005 he collaborated with Mark Stewart and Keith Levene and has released records on Rephlex, Tigerbeat6 and Klien Records. The Bug produced some radio sessions, including a clash with Soundmurderer on John Peel and a 2006 Breezeblock session with 10 MCs.\nIn 2006, The Bug launched a monthly London-based reggae club night entitled BASH, in collaboration with dubstep producer Loefah. 2008 saw the release of London Zoo, the third full release from the project, to critical acclaim.","torrent":{"xt":"urn:btih:04d89046d43b4407fc23a155a3ba9977a4b6a32b","amp;dn":"The+Bug+-+London+Zoo+2008+%28dubstep%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04d89046d43b4407fc23a155a3ba9977a4b6a32b","infoHashBuffer":{"type":"Buffer","data":[4,216,144,70,212,59,68,7,252,35,161,85,163,186,153,119,164,182,163,43]},"announce":[],"urlList":[]}}