{"title":"ABC of Medical Law [PDF] [StormRG]","uid":11260115,"size":1755590,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:05116f349fd78dca3a73f874d5a2c9daedd08048&amp;dn=ABC+of+Medical+Law+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"0xmovva","files":2,"time":1413952127,"description":"TITLE/EDITION ABC of Medical Law \nAuthor: Lorraine Corfield (Author), Ingrid Granne (Author), William Latimer-Sayer (Author)\nPaperback: 64 pages\nPublisher: BMJ Books; 1 edition (July 7, 2009)\nLanguage: English\nISBN-10: 1405176288\nISBN-13: 978-1405176286\nFormat: Retail PDF\n\nNOTE: this is the standalone ebook and may not include access codes that come packaged with the bound book\n\n__________________________________________________________________________________\n\n\nAn understanding of medical law is increasingly important for all health professionals and this new ABC provides a basic introduction to the legal issues faced in health care that is accessible to anyone without any legal knowledge. The ABC of Medical Law provides ideal guidance to the practicing physician - covering just what you need to know without becoming embroiled in complicated legal discussion.\nThe ABC of Medical Law has up-to-date coverage of the legal issues to be found in daily medical practice, including confidentiality, research, consent, negligence, organ donation and human rights, as well as more contentious issues such as tissue retention and withholding/withdrawing treatment. Well illustrated and presented in a user-friendly format, chapters include summaries and cases to help clarify the points made.\n\nWritten by practising clinicians with expertise in medical law and a medical barrister, the ABC of Medical Law will help keep a practice within the constraints of the law and is ideal for GPs, junior doctors and medical students, and anyone wanting to understand the broad basics of medical law","torrent":{"xt":"urn:btih:05116f349fd78dca3a73f874d5a2c9daedd08048","amp;dn":"ABC+of+Medical+Law+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05116f349fd78dca3a73f874d5a2c9daedd08048","infoHashBuffer":{"type":"Buffer","data":[5,17,111,52,159,215,141,202,58,115,248,116,213,162,201,218,237,208,128,72]},"announce":[],"urlList":[]}}