{"title":"Meyl-Scalar Waves(1st Tesla physics textbook for engineers)","uid":4533232,"size":34058268,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:051fb4786743d962c6115dfbf3b04a2f44c1358a&amp;dn=Meyl-Scalar+Waves%281st+Tesla+physics+textbook+for+engineers%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"red_gonzo","files":1,"time":1227637888,"description":"This is prof. dr. Konstantin Meyl&amp;#039;s long awaited english translated comprehensive book Scalar Waves (original title: Elektromagnetische Umweltvertraglichkeit) which is probably the first physics textbook which derives and describes in detail the physics of scalar (longitudinal) waves as were used by Nikola Tesla over 100 years ago. Subtitled From an extended vortex and field theory to a technical, biological and historical use of londitudinal waves, this amazing book gives you an extented electromagnetic theory, derived from Maxwell&amp;#039;s classic field theory with addition of Teslian scalar waves resulting in a vastly more comprehensive field theory. Such is the change that the reader requires a shift of paradigm to fully understand its implications. Following the complete mathematical derivation of new electromagnetic theory are its applications in areas of physics, chemistry, astronomy, medicine, telecommunications, engine physics, electrogravity and much more. This book is no dull reading! Readers who will expect just another physics textbook filled with some abstract mathematical theories will be very dissapointed as they will see that this amazing book is intended for engineers who wish to upgrade their existing knowledge of physics to a new level. This new level includes thinking of terms of a unified field theory, as Meyl&amp;#039;s new Theory of objectivity successfully merges together electromagnetism, gravity, weak and strong nuclear forces into one comprehensive and most useful tool. The author leads you through the fascinating history of physics of electromagnetism to show how the ideas have evolved through the centuries. Special attention is devoted to Theory of relativity and its grave errors which the author successfully corrects and extends to his Theory of objectivity where the speed of light is no longer constant among other interesting things. The incredible broad contents of this massive book will surely attract many curious people who wish to extend their knowledge of natural processes as the book can be read without difficulties even if the reader doesn&amp;#039;t have a technical background. As for engineers they will surely find one of the most valuable resources available in english language of theoretical and experimental material for upgrading existing technology to the use of extended electromagnetics which includes among others new electrogravitic engines and power sources. A bible of Tesla physics, this unique book is simply not to be missed! Over 650 pages, with many pictures, diagrams, drawings, etc. A must read for everyone.\nNote: The zip archive also contains some other Meyl&amp;#039;s articles (mostly in german), an experimenter&amp;#039;s guide to scalar waves and some other articles.\nBook link: http://www.etzs.de/onlineshop/product_info.php?products_id=13&amp;language=en\n\nFrom a webreview:\nFrom Maxwells field equations only the well-known (transverse) Hertzian waves can be derived, whereas the calculation of longitudinal scalar waves gives zero as a result. This is a flaw of the field theory, since scalar waves exist for all particle waves, like e.g. as plasma wave, as photon- or neutrino radiation.\nStarting from Faradays discovery, instead of the formulation of the law of induction according to Maxwell, an extended field theory is derived, which goes beyond the Maxwell theory with the description of potential vortices (noise vortices) and their propagation as a scalar wave, but contains the Maxwell theory as a special case. With that the extension is allowed and doesn&amp;#039;t contradict textbook physics.\nBesides the mathematical calculation of scalar waves this book contains a voluminous material collection concerning the information technical use of scalar waves, if the useful signal and the usually interfering noise signal change their places, if a separate modulation of frequency and wavelength makes a parallel image transmission possible, if it concerns questions of the environmental compatibility for the sake of humanity (bio resonance, among others) or to harm humanity (electro smog).\n","torrent":{"xt":"urn:btih:051fb4786743d962c6115dfbf3b04a2f44c1358a","amp;dn":"Meyl-Scalar+Waves%281st+Tesla+physics+textbook+for+engineers%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"051fb4786743d962c6115dfbf3b04a2f44c1358a","infoHashBuffer":{"type":"Buffer","data":[5,31,180,120,103,67,217,98,198,17,93,251,243,176,74,47,68,193,53,138]},"announce":[],"urlList":[]}}