{"title":"Introductory Nuclear Physics 2nd ed - Samuel S. M. Wong","uid":15560360,"size":26795170,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:056aa07b9ec46342b77671f6c2403592e62a2693&amp;dn=Introductory+Nuclear+Physics+2nd+ed+-+Samuel+S.+M.+Wong&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"clouderone","files":1,"time":1471122824,"description":"Introductory Nuclear Physics 2nd ed - Samuel S. M. Wong (Wiley-VCH, 2004).pdf\r\n\r\nA comprehensive, unified treatment of present-day nuclear physics-the fresh edition of a classic text/reference.\r\n\r\n&quot;A fine and thoroughly up-to-date textbook on nuclear physics . . . most welcome.&quot; -Physics Today (on the First Edition).\r\n\r\nWhat sets Introductory Nuclear Physics apart from other books on the subject is its presentation of nuclear physics as an integral part of modern physics. Placing the discipline within a broad historical and scientific context, it makes important connections to other fields such as elementary particle physics and astrophysics.\r\n\r\nNow fully revised and updated, this Second Edition explores the changing directions in nuclear physics, emphasizing new developments and current research-from superdeformation to quark-gluon plasma. Author Samuel S.M. Wong preserves those areas that established the First Edition as a standard text in university physics departments, focusing on what is exciting about the discipline and providing a concise, thorough, and accessible treatment of the fundamental aspects of nuclear properties.\r\n\r\nIn this new edition, Professor Wong:\r\n* Includes a chapter on heavy-ion reactions-from high-spin states to quark-gluon plasma\r\n* Adds a new chapter on nuclear astrophysics\r\n* Relates observed nuclear properties to the underlying nuclear interaction and the symmetry principles governing subatomic particles\r\n* Regroups material and appendices to make the text easier to use\r\n* Lists Internet links to essential databases and research projects\r\n* Features end-of-chapter exercises using real-world data.\r\n\r\nIntroductory Nuclear Physics, Second Edition is an ideal text for courses in nuclear physics at the senior undergraduate or first-year graduate level. It is also an important resource for scientists and engineers working with nuclei, for astrophysicists and particle physicists, and for anyone wishing to learn more about trends in the field","torrent":{"xt":"urn:btih:056aa07b9ec46342b77671f6c2403592e62a2693","amp;dn":"Introductory+Nuclear+Physics+2nd+ed+-+Samuel+S.+M.+Wong","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"056aa07b9ec46342b77671f6c2403592e62a2693","infoHashBuffer":{"type":"Buffer","data":[5,106,160,123,158,196,99,66,183,118,113,246,194,64,53,146,230,42,38,147]},"announce":[],"urlList":[]}}