{"title":"Professional Embedded ARM Development (2014) WROX","uid":9549938,"size":20657062,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:058d0bee17df0c78fd054053e624ab5b1474bb5e&amp;dn=Professional+Embedded+ARM+Development+%282014%29+WROX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"d347hBy73","files":-1,"time":1391228677,"description":"PROFESSIONAL EMBEDDED ARM DEVELOPMENT \n\nBOOK DETAILS:\nPages: 336\nPublisher: Wrox (January 2014)\nISBN-10: 111878894X \nISBN-13: 978-1118788943\nFormat: PDF, EPUB\n\n\nBOOK DESCRIPTION:\n\nA practical Wrox guide to ARM programming for mobile devices With more than 90 percent of mobile phones sold in recent years using ARM-based processors, developers are eager to master this embedded technology. If you know the basics of C programming, this guide will ease you into the world of embedded ARM technology. \n\nWith clear explanations of the systems common to all ARM processors and step-by-step instructions for creating an embedded application, it prepares you for this popular specialty. While ARM technology is not new, existing books on the topic predate the current explosive growth of mobile devices using ARM and do not cover these all-important aspects. \n\nNewcomers to embedded technology will find this guide approachable and easy to understand. Covers the tools required, assembly and debugging techniques, C optimizations, and more Lists the tools needed for various types of projects and explores the details of the assembly language Examines the optimizations that can be made to ensure fast code Provides step-by-step instructions for a basic application and shows how to build upon it Professional Embedded ARM Development prepares you to enter this exciting and in-demand programming field. \n\nTable of Contents:\n\nPart I: ARM Systems and Development Chapter 1. The History of ARM Chapter 2. ARM Embedded Systems Chapter 3. ARM Architecture Chapter 4. ARM Assembly Language Chapter 5. First Steps Chapter 6. Thumb Instruction Set Chapter 7. Assembly Instructions Chapter 8. Neon Chapter 9. Debugging Chapter 10. Writing Optimized C Part II: Reference Appendix A. Terminology Appendix B. ARM Architecture Versions Appendix C. ARM Core Versions Appendix D. Neon Intrinsics and Instructions Appendix E. Assembly Instructionsa \n","torrent":{"xt":"urn:btih:058d0bee17df0c78fd054053e624ab5b1474bb5e","amp;dn":"Professional+Embedded+ARM+Development+%282014%29+WROX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"058d0bee17df0c78fd054053e624ab5b1474bb5e","infoHashBuffer":{"type":"Buffer","data":[5,141,11,238,23,223,12,120,253,5,64,83,230,36,171,91,20,116,187,94]},"announce":[],"urlList":[]}}