{"title":"Mikhail Bulgakov - Master and Margarita + other works (17 books)","uid":15170018,"size":34347520,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:05caa4a23d7c4a5b56fc9dbd78a95d0e56eac48b&amp;dn=Mikhail+Bulgakov+-+Master+and+Margarita+%2B+other+works+%2817+books%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"workerbee","files":31,"time":1467386774,"description":"MIKHAIL AFANASYEVICH BULGAKOV (1891-1940) was a Soviet Russian playwright, novelist and short-story writer best known for his humour and penetrating satire.\n\nBeginning his adult life as a doctor, Bulgakov gave up medicine for writing.  His first major work was the novel THE WHITE GUARD, serialized in 1925 but never published in book form.  A realistic and sympathetic portrayal of the motives and behaviour of a group of anti-Bolshevik White officers during the civil war, it was met by a storm of official criticism for its lack of a communist hero.  In 1925 he published a book of satirical fantasies, DIABOLIAD, implicitly critical of Soviet communist society and that was also officially denounced.  In the same year he wrote HEART OF A DOG, a scathing comic satire on pseudoscience.\n\nBecause of their realism and humour, Bulgakov's works enjoyed great popularity, but their trenchant criticism of Soviet mores was increasingly unacceptable to the authorities.  By 1930 he was, in effect, prohibited from publishing and his plea for permission to emigrate was rejected by Stalin.  During the subsequent period of literary ostracism, which continued until his death, Bulgakov created his masterpieces.\n\nHis most famous work, THE MASTER AND MARGARITA, appeared posthumously in the Soviet Union in 1966, and then in heavily censored form.  A dazzling Gogolesque fantasy, the novel is widely considered one of the masterpieces of 20th century literature.  A penetrating philosophical novel wrestling with profound and eternal problems of good and evil, it juxtaposes two planes of action -- one set in contemporary Moscow and the other in Pontius Pilate's Judea.  The work oscillates between grotesque and often ribald scenes of trenchant satiric humour and powerful and moving moments of pathos and tragedy, and firmly secured Bulgakov's place among the pantheon of great Russian writers.\n\nBulgakov's works were slow to benefit from the limited &quot;thaw&quot; that characterized the Soviet literary milieu following the death of Stalin.  His posthumous rehabilitation began slowly in the late 1950s, and starting in 1962 several volumes of his works, including plays, novels, short stories, and his biography of Molière, were published. \n\n\nThe following books are in ePUB format unless otherwise indicated:\n\n* A Country Doctor's Notebook (Melville House, 2012).  Translated by Michael Glenny.\n\n* Diaboliad (Raduga, 1990).  Translated by Kathleen Cook-Horujy.\n\n* Diaries and Selected Letters (Alma, 2013).  Translated by Roger Cockrell.\n\n* Fatal Eggs, The (Raduga, 1990).  Translated by Kathleen Cook-Horujy.\n\n* Fatal Eggs &amp; Other Soviet Satire, The (Grove, 1987).  Edited and translated by Mirra Ginsburg.  In addition to Bulgakov's &quot;Fatal Eggs,&quot; this volume includes selections from eleven other Soviet writers.\n\n* Heart of a Dog (Grove, 1987).  Translated by Mirra Ginsburg.\n\n* Heart of a Dog (Vintage, 2009).  Translated by Michael Glenny.\n\n* Heart of a Dog &amp; Other Stories (Raduga, 1990).  Translated by Kathleen Cook-Horujy and Avril Pyman. -- PDF\n\n* Life of Monsieur de Molière, The (New Directions, 1986).   Translated by Mirra Ginsburg.\n\n* Master and Margarita, The (Ardis, 2011).  Translated by Diana Burgin and Katherine Tiernan O'Connor.\n\n* Master and Margarita, The (Grove, 1995).  Translated by Mirra Ginsburg. -- PDF\n\n* Master and Margarita, The (Signet, 1967).  Translated by Michael Glenny. -- PDF\n\n* Master and Margarita, The (Penguin, 2007).  Translated by Richard Pevear and Larissa Volokhonsky.\n\n* Master and Margarita, The (Penguin, 2016).  50th anniversary edition.  Newly revised translation by Richard Pevear and Larissa Volokhonsky.  Foreword by Boris Fishman.\n\n* Morphine (New Directions, 2013).  Translated by Hugh Aplin.\n\n* Notes on the Cuff (Raduga, 1990).  Translated by Kathleen Cook-Horujy.\n\n* White Guard, The (McGraw-Hill, 1971).  Translated by Michael Glenny.\n\n_____________________________________________________________________________\n\n\nCONTACT ME: You can reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\n                                 \nhttps://pirates-forum.org/User-workerbee  \n\nPLEASE HELP TO SEED!  If you like these books and want others to have access to them, please help to seed for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:05caa4a23d7c4a5b56fc9dbd78a95d0e56eac48b","amp;dn":"Mikhail+Bulgakov+-+Master+and+Margarita+%2B+other+works+%2817+books%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05caa4a23d7c4a5b56fc9dbd78a95d0e56eac48b","infoHashBuffer":{"type":"Buffer","data":[5,202,164,162,61,124,74,91,86,252,157,189,120,169,93,14,86,234,196,139]},"announce":[],"urlList":[]}}