{"title":"Robert Alter - Literary Criticism &amp; Bible Translations (10 b","uid":9462334,"size":26204281,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:05f456884b35ffc7dd4a1fc0280ebe57e28b403d&amp;dn=Robert+Alter+-+Literary+Criticism+%26amp%3B+Bible+Translations+%2810+b&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"workerbee","files":-1,"time":1389377466,"description":"\nROBERT ALTER (b. 1935) is a renowned American literary critic and translator.  His immense achievements in scholarship ranging from the Hebrew Bible to the eighteenth-century European novel and contemporary Hebrew and American literature earned him the Robert Kirsch Award for Lifetime Achievement from the Los Angeles Times.\n\nAlter's book THE ART OF BIBLICAL NARRATIVE (1981) - and its companion volume THE ART OF BIBLICAL POETRY (1985) - radically expanded the horizons of biblical scholarship by recasting the Hebrew Bible as not only a human creation but a work of literary art deserving studied criticism.  Alter presents the Bible as a cohesive literary work, one whose many authors used innovative devices such as parallelism, contrastive dialogue, and narrative tempo to tell one of the most revolutionary stories of human history: the revelation of a single god.  Both volumes are here updated with a new preface and myriad revisions.\n\nHis critically acclaimed and ongoing translations of the Hebrew Bible are the magnificent capstone to a lifetime of distinguished scholarly work and have won the PEN Center Literary Award for Translation.  With the release of ANCIENT ISRAEL: THE FORMER PROPHETS (2013), Alter has now translated more than 60% of the Hebrew Bible in slightly less than 20 years.  In these volumes, he attempts to clear away the inaccuracies, inelegance and muddiness of past translations and to transmit in English the clarity and literary power of the Hebrew original.  They should not be missed!\n\n\nUnless otherwise noted, the following books are in EPUB format (the EPUBs were originally uploaded by livhre, who kindly gave me permission to reproduce them for this collection):\n\n== Literary Criticism ==\n\n* THE ART OF BIBLICAL NARRATIVE, Revised &amp; Updated edition (Basic Books, 2011)\n\n* THE ART OF BIBLICAL POETRY, Revised &amp; Updated edition (Basic Books, 2011)\n\n* DEFENSES OF THE IMAGINATION: Jewish Writers and Modern Historical Crisis (Jewish Publication Society, 1977) -- PDF\n\n* IMAGINED CITIES: Urban Experience and the Novel (Yale University Press, 2005) -- PDF\n\n\n==  Hebrew Bible Translations ==\n\n* ANCIENT ISRAEL: The Former Prophets: Joshua, Judges, Samuel, and Kings: A Translation with Commentary (Norton, 2013)\n\n* THE BOOK OF PSALMS: A Translation with Commentary (Norton, 2007)\n\n* THE DAVID STORY: A Translation with Commentary of I and II Samuel (Norton, 1999) -- PDF\n\n* THE FIVE BOOKS OF MOSES: A Translation with Commentary (Norton, 2004)\n\n* GENESIS: Translation and Commentary (Norton, 1996) -- EPUB + PDF\n\n* THE WISDOM BOOKS: Job, Proverbs, and Ecclesiastes: A Translation with Commentary (Norton, 2010)\n","torrent":{"xt":"urn:btih:05f456884b35ffc7dd4a1fc0280ebe57e28b403d","amp;dn":"Robert+Alter+-+Literary+Criticism+%26amp%3B+Bible+Translations+%2810+b","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05f456884b35ffc7dd4a1fc0280ebe57e28b403d","infoHashBuffer":{"type":"Buffer","data":[5,244,86,136,75,53,255,199,221,74,31,192,40,14,190,87,226,139,64,61]},"announce":[],"urlList":[]}}