{"title":"Caroline Webb - How to Have a Good Day","uid":14669082,"size":770306127,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0619ac63a6670a7cb4cca64e53916995ca29a1a3&amp;dn=Caroline+Webb+-+How+to+Have+a+Good+Day&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"oinky222","files":129,"time":1463847543,"description":"In How to Have a Good Day, economist and former McKinsey partner Caroline Webb shows readers how to use recent findings from behavioral economics, psychology, and neuroscience to transform our approach to everyday working life.\r\n \r\nAdvances in these behavioral sciences are giving us ever better understanding of how our brains work, why we make the choices we do, and what it takes for us to be at our best. But it has not always been easy to see how to apply these insights in the real world – until now. \r\n \r\nIn How to Have a Good Day, Webb explains exactly how to apply this science to our daily tasks and routines. She translates three big scientific ideas into step-by-step guidance that shows us how to set better priorities, make our time go further, ace every interaction, be our smartest selves, strengthen our personal impact, be resilient to setbacks, and boost our energy and enjoyment. Through it all, Webb teaches us how to navigate the typical challenges of modern workplaces—from conflict with colleagues to dull meetings and overflowing inboxes—with skill and ease.\r\n \r\nFilled with stories of people who have used Webb’s insights to boost their job satisfaction and performance at work, How to Have a Good Day is the book so many people wanted when they finished Nudge, Blink and Thinking Fast and Slow and were looking for practical ways to apply this fascinating science to their own lives and careers. \r\n \r\nA remarkable and much-needed book, How to Have a Good Day gives us the tools we need to have a lifetime of good days","torrent":{"xt":"urn:btih:0619ac63a6670a7cb4cca64e53916995ca29a1a3","amp;dn":"Caroline+Webb+-+How+to+Have+a+Good+Day","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0619ac63a6670a7cb4cca64e53916995ca29a1a3","infoHashBuffer":{"type":"Buffer","data":[6,25,172,99,166,103,10,124,180,204,166,78,83,145,105,149,202,41,161,163]},"announce":[],"urlList":[]}}