{"title":"Thomas Mann - Nobel Prize in Literature, 1929 (40 books)","uid":14452420,"size":198152856,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:064d99020836096e28fef865ec94f74b5994217b&amp;dn=Thomas+Mann+-+Nobel+Prize+in+Literature%2C+1929+%2840+books%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"workerbee","files":90,"time":1461763045,"description":"THOMAS MANN (1875-1955) was a German novelist, short story writer, social critic, essayist, and philanthropist.  He was awarded the 1929 Nobel Prize in Literature &quot;principally for his great novel, Buddenbrooks, which has won steadily increased recognition as one of the classic works of contemporary literature.&quot;\n\nMann's first novel, BUDDENBROOKS (1901), won both popular and critical acclaim.  Deeply indebted to the German cultural tradition and specifically influenced by Schopenhauer, Wagner, and Nietzsche, Mann combines &quot;intellectual&quot; themes with vivid realism and comic flair.  Much of his work including the early novellas, &quot;Tonio Kröger&quot; and &quot;Death in Venice&quot;, explores the psychology of the creative temperament and the often tragic position of the intellectual or artist in bourgeois society.  Politically he became an increasingly outspoken opponent of European fascism, a concern reflected in his second major novel, THE MAGIC MOUNTAIN (1924), and in subsequent works.\n\nHis most important later works were the monumental tetralogy JOSEPH AND HIS BROTHERS (1933-1943), a reinterpretation of the biblical story as the emergence of mobile, responsible individuality out of the tribal collective, of history out of myth, and of a human God out of the unknowable;  THE BELOVED RETURNS (1939), in which Mann returned to the world of Goethe's novel &quot;The Sorrows of Young Werther&quot; (1774); and the great tragic novel, DOCTOR FAUSTUS (1947), the story of composer Adrian Leverkühn and the corruption of German culture in the years before and during World War II.  He also extended the comic picaresque fragment, CONFESSIONS OF FELIX KRULL, which he had begun at the time of &quot;Death in Venice&quot;; it was never finished but appeared as his last novel in 1954.\n\nThis collection also features a large selection of Mann's essays, non-fiction, letters, and wartime speeches, many of which have been long out-of-print.  The literary essays in particular make for marvellous reading, with insightful contributions on Goethe, Tolstoy, Chekhov, Lessing, Kleist, Schopenhauer, Nietzsche, Schiller, Wagner, Freud, and many others.  Several autobiographical works are here, including Mann's remarkable memoir about the writing of DOCTOR FAUSTUS, its evolution shaped by world events and a personal health crisis, as well as three volumes of letters, including a new scan of his decades-long correspondence with Hermann Hesse.\n\nI am indebted to @pharmakate for allowing me to include a number of original scans of John Wood's superb recent translations.\n\n\nThe following are in PDF format unless otherwise indicated\n\n                         == NOVELS &amp; NOVELLAS ==                                   \n\n* The Beloved Returns: Lotte in Weimar (Knopf, 1940; 1968). Translated by H. T. Lowe-Porter.\n\n* The Black Swan (Knopf, 1954). Translated by Willard R. Trask.\n\n* Buddenbrooks (Vintage, 1961). Translated by H. T. Lowe-Porter.\n\n* Buddenbrooks: The Decline of a Family (Knopf, 1993). Translated by John E. Woods. -- PDF (courtesy of @pharmakate) + ePUB\n\n* Confessions of Felix Krull, Confidence Man (Knopf, 1955 / Penguin, 1970). Translated by Denver Lindley. -- PDF + ePUB\n\n* Confessions of Felix Krull, Confidence Man (Signet, 1963). Translated by Denver Lindley, with an Afterword by George Steiner.\n\n* Doctor Faustus (Knopf, 1948). Translated by H. T. Lowe-Porter. -- PDF + ePUB\n\n* Doctor Faustus (Vintage, 1999). Translated by John E. Woods (PDF courtesy of @pharmakate).\n\n* The Holy Sinner (Knopf, 1951). Translated by H. T. Lowe-Porter.\n\n* Joseph and His Brothers (Everymans Library, 2005). Translated by John E. Woods (PDF courtesy of @pharmakate).\n\n* The Magic Mountain (Knopf, 1965 / 2014). Translated by H. T. Lowe-Porter. -- PDF + ePUB\n\n* The Magic Mountain (Vintage, 1996 / Everyman's Library, 2005). Translated by John E. Woods. -- PDF (courtesy of @pharmakate) + ePUB.\n\n* Royal Highness (Knopf, 1939). Translated by A. Cecil Curtis, with a Preface translated by H. T. Lowe-Porter. -- ePUB\n\n* The Tables of the Law (Secker &amp; Warburg, 1947). Translated by H. T. Lowe-Porter.\n\n* The Tables of the Law (Paul Dry, 2010). Translated by Marion Faber and Stephen Lehmann, with an Afterword by Michael Wood.\n\n* The Transposed Heads: A Legend of India (Vintage, 1959). Translated by H. T. Lowe-Porter.\n\n                               == SHORT STORIES ==\n\n* Death in Venice (HarperCollins, 2004). Translated by Michael Henry Heim, with an Introduction by Michael Cunningham. -- PDF + ePUB\n\n* Death in Venice &amp; Other Stories (Signet Classic, 1999/2006). Translated with an Introduction by Jefferson S. Chase. -- PDF + ePUB\n\n* Death in Venice &amp; Other Stories (Bantam, 1988). Translated with an Introduction by David Luke. -- PDF + ePUB\n\n* Death in Venice &amp; Other Tales (Penguin Classics, 1999). Translated by Joachim Neugroschel. -- ePUB\n\n* Death in Venice &amp; Seven Other Stories (Knopf, 1963). Translated by H. T. Lowe-Porter.\n\n* Six Early Stories (Sun &amp; Moon Press, 1997). Translated with a Note by Peter Constantine; edited with an Introduction by Burton Pike.\n\n* Stories of Three Decades (Knopf, 1936). Translated by H. T. Lowe-Porter.\n\n* Tonio Kröger &amp; Other Stories (Bantam, 1970). Translated by David Luke.\n\n\n                             == ESSAYS &amp; NON-FICTION ==\n\n* The Coming Victory of Democracy (Secker &amp; Warburg, 1938).\n\n* Essays of Three Decades (Knopf, 1947). Translated by H. T. Lowe-Porter.\n\n* Last Essays (Knopf, 1959). Translated by Richard and Clara Winston &amp; Tania and James Stern.\n\n* Listen, Germany! Twenty-Five Radio Messages to the German People over BBC (Knopf, 1943).\n\n* The Living Thoughts of Schopenhauer (Cassell, 1939). Presented by Thomas Mann with an introductory essay.\n\n* Nobel Prize Acceptance Speech (from Nobel Prize Library: Laxness / Maeterlinck / Mann, 1971).\n\n* Reflections of a Nonpolitical Man (Ungar, 1987). Translated with an Introduction by Walter D. Morris.\n\n* A Sketch of My Life (Knopf, 1960). Translated by H. T. Lowe-Porter.\n\n* The Story of a Novel: The Genesis of &quot;Doctor Faustus&quot; (Knopf, 1961). Translated by Richard and Clara Winston.\n\n* The Theme of the &quot;Joseph&quot; Novels (GPO, 1943).\n\n* This War (Knopf, 1940). Translated by Eric Sutton.\n\n* Three Essays (Knopf, 1929). Translated by H. T. Lowe-Porter.\n\n* The War and the Future: An Address by Thomas Mann (Library of Congress, 1944).\n\n\n                                    == LETTERS ==\n\n* Correspondence with Theodor W. Adorno, 1943-1955 (Polity, 2006). Edited by Christoph Gödde and Thomas Sprecher; translated by Nicholas Walker. -- PDF + ePUB\n\n* The Hesse-Mann Letters: The Correspondence of Hermann Hesse and Thomas Mann, 1910-1955 (Harper &amp; Row, 1975). Edited by Anni Carlsson and Volker Michels; translated by Ralph Manheim.\n\n* Letters to Paul Amann, 1915-1952 (Wesleyan UP, 1960). Edited by Herbert Wegener; translated by Richard and Clara Winston.\n\n_____________________________________________________________________________\n\n\nCONTACT ME: You can reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account): \nhttps://pirates-forum.org/User-workerbee\n\nPLEASE HELP TO SEED! If you like these books and want others to have access to them, please help to seed for as long as you can. The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content. Thank you!","torrent":{"xt":"urn:btih:064d99020836096e28fef865ec94f74b5994217b","amp;dn":"Thomas+Mann+-+Nobel+Prize+in+Literature%2C+1929+%2840+books%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"064d99020836096e28fef865ec94f74b5994217b","infoHashBuffer":{"type":"Buffer","data":[6,77,153,2,8,54,9,110,40,254,248,101,236,148,247,75,89,148,33,123]},"announce":[],"urlList":[]}}