{"title":"Batteries for Sustainability - Ralph J. Brodd","uid":15548698,"size":10831082,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0671956fa2555426ed87c383e564dc1daf7002d1&amp;dn=Batteries+for+Sustainability+-+Ralph+J.+Brodd&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"clouderone","files":1,"time":1471001297,"description":"Batteries for Sustainability - Ralph J. Brodd (Springer, 2013).pdf\r\n\r\nBatteries that can store electricity from solar and wind generation farms are a key component of a sustainable energy strategy. Featuring 15 peer-reviewed entries from the Encyclopedia of Sustainability Science and Technology, this book presents a wide range of battery types and components, from nanocarbons for supercapacitors to lead acid battery systems and technology. Worldwide experts provides a snapshot-in-time of the state-of-the art in battery-related R&amp;D, with a particular focus on rechargeable batteries. Such batteries can store electrical energy generated by renewable energy sources such as solar, wind, and hydropower installations with high efficiency and release it on demand. They are efficient, non-polluting, self-contained devices, and their components can be recovered and used to recreate battery systems. \r\n\r\nCoverage also highlights the significant efforts currently underway to adapt battery technology to power cars, trucks and buses in order to eliminate pollution from petroleum combustion. Written for an audience of undergraduate and graduate students, researchers, and industry experts, Batteries for Sustainability is an invaluable one-stop reference to this essential area of energy technology","torrent":{"xt":"urn:btih:0671956fa2555426ed87c383e564dc1daf7002d1","amp;dn":"Batteries+for+Sustainability+-+Ralph+J.+Brodd","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0671956fa2555426ed87c383e564dc1daf7002d1","infoHashBuffer":{"type":"Buffer","data":[6,113,149,111,162,85,84,38,237,135,195,131,229,100,220,29,175,112,2,209]},"announce":[],"urlList":[]}}