{"title":"Psychiatric-Mental Health Nursing [PDF] [StormRG]","uid":9741106,"size":42297381,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:06ba74fce0b34cff14d55da917b68946021a2480&amp;dn=Psychiatric-Mental+Health+Nursing+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"0xmovva","files":-1,"time":1394518513,"description":"Author: Dr. Jeffrey Jones , Dr. Joyce Fitzpatrick , Dr. Vickie L. Rogers\nPaperback: 696 pages\nPublisher: Springer Publishing Company; 1 edition (March 16, 2012)\nLanguage: English\nISBN-10: 0826105637\nISBN-13: 978-0826105639\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n\n__________________________________________________________________________________\n\n\n&quot;The editors accomplished a difficult task in developing this well-written, comprehensive psychiatric-mental health nursing text. It is an excellent resource for both the novice nursing student and the practitioner.&quot; --Psychiatric Services\n\n&quot;Some call it the encounter; others the engagement. Regardless of the terms used, it is the relationship that is the healing difference in psychiatric care services. As one of Hildegard Peplau's students, I remain in awe of her vision and commitment to inspiring the nursing profession to acknowledge and own the &quot;interpersonal relationship&quot; as an essential part of nursing. This textbook, building on the interpersonal theories of Peplau and Joyce Travelbee, continues the journey for embedding and extricating the importance of the relationship across the spectrum of psychiatric care and caring.&quot;\n\nBeverly Malone, RN, PhD, FAAN \nCEO, National League for Nursing\n\nThis psychiatric-mental health undergraduate textbook, based on the theories of Hildegard Peplau and Joyce Travelbee, is the first recent book devoted to interpersonal relations as the foundation for therapeutic practice in psychiatric nursing. It guides the student through the essential phases of self-discovery necessary to integrate interpersonal nursing theory into practice, and provides a historical overview of the profession.\n\nThe book addresses the most current ISPN and APNA competencies and presents content designed to foster self-growth, and critical thinking and decision-making skills, as well as to implement therapeutic interventions. It offers an overview of theories of mental illness and a detailed discussion of commonly seen psychiatric disorders, and addresses mental health care settings across the lifespan and different populations. Clinical case studies and first-hand accounts vividly describe the realities of living with specific mental illnesses, &quot;What would you do?&quot; questions stimulate discussions, and sample and practice care plans for chronic mental illness facilitate integration of concepts into practice. Evidence-based practice summaries from psychiatric nursing and related research literature are included, and NANDA guidelines are integrated throughout. A new chapter with DSM-V updates is also available. This affordably priced text additionally comes with supplementary materials for both teachers and students, including handy review guides, summaries, drug monographs, and hyperlinks to films and video illustrating content. A test bank and PowerPoint slides are also available for instructors.\n\nKey Features:\n\nIntegrates and applies the Peplau/Travelbee interpersonal relations theories to the four-step Assessment, Planning/Diagnosing, Implementation, and\nEvaluation (APIE) nursing process\nAddresses critical thinking, clinical decision making, therapeutic interventions, case management roles, and mental health care settings across the lifespan\nFeatures NCLEX preparation questions, vivid clinical scenarios, and evidence-based practice summaries\nAddresses the most current ISPN and APNA competencies\nA new chapter with DSM-V updates is available\n\n\nA test bank and PowerPoint slides are also available for instructors\neBook Features (available in all eBook formats):\n\nBidirectional link between Key Terms and their glossary definitions\nLearning Outcomes at start of chapters link to respective sections in book\nHyperlinks to supplementary films and videos\nCare plans\nDSM-V update \n","torrent":{"xt":"urn:btih:06ba74fce0b34cff14d55da917b68946021a2480","amp;dn":"Psychiatric-Mental+Health+Nursing+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06ba74fce0b34cff14d55da917b68946021a2480","infoHashBuffer":{"type":"Buffer","data":[6,186,116,252,224,179,76,255,20,213,93,169,23,182,137,70,2,26,36,128]},"announce":[],"urlList":[]}}