{"title":"Scribblenauts Unmasked A DC Comics Adventure (2-click run)","uid":8970496,"size":1129891280,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:06c9b4ac61d03cd4e3ac5a754f6d30e729999cf8&amp;dn=Scribblenauts+Unmasked+A+DC+Comics+Adventure+%282-click+run%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"The_Duck1","files":-1,"time":1380324202,"description":"No need for serials and cracks to get the full version, (already done it for you).\nNo unnecessary registry changes. \nNo boring installation of tool-bars in your browser or other unwanted things.\nYou can even run this torrent from an USB-Stick.\nEasy Uninstall with the Windows control panel.\nChoose where you want to put the files on your PC. \nThese are a few things that makes a '2-click run' version a better version.\n\nIf everybody seeds, you will get higher downloading speeds.\n\nDESCRIPTION:\nIn Scribblenauts Unmasked: A DC Comics Adventure, Maxwell unites with\nBatman, Superman and the rest of The Justice League to restore order\nto the DC Comics Universe.\n\nChallenge your imagination as you battle the mightiest villains in an\nexciting, action-filled adventure through GOTHAM CITY, METROPOLIS,\nATLANTIS and other iconic locales from the DC Comics Universe. Bring\nout your inner super hero (or villain) with the all-new Hero Creator\nby crafting completely original objects out of parts of existing DC\nComics characters. Then assign unique properties to your creations and\nuse them to solve puzzles, or share them online with friends which\nthey can use in game or further modify as they like.\n\nFeatures:\n\nThe DC Comics Universe: Summon thousands of your favorite DC Comics\ncharacters and objects - all drawn in the unique Scribblenauts art\nstyle\n\nHeroic Feats: Enjoy addictive replayability with new, dynamic puzzles\nthat continuously generate different missions every time you play it.\n\nThe Hero Creator: Create, edit and share your own personalized super\nhero or villain by using parts of existing objects from the expansive\nDC Comics universe. How will your Wonder\n\nJoker stack up against your friends Bat Bain?\n\nIntroducing the Batcomputer: Need help looking for that perfect object\nto summon? Reference the in-game encyclopedia that lists the names and\ndescription of every object from the DC Comics universe.\n\nInstallation instructions:\n1. Execute the Scribblenauts Unmasked A DC Comics Adventure (2-click run).exe file.\n2. Click next.\n3. Enjoy the program.","torrent":{"xt":"urn:btih:06c9b4ac61d03cd4e3ac5a754f6d30e729999cf8","amp;dn":"Scribblenauts+Unmasked+A+DC+Comics+Adventure+%282-click+run%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06c9b4ac61d03cd4e3ac5a754f6d30e729999cf8","infoHashBuffer":{"type":"Buffer","data":[6,201,180,172,97,208,60,212,227,172,90,117,79,109,48,231,41,153,156,248]},"announce":[],"urlList":[]}}