{"title":"[FSX/P3D] Milviz MD530F v2.141208","uid":11684800,"size":380776504,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0804326929acb283ec64ed6a7362e1acd9c27135&amp;dn=%5BFSX%2FP3D%5D+Milviz+MD530F+v2.141208&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"leopard87","files":5,"time":1423274856,"description":"OK guys, here is a little comeback gift for you from me. I rebuilt the original Milviz v2.141208 installers for FSX/P3D and P3D v2 into a custom single installer for you so that you can easily install it on your systems.\n\nThis version is internally called SP1 by Milviz, and still lacks some functionality. For instance, the sound package is not 100% authentic, flight dynamics are not that realistic etc. In order to cure these problems as much as possible, I integrated Jerrod Correy's MD 530 Upgrade Package into the installer and changed some other things, too. READ the installer's information page for a full list of changes. I hope you will like what I have done for you.\n\nI've got to warn you: This is NOT the latest version of this rotorcraft. Milviz changed their e-commerce system recently, and ever since then my &quot;contacts&quot; have been reluctant to provide me with the links to updates, and they haven't sent me the full installers, either. Normally I'm not interested in helicopters at all, but this one is -despite all its current deficiencies- so good that I may buy it as soon as I have some spare money. I have to admit guys at Milviz REALLY deserve it this time. If you have the money, I suggest you buy it, too :-) And of course provide us with updates, too ;-)\n\nFor those who don't know me already &amp; skeptical fuckers who might be suspicious of my work, background images from the original installers are included as the proof that I indeed built this package from the original installers I've mentioned above.\n\nThose who know me from the good old days can remember that I have a fuckin' fast connection, but unfortunately not tonight... Please be patient; the download may be slow, but you'll all eventually get it.\n\nSEED AND ENJOY, PIRATES!","torrent":{"xt":"urn:btih:0804326929acb283ec64ed6a7362e1acd9c27135","amp;dn":"%5BFSX%2FP3D%5D+Milviz+MD530F+v2.141208","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0804326929acb283ec64ed6a7362e1acd9c27135","infoHashBuffer":{"type":"Buffer","data":[8,4,50,105,41,172,178,131,236,100,237,106,115,98,225,172,217,194,113,53]},"announce":[],"urlList":[]}}