{"title":"Thomas Hardy - Novels, Stories and Poetical Notebook (13 books)","uid":10450144,"size":23729120,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:085707c37e837020363e9fd5281a05e138c4bb8d&amp;dn=Thomas+Hardy+-+Novels%2C+Stories+and+Poetical+Notebook+%2813+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"workerbee","files":-1,"time":1404003030,"description":"\nTHOMAS HARDY (1840-1928) was an English novelist and poet.  While Hardy wrote poetry throughout his life and regarded himself primarily as a poet, his first collection was not published until 1898.  Initially, therefore, he gained fame as the author of novels, including FAR FROM THE MADDING CROWD (1874), THE MAYOR OF CASTERBRIDGE (1886), TESS OF THE D'URBERVILLES (1891), and JUDE THE OBSCURE (1895).\n\nMost of his fictional works, initially published as serials in magazines, are set in the semi-fictional region of Wessex.  They explore tragic characters struggling against their passions and social circumstances.  Hardy's Wessex is based on the medieval Anglo-Saxon kingdom and eventually came to include the counties of Dorset, Wiltshire, Somerset, Devon, Hampshire and much of Berkshire, in southwest and south central England.\n\n\nThe following books are in PDF format unless otherwise indicated:\n\n* A PAIR OF BLUE EYES (Oxford World's Classics, 2005).  Edited with Notes by Alan Manford, with a new Introduction by Tim Dolin.\n\n* THE DISTRACTED PREACHER &amp; OTHER TALES (Penguin Classics, 1979).  Edited with an Introduction and Notes by Susan Hill.\n\n* FAR FROM THE MADDING CROWD (Barnes &amp; Noble Classics, 2005).  With an Introduction and Notes by Jonathan A. Cook. -- ePUB\n\n* FAR FROM THE MADDING CROWD (Signet Classics, 2002).  With a new Introduction by Suzanne Keen. -- ePUB\n\n* JUDE THE OBSCURE (Barnes &amp; Noble Classics, 2003).  With an Introduction and Notes by Amy M. King. -- ePUB\n\n* JUDE THE OBSCURE (Oxford World's Classics, 2002).  Edited with an Introduction and Notes by Patricia Ingham.\n\n* THE MAYOR OF CASTERBRIDGE (Oxford World's Classics, 1996).   Edited with an Introduction and Notes by Dale Kramer.\n\n* &quot;POETICAL MATTER&quot; NOTEBOOK (Oxford UP, 2009).  Edited by Pamela Dalziel and Michael Millgate.\n\n* TESS OF THE D'URBERVILLES (Oxford World's Classics, 2005).  Edited by Juliet Grindle and Simon Gatrell, with a new Introduction by Penny Boumelha and Notes by Nancy Barrineau.\n\n* TESS OF THE D'URBERVILLES (Signet Classics, 2006).  With a new Introduction by Marcelle Clements. -- ePUB\n\n* TESS OF THE D'URBERVILLES (Barnes &amp; Noble Classics, 2005).  With an Introduction and Notes by David Galef. -- ePUB\n\n* THE WOODLANDERS (Oxford World's Classics, 2005).  Edited with Notes by Dale Kramer and a new Introduction by Penny Boumelha.\n\n\n== Bonus book ==\n\nJohn Sutherland - SO YOU THINK YOU KNOW THOMAS HARDY? A Literary Quizbook (Oxford World's Classics, 2005).\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                      &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n","torrent":{"xt":"urn:btih:085707c37e837020363e9fd5281a05e138c4bb8d","amp;dn":"Thomas+Hardy+-+Novels%2C+Stories+and+Poetical+Notebook+%2813+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"085707c37e837020363e9fd5281a05e138c4bb8d","infoHashBuffer":{"type":"Buffer","data":[8,87,7,195,126,131,112,32,54,62,159,213,40,26,5,225,56,196,187,141]},"announce":[],"urlList":[]}}