{"title":"Tamaryn - Tender New Signs (2012) [MP3 320]","uid":7767973,"size":99027475,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0891160604843a8e4ca58080d451f906d2f5511e&amp;dn=Tamaryn+-+Tender+New+Signs+%282012%29+%5BMP3+320%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"politux","files":10,"time":1351435087,"description":"\n  Tamaryn - Tender New Signs (2012) [MP3 320]\n\n  Released: 2012\n  Duration: 40:42\n  Genre: Pop/Rock\n  Style: Indie Rock, Shoegaze, Dreampop\n  Codec: MP3\n  Bit Rate: 320 CBR\n  Cover: Front\n\n  01 I'm Gone\n  02 While You're Sleeping, I'm Dreaming\n  03 Heavenly Bodies\n  04 No Exits\n  05 Prizma\n  06 The Garden\n  07 Transcendent Blue\n  08 Afterlight\n  09 Violet's In A Pool\n\nOn Tender New Signs, Tamaryn and Rex John Shelverton aimed to give more structure to the drifting beauty of their first album, The Waves. Fortunately, adding more shape to their songs doesn't pin down their sounds too much. Like a lot of shoegaze revivalists, Tamaryn cherry-pick their favorite elements from the style's originators, and Bilinda Butcher's seductive coo, Julee Cruise's surreal little-girl-lost vignettes, and the Cocteau Twins' alien ecstasy are some of the main influences here. Yet the duo still manages to sound more genuine, if not more original, than many of its contemporaries. &quot;Heavenly Bodies&quot; is shoegaze so archetypal that it could have been beamed to this album straight from 1991: hypnotically plodding beats underpin smoothly churning guitars and a droning, hazy melody that blooms into something bigger and brighter on the choruses. The band captures this sound so well, and so completely, that it hardly matters that it's been done before. Likewise, &quot;Prizma&quot; embodies all the sweetly elliptical sensuality of the style at its finest, and songs such as &quot;The Garden&quot; and &quot;Afterlight&quot; are never less than lovely. However, Tender New Signs is most intriguing when Tamaryn don't follow the shoegaze playbook quite so closely. &quot;I'm Gone&quot; opens the album with Tamaryn's vocals lost in a whorl of Shelverton's guitars, crafting a dark, honeyed allure that is more streamlined but just as intoxicating as the headiest songs from the style's first heyday. &quot;While You're Sleeping, I'm Dreaming&quot; allows the guitars to take center stage, adding psych-rock and surf undercurrents that help separate Tamaryn from the pack of dream pop resuscitators. Meanwhile, the spacious drama of songs such as the swooning &quot;No Exits&quot; and pretty yet ominous album closer &quot;Violet's in a Pool&quot; shows that Tender New Signs doesn't just fulfill the promise of The Waves, it also points the way to an even more promising future for the band.","torrent":{"xt":"urn:btih:0891160604843a8e4ca58080d451f906d2f5511e","amp;dn":"Tamaryn+-+Tender+New+Signs+%282012%29+%5BMP3+320%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0891160604843a8e4ca58080d451f906d2f5511e","infoHashBuffer":{"type":"Buffer","data":[8,145,22,6,4,132,58,142,76,165,128,128,212,81,249,6,210,245,81,30]},"announce":[],"urlList":[]}}