{"title":"Train To Pakistan - Khushwant Singh","uid":9924282,"size":862641,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:08edb119dbd4c23b55d6164b9ccf85be712f9658&amp;dn=Train+To+Pakistan+-+Khushwant+Singh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":2,"uploader":"Mohammad_AT","files":4,"time":1397040175,"description":"It is the summer of 1947. But Partition does not mean much to the Sikhs and Muslims of Mano Majra, a village on the border of India and Pakistan. Then, a local money-lender is murdered, and suspicion falls upon Juggut Singh, the village gangster who is in love with a Muslim girl. When a train arrives, carrying the bodies of dead Sikhs, the village is transformed into a battlefield, and neither the magistrate nor the police are able to stem the rising tide of violence. Amidst conflicting loyalties, it is left to Juggut Singh to redeem himself and reclaim peace for his village. First published in 1956, Train to Pakistan is a classic of modern Indian fiction.\n\nFrom the Back Cover\n\nIt is a place, Khushwant Singh goes on to tell us at the beginning of this classic novel, where Sikhs and Muslims have lived together in peace for hundreds of years. Then one day, at the end of the summer, the 'ghost train' arrives, a silent, incredible funeral train loaded with the bodies of thousands of refuges, bringing the village its first taste of the horrors of the civil war. Train to Pakistan is the story of this isolated village that is plunged into the abyss of religious hate. It is also the story of a Sikh boy and a Muslim girl whose love endures and transcends the ravages of war.\n\nAbout the Author\n\nKhushwant Singh is India s best-known writer and columnist. He has been founder editor of Yojana, and editor of the Illustrated Weekly of India, the National Herald and the Hindustan Times. He is also the author of several books which include the novels Train to Pakistan, I Shall Not Hear the Nightingale, Delhi, The Company of Women and Burial at Sea; the classic two-volume A History of the Sikhs; and a number of translations and non-fiction books on Sikh religion and culture, Delhi, nature, current affairs and Urdu poetry. His autobiography, Truth, Love and a Little Malice, was published in 2002. Khushwant Singh was a Member of Parliament from 1980 to 1986. He was awarded the Padma Bhushan in 1974, but returned the decoration in 1984 in protest against the storming of the Golden Temple by the Indian Army. In 2007, he was awarded the Padma Vibhushan.","torrent":{"xt":"urn:btih:08edb119dbd4c23b55d6164b9ccf85be712f9658","amp;dn":"Train+To+Pakistan+-+Khushwant+Singh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08edb119dbd4c23b55d6164b9ccf85be712f9658","infoHashBuffer":{"type":"Buffer","data":[8,237,177,25,219,212,194,59,85,214,22,75,156,207,133,190,113,47,150,88]},"announce":[],"urlList":[]}}