{"title":"Aesop Rock - Labor Days VO","uid":3857699,"size":100183175,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:09a31e0d1cd772001b42250a8a46347ebf44d83a&amp;dn=Aesop+Rock+-+Labor+Days+VO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":2,"uploader":"shdwwarlord","files":14,"time":1193297009,"description":"From AllMusic:\n&quot;After finding an eager online audience for his dense soundscapes and even more complex rhymes, New York MC Aesop Rock released his most potent combination of words and music on his Def Jux debut. Crammed with references to history and mythology, as well as the usual pop-culture name checks, Aesop&amp;#039;s lyrics remain unusually verbose and intelligent here, but he&amp;#039;s also able to spin them into compelling stories. The best example is the bittersweet, follow-your-dreams saga of &quot;No Regrets,&quot; which chronicles a woman&amp;#039;s sacrifices for art from childhood to old age. Besides the wealth of detail, the song doesn&amp;#039;t sugarcoat the loneliness of its subject, even as it shows her at ease with her choices. And on &quot;9-5ers Anthem,&quot; Aesop ? who still works a day job himself ? allays any concerns about him being a hip-hop elitist, offering a shout out to the blue-collar masses. There are still instances where he gives his listeners simply too much information to process for a pop song (&quot;The Tugboat Complex, Pt. 3&quot;), but, overall, he does his best job yet at balancing smarts and accessibility. Of course, with such a focus on lyrics, it&amp;#039;s easy to ignore the beats behind them ? but while the sampled backing is sometimes on the plain side, Labor Days contains some inventive bites from classical music, and more than a few tunes will grow on you, if given the chance. &quot;\n\nThese are torrents I have culled from OiNK before it died. I am doing my part for the community in absence of OiNK until a replacement can be found. You are welcome.","torrent":{"xt":"urn:btih:09a31e0d1cd772001b42250a8a46347ebf44d83a","amp;dn":"Aesop+Rock+-+Labor+Days+VO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09a31e0d1cd772001b42250a8a46347ebf44d83a","infoHashBuffer":{"type":"Buffer","data":[9,163,30,13,28,215,114,0,27,66,37,10,138,70,52,126,191,68,216,58]},"announce":[],"urlList":[]}}