{"title":"Goodbye.Deponia-RELOADED","uid":9062629,"size":3801819292,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0a0f905bbf5a1502f98e5c968f4ff9b27cef9ffd&amp;dn=Goodbye.Deponia-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":3,"uploader":"Mr.Stifmeister","files":2,"time":1382056425,"description":"\nnERv\n\nGoodbye Deponia (c) Daedalic Entertainment\n\n10/2013 :..... RELEASE.DATE .. PROTECTION .......: Steam\n1 :.......... DISC(S) .. GAME.TYPE ........: Adventure, Indie\n\nMore chaos, more destruction, more Rufus. Not one, not two, but three Rufuses\ncause all kinds of crazy mayhem in the long-awaited adventure comedy Goodbye\nDeponia: The Organon plans the destruction of Deponia, the lovely Goal has\n(once again) disappeared, and anti-hero Rufus just can't seem to stop getting\nin his own way.\n\nAll inventor and free spirit Rufus wanted to do was to get off the junkyard\nplanet of Deponia and move to Elysium, the paradise orbiting Deponia as a\nspaceship reserved for the highest echelons of society. Goal, the ex-Elysian\ngirl that Rufus has fallen head over heels for, still seems to be the key to\nhis endeavor...and to the elevator that will get him to space. Finally, Rufus\nhas come up with a seemingly perfect plan.\n\nAnd yet, everything that could possibly go wrong suddenly does go wrong\nRufus finds himself (initially in disguise) on a highway cruiser amongst\nstern-faced officials of the Organon, while Goal goes missing. When Rufus\nstumbles upon a cloning machine, he believes to have found his way out. A\nclone copy is supposed to help him out of his predicament. But an\n&quot;inexplicable&quot; error causes complications and Goal slips from our hero's\nreach once again. Now, he has to solve three major problems: He needs to find\nGoal again, reach Elysium and prevent the destruction of the entire planet of\nDeponia by the hand of the Organon.\n\nThree problems that only three Rufuses could solve  and thus, the luckless\ninventor decides to clone himself This leads to crazy ramifications for the\nplayer: In Goodbye Deponia, the player occasionally needs to control all\nthree Rufuses, using them to complete tasks together  despite Rufus stumbling\nover himself so often.\n\nGoodbye Deponia is the epic conclusion to the Deponia trilogy and sequel to\nthe best German game of 2013 (German Computer Game Awards).\nThe award-winning Deponia series comprises of three wacky tales of adventure\nfrom the junkyard planet Deponia. These classic point &amp; click romps not only\ndelight comedy fans and adventure veterans, but also newcomers to the genre\nThe humorous Deponia series impresses with beautiful, hand-drawn 2D comic\ngraphics, sarcastic dialogues and plenty of black humor. It has received\nnumerous press awards, among them the German Computer Game Award (Deutscher\nComputerspielpreis) and many other German developer awards.\n\nKey Features\n\nA classic point &amp; click adventure in a unique world, in the tradition of\nDouglas Adams, Terry Pratchett and Matt Groening\nFrom the makers of Memoria, Edna &amp; Harvey: The Breakout, A New Beginning\nand Edna &amp; Harvey: Harvey's New Eyes\nAn epic conclusion to the iconic Deponia series\nUnique comic style with hand-drawn HD 2D graphics\nCutscenes set to music with lovingly realized animations\n\n1. Unrar\n2. Burn or mount the image\n3. Install the game.\n4. Copy over the cracked content from the /Crack directory on the image to\nyour game install directory\n5. Play the game\n6. Support the software developers. If you like this game, BUY IT\n\n","torrent":{"xt":"urn:btih:0a0f905bbf5a1502f98e5c968f4ff9b27cef9ffd","amp;dn":"Goodbye.Deponia-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a0f905bbf5a1502f98e5c968f4ff9b27cef9ffd","infoHashBuffer":{"type":"Buffer","data":[10,15,144,91,191,90,21,2,249,142,92,150,143,79,249,178,124,239,159,253]},"announce":[],"urlList":[]}}