{"title":"Dear Leader: North Korea's senior propagandist exposes (2014)","uid":10469374,"size":1464809,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0a82395f921a219a7574ba54429e8aabb20fe28f&amp;dn=Dear+Leader%3A+North+Korea%27s+senior+propagandist+exposes+%282014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"bookzilla","files":1,"time":1404240955,"description":"Dear Leader: North Korea's senior propagandist exposes shocking truths behind the regime\n\nDear Leader contains astonishing new insights about North Korea which could only be revealed by someone working high up in the regime. It is also the gripping story of how a member of the inner circle of this enigmatic country became its most courageous, outspoken critic.\n\n Jang Jin-sung held one of the most senior ranks in North Korea's propaganda machine, helping tighten the regime's grip over its people. Among his tasks were developing the founding myth of North Korea, posing undercover as a South Korean intellectual and writing epic poems in support of the dictator, Kim Jong-il.\n\n Young and ambitious, his patriotic work secured him a bizarre audience with Kim Jong-il himself, thus granting him special status as one of the 'Admitted'. This meant special food provisions, a travel pass and immunity from prosecution and harm. He was privy to state secrets, including military and diplomatic policies, how the devastating 'Scrutiny' was effected, and the real position of one of the country's most powerful, elusive men, Im Tong-ok. Because he was praised by the Dear Leader himself, he had every reason to feel satisfied with his lot and safe.\n\n Yet he could not ignore his conscience, or the disparity between his life and that of those he saw starving on the street. After breaking security rules, Jang Jin-sung, together with a close friend, was forced to flee for his life: away from lies and deceit, towards truth and freedom.\n\nepub\n","torrent":{"xt":"urn:btih:0a82395f921a219a7574ba54429e8aabb20fe28f","amp;dn":"Dear+Leader%3A+North+Korea%27s+senior+propagandist+exposes+%282014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a82395f921a219a7574ba54429e8aabb20fe28f","infoHashBuffer":{"type":"Buffer","data":[10,130,57,95,146,26,33,154,117,116,186,84,66,158,138,171,178,15,226,143]},"announce":[],"urlList":[]}}