{"title":"Germinal 1993 DVDRip Sonata Premiere","uid":9951148,"size":864612328,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0ab0d2bc6b1dbe3c9aa09497683e02c53426f2dd&amp;dn=Germinal+1993+DVDRip+Sonata+Premiere&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"klinho","files":2,"time":1397402901,"description":"Claude Berri's angry, ambitious epic, based on the 19th-century novel by Emile Zola, re-creates, as does the novel, the gut-wrenching poverty and the intense day-by-day struggles of striking French coal-miners in 1884 at the Voreux mines of France. The film centers upon the bitter toils of Maheu (Gerard Depardieu) and his family -- consisting of his iron-willed wife (Miou-Miou) and their daughter Catherine (Judith Henry), who also works in the mines. When a new miner, Etienne Lantier (Renaud), comes to Voreux to seek work, he is befriended by Maheu, who takes him on his mining crew and allows him to stay at his home. Etienne is also an organizer for a new miner's union and, as conditions in the Voreux mines worsen, Etienne convinces Maheu to organize a miner's strike. Meanwhile, Etienne is attracted to Catherine, and Catherine to him, but she doesn't act upon her feelings, taking up, instead, with Chaval (Jean-Roger Milo), a local ne'er do well. As conditions in the mines become more desperate and unsafe, and the owners propose to cut wages, Maheu at last stages a massive strike of the miners. When that happens, the owners send in armed soldiers to defend the mines.","torrent":{"xt":"urn:btih:0ab0d2bc6b1dbe3c9aa09497683e02c53426f2dd","amp;dn":"Germinal+1993+DVDRip+Sonata+Premiere","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ab0d2bc6b1dbe3c9aa09497683e02c53426f2dd","infoHashBuffer":{"type":"Buffer","data":[10,176,210,188,107,29,190,60,154,160,148,151,104,62,2,197,52,38,242,221]},"announce":[],"urlList":[]}}