{"title":"Thrive - Arianna Huffington - Audiobook MP3","uid":11691015,"size":285640530,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0ad732ffc52522d6bbe90f6baef5ee08d87249ce&amp;dn=Thrive+-+Arianna+Huffington+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"Squiddy82","files":7,"time":1423530770,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nThrive: The Third Metric to Redefining Success and Creating a Life of Well-Being, Wisdom, and Wonder\n\nWritten by: Arianna Huffington\nNarrated by: Agapi Stassinopoulos\nLength: 9 hrs and 58 mins\nUnabridged Audiobook\nRelease Date:03-25-14\n\nArianna Huffington's personal wakeup call came in the form of a broken cheekbone and a nasty gash over her eye - the result of a fall brought on by exhaustion and lack of sleep. The co-founder and editor-in-chief of the Huffington Post, one of the fastest growing media companies in the world, celebrated as one of the world's most influential women, gracing the covers of magazines, she was, by any traditional measure, extraordinarily successful. Yet as she found herself going from brain MRI to CAT scan to echocardiogram, to find out if there was any underlying medical problem beyond exhaustion, she found herself wondering, is this really what success feels like?\nIn Thrive, she has written a passionate call to arms, looking to redefine what it means to be successful in today's world. In a commencement address she gave at Smith College in the spring of 2013, Arianna likened our drive for money and power to two legs of a three-legged stool. It may hold us up temporarily, but sooner or later we're going to topple over. We need a third leg - a Third Metric for defining success. In this deeply personal book, Arianna talks candidly about her own challenges with managing time and prioritizing the demands of a career and two daughters - of juggling business deadlines and family crises, a harried dance that led to her collapse - and to her &quot;aha moment&quot;. Drawing on the latest groundbreaking research and scientific findings in the fields of psychology, sports, sleep, and physiology that show the profound and transformative effects of meditation, mindfulness, unplugging, and giving, Arianna shows us the way to a revolution in our culture, our thinking, our workplaces, and our lives","torrent":{"xt":"urn:btih:0ad732ffc52522d6bbe90f6baef5ee08d87249ce","amp;dn":"Thrive+-+Arianna+Huffington+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ad732ffc52522d6bbe90f6baef5ee08d87249ce","infoHashBuffer":{"type":"Buffer","data":[10,215,50,255,197,37,34,214,187,233,15,107,174,245,238,8,216,114,73,206]},"announce":[],"urlList":[]}}