{"title":"Sid Meier's Alpha Centauri Complete","uid":6458256,"size":1410518452,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0bd42ba8f5c559a1f96c7e988f5c322a7a9b66af&amp;dn=Sid+Meier%5C%27s+Alpha+Centauri+Complete&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":2,"uploader":"Jona198102","files":50,"time":1307660306,"description":"The Future of Mankind Product Information Legendary designer Sid Meier presents the next evolution in strategy games, with the addictive gameplay.  Explore the alien planet that is your new home and uncover its  myriad mysteries.  Discover over 75 extraordinary technologies.  Build over 60 base upgrades and large scale secret projects for your empire.  Conquer your enemies with a war machine that you design from over 32,000 possible unit types. Product Features Design Your Own War Machine Custom build fighting units that meet your mission's specific needs, or accept your governor's recommendations. Diplomatic Relations Dynamic personalities react individually to your action.  Your diplomatic decisions dictate your path to one of five ultimate resolutions. Infinitely Replayable A random 3D world generator, unlimited strategies, five paths to victory, six levels of difficulty, seen unique factions, fully featured map/game editor, and a whole host of customizable options ensure unlimited gameplay.\n\nWindows Requirements Windows 98, XP, Vista 133 MHz processor 16 MB of RAM 60 MB Hard Drive space DirectX 6.0 2 MB Graphics Card DirectX 6.0 compatible Sound Card 4X CD-ROM drive Mouse Keyboard Network: LAN\n\nIncludes: \n\n- Sid Meier's Alpha Centauri (SMAC)\n- Sid Meier's Alien Crossfire Expansion (SMACX)\n\nas well as all patches and updates, 2 additional scenarios, and 2 complete short stories.\n\nPlease see &quot;INSTALL_READ ME.txt&quot; file for complete details.","torrent":{"xt":"urn:btih:0bd42ba8f5c559a1f96c7e988f5c322a7a9b66af","amp;dn":"Sid+Meier%5C%27s+Alpha+Centauri+Complete","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0bd42ba8f5c559a1f96c7e988f5c322a7a9b66af","infoHashBuffer":{"type":"Buffer","data":[11,212,43,168,245,197,89,161,249,108,126,152,143,92,50,42,122,155,102,175]},"announce":[],"urlList":[]}}