{"title":"D16.Group.Drumazon.VSTi.v1.4.0.Incl.Keygen-AiR","uid":5185378,"size":8839656,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:0be64c229cc2839f0104795729c7826874a484a2&amp;dn=D16.Group.Drumazon.VSTi.v1.4.0.Incl.Keygen-AiR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"TvTeam","files":5,"time":1259439153,"description":"PROUDLY PRESENTS\n\n                   D16.Group.Drumazon.VSTi.v1.4.0.Incl.Keygen \n\n                            SUPPLIER ..: TEAM AiR   \n                            PROTECTION : KEYFiLE      \n                            SIZE ......: 02 * 4,77MB\n                            DATE ......: 11/2009 \n                            URL........: http://www.d16.pl \n\n                              \n                    \n                         \n             \n            \n\n   Drumazon synthesis  emulates all  the sounds  of the  original 9O9. All the \n   instruments are synthesized  in exactly the  same way as  the original. All \n   the nuances and detail of the original are captured perfectly. In addition, \n   all Drumazon instruments have  enhanced controls. This extra  functionality \n   allows the user  to adjust the  sounds further than  on the original  unit. \n   This opens up a whole new world of sound creation \n             \n   Outputs   \n             \n   Drumazon  has a  flexible output  configuration. Every  instrument's audio \n   signal can be routed to any of the 11 outputs. This allows users to further \n   shape sounds individually or in  groups via their favourite plug-ins.  Each \n   individual output can be set to mono or stereo. Every instrument also has a \n   Mute and Solo button.  Mute will not just  silence the sound, it  will stop \n   the sound being triggered. Solo will stop all other instruments from  being \n   triggered and only allow the selected sound(s) to play. \n             \n   Control   \n             \n   Drumazon has extensive midi control. Midi notes can be used to trigger each \n   individual sound. Alternatively, the  internal sequencer can be  used. This \n   can be set to  play using Drumazon's internal  clock or set to  synchronize \n   perfectly  to the  host sequencer.  Most of  Drumazon's parameters  can be \n   automated within the host and also controlled using MidiCC with an external \n   controller. An easy-to-use Midi  Learn function allows reassignment  of any \n   of the parameters. \n             \n   Internal Sequencer \n             \n   Within the internal  sequencer, patterns are  stored in 8  banks. Each bank \n   can  store up  to 12  patterns. Each  pattern consists  of 16  steps. Each \n   pattern location has a midi note number assigned to it. The patterns can be \n   edited traditionally using the step buttons or using the tap function.  The \n   internal sequencer has various modes  of operation. In Chain Mode,  a range \n   of patterns are selected from the internal banks and are played through  in \n   a circular fashion. Patterns can also be triggered freely by selecting  the \n   corresponding midi  note (for  example, from  a midi  controller keyboard). \n   External controllers can be used in  any mode to provide full control  over \n   pattern  playback.  A  Randomizer  function  is  also  provided  within the \n   internal sequencer. It can be used  to make simple changes to a  pattern or \n   create  a  whole  new one  -  ideal  when your  creativity  needs  a boost! \n   Randomizing can be applied to specific instruments and specific steps.  The \n   frequency of occurrence  can also be  adjusted to give  you just the  right \n   amount. Files are stored in the XML format. This allows single patterns  or \n   whole banks to be exchanged between  users easily. XML allows the files  to \n   be edited in a text editor. Ideal if you want to post or share a pattern on \n   a web site -just post the text!  \n             \n   Presets   \n             \n   The settings for  each instrument can  be stored in  it's own preset.  Each \n   instrument  preset  can  be loaded  in  individually.  This allows  maximum \n   flexibility when putting kits  of instruments together. A  dedicated Preset \n   Manager is provided  to help the  user manage the  sounds within their  own \n   unique library. \n             \n             \n   Full Features: \n             \n             \n   truly emulated instruments' synthesis  \n             \n   perfectly scaled knob ranges  with few modifications enlarging  spectrum of \n   the sounds  \n             \n   exhanced control of instruments' sound  \n             \n   dynamic signal routing from instruments to outputs  \n             \n   user defined plugin outputs settings  \n             \n   mutes/solos for each instrument (affect triggerring not just the signal)  \n             \n   fully controllable via MidiCC  \n             \n   quick midiCC assignation with MidiLearn function  \n             \n   many ways of controlling the device:  \n             \n   external mode (note mode)  \n             \n   internal sequencer (pattern mode) with 3 submodes  \n             \n   external mode:  \n             \n   midi map equivalent with the classic drum machine's map  \n             \n   midi tune and velocity controls instruments' levels and tunes  \n             \n   internal sequencer:  \n             \n   8 banks with 12 patterns per bank  \n             \n   each pattern up to 16 steps of length  \n             \n   each pattern defined with one of four available measures  \n             \n   each step can be defined normal or flamed and accented or not  \n             \n   shuffle mode  \n             \n   flam mode  \n             \n   tap mode  \n             \n   chain mode  \n             \n   Shuffle, Flam and TotalAccent values defined globally and per pattern  \n             \n   Scale function and intelligent Rescale (automatically stretches pattern  to \n   the chosen measure)  \n             \n   built  in  Randomizer (selection  of  instruments to  random,  steps to  be \n   affected, frequency of the randomized notes and more)  \n             \n   patterns import/export via human readable xml files  \n             \n   two modes of synchronization:  \n             \n   precise synchronization to the host tempo  \n             \n   synchronization to internal  clock - tempo  controlled in the  range 30-303 \n   BPM (+-0.1)  \n             \n   individual presets per instrument with preset manager to easy control  \n             \n             \n   Changes in v1.4.0 \n             \n             \n   fixed issue with preset name keyboard focus  \n             \n   fixed hanging GUI issue during simultaneous work with other d16 plugins  \n             \n   fixed issue with loading/saving current pattern \n\n\n                                                          \n                         \n                                   \n                  \n                                        \n                  1) Unzip, Unrar and run Setup.exe \n                            \n                  2) Use Keygen to create your Drumazon.key \n                     and copy it into installation folder \n                            \n                  3) Enjoy this fine Team AiR release !!! \n\n\n                       \n                                      \n               \n                                                    nFO bY ThE AiRBEARS 2009","torrent":{"xt":"urn:btih:0be64c229cc2839f0104795729c7826874a484a2","amp;dn":"D16.Group.Drumazon.VSTi.v1.4.0.Incl.Keygen-AiR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0be64c229cc2839f0104795729c7826874a484a2","infoHashBuffer":{"type":"Buffer","data":[11,230,76,34,156,194,131,159,1,4,121,87,41,199,130,104,116,164,132,162]},"announce":[],"urlList":[]}}