{"title":"The Heart Sutra: Becoming a Buddha Through Meditation","uid":10713778,"size":1251103,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0beb65e52e133f05e86e8facba7d40ee5ee46986&amp;dn=The+Heart+Sutra%3A+Becoming+a+Buddha+Through+Meditation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1407383713,"description":" Osho, &quot;The Heart Sutra: Becoming a Buddha Through Meditation&quot;\n\nEnglish | ISBN: 1938755901 | 2014 | 292 pages | EPUB, PDF | 2 MB\n\nThe Heart Sutra, originally a very short set of verses, was given in privacy. It was a message to one of Buddha's close disciples, Sariputra, and was specifically addressed to him. Over time, the Heart Sutra became one of Buddhism's core teachings. In these ten talks Osho presents the powerful message of these ancient words and brings them to a modern audience - one with different minds and needs than the original audiences of Buddha more than 2,500 years ago. Osho's message is not about Buddha the historical figure: instead, he addresses his readers and listeners and encourages them to discover their own inner reality, their own buddhahood. Like Buddha's, Osho's message is about meditation and meditation alone - &quot;rely only on your meditation and nothing else.&quot; Osho also speaks on the seven chakras, the energy centers of the human body, and their corresponding relationships to the physical, psychosomatic, psychological, psychospiritual, spiritual, spiritual-transcendental, and transcendental aspects of human growth and consciousness. ","torrent":{"xt":"urn:btih:0beb65e52e133f05e86e8facba7d40ee5ee46986","amp;dn":"The+Heart+Sutra%3A+Becoming+a+Buddha+Through+Meditation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0beb65e52e133f05e86e8facba7d40ee5ee46986","infoHashBuffer":{"type":"Buffer","data":[11,235,101,229,46,19,63,5,232,110,143,172,186,125,64,238,94,228,105,134]},"announce":[],"urlList":[]}}