{"title":"Passcape Software Reset Windows Password 5.1.3.559 Advanced Edit","uid":11980508,"size":244361940,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0c86888fc56a8135871a04d36edc15804a900b1e&amp;dn=Passcape+Software+Reset+Windows+Password+5.1.3.559+Advanced+Edit&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"nikita200","files":3,"time":1433185035,"description":"Lost password or locked Windows account is the most frequent problem data recovery specialists have to deal with. You could format the hard drive or reinstall your operating system, but that wouldn't keep you from partial loss of data, personal settings and extra headache. Besides, all that can take some time. There is a quicker and more elegant way out of this situation. Just run Reset Windows Passwords from a bootable CD or USB and reset the forgotten password or unlock the account. It's a matter of a few minutes! Reset Windows Password is the most powerful solution for recovering or bypassing all types of Windows account passwords: user', administrator, Active Directory accounts, and domain administrators.\n\nReset Windows Password 5.1.3\nNew version of our Windows password reset tool has been submitted with the following changes:\n- New feature for looking up lost product keys and serial numbers.\n- New icons and some visual enhancements.\n- The program now correctly processes 'Account expire date' and 'Logon hours' flags and resets it if needed. This additional checkout is applied for both SAM and Active Directory accounts.\n- Several default setting were changed in password lookup dialogs.\n- Some annoying warnings were suppressed when parsing Active Directory databases.\n- Update for French and Russian interfaces (provided by Laurent Debard).\n- Minor improvements.\n- Fixed a critical error parsing Outlook Express entries. The bug affected some password lookup modules.\n\nHomepage: www.passcape.com","torrent":{"xt":"urn:btih:0c86888fc56a8135871a04d36edc15804a900b1e","amp;dn":"Passcape+Software+Reset+Windows+Password+5.1.3.559+Advanced+Edit","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c86888fc56a8135871a04d36edc15804a900b1e","infoHashBuffer":{"type":"Buffer","data":[12,134,136,143,197,106,129,53,135,26,4,211,110,220,21,128,74,144,11,30]},"announce":[],"urlList":[]}}