{"title":"PCU (1994 Comedy) Jeremy Piven, Jon Favreau, David Spade","uid":6813662,"size":1600453029,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0cb4e70b972df0edba31a18c431a5d2b5f841f1b&amp;dn=PCU+%281994+Comedy%29+Jeremy+Piven%2C+Jon+Favreau%2C+David+Spade&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":5,"uploader":"rambam1776","files":-1,"time":1321119546,"description":"PCU (1994 Comedy) Jeremy Piven, Jon Favreau, David Spade\n\nVideo Codec..........: XviD ISO MPEG-4 \nVideo Bitrate........: 2230kbps \nDuration.............: 1:20:35\nResolution...........: 848*464 \nFramerate............: 29.970 \nAudio Codec..........: 0x2000 (Dolby AC3) AC3 \nAudio Bitrate........: 192 kbps CBR \nAudio Channels.......: 2 \nFilesize.............: 1,470,783,272 \nSUBTITLES............: English, Spanish\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0110759/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0110759/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/PCU_(film)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/PCU_(film)&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bayimg.com/NaKlgAAdO&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/NaKlgAAdO&lt;/a&gt;\n\n\nPCU is a 1994 comedy film. The film depicts college life at the fictional Port Chester University, and represents &quot;an exaggerated view of contemporary college life....&quot; The film is based on the experiences of writers Adam Leff and Zak Penn at Wesleyan University in Middletown, Connecticut.\n\nPlot\n\nThe story involves preppy pre-freshman (pre-frosh) Tom Lawrence (Chris Young) who visits Port Chester University, a college where fraternities have been outlawed and political correctness is rampant on campus. The film makes heavy use of the political correctness movement as a comedy device.\n\nDuring his visit, Tom manages to make enemies with nearly every group of students on the campus. Getting caught in an infamous &quot;meat tossing incident&quot; (where tubs of raw meat were dropped on a group of animal rights protesters) angers the &quot;cause-heads&quot; (the name given to a group of students who jump from cause to cause protesting), and while taking a short cut through the computer lab, he trips over the power cords and accidentally crashes all the computers, angering all the people working on their thesis papers.\n\nDuring his visit, Tom also gets in the middle of the war between &quot;The Pit&quot; and &quot;Balls and Shaft&quot;, two rival groups on campus. The latter group (officially known as &quot;The Order of Balls and Shaft&quot;) is a parody of the Skull and Bones secret society and conservative fraternities in general. Among its members is Rand McPherson (David Spade), who, with the other Balls and Shaft members, want the outlawed Greek system to return. Meanwhile, members of &quot;The Pit&quot;, a party-frat which split from Balls and Shaft years ago, currently led by James &quot;Droz&quot; Andrews (Jeremy Piven)&amp; living in the dilapidated former Balls and Shaft frat house(the eponymous &quot;Pit&quot;), just want everyone to get along. The movie is in part about the battle between Droz and Rand.\n\nBesides Balls and Shaft, the other great nemeses of The Pit are a radical feminist group on campus known as the Womynists, and the college president, Ms. Garcia-Thompson (Jessica Walter), who is obsessed with enforcing &quot;sensitivity awareness&quot; and multiculturalism to the point where she proposes that Bisexual Asian Studies should have its own building (ousting either mathematics or hockey). The Womynists' entire world view revolves around a paranoia about rape culture and all things phallic, and they are known to hold protests at parties chanting &quot;hey hey, ho ho, this penis party's got to go!&quot; Ms. Garcia-Thompson conspires with Balls and Shaft to get The Pit, their mutual nemesis, kicked off campus, giving Rand control of the house.\n\nThe Pit responds by throwing a party to raise funds to pay off their debts and keep their house. The Womynists take offense to The Pit's flyers advertising the party, and hold a protest outside. The party at first appears to be a failure. However, a series of unlikely events results in George Clinton and Parliament-Funkadelic performing at the party. Students begin streaming in and the party successfully raises the funds to keep the house.\n\nAfter Garcia-Thompson decides to throw The Pit off campus anyway, using the history of complaints against The Pit as her reason, the members of The Pit plot their ultimate revenge at an alumni gathering the next day. They succeed in provoking the other students into an impromptu protest (ironically using the collective chant &quot;We're not gonna protest&quot;), causing the Board of Trustees to fire Garcia-Thompson due to her inability to control the student body.\n\nThe film ends showing Tom heading home, having decided to commit to going to PCU. As he sits on the bus, he sees Rand, who after unwittingly insulting the entire student body over the sound system of the event, is now in Tom's position at the beginning of the film being chased by the students across campus.\n\nCast\n\nJeremy Piven - James &quot;Droz&quot; Andrews\nChris Young - Tom Lawrence\nMegan Ward - Katy\nJon Favreau - Gutter\nAlex DÃƒÂ©sert - Mullaney\nGale Mayron - Cecilia\nJake Beecham - Dave #1\nDarin Heames - Dave #2\nMatt Ross - Raji (as Matthew Brandon Ross)\nStivi Paskoski - Deege\nJody Racicot - Pigman\nSarah Trigger - Samantha\nViveka Davis - Womynist #1\nMaddie Corman - Womynist #2\nDavid Spade - Rand McPherson\nKevin Jubinville - Carter Prescott\nJake Busey - Mersh\nJessica Walter - President Garcia Thompson\nColin Fox - Trustee #1\nLarry Reynolds - Trustee #2\nGeorge Clinton - Himself","torrent":{"xt":"urn:btih:0cb4e70b972df0edba31a18c431a5d2b5f841f1b","amp;dn":"PCU+%281994+Comedy%29+Jeremy+Piven%2C+Jon+Favreau%2C+David+Spade","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0cb4e70b972df0edba31a18c431a5d2b5f841f1b","infoHashBuffer":{"type":"Buffer","data":[12,180,231,11,151,45,240,237,186,49,161,140,67,26,93,43,95,132,31,27]},"announce":[],"urlList":[]}}