{"title":"Singles Flirt up Your Life (FULL version, not demo and crack)","uid":3994506,"size":556254254,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0ced388c1fe0007ad52f50b30a41394483abf2a5&amp;dn=Singles+Flirt+up+Your+Life+%28FULL+version%2C+not+demo+and+crack%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"EmoxChick910","files":31,"time":1201238541,"description":"Singles: Flirt Up Your Life places players in the role of matchmaker. Choosing from over a dozen, unique characters, the player will pick two people to move into a sparsely decorated apartment and begin their adventure together as new roommates. Numerous opportunities to engage the characters in situations will make or break their relationship in the house. The player, having no idea what each individuals tastes and opinions are, must choose the characterÃƒÂ¢s actions as they interact and learn about one another. Anticipation and curiosity will build from learning how to collaborate on furnishing the home, to finding out what your roommate enjoys watching on television most. Of course, if someone forgets to vacuum the house, there will be trouble.\n\nSimple interactions can uncover shy insecurities, quirky behaviors, anger fits, and of course, intensely flirty situations which can lead to levels beyond friendship. The successful bond the player creates between the characters is what allows boundaries to slip and attraction and physical intimacy to take over. Even the most opposite characters have a chance at romance.\n\nCharacter models are highly detailed offering realistic facial expressions and ÃƒÂ¢ true to lifeÃƒÂ¢ displays of the human body that can all be appreciated as the game progresses. The real-time dynamic lighting model gives the needed mood to both the characters and environments, to evolve into romantic, possibly even erotic scenarios.\n\nBy Deep Silver\n\n\nThis is the FULL version (Not the demo plus the crack, there is no crack needed :D )\n\nIt has taken some time, but finally I have gotten a full copy,  just click  setup.exe and you&amp;#039;re on your way. Enjoy playing Cupid! I&amp;#039;ll be uploading Singles 2: Triple Touble very soon as well.\n\nEmoxChick!","torrent":{"xt":"urn:btih:0ced388c1fe0007ad52f50b30a41394483abf2a5","amp;dn":"Singles+Flirt+up+Your+Life+%28FULL+version%2C+not+demo+and+crack%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ced388c1fe0007ad52f50b30a41394483abf2a5","infoHashBuffer":{"type":"Buffer","data":[12,237,56,140,31,224,0,122,213,47,80,179,10,65,57,68,131,171,242,165]},"announce":[],"urlList":[]}}