{"title":"Scottish Hearts Collection ebook Carmen Caine Fiction","uid":10291068,"size":2597934,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0d187d51eca603a81faf0fdceb9b79072765354a&amp;dn=Scottish+Hearts+Collection+ebook+Carmen+Caine+Fiction&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"KiwiSue49","files":-1,"time":1401855822,"description":"Books 1 - 4 of the Highland Heather and Hearts Scottish Romance Series by Carmen Caine\n\n\nFour full-length novels of Medieval Scotland. This set includes the two Award-Winning novels (&quot;The Bedeviled Heart&quot; and &quot;The Daring Heart&quot;) along with the first book Carmen Caine ever wrote: &quot;The Kindling Heart&quot;.\n\n                         ------------------------------\n\n- THE KINDLING HEART\n\n(Scotland, 1478) - Ruan MacLeod was through with women. They were nothing but trouble.\n\nLeaving the rash life of his youth behind, he returned to Skye, seeking peace. He never meant to split the clan or start a war with the MacDonald of Duntulm. He certainly never foresaw an arranged marriage to the most scandalous woman in Scotland. Even though she was twice his age, the size of a horse and mother to more than one illegitimate child, he agreed to secure his sister's freedom.\n\nHowever, even that plan goes drastically awry. On his wedding day, he finds himself faced instead with an enticing, green-eyed lass named Bree. A walking disaster, his bride immediately turns his world into chaos and threatens to melt his resolve never to love again.\n\n\n- THE BEDEVILED HEART\n \n(Scotland, 1479) Cameron Malcolm Stewart, Earl of Lennox, had made his peace with destiny. It was not his fate to love as other men.\n\nEach of his politically arranged marriages had ended in disaster. And though he had never touched a one of his wives, he had come to believe that sharing his name would consign a woman to an early grave. So, on the sunny spring day Cameron encounters a delightfully devious, bright-eyed lass selling charmed stones in one of Stirling's alehouses, he tosses her a shilling, thinking only to steal a kiss. But it is a kiss that will change his life forever.\n\n\n- THE DARING HEART\n\n (Scotland, 1482) - To the scandalous Lord Julian Gray, marriage is a malady and nothing more.\n\nHow can a man even court a lass longer than a fortnight when there are so many pouting lips to kiss? Roaming the courts of Europe, Julian appears to spend his time drinking wine, wagering gold, and dandling willing lasses upon his knee. But no one knows the man behind the mask. No one knows that he is Le Marin--Europe's most daring and brazen spy.\n\nBut everything changes the night he finds a dagger pressed against his ribs and an alluring hazel-eyed minx in his bed.\n\n\n- THE BOLD HEART\n\n(Scotland, 1488) - Ewan was a battle-weary warrior with haunted dreams. He no longer believed in love.\n\nAs Scotland's greatest warrior and heir to the earldom of Mull, few dared to cross swords with Ewan MacLean. But the price he paid for his fearsome reputation was a heavy one. To survive, he buried his emotions and became only the warrior, riding from battle to battle with his men to protect Scotland from threats within and without her borders and letting himself feel nothing else.\nBut when his right-hand man, Alec Montgomery, is caught dallying with a powerful Lord's daughter, a trap is set. And both Ewan and Alec find themselves in an English prison, their necks headed for the noose.\n\nOn the Isle of Skye, the raven-haired Merry MacLeod spends her days caring for the clan elderly and hurtling across the moors on the back of her black stallion. A high-spirited, adventurous lass, she is no longer troubled by childhood memories of the day the braw lad, Ewan MacLean, rescued her from her husband, the cruel MacDonald. But when she hears the very same Ewan is now confined in an English prison, she disguises herself as a lad and sets out to repay her debt.\n\nAfter a bold, mysterious youth rescues Ewan and his men from the English, the group swiftly makes their way back to Scotland. But no sooner embarked on their journey home, a young Prince James sounds the call to arms, rises against his father, King James III of Scotland, and plunges Scotland into a dangerous civil war.\n\nBut as they journey to join the prince, both Ewan and Alec discover their rescuer's secret and both men find themselves falling unexpectedly in love with a raven-haired beauty\n\n\nNote: Have tried out both file types horizontally and vertically on Samsung Note 10.1 (2012 model), using Kindle for the mobi file and Aldiko for the epub file.\n\nEnjoy.\n\n","torrent":{"xt":"urn:btih:0d187d51eca603a81faf0fdceb9b79072765354a","amp;dn":"Scottish+Hearts+Collection+ebook+Carmen+Caine+Fiction","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d187d51eca603a81faf0fdceb9b79072765354a","infoHashBuffer":{"type":"Buffer","data":[13,24,125,81,236,166,3,168,31,175,15,220,235,155,121,7,39,101,53,74]},"announce":[],"urlList":[]}}