{"title":"Plato - Complete Works (Hackett Pub.) (retail epub, mobi)","uid":8666621,"size":12460625,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0d25c216e5b606bcf2b7732688a9d1ebdf6997c5&amp;dn=Plato+-+Complete+Works+%28Hackett+Pub.%29+%28retail+epub%2C+mobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"pharmakate","files":-1,"time":1373413902,"description":"Plato (John M. Cooper, ed.) - Complete Works (Hackett, 1997). 1808 pages.\n\nHigh quality epub, from a retail source; mobi converted with calibre\n\nNote: There's another epub edition of this book available on tpb, but this one is different and of much higher quality.\n\n\nThe best translation of Plato's complete works currently available.\n\ndescription:\n\nOutstanding translations by leading contemporary scholars -- many commissioned especially for this volume -- are presented here in the first single edition to include the entire surviving corpus of works attributed to Plato in antiquity. In his introductory essay, John Cooper explains the presentation of these works, discusses questions concerning the chronology of their composition, comments on the dialogue form in which Plato wrote, and offers guidance on approaching the reading and study of Plato's works. Also included are concise introductions to each translation, meticulous annotation designed to serve both scholar and general reader, and a comprehensive index. \n\nFrom Library Journal\n\nOne might be tempted to ask whether another collection of Plato's works is really necessary, given that they have been translated many times. But several factors set this particular volume apart, making it a worthy addition to most libraries. The translations are all relatively recent and thus reflect contemporary language use and terminology. The collection includes works such as the Minos, Epinomis, Demodocus, Eryxias, and Axiochus, which, though generally considered not to have been written by Plato, are &quot;Socratic&quot; in form or style. The text itself is clearly printed and laid out, with useful notes, and Cooper's introduction and notes about the translations are helpful in setting the dialogs in context.\n\n--------------------------------------\n\n\nHigh quality pdf version of this book available here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8224241&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8224241&lt;/a&gt;","torrent":{"xt":"urn:btih:0d25c216e5b606bcf2b7732688a9d1ebdf6997c5","amp;dn":"Plato+-+Complete+Works+%28Hackett+Pub.%29+%28retail+epub%2C+mobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d25c216e5b606bcf2b7732688a9d1ebdf6997c5","infoHashBuffer":{"type":"Buffer","data":[13,37,194,22,229,182,6,188,242,183,115,38,136,169,209,235,223,105,151,197]},"announce":[],"urlList":[]}}