{"title":"Homeland - Season 2","uid":9562657,"size":9119282328,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0d624343d944f1364b474f96c4b1c84454cf4b54&amp;dn=Homeland+-+Season+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":5,"uploader":"POtHS11","files":-1,"time":1391462084,"description":"Season 2 (2012)\n\nThe second season follows Carrie and the CIA working with Brody to capture Abu Nazir. Discovering a video of Brody's confession during a CIA operation in Lebanon, Carrie and Saul, along with analyst Peter Quinn, work to turn Brody into a double agent. Brody gives in to the CIA interrogation and is now an asset for the CIA, sending information to both sides. The downside of being a double agent as well as a rising Congressman with the Vice President's support brings Brody closer to Carrie while worsening his relationship with his family. Egged on by Abu Nazir, who was now in the U.S., Brody silently kills the Vice President while the CIA tracks down Nazir's contacts and kill Nazir himself using Brody's information. Seemingly free of being Nazir's man, Brody celebrates with Carrie at the CIA headquarters but both survive the explosion that killed Director Estes and many others. Having been framed for the bombing due to his earlier video confession, Brody flees the U.S. with Carrie's help. Carrie and Saul, who was burying Nazir's body at sea, are left to pick up the pieces.","torrent":{"xt":"urn:btih:0d624343d944f1364b474f96c4b1c84454cf4b54","amp;dn":"Homeland+-+Season+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d624343d944f1364b474f96c4b1c84454cf4b54","infoHashBuffer":{"type":"Buffer","data":[13,98,67,67,217,68,241,54,75,71,79,150,196,177,200,68,84,207,75,84]},"announce":[],"urlList":[]}}