{"title":"The Art of Japan - from the Jomon to the Tokugawa period (Art of","uid":11566164,"size":40138125,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0ef6b767274303deb8e18afdb395ca59c2203879&amp;dn=The+Art+of+Japan+-+from+the+Jomon+to+the+Tokugawa+period+%28Art+of&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"STBGD","files":-1,"time":1416953553,"description":"Pdf / English / 1966 Greystone Press / 242 pages / 38.2 MB\n\nby P.C.Swann, with 63 Illustrations in color and 63 black-and-white illustrations\n\nP.C.Swann,\nKeeper of the Department of Eastern Art at the Ashmolean Museum, Oxford;\neditor of the magazine Oriental Art; Professorial Fellow of St. Edmund Hall, Oxford;\nand author of several well-known books on Oriental art, has spent a lifetime studying the art of the Far East. He speaks Japanese fluently, and is intimately familiar with life in Japan. \n\nP.C.Swann has divided his text into nine chapters, beginning with the pre-Buddhist era, during which the widespread Jomon culture flourished for a very long time, perhaps from as early as the fifth millennium B.C. almost to the Christian Era. The last chapter closes with the opening of the country to the United States in 1868, which forced the Japanese to abandon their isolationist policy and allow foreigners into the country. Immediately thereafter, the Japanese reversed their previous behavior, and began to accept everything Western without discrimination.\n\nAs a natural reaction after a little more than a decade, Japan turned once more to the preservation of her past. Many museums were founded to protect the nation's treasures, and it is to these that we owe a large number of the masterpieces illustrated in this book","torrent":{"xt":"urn:btih:0ef6b767274303deb8e18afdb395ca59c2203879","amp;dn":"The+Art+of+Japan+-+from+the+Jomon+to+the+Tokugawa+period+%28Art+of","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ef6b767274303deb8e18afdb395ca59c2203879","infoHashBuffer":{"type":"Buffer","data":[14,246,183,103,39,67,3,222,184,225,138,253,179,149,202,89,194,32,56,121]},"announce":[],"urlList":[]}}