{"title":"Pokemon GO 0.31.0 Includes Guide and Map APK","uid":15450074,"size":66344392,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:0f11805333250b257f1c3cd82eba11849f8cb465&amp;dn=Pokemon+GO+0.31.0+Includes+Guide+and+Map+APK&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"IamHeMan","files":3,"time":1469933845,"description":"Latest Game Update:\r\n\r\nTrainers, Pokémon GO has been updated to version 0.31.0:\r\n- Avatars can now be re-customized from the Trainer profile screen\r\n- Adjusted battle move damage values for some Pokémon\r\n- Refined certain Gym animations\r\n- Improved memory issues\r\n- Removed footprints of nearby Pokémon\r\n- Modified battle damage calculation\r\n- Various bug fixes during wild Pokémon encounter\r\n- Updated Pokémon details screen\r\n- Updated achievement medal images\r\n- Fixed issues with displaying certain map features\r\n- Minor text fixes\r\n\r\nGame Details:\r\n\r\nVenusaur, Charizard, Blastoise, Pikachu, and many other Pokémon have been discovered on planet Earth! \r\nNow’s your chance to discover and capture the Pokémon all around you—so get your shoes on, step outside, and explore the world. You’ll join one of three teams and battle for the prestige and ownership of Gyms with your Pokémon at your side.\r\nPokémon are out there, and you need to find them. As you walk around a neighborhood, your smartphone will vibrate when there’s a Pokémon nearby. Take aim and throw a Poké Ball… You’ll have to stay alert, or it might get away!\r\n\r\nSearch far and wide for Pokémon and items\r\nCertain Pokémon appear near their native environment—look for Water-type Pokémon by lakes and oceans. Visit PokéStops, found at interesting places like museums, art installations, historical markers, and monuments, to stock up on Poké Balls and helpful items.\r\n\r\nCatching, hatching, evolving, and more\r\nAs you level up, you’ll be able to catch more-powerful Pokémon to complete your Pokédex. You can add to your collection by hatching Pokémon Eggs based on the distances you walk. Help your Pokémon evolve by catching many of the same kind.\r\n\r\nTake on Gym battles and defend your Gym\r\nAs your Charmander evolves to Charmeleon and then Charizard, you can battle together to defeat a Gym and assign your Pokémon to defend it against all comers.\r\n\r\nIt’s time to get moving—your real-life adventures await!\r\n\r\n\r\n\r\nGuide:\r\n\r\nFind everything you need to know about Pokémon GO with this app!\r\nPokémon GO is taking the world by storm and this app has everything you need!\r\n\r\nFeatures:\r\n• Location where you can find Pokémon!\r\n• Check out the game trailer!\r\n• Check out tips and tricks through Game Faqs and Digital Trends!\r\n• Pokémon GO Twitter Feed\r\n\r\nWith Poké Go Guide &amp; News, you will have all the information needed to begin hunting Pokémon. Bulbasaur, Pikachu, JigglyPuff, Vaporeon, Squirtle are the rest of the Pokémon are all waiting for you!","torrent":{"xt":"urn:btih:0f11805333250b257f1c3cd82eba11849f8cb465","amp;dn":"Pokemon+GO+0.31.0+Includes+Guide+and+Map+APK","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f11805333250b257f1c3cd82eba11849f8cb465","infoHashBuffer":{"type":"Buffer","data":[15,17,128,83,51,37,11,37,127,28,60,216,46,186,17,132,159,140,180,101]},"announce":[],"urlList":[]}}