{"title":"Giorgio Agamben - Philosophical Works (18 books)","uid":9917348,"size":106204334,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0f2e9960785c704925a5bd3f96b7af8c821c45ee&amp;dn=Giorgio+Agamben+-+Philosophical+Works+%2818+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"workerbee","files":-1,"time":1396916200,"description":"\nGIORGIO AGAMBEN (b. 1942) is one of the leading figures in Italian philosophy and radical political theory, and in recent years, his work has had a deep impact on contemporary scholarship in a number of disciplines in the Anglo-American intellectual world.  He is best known for his work investigating the concepts of the state of exception, form-of-life and homo sacer.  The concept of biopolitics (borrowed from Michel Foucault) informs many of his writings.  His strongest influences include Martin Heidegger, Walter Benjamin and Michel Foucault.\n\nMuch of his work since the 1980s can be viewed to leading up to the so-called Homo Sacer-project, that properly begins with the book HOMO SACER: SOVEREIGN POWER AND BARE LIFE (1995).  In this series of ongoing works, which have been published out of order, Agamben responds to Hannah Arendt's and Foucault's studies of totalitarianism and biopolitics.\n\n\nAll the following books are in PDF format of varying quality (several are also available as ePUBs):\n\n* THE CHURCH AND THE KINGDOM (Seagull Books, 2012).  Translated by Leland de la Durantaye, with photographs by Alice Attie.\n\n* THE COMING COMMUNITY (University of Minnesota Press, 1993).  Translated by Michael Hardt.\n\n* THE HIGHEST POVERTY: Monastic Rules and Forms-of-Life (Stanford University Press, 2013).  Translated by Adam Kotsko. -- PDF + ePUB\n\n* HOMO SACER: Sovereign Power and Bare Life (Stanford University Press, 1998).  Translated by Daniel Heller-Roazen. -- PDF + ePUB\n\n* INFANCY AND HISTORY: Essays on the Destruction of Experience (Verso, 1993).  Translated by Liz Heron.\n\n* THE KINGDOM AND THE GLORY: For a Theological Genealogy of Economy and Government (Stanford University Press, 2011).  Translated by Lorenzo Chiesa (with Matteo Mandarini). -- PDF + ePUB\n\n* LANGUAGE AND DEATH: The Place of Negativity (University of Minnesota Press, 1991).  Translated by Karen E. Pinkus and Michael Hardt.\n\n* MEANS WITHOUT END: Notes on Politics (University of Minnesota Press, 2000).  Translated by Vincenzo Binetti and Cesare Casarino.\n\n* THE OPEN: Man and Animal (Stanford University Press, 2004).  Translated by Kevin Attell.\n\n* OPUS DEI: An Archeology of Duty (Stanford University Press, 2013).  Translated by Adam Kotsko. -- PDF + ePUB\n\n* POTENTIALITIES: Collected Essays in Philosophy (Stanford University Press, 1999).  Translated by Daniel Heller-Roazen.\n\n* PROFANATIONS (Zone Books, 2007).  Translated by Jeff Fort.\n\n* REMNANTS OF AUSCHWITZ: The Witness and the Archive (Zone Books, 1999).  Translated by Daniel Heller-Roazen.\n\n* THE SACRAMENT OF LANGUAGE: An Archaeology of the Oath (Stanford University Press, 2011).  Translated by Adam Kotsko.\n\n* THE SIGNATURE OF ALL THINGS: On Method (Zone Books, 2009).  Translated by Luca D'Isanto with Kevin Attell.\n\n* STANZAS: Word and Phantasm in Western Culture (University of Minnesota Press, 1993).  Translated by Ronald L. Martinez.\n\n* STATE OF EXCEPTION (University of Chicago Press, 2005).  Translated by Kevin Attell.\n\n* WHAT IS AN APPARATUS &amp; OTHER ESSAYS (Stanford University Press, 2009).  Translated by David Kishik and Stefan Pedatella.\n\n_______________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n               &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n","torrent":{"xt":"urn:btih:0f2e9960785c704925a5bd3f96b7af8c821c45ee","amp;dn":"Giorgio+Agamben+-+Philosophical+Works+%2818+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f2e9960785c704925a5bd3f96b7af8c821c45ee","infoHashBuffer":{"type":"Buffer","data":[15,46,153,96,120,92,112,73,37,165,189,63,150,183,175,140,130,28,69,238]},"announce":[],"urlList":[]}}