{"title":"MemTest86 7.1 Pro Edition","uid":15505810,"size":25753493,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0f6cff571dc0cdf174b07e7ba6b13d7b0562c7b1&amp;dn=MemTest86+7.1+Pro+Edition&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"nikita200","files":6,"time":1470581004,"description":"There are many good approaches for testing memory. However, many tests simply throw some patterns at memory without much thought or knowledge of memory architecture or how errors can best be detected. This works fine for hard memory failures but does little to find intermittent errors. BIOS based memory tests are useless for finding intermittent memory errors.\r\n\r\nRAM chips consist of a large array of tightly packed memory cells, one for each bit of data. The vast majority of the intermittent failures are a result of interaction between these memory cells. Often writing a memory cell can cause one of the adjacent cells to be written with the same data. An effective memory test attempts to test for this condition. Therefore, an ideal strategy for testing memory would be the following:\r\nWrite a cell with a zero.\r\nWrite all of the adjacent cells with a one, one or more times.\r\nCheck that the first cell still has a zero.\r\n\r\nIt should be obvious that this strategy requires an exact knowledge of how the memory cells are laid out on the chip. In addition there are a never ending number of possible chip layouts for different chip types and manufacturers making this strategy impractical. However, there are testing algorithms that can approximate this ideal and MemTest86 does just this.\r\n\r\nIMPORTANT: MemTest86 V5 (and later) images supports dual booting (UEFI/BIOS). On machines that don't support UEFI, the older V4 BIOS release of MemTest86 will be automatically booted.\r\n\r\nHomepage: www.memtest86.com","torrent":{"xt":"urn:btih:0f6cff571dc0cdf174b07e7ba6b13d7b0562c7b1","amp;dn":"MemTest86+7.1+Pro+Edition","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f6cff571dc0cdf174b07e7ba6b13d7b0562c7b1","infoHashBuffer":{"type":"Buffer","data":[15,108,255,87,29,192,205,241,116,176,126,123,166,177,61,123,5,98,199,177]},"announce":[],"urlList":[]}}