{"title":"Principles of Neurological Surgery 3rd  Ed [PDF][tahir99] VRG.pd","uid":10574487,"size":124698224,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0f937727a3e20b34a0659a57b084ec24e97b4e6f&amp;dn=Principles+of+Neurological+Surgery+3rd++Ed+%5BPDF%5D%5Btahir99%5D+VRG.pd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"tahir99","files":-1,"time":1405625261,"description":"Principles of Neurological Surgery: Expert Consult - Online and Print, 3e (PRINCIPLES OF NEUROSURGERY)\n\nRichard G. Ellenbogen MD FACS (Author), Saleem I. Abdulrauf MD FAAN FACS (Author), Laligam N Sekhar MD FACS (Author)\n\nTRUE PDF, BOOKMARKED and INDEXED\n\nimage\n\nPublication Date: April 26, 2012 | ISBN-10: 1437707017 | ISBN-13: 978-1437707014 | Edition: 3\n\nPrinciples of Neurosurgery, by Drs. Richard G. Ellenbogen, Saleem I. Abdulrauf and Laligam N Sekhar, provides a broad overview of neurosurgery ideal for anyone considering or training in this specialty. From general principles to specific techniques, it equips you with the perspectives and skills you need to succeed. Comprehensive without being encyclopedic, this new edition familiarizes you with the latest advances in the field-neuroimaging, the medical and surgical treatment of epilepsy, minimally invasive techniques, and new techniques in position and incisions-and shows you how to perform key procedures via an online library of surgical videos at www.expertconsult.com. No other source does such an effective job of preparing you for this challenging field!\n\nGet comprehensive coverage of neurosurgery, including pre- and post- operative patient care, neuroradiology, pediatric neurosurgery, neurovascular surgery, trauma surgery, spine surgery, oncology, pituitary adenomas, cranial base neurosurgery, image-guided neurosurgery, treatment of pain, epilepsy surgery, and much more.\n\nGain a clear visual understanding from over 1,200 outstanding illustrations-half in full color-including many superb clinical and operative photographs, surgical line drawings, and at-a-glance tables.\n\nApply best practices in neuroimaging techniques, minimally invasive surgery, epilepsy surgery, and pediatric neurosurgery.\n\nMaster key procedures by watching experts perform them in a video library online at www.expertconsult.com, where you can also access the fully searchable text, an image gallery, and links to PubMed.\n\nKeep up with recent advances in neurosurgery with fully revised content covering neuroimaging, the medical and surgical treatment of epilepsy, minimally invasive techniques, new techniques in position and incisions, deep brain stimulation, cerebral revascularization, and treatment strategies for traumatic brain injury in soldiers.\n\nApply the latest guidance from new chapters on Cerebral Revascularization, Principles of Modern Neuroimaging, Principles of Operative Positioning, Pediatric Stroke and Moya-Moya, Anomalies of Craniovertebral Junction, and Degenerative Spine Disease.\n\nTap into truly global perspectives with an international team of contributors led by Drs. Richard G. Ellenbogen and Saleem I. Abdulrauf.\n\nFind information quickly and easily thanks to a full-color layout and numerous detailed illustrations.\n\nUnderstand the principles and problems of neurosurgery using this unique multimedia reference that's comprehensive without being encyclopedic.","torrent":{"xt":"urn:btih:0f937727a3e20b34a0659a57b084ec24e97b4e6f","amp;dn":"Principles+of+Neurological+Surgery+3rd++Ed+%5BPDF%5D%5Btahir99%5D+VRG.pd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f937727a3e20b34a0659a57b084ec24e97b4e6f","infoHashBuffer":{"type":"Buffer","data":[15,147,119,39,163,226,11,52,160,101,154,87,176,132,236,36,233,123,78,111]},"announce":[],"urlList":[]}}