{"title":"The Secrets of the FBI - Ronald Kessler - Audiobook MP3","uid":10817890,"size":257061336,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0fc337a02bfac4726d8a2958341cbd50caffc7ca&amp;dn=The+Secrets+of+the+FBI+-+Ronald+Kessler+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":2,"uploader":"Squiddy82","files":-1,"time":1408484361,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n \nThe Secrets of the FBI\n\nWritten by: Ronald Kessler\nNarrated by: Michael Bybee\nLength: 8 hrs and 54 mins\nFormat: Unabridged\nRelease Date:08-02-11\n\nThe Secrets of the FBI, by New York Times best-selling author Ronald Kessler, reveals the FBI's most closely guarded secrets and the secrets of celebrities, politicians, and movie stars uncovered by agents during their investigations.\n\nBased on inside access, the book presents revelations about the raid on Osama bin Laden's compound, the recent Russian spy swap, Marilyn Monroe's death, Vince Foster's suicide, and J. Edgar Hoover's sexual orientation. For the first time, it tells how the FBI caught spy Robert Hanssen in its midst and how the FBI breaks into homes, offices, and embassies to plant bugging devices without getting caught.\n\nFrom Watergate to Waco, from congressional scandals to the killing of bin Laden, The Secrets of the FBI presents headline-making disclosures about the most important figures and events of our time. ","torrent":{"xt":"urn:btih:0fc337a02bfac4726d8a2958341cbd50caffc7ca","amp;dn":"The+Secrets+of+the+FBI+-+Ronald+Kessler+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fc337a02bfac4726d8a2958341cbd50caffc7ca","infoHashBuffer":{"type":"Buffer","data":[15,195,55,160,43,250,196,114,109,138,41,88,52,28,189,80,202,255,199,202]},"announce":[],"urlList":[]}}