{"title":"Phish - Fuego  (2014) [FLAC]","uid":10400146,"size":385974272,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:10008eed507c534f2d7f25af17847fbe0aded1b6&amp;dn=Phish+-+Fuego++%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"politux","files":-1,"time":1403349495,"description":"\n  Phish - Fuego  (2014) [FLAC]\n\n  Genre: Pop/Rock \n  Styles: Jam Band, Alternative, Psychedelic \n  Source: CD (log + cue) \n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sample Rate: 44.1 kHz\n\n  01 Fuego \n  02 The Line \n  03 Devotion to a Dream \n  04 Halfway to the Moon \n  05 Winterqueen \n  06 Sing Monica \n  07 555 \n  08 Waiting All Night \n  09 Wombat \n  10 Wingsuit \n\n  The studio album has always been a slippery prospect for any jam band worth taking seriously. Even the earliest champions of live exploration (Grateful Dead, Allman Brothers, etc.) turned in their share of notoriously spotty or confusing studio recordings, much preferring the stage as a place for their craft to really take form. Long-running jam-band institution Phish follow this to a T, releasing scads of live recordings that tend to find superior readings of tunes that come off stuffy or lifeless in their studio versions. Releasing new studio material seems to be a low priority for the band, with 12th studio album Fuego being released five years after 2009's Joy, which itself came after 2004's Undermind. The hallucinatory whimsy and unbridled exuberance Phish exude on-stage has been hard to capture in the confines of the studio, but the excellent and smartly crafted Fuego steps outside of this pattern in a few ways. The logical thing to do when recording a band championed for their excellence in a live setting would be to record them as close to live in the studio as possible, as was the process with the unremarkable Joy. Studio legend Bob Ezrin seems to rethink that approach here, with production that highlights individual elements that make a fantastic whole, rather than the collective energy that so often turns to murky confusion on tape. \n\n  Instead of an overblown studio creation, Fuego instead finds the band sounding relaxed and connected, but also distinctly articulate in their often complex twists and turns. More than the smart production, Fuego is a standout in Phish's sometimes less-than-impressive studio catalog on the strengths of its ten stellar tracks, inspired tunes that share a loose thread as they bound between virtuosic playing, flirtations with gospel and funk, and the kind of eclectic rock jamming Phish have made their name on. The album opens with its epic titular track, a flashy, caffeinated jam that spins on for almost ten minutes before second track, &quot;The Line,&quot; simmers things down with its quirky grooves and a pop-friendly chorus that make the song one of the album's catchiest moments. Fans of the band's goofier side will delight in &quot;Wombat,&quot; a dorky funk workout that recalls their early romps with nonsensical lyrical themes and lighthearted genre experimentation. Horns, synthesizers, background singers, and other various sprinklings of production pop up throughout the album, keeping the already sharp tunes sonically interesting on top of solid interplay between the core bandmembers. With sharp production and some of the better compositions Phish have managed in ages, Fuego ranks among their best studio albums, capturing strands of the frenetic, cartoonish, darkly cautionary, and open-hearted expressions that make their concerts such moving experiences, but which often get lost when the tape starts rolling.","torrent":{"xt":"urn:btih:10008eed507c534f2d7f25af17847fbe0aded1b6","amp;dn":"Phish+-+Fuego++%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10008eed507c534f2d7f25af17847fbe0aded1b6","infoHashBuffer":{"type":"Buffer","data":[16,0,142,237,80,124,83,79,45,127,37,175,23,132,127,190,10,222,209,182]},"announce":[],"urlList":[]}}