{"title":"Alaap: A Discovery of Indian Classical Music (2009) ABEE","uid":11723333,"size":6352082567,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:100db84a53d8e233c9a4af287afe831e051269a0&amp;dn=Alaap%3A+A+Discovery+of+Indian+Classical+Music+%282009%29+ABEE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":6,"uploader":"The_Abee","files":219,"time":1424910497,"description":"Various Artists - Alaap: A Discovery of Indian Classical Music (2009) \n &lt;a href=&quot;\nhttp://www.exoticindia.com/books/alaap_a_discovery_of_indian_classical_music_collection_icn093.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exoticindia.com/books/alaap_a_discovery_of_indian_classical_music_collection_icn093.jpg&lt;/a&gt;\n\nALAAP: A DISCOVERY OF INDIAN CLASSICAL MUSIC\n\nHow often has one heard Indian classical music, enjoyed it, but understood nothing whatsoever?A significant characteristic of Indian Classical Music is tht one has to apply a little something more...a little effort, not necessarily at the mental level alone, but something which compels us to 'understand' rather than simply fade in and fade out to the background music of other genres like film or pop or rave or rock.Even with Indian classical it may be possible to actually sit and simply enjoy wafting strains. But if one so desires, then there can be an enhanced level of enjoyment, by comprehending the subtle touches and the technical twists. For this one ideally needs to study music, its theory, its various shades and colors. And for most, it remains as an 'idea', left to freer time,w hich will perhaps never show up. Does that mean, we remain where we are, with our little or no background of classical complexities, shying away altogether or indulging only as much as a chance evening may bring our way?Possibly.But then steps in Alaap, with its ambitious objective, all neatly packed into twenty hours of lifelong listening and a resource book, illustrated with innumerable archival treasures sporting legendary names and top class musicians.As its name suggests, Alaap, the introductory part of a musical composition provides in this case, an introduction to Indian Classical music. Its objective is to teach basic technicalities, draw attention to wonderful insights, illustrate with actual Hindustani and Carnatic compositions, and to let the heart and soul of Indian music light up as one glides along, with its self-luminescent glow.And this is how it proposes to do all this...In the first segment, it explores the subtle shades, diving right into the core andbringing out the essence of Indian classical music as a whole. In the middle and final segment, it details the aspects of Hindustani Music and Carnatic Music respectively, providing a rich and educative Audio-Glossary for both Styles.The Quest and the LureThis is perhaps the most important part of the entire experience involved in Indian classical music. It revolves around some of the most intriguing concepts, such that need to be felt at a deeper and spiritual level versus a methodical and academic approach.What is it that makes Indian music so unique and special and elusive...? It all lies in the magical dream-like notions of Shruti, Swata, Rasa, Bhava...all which constitute the delicate nuances of the Raga. Abstract they are, but not entirely imagined. They love being chased by the curious mind, until the very mind itself gives the reins to the heart which in turn delivers all to the soul...and then at one sudden moment, it happens...the elusive ones slow down their pace and show themselves, allowing one to touch, to feel, to sense and to drwon in their depthless magic.Alaap goes on to describe the internal make-up of the Guru-Shishya relationship, the age-old tradition of Gharanas or musical households, and throws light on some rare inner processes like Chilla and the Saghana that form an integral part of the musician's growth from the ordinary to the extraordinary.\n &lt;a href=&quot;\nhttp://s29.postimg.org/akpmat7zp/cover.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s29.postimg.org/akpmat7zp/cover.jpg&lt;/a&gt;\n\nHindustani Music What do we understand by Hindustani Music? What are the key elements that need to guide the musician through the limitless vistas of a Raga...in fact what is a Raga?Here Alaap gets into the details of the different styles and forms of Hindustani Music, describing each one's history and uniqueness. Also, rhythm as commonly asessed in the West, differs in Indian classical and thus, Tala forms part of the research and is well illustrated with all its pecularities and intricacies in this section. Many of the main concert instruments are exemplified singularly, giving an absolutely clear idea of each one's sound.Part II ends significantly with an entire conert of Hindustani Music, bringing together all that one has by now studied, heard, understood, giving an opportunity for practical application.Carnatic MusicAlthough two different styles do exist in the Norht and the South of India, they have their own share of similarities. Alaap not only explains the essential similarity which lies at the hearth of the two systems but also takes a ride through all the specialized features and notes that define and create Carnatic music. The Tala in this case follows its own rhythmic patterns and is in fact more complicated than its Hindustani counterpart; the musician tends to kep time himself and thus it becomes interesting and enjoyable if those listening are able to participate in this aspect.Here, just as in part II, there is an entire chapter dealing with Instruments peculiar tothis style, while another differentiates between the various kinds of musical compositions that have been passed on throught he ages. And once again, the segment ends befittingly with a Carnatic Music concert which allows one to exercise all that has been learnt or assimilated.Weaving all its elementary concepts together, tnterspersed with rich, humurous and revealing anecdotes, Alaap brings very near to the listener all that makes up the world of Indian Classical Music. Like the Indian Raga which cannot be restricted within any boundaries, the canvase of Indian music too, can never be completed with a final stroke.It is fundamental to keep in mind that &quot;music cannot be taught through tapes...&quot;. This collection of CDs only attempt to &quot;communicate the delight and the bliss of an art...&quot;, which has ancient beginning and an eternal future.The real effort however, needs to be made by the listener alone, just as the Guru or teacher of Indian music can only show the way to his Shishya or student..not more. Thereafter, all depends on the student's determination, devotion, dedication.In the words of the Sufi Saint Hazrat Inayat Khan, &quot;In music, no one leaves empty handed. Everyone gets as much as he can take.&quot;ContentsPart 1: The Quest and the Lure (6 CDs)1. The Quest2. How to Listen3. Indian and Western Music    a) No written Score    b) Always a New Creation    c) Melody and Harmony    d) Spiritual Nature of Indian Music4. The Call of the Swata5. Learning the Art    a) The Search for the Swara    b) The Guru Shishya Parampara    c) The Sadhana    d) The Chilla    e) The Gharanas6. The Alchemy of Music7. The World of the Raga8. Styles of Classical Singing9. Tala - The Throb of the Raga10. Hindustani and Carnatic Music11. Reaching OutPart II: The Heart and Soul of Hindustani Music (North Indian - 7 CDs)1. description of the Scale2. Movement of the Raga3. The Techniques and Graces4. Tala5. styles and Forms6. Gharanas7. Instruments8. Some Basic Concepts9. A Musical Concert10. The Meaning of ImprovisationPart III: The Heart and Soul of Carnatic Music (South Indian - 7 CDs)1. Swara (Notes) and Murcana (Scale)2. Ornamental Elements3. Raga Sancara or Movemnts of a Raga4. Types of Compositions5. Tala in Carnatic Music6. Musical Instruments7. A Carnatic Music Concert\n &lt;a href=&quot;\nhttp://s3.postimg.org/f1btntbnn/alaap_a_discovery_of_indian_classical_music_400x.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s3.postimg.org/f1btntbnn/alaap_a_discovery_of_indian_classical_music_400x.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imusti.com/#!/music/album/1353/Alaap%3A-A-Discovery-of-Indian-Classical-Music&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imusti.com/#!/music/album/1353/Alaap%3A-A-Discovery-of-Indian-Classical-Music&lt;/a&gt;\n\n---------------------------------------\n\n\n\nCome &amp; Join Suprbay; Post Requests, Suggestions &amp; Surf the TPB Forum. \n\n                                                &lt;a href=&quot;\nhttps://pirates-forum.org/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://pirates-forum.org/index.php&lt;/a&gt;\n\n__________________\n\n\nAnd, My Link On Suprbay:\n                                                &lt;a href=&quot;\nhttps://pirates-forum.org/Thread-Promising-ebooks-Audio-Books-Torrents-by-The-Abee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://pirates-forum.org/Thread-Promising-ebooks-Audio-Books-Torrents-by-The-Abee&lt;/a&gt;\n\nGet me there. :)\n\n\n `~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\n  SEED PLEASE , LET OTHERS GET IT TOO. \n `~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\n\n\n\n                                                     :)__Abee","torrent":{"xt":"urn:btih:100db84a53d8e233c9a4af287afe831e051269a0","amp;dn":"Alaap%3A+A+Discovery+of+Indian+Classical+Music+%282009%29+ABEE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"100db84a53d8e233c9a4af287afe831e051269a0","infoHashBuffer":{"type":"Buffer","data":[16,13,184,74,83,216,226,51,201,164,175,40,122,254,131,30,5,18,105,160]},"announce":[],"urlList":[]}}