{"title":"Scripts - Elegant Lettering from Designs Golden Age (Art Ebook).","uid":10041607,"size":374717047,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:100e0074df893d97e40a1a0fdc610376aee138cb&amp;dn=Scripts+-+Elegant+Lettering+from+Designs+Golden+Age+%28Art+Ebook%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"STBGD","files":-1,"time":1398469620,"description":"Steven Heller, Louise Fili, &quot;Scripts: Elegant Lettering from Design's Golden Age&quot;\nISBN: 0500290393, 0500515689 | 2012 | PDF (scan) | 352 pages | 357 MB\n\nElegant, quirky, fluid, brutish, ostentatious- a visual resource of cursives and other typefaces that resemble handwriting.\nFrom wedding announcements to IOUs, there are hundreds, perhaps thousands, of scripts-some &quot;classic,&quot; others eccentric. Derived from handwriting, these are typefaces that are stylized to suggest, imply, or symbolize certain traits linked to writing. Their fundamental characteristic is that all the letters, more or less, touch each other.\n\nScripts tend to fall in and out of fashion, but they are most definitely part of the typographic landscape today, and the more curious and distinctive they are, the better. Drawn from the Golden Age of Scripts, from the nineteenth to the mid-twentieth century, this is the first compilation of popular, rare, and forgotten scripts from the United States, Germany, France, England, and Italy.\n\nFilled with examples from a broad spectrum of sources-advertising, street signs, invitations, type-specimen books, personal letters-the book is a delightful and invaluable trove of long-overlooked material. 300 color and 50 black-and-white illustrations.\n","torrent":{"xt":"urn:btih:100e0074df893d97e40a1a0fdc610376aee138cb","amp;dn":"Scripts+-+Elegant+Lettering+from+Designs+Golden+Age+%28Art+Ebook%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"100e0074df893d97e40a1a0fdc610376aee138cb","infoHashBuffer":{"type":"Buffer","data":[16,14,0,116,223,137,61,151,228,10,26,15,220,97,3,118,174,225,56,203]},"announce":[],"urlList":[]}}