{"title":"The Medieval World  (History of Costume and Fashion) ","uid":6799566,"size":3587263,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:102327ddd3aabf033d98483f461aa7d1ecb8fb90&amp;dn=The+Medieval+World++%28History+of+Costume+and+Fashion%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"freaktorrent07","files":-1,"time":1320603632,"description":"  The Medieval World (History of Costume and Fashion)\n\n\nA History of Fashion and Costume is an eight-volume set that examines the development of costume and fashion over time - from the earliest cave dwellers to the present - along with the social history that gave rise to it. Introducing readers to the rich world of fashion and dress, this set vividly depicts the changing styles, processes, and trends - from the first people to wear clothes in the last Ice Age to the courtly fashion of medieval Europe to the globalization of Western style - that led us to the clothing of today. Describing both the practical uses of clothing and the highly impractical clothes that have been used throughout history to convey social status, these volumes provide a compelling look at the effects of fashion and costume on society. Each accessible volume describes the fashions of the time, styles and designs, and the changing use of materials. Beautiful illustrations and engaging text examine clothing as well as the jewelry, hairstyles, hats, and footwear that accompanied the fashions and made them unique. Special features in each volume include a foreword written by a fashion industry expert as well as a helpful glossary, timeline, and index.\n\n\n\nAuthor(s):\tPhilip Steele\nPublisher:\tFacts on File\nDate:\t        2005-09\nPages:\t        64\nFormat: \tPDF\nISBN10: \t0312575947\nISBN13: \t9780312575946","torrent":{"xt":"urn:btih:102327ddd3aabf033d98483f461aa7d1ecb8fb90","amp;dn":"The+Medieval+World++%28History+of+Costume+and+Fashion%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"102327ddd3aabf033d98483f461aa7d1ecb8fb90","infoHashBuffer":{"type":"Buffer","data":[16,35,39,221,211,170,191,3,61,152,72,63,70,26,167,209,236,184,251,144]},"announce":[],"urlList":[]}}