{"title":"[ExploitedCollegeGirls] Fanny (04.23.2015)","uid":11841878,"size":1042426215,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:108a21aebcea726968848ad7bb4e0cad489066c2&amp;dn=%5BExploitedCollegeGirls%5D+Fanny+%2804.23.2015%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":4,"uploader":"chkm8te","files":1,"time":1429870502,"description":"[ExploitedCollegeGirls] Fanny (04.23.2015)\n\nFanny's blessed with a curvy dancer's body, but Jay instantly homes in on her best quality and the source of her name: her amazing ass. It's a good thing that he didn't wait until after filming to come up with a name because this update would be called Lick Them Balls, Senorita. In fact, this week's update may possibly feature more ball play than Wimbeldon, although much less anal.\n\nYou'll notice right away that Fanny is what we might call shy, but she's still getting naked on camera so we're not complaining. For example, when Jay asks her what nationality she is, she mumbles, &quot;Hispanic.&quot; We're not sure where Hispania is, but it's not important other than the fact that apparently there might be a squirrel-like culture of nut worship there. After learning that Fanny doesn't masturbate, thinks big boobs are &quot;disgusting and gross&quot; and only has sex on a quarterly basis; well that's more than enough talking for now, dear.\n\nJay finally gets Fanny naked and introduces her to the novel pleasures of a vibrating sex toy and his expert fingers. After bringing her close to an orgasm, he finally gets a chance to sample Fanny's fantastic deep throat blowjob skills. This is a girl who, as we said above, really knows her way around the meat and veg. From gagless deep throating to seamless ball play to teasing her way around the head, this girl is an expert which is why you get several angles and replays.\n\nAfter fucking Fanny on her back, Jay flips her over and attempts some anal. He starts off by dropping a digit and lubing her up, but it just doesn't happen. He gets close but Fanny uses her safe word (&quot;Ouch!&quot;) and he backs off and finishes the shoot in her vag. Well, technically her finishes on her face, but he gets there with a lot of great, hard P in V action, including some serious pole riding in reverse cowgirl. Thanks Fanny, and uh, don't call us, we'll call you.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=xsa4bth96r6xva90i5ay.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=xsa4bth96r6xva90i5ay.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=vq6yhctsnhe8i5xld8nt.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=vq6yhctsnhe8i5xld8nt.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:108a21aebcea726968848ad7bb4e0cad489066c2","amp;dn":"%5BExploitedCollegeGirls%5D+Fanny+%2804.23.2015%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"108a21aebcea726968848ad7bb4e0cad489066c2","infoHashBuffer":{"type":"Buffer","data":[16,138,33,174,188,234,114,105,104,132,138,215,187,78,12,173,72,144,102,194]},"announce":[],"urlList":[]}}