{"title":"The Fugitive(1993)DVDRip.AC3(ENG)-DROCK","uid":6334009,"size":733871670,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:10aa230ebf36b11bede65251126f08f373d47b22&amp;dn=The+Fugitive%281993%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":2,"uploader":"drock232","files":-1,"time":1303395694,"description":"This 1993 box-office smash partly adheres to the 1960s TV series on which it is based and partly goes off on several tangents of its own. Harrison Ford stars as Dr. Richard Kimble, convicted of murdering his wife. While being transferred to prison by bus, Kimble is involved in a spectacular bus-train collision (one of the best of its kind ever filmed). Surviving the disaster, Kimble escapes, vowing to track down the elusive professional criminal whom he holds responsible for the murder. Dogging the fugitive every foot of the way is U.S. marshal Sam Gerard (an Oscar-winning turn by Tommy Lee Jones), who announces his intention to search &quot;every whorehouse, doghouse, and outhouse&quot; to bring Kimble to justice. Unlike his dour TV-series counterpart Barry Morse, Jones plays the role with a sardonic sense of humor: when a cornered Kimble screams, &quot;I didn't kill my wife,&quot; Gerard shrugs and famously replies, &quot;I don't care.&quot; Once the premise has been established, scripters Jeb Stuart and David Twohy and director Andrew Davis pull off several audacious plot twists, ranging from Kimble's rendezvous with a sympathetic lab technician to a jaw-dropping dive into a huge waterfall. The second half of the film offers one surprise after another (including the true identity of the murderer), brilliantly avoiding the letdown that plagues many movie adaptations of old TV series. \n\nRipped with Handbrake.\n\nLength: 2 Hours 10 Minutes\n\nFile Type: MP4","torrent":{"xt":"urn:btih:10aa230ebf36b11bede65251126f08f373d47b22","amp;dn":"The+Fugitive%281993%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10aa230ebf36b11bede65251126f08f373d47b22","infoHashBuffer":{"type":"Buffer","data":[16,170,35,14,191,54,177,27,237,230,82,81,18,111,8,243,115,212,123,34]},"announce":[],"urlList":[]}}