{"title":"The B-52s - Cosmic Thing 320cbr (Big Papi) 1989","uid":9479718,"size":114802013,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:10b8295036959fabbd6b4427f3909e42497c340f&amp;dn=The+B-52s+-+Cosmic+Thing+320cbr+%28Big+Papi%29+1989&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"Big-Papi","files":-1,"time":1389767370,"description":"The B-52s - Cosmic Thing 320cbr (Big Papi) 1989 (Size: 109.48 MB)\n\nSource; 1989 CD\n\n\n \t\t\n01 B-52s, The - Cosmic Thing.mp3\t8.99 MB\n \t\t\n02 B-52s, The - Dry County.mp3\t11.36 MB\n \t\t\n03 B-52s, The - Deadbeat Club.mp3\t11.08 MB\n \t\t\n04 B-52s, The - Love Shack.mp3\t12.38 MB\n \t\t\n05 B-52s, The - Junebug.mp3\t11.85 MB\n \t\t\n06 B-52s, The - Roam.mp3\t11.37 MB\n \t\t\n07 B-52s, The - Bushfire.mp3\t11.46 MB\n \t\t\n08 B-52s, The - Channel Z.mp3\t11.17 MB\n \t\t\n09 B-52s, The - Topaz.mp3\t10.09 MB\n \t\t\n10 B-52s, The - Follow Your Bliss.mp3\t9.61 MB\n \t\t\n\n\n\n\nBy Gary F. Taylor VINE VOICE\n\nThe B-52's began life as a self-described &quot;tacky little dance band&quot; out of 1970s Athens, Georgia--and they sounded like musical refugees from a Twilight Zone episode that Rod Serling thought better of. But the band touched a techno-nerve, and before too long they had a record deal and a cult single (&quot;Rock Lobster&quot;) that actually made the charts. But for all their fame, The B-52's very glitchy sound never had much in the way of airplay, much less big-time sales... until the release of COSMIC THING.\n\nCOSMIC THING spawned two major singles. The first one to hit--and the one that remains most durable--is &quot;Love Shack,&quot; a truly bizarre but extremely infectious mix of funky rhythm and catchy melody dominated by Fred Schneider's ultra-silly, ultra-clever pseudo-rap--the song was and is a tremendous amount of fun, and while it lacks the truly weird edge of earlier B-52's cuts it remains one of the best dance party cuts I've ever come across, something that will get you on your feet faster than you can say &quot;Bang Bang.&quot; The second hit, &quot;Roam,&quot; was more specifically pop--but pop with a B-52's twist: a covertly sexy lyric and Cindy Wilson and Kate Pierson blasting out unexpected harmonies from beneath their dueling beehive hairdos.\n\nBut COSMIC THING has more to offer than just these two cuts: everything here is extremely well done. The downbeat &quot;Dry Country&quot; has a seductive swing to it; &quot;Deadbeat Club&quot; is super smooth; &quot;Topaz&quot; is a remarkable little thing, sweet and sour all at once; and the largely non-vocal &quot;Follow Your Bliss&quot; wraps up the set on an unexpected but effective note.\n\nBy and large, the B-52's does the sort of music where a little goes a long way, but here they hit a really neat balance between their earlier extremes and some really solid pop inflections. The result may not please every one who is addicted to their original, undiluted sound, but the result is an extremely playable set that can be repeated again and again without you beginning to feel like roadkill on the intergalactic highway: it's funky, funny, stylish, and it still has enough of an edge to let you know that this really is the B-52's.\n\nBang bang, on the door, baby. Strongly recommended if you want to line up just to get down. Let's go around the world. The trip begins with a kiss!","torrent":{"xt":"urn:btih:10b8295036959fabbd6b4427f3909e42497c340f","amp;dn":"The+B-52s+-+Cosmic+Thing+320cbr+%28Big+Papi%29+1989","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10b8295036959fabbd6b4427f3909e42497c340f","infoHashBuffer":{"type":"Buffer","data":[16,184,41,80,54,149,159,171,189,107,68,39,243,144,158,66,73,124,52,15]},"announce":[],"urlList":[]}}