{"title":"[Ashley Fires Fetish Clips / Clips4Sale] Ashey Fires, Lux Orchid","uid":15758246,"size":374276924,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:10e484b2ea037a8c42c9fb9665d5648af25134c1&amp;dn=%5BAshley+Fires+Fetish+Clips+%2F+Clips4Sale%5D+Ashey+Fires%2C+Lux+Orchid&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"ImgSnaps","files":1,"time":1473079486,"description":"[Ashley Fires Fetish Clips / Clips4Sale] Ashey Fires, Lux Orchid - Son Gets Anal With Mommy\r\n\r\nScreenshots:\r\n \nhttp://imgsnaps.com/img2-57cd4cb87cbbd.html\r\n \nhttp://imgsnaps.com/img2-57cd4cb8801a8.html\r\n\r\n\r\nHarlo had finally gotten a job! Well, technically he had gotten an internship, an unpaid one at that. It was for a reputable company though and at the end of the internship was the opportunity for him to be hired so it was good enough. He was on a mission to collect; Mom had promised him a few months earlier that if he got a job she would finally give him anal sex. He walked in to find Mom sitting and chatting with his Aunt Lux in their living room. He greeted them both and without hesitation turned to his mother and said I did it Mom, I finally a job! I want what you promised me. She politely tried to dismiss him saying, Harlo, not now, Aunt Lux is here and this is just an internship. Im proud of you but its not a job, youll have to wait. He didnt care in his mind she owed him, Mom, you promised me that if I got a job, you would. Aunt Lux leaned close to her sister, What did you promise him? she asked. I told him that Id finally take his anal virginity, it can wait. His mother replied. Oh! How exciting! Aunty Lux exclaimed, I dont mind at all, I can help! she offered kindly. Mom started getting undressed while Aunty Lux got on her knees, Take out your cock, Im so proud of you she told him. Aunty Lux began sucking her nephews already stiff cock while Mom knelt before him. At first Mom was only going to let Harlo fuck her pussy, she knew her sister would want to join and she hoped that Harlo would cum inside his Aunt Lux and forget about fucking her ass for now. He fucked the ladies side by side and even had Mom lying on top of Aunty Lux as he fucked his Aunts pussy then his mothers. He didnt forget the promise though and he was persistent in asking, Mom finally agreed. As Harlo stuck his cock into his mothers sweet asshole he felt like he was on top of the world! He had been fucking her as part of their family tradition for years, but anal sex was the Holy Grail to the men of the family and at that moment Harlo understood why. It was an exciting bonus to have his dear Aunt Lux there bent over Mom, naked and encouraging him. He would fuck Moms ass then pull out and have Aunty suck his cock then hed go back into Moms asshole. Getting this internship was so worth it! He thought to himself as he fucked his mom. When Harlo came it was fast and hard and all over Moms perfect fuckhole, then he left. Aunty Lux cleaned up her sister with her mouth and shares the nectar of her son with a kiss. They really had the best family ever!","torrent":{"xt":"urn:btih:10e484b2ea037a8c42c9fb9665d5648af25134c1","amp;dn":"%5BAshley+Fires+Fetish+Clips+%2F+Clips4Sale%5D+Ashey+Fires%2C+Lux+Orchid","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10e484b2ea037a8c42c9fb9665d5648af25134c1","infoHashBuffer":{"type":"Buffer","data":[16,228,132,178,234,3,122,140,66,201,251,150,101,213,100,138,242,81,52,193]},"announce":[],"urlList":[]}}