{"title":"Otolaryngology- Head and Neck Surgery Clinical Reference Guide 4","uid":10634400,"size":24931084,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1134d8f8bef3a9468bf533a97b88c814be3de1a4&amp;dn=Otolaryngology-+Head+and+Neck+Surgery+Clinical+Reference+Guide+4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"tahir99","files":1,"time":1406371195,"description":"Otolaryngology- Head and Neck Surgery: Clinical Reference Guide\n\nby Raza Pasha (Author), Justin S. Golub (Author)\n\nTRUE PDF, BOOKMARKED and INDEXED\n\nimage\n\nISBN-13: 978-1597565325 ISBN-10: 1597565326 Edition: 4th September 13, 2013\n\nThe bestselling &quot;Pasha&quot; pocket guide Otolaryngology-Head and Neck Surgery: Clinical Reference Guide is back in an extensively revised, up-to-date, and expanded fourth edition.\n\nSpanning the breadth of the entire field, this &quot;high-yield&quot; book retains a &quot;by residents, for residents&quot; feel, while also including expert content useful to accomplished physicians.\n\nStudents, residents, attendings, and speech/hearing professionals will find the concise, outline format to be useful for clinical situations as well as a last minute cram before a consult or rounds. The guide has proven essential for board review and maintenance of certification exams as well as a quick source for primary care providers.\n\nIn addition to all the great features that have made this sought after book, this new edition features:\n* Revised updates across all chapters featuring the latest diagnostic and treatment information\n* A brand new Pediatric Otolaryngology chapter consolidating and expanding material on this expanding subspecialty\n* New sections on cutting-edge treatment methods including transoral robotic surgery and advancements in sleep apnea management\n* A new anesthesia appendix\n* A fully revised index\n* Contributions from current residents, fellows, and leading practicing experts\n* New and updated figures\n* Referenced updates on landmark studies in Head and Neck Cancer\n* Tabs for each chapter enable readers to quickly find sections they need\n\n","torrent":{"xt":"urn:btih:1134d8f8bef3a9468bf533a97b88c814be3de1a4","amp;dn":"Otolaryngology-+Head+and+Neck+Surgery+Clinical+Reference+Guide+4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1134d8f8bef3a9468bf533a97b88c814be3de1a4","infoHashBuffer":{"type":"Buffer","data":[17,52,216,248,190,243,169,70,139,245,51,169,123,136,200,20,190,61,225,164]},"announce":[],"urlList":[]}}