{"title":"Medical-Surgical Nursing, 7E Ignatavicius [PDF] [StormRG]","uid":11511631,"size":148984126,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:122a9a14e8545b8c1ad9fe751c62e8a04335c67e&amp;dn=Medical-Surgical+Nursing%2C+7E+Ignatavicius+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"0xmovva","files":2,"time":1416407196,"description":"TITLE/EDITION Medical-Surgical Nursing: Patient-Centered Collaborative Care, Single Volume, 7e (Ignatavicius, Medical-Surgical Nursing, Single Vol) \nAuthor: Donna D. Ignatavicius MS RN ANEF (Author), M. Linda Workman PhD RN FAAN (Author)\nSeries: Ignatavicius, Medical-Surgical Nursing, Single Vol\nHardcover: 1968 pages\nPublisher: Saunders; 7 edition (February 23, 2012)\nLanguage: English\nISBN-10: 1437728014\nISBN-13: 978-1437728019\nFormat: Retail PDF\nNOTE: this is the standalone ebook and may not include access codes that come packaged with the bound book\n\n___________________________________________________________________________________\n\n\nUsing a uniquely collaborative and reader-friendly approach, expert authors Donna D. Ignatavicius and M. Linda Workman cover all the latest trends, evidence-based treatment guidelines, and additional updated information needed for safe clinical practice in medical-surgical nursing. This seventh edition features an expanded emphasis on patient safety and NCLEXÂ® Examination preparation, new ties to the QSEN priorities for patient safety, and a greater alignment with the language and focus of clinical practice. A new chapter on evidence-based practice and a wealth of effective online learning tools help solidify your mastery of medical-surgical nursing.\n\nUNIQUE! Collaborative approach presents all medical, surgical, nursing, and other interventions through the lens of the nursing process.\nReader-friendly, direct writing style makes this one of the most readable medical-surgical nursing textbooks available.\nUNIQUE! Cutting-edge focus on the latest trends in nursing practice and nursing education prepares you for both today and tomorrow's nursing practice.\nUNIQUE! Integrated tools for NCLEX preparation get you ready for your licensure examination.\n\nChapter-opening Learning Outcomes are linked to Self-Assessment Questions for the NCLEX Examination on the Evolve website.\nUnique chapter-ending Get Ready for the NCLEX Examination! sections include Key Points organized by NCLEX Client Needs Categories.\nUNIQUE! Focus on nursing concepts helps bridge the gap between the concepts learned in Nursing Fundamentals, and disorders content learned in the medical-surgical nursing course.\nUNIQUE! Emphasis on clinical decision-making teaches you to apply concepts to true-to-life clinical situations.\nUNIQUE! Concentration on the core body of knowledge for the RN level of medical-surgical nursing practice focuses your attention on &quot;need-to-know&quot; content to pass the NCLEX Examination and practice safely as a beginning nurse.\nRich array of effective learning aids includes:\n\nBest Practice for Patient Safety &amp; Quality Care\nBest Practice for Emergency Care\nPatient and Family Education: Preparing for Self-Management \nNursing Focus on the Older Adult\nHome Care Assessment\nFocused Assessment\nCommon Examples of Drug Therapy\nEvidence-Based Practice\nConcept Maps\nLaboratory Profiles\nAssessment Using Gordon's Functional Health Patterns\nPatient safety is emphasized throughout with Nursing Safety Priority features, including Drug Alerts, Critical Rescue, and Action Alerts.\nMore NCLEXÂ® Examination preparation, including integrated NCLEX Examination Challenges to prepare you for the types of questions you will see on today's NCLEX Examination.\nGreater use of realistic clinical language familiarizes you with the terminology actually used by nurses, physicians, and other healthcare professionals in clinical practice today.\nStreamlined, prioritized coverage of the nursing process highlights the most important patient problems, regardless of whether they can be addressed by independent nursing actions or must be addressed by collaborative interventions.\nUNIQUE! New ties to QSEN competencies for patient safety inform you of the best safety practices in medical-surgical nursing.\nMore coverage of evidence-based practice teaches you how to appraise the validity of research and provides synopses of recent nursing research and other evidence-based articles.\nStudent Resources on Evolve include animations, video clips, audio clips, tutorials, Review Questions for the NCLEX Examination, and more.\nImproved layout and design streamlines content for an easier reading experience.\nCoverage of core genetics competencies acquaints you with new research demonstrating a genetic component to many diseases and disorders.\nIncreased emphasis on health promotion and promotion of self-care offers strategies for helping people recover from illness and stay well and prevent illness.\nAll-new Concept Maps match the streamlined nursing process format of the text and employ more creative, visually oriented symbols","torrent":{"xt":"urn:btih:122a9a14e8545b8c1ad9fe751c62e8a04335c67e","amp;dn":"Medical-Surgical+Nursing%2C+7E+Ignatavicius+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"122a9a14e8545b8c1ad9fe751c62e8a04335c67e","infoHashBuffer":{"type":"Buffer","data":[18,42,154,20,232,84,91,140,26,217,254,117,28,98,232,160,67,53,198,126]},"announce":[],"urlList":[]}}