{"title":"Mission in a Bottle: The Honest Guide to Doing Business Differen","uid":12298815,"size":66291652,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1234c720ac24b7961d3ac5c719ea78b483fd1db1&amp;dn=Mission+in+a+Bottle%3A+The+Honest+Guide+to+Doing+Business+Differen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"mdusanjay","files":1,"time":1440669826,"description":"Mission in a Bottle: The Honest Guide to Doing Business Differently--and Succeeding by Seth Goldman, Barry Nalebuff\n\nOverview: In an incredibly fun and accessible two-color graphic-book format, the cofounders of Honest Tea tell the engaging story of how they created and built a mission-driven business, offering a wealth of insights and advice to entrepreneurs, would-be entrepreneurs, and millions of Honest Tea drinkers about the challenges and hurdles of creating a successful business--and the importance of perseverance and creative problem-solving.\n\nSeth Goldman and Barry Nalebuff began Honest Tea fifteen years ago with little more than a tea leaf of an idea and a passion to offer organic, freshly brewed, lightly sweetened bottled tea. Today Honest Tea is a rapidly expanding national brand sold in more than 100,0000 grocery stores, restaurants, convenience stores and drugstores across the country. The brand has flourished as American consumers move toward healthier and greener lifestyles","torrent":{"xt":"urn:btih:1234c720ac24b7961d3ac5c719ea78b483fd1db1","amp;dn":"Mission+in+a+Bottle%3A+The+Honest+Guide+to+Doing+Business+Differen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1234c720ac24b7961d3ac5c719ea78b483fd1db1","infoHashBuffer":{"type":"Buffer","data":[18,52,199,32,172,36,183,150,29,58,197,199,25,234,120,180,131,253,29,177]},"announce":[],"urlList":[]}}