{"title":"NoSQL For Dummies by Adam Fowler [EPUB]","uid":12094747,"size":2496296,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1281369312112c8ba5b959c20de5fcfd1c5173f7&amp;dn=NoSQL+For+Dummies+by+Adam+Fowler+%5BEPUB%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"Hawzerstar","files":1,"time":1436123414,"description":"Book name: NoSQL For Dummies\n\nBook author: Adam Fowler\n\nBook description: Get up to speed on the nuances of NoSQL databases and what they mean for your organization\nThis easy to read guide to NoSQL databases provides the type of no-nonsense overview and analysis that you need to learn, including what NoSQL is and which database is right for you. Featuring specific evaluation criteria for NoSQL databases, along with a look into the pros and cons of the most popular options, NoSQL For Dummies provides the fastest and easiest way to dive into the details of this incredible technology. You'll gain an understanding of how to use NoSQL databases for mission-critical enterprise architectures and projects, and real-world examples reinforce the primary points to create an action-oriented resource for IT pros.\n\nIf you're planning a big data project or platform, you probably already know you need to select a NoSQL database to complete your architecture. But with options flooding the market and updates and add-ons coming at a rapid pace, determining what you require now,and in the future, can be a tall task. This is where NoSQL For Dummies comes in! * Learn the basic tenets of NoSQL databases and why they have come to the forefront as data has outpaced the capabilities of relational databases * Discover major players among NoSQL databases, including Cassandra, MongoDB, MarkLogic, Neo4J, and others * Get an in-depth look at the benefits and disadvantages of the wide variety of NoSQL database options * Explore the needs of your organization as they relate to the capabilities of specific NoSQL databases.\n\nBig data and Hadoop get all the attention, but when it comes down to it, NoSQL databases are the engines that power many big data analytics initiatives. With NoSQL For Dummies, you'll go beyond relational databases to ramp up your enterprise's data architecture in no time.\n\nNumber of pages: 456\n\nISBN13: 9781118905746\n\nISBN10: 1118905741\n\nFormat: EPUB","torrent":{"xt":"urn:btih:1281369312112c8ba5b959c20de5fcfd1c5173f7","amp;dn":"NoSQL+For+Dummies+by+Adam+Fowler+%5BEPUB%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1281369312112c8ba5b959c20de5fcfd1c5173f7","infoHashBuffer":{"type":"Buffer","data":[18,129,54,147,18,17,44,139,165,185,89,194,13,229,252,253,28,81,115,247]},"announce":[],"urlList":[]}}