{"title":"Code - Charles Petzold","uid":6886235,"size":16542842,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:12aaba00adc705e05060067d442d28c9974f5a11&amp;dn=Code+-+Charles+Petzold&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"jakcreed2","files":3,"time":1323840353,"description":"Charles Petzold's latest book, Code: The Hidden Language of Computer Hardware and Software, crosses over into general-interest nonfiction from his usual programming genre. It's a carefully written, carefully researched gem that will appeal to anyone who wants to understand computer technology at its essence. Readers learn about number systems (decimal, octal, binary, and all that) through Petzold's patient (and frequently entertaining) prose and then discover the logical systems that are used to process them. There's loads of historical information too. From Louis Braille's development of his eponymous raised-dot code to Intel Corporation's release of its early microprocessors, Petzold presents stories of people trying to communicate with (and by means of) mechanical and electrical devices. It's a fascinating progression of technologies, and Petzold presents a clear statement of how they fit together.\n\nThe real value of Code is in its explanation of technologies that have been obscured for years behind fancy user interfaces and programming environments, which, in the name of rapid application development, insulate the programmer from the machine. In a section on machine language, Petzold dissects the instruction sets of the genre-defining Intel 8080 and Motorola 6800 processors. He walks the reader through the process of performing various operations with each chip, explaining which opcodes poke which values into which registers along the way. Petzold knows that the hidden language of computers exhibits real beauty. In Code, he helps readers appreciate it. --David Wall\n\nTopics covered: Mechanical and electrical representations of words and numbers, number systems, logic gates, performing mathematical operations with logic gates, microprocessors, machine code, memory and programming languages. \nEnjoy and seed","torrent":{"xt":"urn:btih:12aaba00adc705e05060067d442d28c9974f5a11","amp;dn":"Code+-+Charles+Petzold","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12aaba00adc705e05060067d442d28c9974f5a11","infoHashBuffer":{"type":"Buffer","data":[18,170,186,0,173,199,5,224,80,96,6,125,68,45,40,201,151,79,90,17]},"announce":[],"urlList":[]}}