{"title":"The Complete Short Stories - Vol 2 - Roald Dahl","uid":10454042,"size":1055413,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:13601072f79e340e24e15a724363009441662985&amp;dn=The+Complete+Short+Stories+-+Vol+2+-+Roald+Dahl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1404057207,"description":"The Complete Short Stories of Roald Dahl in the second of two unsettling and sinister volumes.\n\n'Dahl finds the child in the adult and the adult in the child and, with a little smile, he sticks the knife in both' Anthony Horowitz, from his introduction\n\nRoald Dahl is one of the world's most popular writers, equally at home writing for both children and adults. In this, the second of two volumes chronologically collecting all his published adult short stories, we experience Dahl's dark and powerful imagination in full flight in 28 stories written between 1954 and 1988 (including eight tales which are not available in any other printed edition).\n\nHere, in 'Parson's Pleasure', a piece of furniture is the subject of a deceitful bargain; in 'William and Mary', a wife revenges herself on her dead husband; and in 'Royal Jelly' some new parents find an unusual and unsettling way to give their newborn its start in life.\n\nWhether you're young or old, once you've stepped into the brilliant, troubling world of Roald Dahl, you'll never be the same again.\n\n'One of the most widely read and influential writers of our generation' The Times\n\n'The absolute master of the twist in the tale' Observer\n\n","torrent":{"xt":"urn:btih:13601072f79e340e24e15a724363009441662985","amp;dn":"The+Complete+Short+Stories+-+Vol+2+-+Roald+Dahl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13601072f79e340e24e15a724363009441662985","infoHashBuffer":{"type":"Buffer","data":[19,96,16,114,247,158,52,14,36,225,90,114,67,99,0,148,65,102,41,133]},"announce":[],"urlList":[]}}