{"title":"Brian Tracy - How to Master Your Time","uid":4591020,"size":218123350,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:13beedc33b5dc751457169cf8830dd8184d4a00c&amp;dn=Brian+Tracy+-+How+to+Master+Your+Time&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"prince213","files":12,"time":1229827798,"description":"Product Details\n\n    * Language: English\n    * Type: Audio Book\n    * Format: MP3 @ 128 Kbps\n    * Publisher: Nightingale Conant\n\nProduct Description\n\nWouldn't it be extraordinary to learn how to manage your time?\n\nWouldn't you like to have more time available to get more done? To make more money and have more time to spend doing the things you like, and being with the people that make you happy?\n\nImagine having more energy, less stress and a greater sense of control.\n\nIt's easy... become the master of your time.\n\nTime mastery doesn't mean letting the clock rule your life. In fact, the very opposite is true: time mastery gives you the absolute freedom to do what you want, when you want to do it.\n\nI have created a practical and simple program on time management for you to achieve an outstanding life.\n\nI will teach you the philosophy of time management, to help you internalize it, and to help you develop a belief system that will make your every moment more efficient.\n\nYou will make a decision to become excellent at time management...to concentrate on the highest pay-off tasks.\n\nI designed this program to give you everything you will ever need to know about mastering your time for your personal life and career. Your life will simply work better.\n\nThrough this valuable 6-CD audio program, you'll learn to:\n\n    * Model your own behavior after the most efficient people\n    * Learn to lead others as an example of successful time management\n    * Become results-oriented, working smarter, not harder\n    * Delegate more effectively and become more adept at prioritizing\n    * Energize yourself with the positive results of your labor\n\nBe, have and do anything you want in your life, and learn how easy it is to implement positive time management in your every day world.\n\nWith How to Master your time you will receive hundreds of valuable ideas that you can put to use right now.\n\nEveryone starts the day with the same 24 hours... How will you use yours?\n\nBuy How to Master your time right now, the clock is ticking.\n\n\nVisit http://prince213.blogspot.com/ for more...","torrent":{"xt":"urn:btih:13beedc33b5dc751457169cf8830dd8184d4a00c","amp;dn":"Brian+Tracy+-+How+to+Master+Your+Time","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13beedc33b5dc751457169cf8830dd8184d4a00c","infoHashBuffer":{"type":"Buffer","data":[19,190,237,195,59,93,199,81,69,113,105,207,136,48,221,129,132,212,160,12]},"announce":[],"urlList":[]}}