{"title":"Dave Matthews Band - Studio Discography (320kbps)","uid":6791888,"size":1006487853,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:14726b8b6ee46a4d7099cc9173ef962451787d2b&amp;dn=Dave+Matthews+Band+-+Studio+Discography+%28320kbps%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":5,"uploader":"piratetorrent1989","files":85,"time":1320304794,"description":"Dave Matthews Band, sometimes shortened to DMB, is a U.S. rock band formed in Charlottesville, Virginia in 1991. The founding members were singer-songwriter and guitarist Dave Matthews, bassist Stefan Lessard, drummer/backing vocalist Carter Beauford and saxophonist LeRoi Moore. Boyd Tinsley was added to the band as a violinist soon after the band was formed. Moore died suddenly in August 2008 due to complications from an ATV accident. Grammy Award-winner Jeff Coffin, of BÃƒÂ©la Fleck and the Flecktones, has since filled Moore's spot as the band's saxophonist. Rashawn Ross and Tim Reynolds have also become full-time touring members of the band. With musicians who each have roots in differing genres, including jazz, classical, soul, rock, bluegrass, and hip-hop, the band has come together to create an eclectic sound which has earned them fans from a variety of quarters. As of 2010, Dave Matthews Band have approximate sales between 30 and 40 million copies worldwide.\nThe band is known for their annual summer-long tours of the US and Europe, featuring lengthy improvisational renditions of their songs, accompanied by an elaborate video and lighting show. This portion of the tour has become a stamp of DMB and has grown with the band since Fenton Williams began in the early 1990s. After twenty consecutive years of touring the band announced that it is going to take the summer of 2011 off. The band's most recent album, Big Whiskey and the GrooGrux King (the first since Moore's death) debuted at number one on Billboard 200, giving the band their fifth consecutive number one debut, making them the second band behind Metallica to do so.\nThe band has won one Grammy Award, and was awarded the NAACP Chairman's Award. According to Julian Bond, &quot;they sell out the largest arenas on Earth, but frequently give their music away.&quot;\n\nAlbums:\n\nUnder the Table and Dreaming (1994)\nCrash (1996)\nBefore These Crowded Streets (1998)\nEveryday (2001)\nBusted Stuff (2002)\nStand Up (2005)\nBig Whiskey and the GrooGrux King (2009)","torrent":{"xt":"urn:btih:14726b8b6ee46a4d7099cc9173ef962451787d2b","amp;dn":"Dave+Matthews+Band+-+Studio+Discography+%28320kbps%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14726b8b6ee46a4d7099cc9173ef962451787d2b","infoHashBuffer":{"type":"Buffer","data":[20,114,107,139,110,228,106,77,112,153,204,145,115,239,150,36,81,120,125,43]},"announce":[],"urlList":[]}}