{"title":"Paradise Or Oblivion - Disk A (Official Release)","uid":7185775,"size":2170788810,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:14e76cfd62949c303ef6d7b2cafb5f3e6145cef3&amp;dn=Paradise+Or+Oblivion+-+Disk+A+%28Official+Release%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"TheVenusProject","files":4,"time":1334420561,"description":"Disk A Subtiles - English | Afrikaans | Arabic | Bulgarian | Croation | Czech | Dutch | Estonian | Finnish | French | German | Greek | Hebrew | Hindi\n\nA free online documentary created by The Venus Project. Original music by Carly Paradis (http://www.carlyparadis.com/) from her album &quot;They Have Been Watching&quot;.\n\nWe encourage you to copy this documentary in full and distribute it to help introduce The Venus Project to others. Very soon we will have the DVD available for free download with subtitles in multiple languages (thanks to the volunteers at the Linguistic Team International) along with a printable label and DVD cover art. If you would like to purchase a copy to help support the project this will be available at our store for $10.00 each plus Shipping &amp; Handling. Multiple copies will also be accessible at reduced cost. Please check back in one week. Thank you.\n\nThis documentary details the root causes of the systemic value disorders and detrimental symptoms caused by our current established system. This video presentation advocates a new socio-economic system, which is updated to present-day knowledge, featuring the life-long work of Social Engineer, Futurist, Inventor and Industrial Designer Jacque Fresco, which he calls a Resource-Based Economy.\n\nThe film details the need to outgrow the dated and inefficient methods of politics, law, business, or any other &quot;establishment&quot; notions of human affairs, and use the methods of science, combined with high technology, to provide for the needs of all the world's people. It is not based on the opinions of the political and financial elite or on illusionary so-called democracies, but on maintaining a dynamic equilibrium with the planet that could ultimately provide abundance for all people.\n\nParadise or Oblivion, by The Venus Project, introduces the viewer to a more appropriate value system that would be required to enable this caring and holistic approach to benefit human civilization. This alternative surpasses the need for a monetary-based, controlled, and scarcity-oriented environment, which we find ourselves in today.\n\n*This is NOT the &quot;major motion picture&quot; that The Venus Project is working towards but rather is a 52 minute documentary to introduce the aims and proposals to new people.","torrent":{"xt":"urn:btih:14e76cfd62949c303ef6d7b2cafb5f3e6145cef3","amp;dn":"Paradise+Or+Oblivion+-+Disk+A+%28Official+Release%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14e76cfd62949c303ef6d7b2cafb5f3e6145cef3","infoHashBuffer":{"type":"Buffer","data":[20,231,108,253,98,148,156,48,62,246,215,178,202,251,95,62,97,69,206,243]},"announce":[],"urlList":[]}}