{"title":"The Power of Passive Investing More Wealth with Less Work by Ric","uid":9368109,"size":3977368,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:150b08b502760d028293362107be42ea5d94d8d0&amp;dn=The+Power+of+Passive+Investing+More+Wealth+with+Less+Work+by+Ric&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"420weedman","files":5,"time":1387469196,"description":" A practical guide to passive investing. \nTime and again, individual investors discover, all too late, that actively picking stocks is a loser's game. The alternative lies with index funds. This passive form of investing allows you to participate in the markets relatively cheaply while prospering all the more because the money saved on investment expenses stays in your pocket. \nIn his latest book, investment expert Richard Ferri shows you how easy and accessible index investing is. Along the way, he highlights how successful you can be by using this passive approach to allocate funds to stocks, bonds, and other prudent asset classes. \nAddresses the advantages of index funds over portfolios that are actively managed \nOffers insights on index-based funds that provide exposure to designated broad markets and don't make bets on individual securities \nFerri is also author of the Wiley title: The ETF Book and co-author of The Bogleheads' Guide to Retirement Planning. \nIf you're looking for a productive investment approach that won't take all of your time to implement, then The Power of Passive Investing is the book you need to read. ","torrent":{"xt":"urn:btih:150b08b502760d028293362107be42ea5d94d8d0","amp;dn":"The+Power+of+Passive+Investing+More+Wealth+with+Less+Work+by+Ric","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"150b08b502760d028293362107be42ea5d94d8d0","infoHashBuffer":{"type":"Buffer","data":[21,11,8,181,2,118,13,2,130,147,54,33,7,190,66,234,93,148,216,208]},"announce":[],"urlList":[]}}