{"title":"Antamedia hotspot 3.6","uid":9344964,"size":85792272,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1541fa4f133b3c8748dad7d6157e5e12c0ade98a&amp;dn=Antamedia+hotspot+3.6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"ssamjh","files":4,"time":1387019138,"description":"Antamedia HotSpot Software - HotSpot Software - WiFi Hotspot billing with time and bandwidth control.\n\nAntamedia HotSpot Software is a WiFi Hotspot billing software which helps you control and bill your customers for the Internet usage. HotSpot software is suitable for all purposes where customers should be redirected to the login page to sign in or pay for the Internet access. Upon the successful login, customer will see remaining time and bandwidth, browse the Internet until account expires, and refill the account when needed.\n\nOur HotSpot solution works with any active and passive network hardware. You are not required to buy specific access point models and in many cases not even required to reconfigure your network.\n\nFeature List:\nUser Accounts\nCreate prepaid user accounts with username and password\nUser accounts are time limited, when session ends customer can continue browsing after buying additional time\nAdd time to account and print receipt\nUnlimited time option (could be used to enable only bandwidth limits)\nSet expiration date (starts from first account login)\nSet allowed access hours for login\nAccount can be temporary disabled\nDisable inactivity timeout (customer doesn't have to relogin after specified inactivity time)\nTime left modification (optional)\n\nhow use\ninstal it then put loader in instal folder and edit run reg rename it to loader for startup","torrent":{"xt":"urn:btih:1541fa4f133b3c8748dad7d6157e5e12c0ade98a","amp;dn":"Antamedia+hotspot+3.6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1541fa4f133b3c8748dad7d6157e5e12c0ade98a","infoHashBuffer":{"type":"Buffer","data":[21,65,250,79,19,59,60,135,72,218,215,214,21,126,94,18,192,173,233,138]},"announce":[],"urlList":[]}}