{"title":"Unaccompanied Minors(2006)DVDRip.AC3(ENG)-DROCK","uid":6798523,"size":740013376,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:15f6820d1c68b2fc097acced1558e78a092a0330&amp;dn=Unaccompanied+Minors%282006%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":2,"uploader":"drock232","files":-1,"time":1320564155,"description":"A handful of kids stranded without their parents is determined to make the most of a bad situation in this comedy. It's Christmas Eve, and Oliver Porter (Lewis Black), the passenger relations manager at a busy airport in the Midwest, is looking forward to spending Christmas in Hawaii with his wife after 15 years in a row working on the busy Yuletide holiday. However, fate conspires against him when a massive snowstorm sweeps in and all flights are canceled. Porter suddenly has to deal with a number of stranded passengers, including six tween-age kids who are each flying unaccompanied from one divorced parent to another -- spoiled little rich girl Grace (Gina Mantegna), geeky but likable Spencer (Dyllan Christopher), his pesky little sister Katy (Dominique Saldana), plus-size comic book fan Beef (Brett Kelly), grumpy tomboy Donna (Quinn Shephard), and bright but mischievous Charlie (Tyler James Williams). With his hands full and determined to make his way to the islands, Porter puts his assistant Zach Van Bourke (Wilmer Valderrama) in charge of the kids. Zach doesn't care for this assignment and the kids don't care for him, and before long they've escaped from the basement conference room where he's stashed them and turned the airport into their playground. Unaccompanied Minors also features Paget Brewster, Rob Corddry and Teri Garr. \n\nRipped with Handbrake.\n\nLength: 1 Hour 30 Minutes\n\nFile Type: MP4\n\nFrame Width: 624\n\nFrame Height: 352\n\nFrame Rate: 29fps\n\nAudio\n\nBit Rate: 159kbps","torrent":{"xt":"urn:btih:15f6820d1c68b2fc097acced1558e78a092a0330","amp;dn":"Unaccompanied+Minors%282006%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15f6820d1c68b2fc097acced1558e78a092a0330","infoHashBuffer":{"type":"Buffer","data":[21,246,130,13,28,104,178,252,9,122,204,237,21,88,231,138,9,42,3,48]},"announce":[],"urlList":[]}}