{"title":"Badass: The Birth of a Legend - Spine-Crushing Tales ...","uid":15791750,"size":5705960,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:169c8998f1bdbb5f4ceab95693a499dc5f74c05e&amp;dn=Badass%3A+The+Birth+of+a+Legend+-+Spine-Crushing+Tales+...&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"marty14","files":1,"time":1473387384,"description":"Badass: The Birth of a Legend - Spine-Crushing Tales of the Most Merciless Gods, Monsters, Heroes, Villains, and Mythical Creatures Ever Envisioned - Ben Thompson [epub]\r\n\r\nIn his first book, Badass, Thompson, creator of the Web site badassoftheweek.com, focused on warlords, samurai, pirates, and gunfighters who actually existed; in this follow-up, he turns to mythological badasses throughout history. From Anubis and Zeus to Capt. James T. Kirk and Godzilla, Thompson delivers detailed and adrenaline-fueled screeds on 40 characters &quot;whose stories of ball-crushing conquest are still awesome enough to make even the tamest readers want to snatch up a sword and go hunting for dragon meat.&quot; Subjects include El Chupacabra (&quot;this freakadelic ass-reaming spawn of Satan&quot;); Diomedes (&quot;the wanton slaughter of faceless jobbers is just the beginning of awesomeness&quot;); and, in a long-overdue tribute, the Daleks from Doctor Who (&quot;these murderous, automated salt-shakers are vile constructs of pure evil&quot;).\r\n\r\nFortunately, the book includes badass women as well as men, and Thompson's overheated prose rises even further when describing the Indian goddess Kali: &quot;When she's not consuming the entrails of the gods, getting drunk on human blood, performing her Dance of Annihilation... she shoots blood out of her mouth like a fire hose... she's pretty much the most totally metal being ever.&quot;","torrent":{"xt":"urn:btih:169c8998f1bdbb5f4ceab95693a499dc5f74c05e","amp;dn":"Badass%3A+The+Birth+of+a+Legend+-+Spine-Crushing+Tales+...","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"169c8998f1bdbb5f4ceab95693a499dc5f74c05e","infoHashBuffer":{"type":"Buffer","data":[22,156,137,152,241,189,187,95,76,234,185,86,147,164,153,220,95,116,192,94]},"announce":[],"urlList":[]}}