{"title":"FTVGirls - Ellie - Making Men Happy","uid":11883047,"size":486030353,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:17922b88bbfa95ee510ed4ff05c485da8dc5323c&amp;dn=FTVGirls+-+Ellie+-+Making+Men+Happy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":4,"uploader":"chkm8te","files":1,"time":1430747433,"description":"FTVGirls - Ellie - Making Men Happy / 05.04.2015)\n\nThis supercute teen girl next door is planning to start her carreer in adult, and had her first experience here on FTV. Visiting all the way from New Hampshire, she came to stay for a weekend. A little shy at start, we see her in a cute little skirt and bra-less top, and wow are those breasts big for that little body of hers! She visits an ice cream store, and flashes her breasts and butt in front of some people (and sticks a ice cream stick inside her!), then goes to play in a park and expose herself some more. Watch those big breasts bounce as she runs around in the grass doing cartwheels! Visiting a car wash, she fingers herself and flashes where all the car wash employees are working, and they love watching this surprise visit! She then visits an office building, drawing more attention as she strips naked and spreads her private parts wide. She's making many men happy watching her! Back home, she masturbates her way, with finger penetration until orgasm, then uses a vibrator and ends up squirting all over the bathroom counter! We then see her spread her private parts, and gape wide, then fist herself! Not new to deep fingering, she says she likes to experiment with fingers all the time. Out at a restaurant, she flashes her breasts, and gets more playful and horny, then goes home to do a very sexy dance to music in a cute bra &amp; panties. The next morning, she wakes up as we watch those big breasts, and goes back to the bathroom counter to squirt again, this time all over the camera lens. She dances some more, then braids her hair, puts on a very cute &amp; innocent white dress, and visits a mall. There we notice how see-through her dress can be, and enjoy upskirt views while she flashes as people walk by! Fingering herself on the escalator and spreading her butt wide, she then has a little topless breakfast at another restaurant. Going home, she strips down on the bed, and gives us more extreme closeups of her pretty private parts, fists herself, and uses the large glass ball toy to penetrate and gape her vagina. Back out at a resort, she's wearing her cutest flower dress, and sexy red satin heels. We watch her big breasts pop out while she walks around, then penetrating with not just one, but two glass toys in her vagina! The double penetration stretches her wide... Back home, we discover that she is a ballerina, and does a magnificent dance to ballet music... some amazing beauty and grace in her step! It suddenly turns kinky when she uses a speculum to expose her vagina deep inside to her cervix, then tries to masturbate and squirt while she's wide open! Notice her strong vaginal muscles contracting while open... As the day comes to an end, she puts on another sexy outfit, this time a yellow dress with heels, and experiments with anal play for the first time. To finish off, she rides the large glass FTV Toy, though its a little too big for her little body. Another fun, adventurous FTV style teen, enjoy her First Time Experience -- she's that cute girl next door we all fantasize about.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=bb1u63uvx6szhrkjclml.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=bb1u63uvx6szhrkjclml.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=q0ck71ufgy200gnuu6fk.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=q0ck71ufgy200gnuu6fk.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:17922b88bbfa95ee510ed4ff05c485da8dc5323c","amp;dn":"FTVGirls+-+Ellie+-+Making+Men+Happy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17922b88bbfa95ee510ed4ff05c485da8dc5323c","infoHashBuffer":{"type":"Buffer","data":[23,146,43,136,187,250,149,238,81,14,212,255,5,196,133,218,141,197,50,60]},"announce":[],"urlList":[]}}