{"title":"Slipknot - 5 The Gray Chapter [Special Edition] mp3  (2014) ","uid":11183310,"size":180404468,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:17d0aa2f0d08e43a9b8545361bd78b0167dfbef9&amp;dn=Slipknot+-+5+The+Gray+Chapter+%5BSpecial+Edition%5D+mp3++%282014%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"analogkid6103","files":18,"time":1412894141,"description":"\n.5: The Gray Chapter is the upcoming fifth studio album by American heavy metal band Slipknot. Scheduled for release on October 20, 2014, it is the first album by the band in six years and the first to not feature bassist Paul Gray and drummer Joey Jordison after the former died in 2010 (the title of the album being a reference to his name), and the latter parted ways with the band in 2013. A standard and deluxe edition of the album will be released. The deluxe edition will feature two bonus tracks. It was also revealed another special edition featuring a t-shirt of the album cover will be released.\nimage\n\nThe writing process of the record began in late 2013. Wanting to dedicate more time to the album, guitarist Jim Root decided not to tour with Stone Sour in January 2014. According to frontman Corey Taylor, the sound of the album is somewhat of a cross between 2001's Iowa and 2004's Vol. 3: (The Subliminal Verses). Taylor told Pop Culture Madness that the material contains &quot;gorgeous melodies&quot; and the artistic direction as Vol. 3: (The Subliminal Verses) but yet retains some of its &quot;brutality&quot; from the Iowa era.\n\nA new bassist and drummer were added to the lineup during the recording process and Taylor told Loudwire that two similar masks were created for their appearances in music videos and stage performances as they saw it disrespectful to have them sporting unique masks. Both members were briefly shown in the music video for The Devil In I, however their identities have not been announced by Slipknot amidst speculation. Jim Root revealed in an interview that Donnie Steele was involved in some of the studio sessions for the album and they had tried many other bass players until they settled.\n\n\n\nSlipknot - .5: The Gray Chapter (2014)\n\n[Special Edition]\n\n\n\n\n\n\n\n\nTracklist:\n\n1. XIX\n2. Sarcastrophe\n3. Aov\n4. The Devil In I\n5. Killpop\n6. Skeptic\n7. Lech\n8. Goodbye\n9. Nomadic\n10. The One That Kills the Least\n11. Custer\n12. Be Prepared For Hell\n13. The Negative One\n14. If Rain Is What You Want\n15. Override (Bonus track)\n16. The Burden (Bonus track) ","torrent":{"xt":"urn:btih:17d0aa2f0d08e43a9b8545361bd78b0167dfbef9","amp;dn":"Slipknot+-+5+The+Gray+Chapter+%5BSpecial+Edition%5D+mp3++%282014%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17d0aa2f0d08e43a9b8545361bd78b0167dfbef9","infoHashBuffer":{"type":"Buffer","data":[23,208,170,47,13,8,228,58,155,133,69,54,27,215,139,1,103,223,190,249]},"announce":[],"urlList":[]}}