{"title":"Elder Scrolls IV: Oblivion","uid":4623144,"size":4491771904,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:18251b0a6da1242e60f0f882f7d7492be3534cb0&amp;dn=Elder+Scrolls+IV%3A+Oblivion&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"Bubonic","files":1,"time":1231109404,"description":"Oblivion is a fantasy role-playing adventure game and uses open-ended or sandbox gameplay. The main quest can be postponed or completely ignored as the player explores the expansive game worlds, following side-quests, interacting with NPCs, and developing their character.\n\n  Players are free to go anywhere inside the province of Cyrodiil at any time while playing the game, and even after completing the main quest storyline. The game never ends, and players are able to build up their character as much as they want, with no restrictions on skills or equipment.\n\n  The Windows version of the game is open to almost unrestricted modification, and there are hundreds of modifications available on the Internet. These modifications vary from minor item changes to complete game overhauls.\n\n  The game provides a wide variety of enemies, including monsters and animals. Enemies become stronger and weapons become more powerful as the player's character becomes more proficient in skills. This game mechanic, called &quot;leveling&quot;, keeps the difficultly constant throughout the course of the game. The player, however, has the option of adjusting the difficulty level.\n\n\nNo CD Key or noDVD crack Required it's a straight ISO file. Just mount, install and play!\n\n\nElder Scrolls IV: Shivering Isle - http://thepiratebay.se/torrent/4623154\n","torrent":{"xt":"urn:btih:18251b0a6da1242e60f0f882f7d7492be3534cb0","amp;dn":"Elder+Scrolls+IV%3A+Oblivion","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18251b0a6da1242e60f0f882f7d7492be3534cb0","infoHashBuffer":{"type":"Buffer","data":[24,37,27,10,109,161,36,46,96,240,248,130,247,215,73,43,227,83,76,176]},"announce":[],"urlList":[]}}