{"title":"Emergency Medicine MCQs- De Alwis [PDF] [StormRG]","uid":11180306,"size":5678910,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1891c2726856f13702f6b1776b46e0af320397ed&amp;dn=Emergency+Medicine+MCQs-+De+Alwis+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":2,"uploader":"0xmovva","files":2,"time":1412852511,"description":"TITLE/EDITIONEmergency Medicine MCQs, 1e\nAuthor: Waruna De Alwis , Yolande Weiner \nPaperback: 440 pages\nPublisher: Churchill Livingstone; 1 edition (December 4, 2012)\nLanguage: English\nISBN-10: 0729541045\nISBN-13: 978-0729541046\nFormat: Retail PDF\nNOTE: this is the standalone ebook and may not include access codes that come packaged with the bound book\n\n___________________________________________________________________________________\n\n\nAn invaluable self-assessment tool for emergency medicine trainees in Australasia.\n\nEmergency Medicine MCQs is an essential resource for Australasia's emergency medicine trainees.\n\nA practical self-assessment tool, the book assists trainees as they expand and refine their knowledge of emergency medicine, and will ultimately help them pass the Australasian Emergency Medicine Fellowship examination (FACEM).\n\nThe multiple-choice questions in Emergency Medicine MCQs cover both the core and non-core areas in the Australasian Emergency Medicine Fellowship. Using this text, trainees can revise alone or with their peers to identify the areas in which they need further development.\n\nThe curriculum is divided into three main areas where trainees require expert level of knowledge, high level of knowledge and general level of knowledge. It covers important clinical problems encountered in everyday emergency medicine practice - from cardiovascular emergencies through to obstetric and gynaecology emergencies, disaster management and toxicology.\n\nAs well as being ideal for emergency medicine trainees qualifying through AECM, the book is a useful resource for GPs taking the GEM qualification through ACEM and JMOs 'on call'.\n\nPlus, this emergency medicine text is accompanied by an app - a separate product containing 180 randomised multiple-choice questions on all the topics within the book.\n\nAn emergency medicine test bank, with questions and answers sections\nFilled with evidence-based, clinically oriented material, with references to currently relevant literature\nPractice Exams in Emergency Medicine App will also be released in conjunction with this text and is sold separately for iPhone, iPad, Android phone and tablet.\nPractice Exams in Emergency Medicine App features 3 exam papers and 60 MCQs reflecting topics covered in the core curriculum of the Australasian College for Emergency Medicine fellowship program.","torrent":{"xt":"urn:btih:1891c2726856f13702f6b1776b46e0af320397ed","amp;dn":"Emergency+Medicine+MCQs-+De+Alwis+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1891c2726856f13702f6b1776b46e0af320397ed","infoHashBuffer":{"type":"Buffer","data":[24,145,194,114,104,86,241,55,2,246,177,119,107,70,224,175,50,3,151,237]},"announce":[],"urlList":[]}}