{"title":"Jacobites: A New History of the 1745 Rebellion","uid":15749537,"size":8634617,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:18e15457c3c9732f103132d00b64420296a3db49&amp;dn=Jacobites%3A+A+New+History+of+the+1745+Rebellion&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"marty14","files":1,"time":1473015958,"description":"Jacobites: A New History of the '45 Rebellion - Jacqueline Riding [epub]\r\n\r\nThe 1745 Jacobite Rebellion was a turning point in British history. When Charles Edward Stuart, commonly known as the Young Pretender, sailed from France to Scotland in July 1745, and with only a handful of supporters to claim the throne for his exiled father, few people within Britain were alarmed. But after he raised the Stuart standard at Glenfinnan in the Western Highlands, destroyed a contingent of the British army at Prestonpans near Edinburgh, and then marched south into England, swiftly reaching Derby, the rising threatened to destabilise the British state, dethrone King George and the Hanoverian dynasty, while disrupting Britain's military capability in Europe and colonial activities in America and beyond. Less than four decades after the controversial Act of Union between Scotland and England, arrogance and incompetence on the part of government ministers had allowed the small danger Charles and his Jacobite army had initially posed to escalate into a full-scale civil war: part of the on-going dynastic, political and ideological struggle for the heart and soul of this new nation.\r\n\r\nYet the reality of the '45 continues to be obscured by fiction and myth, as personified by the heroic, gallant but doomed 'Bonnie Prince Charlie' versus the heartless victor, 'Butcher' Cumberland. In the years 1745-6 nothing was certain. While utilising past and recent scholarship, this magnificent account draws extensively on a wealth of contemporary sources, revealing the thoughts and feelings of the key players and local eyewitnesses as these extraordinary events played out. What emerges is a story more complex, paradoxical and even tragic than the myth suggests. From the exiled Stuart court in Rome to the palaces of Versailles and Holyroodhouse, from the battlefields of Flanders to Falkirk and Culloden, Jacobites brilliantly sets the '45 in its full and proper context on the stage of European history. And in our own time of seismic shift for the Union, the British political system, constitution and monarchy, Jacobites offers a timely re-telling of this critical episode in our island's shared past","torrent":{"xt":"urn:btih:18e15457c3c9732f103132d00b64420296a3db49","amp;dn":"Jacobites%3A+A+New+History+of+the+1745+Rebellion","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18e15457c3c9732f103132d00b64420296a3db49","infoHashBuffer":{"type":"Buffer","data":[24,225,84,87,195,201,115,47,16,49,50,208,11,100,66,2,150,163,219,73]},"announce":[],"urlList":[]}}