{"title":"Uncanny X-Men (v1 - v3 + Extras) (Digital+Scans) (1963 - Ongoing","uid":11357265,"size":22167618212,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:194b71f52bbb51882e060686b432bc1c520d7439&amp;dn=Uncanny+X-Men+%28v1+-+v3+%2B+Extras%29+%28Digital%2BScans%29+%281963+-+Ongoing&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":15,"uploader":"nemesis43","files":660,"time":1414962917,"description":"Uncanny X-Men (v1-v3 + Extras)(Digital+Scans)(1963 - Ongoing)(Empire+Minutemen)\n\n\nVolume 1\n\nThis is a continuation of Stan Lee's and Jack Kirby's original The X-Men (Vol. 1).\n\nBeginning with issue #114 the descriptive &quot;Uncanny&quot; was added to the cover treatment but it wasn't until issue #142 that the volume's official name was permanently changed to Uncanny X-Men, which it remains to this day. Originally the standalone X-Men title it has now become the flagship under which all other X-titles revolve around. While each other title (Legacy, Astonishing, New Mutants, and the new adjective-less X-Men) has its own focus, this title has become sort of the mutant world view of the Marvel Universe, having no set team or focal character.\n\nThe title has had many creative influences over the years but Chris Claremont was probably the force that drove the title through many it its historic changes, truly bringing it from &quot;the world strangest teens&quot; into their new status a team of mutants fight in a &quot;world that fears and hates them&quot;. During his legendary 15 year run he gave us character and stories such as Phoenix/Dark Phoenix, the Hellfire Club, the New Mutants, X-Factor, the Mutant Massacre, Inferno and Jubilee and numerous other historic heroes and events. This epic run ended after editorial disputes in 1991.\n\nSince then this title has been the mainstay of the X-universe and the central part of most storylines from X-Cutioners Song and Fatal Attractions all the way to House of M and the Messiah Trilogy.\n\nSince the Utopia storyline with Norman Osborn's Dark Avengers, the title has focused strongly on the mutant life on the island and in the greater San Francisco area. Recent developments have included Magneto's return to the X-Men, Kitty Pryde's intangible return from space, the aftermath of Bastion's attack on Utopia and new trouble from the Breakworld","torrent":{"xt":"urn:btih:194b71f52bbb51882e060686b432bc1c520d7439","amp;dn":"Uncanny+X-Men+%28v1+-+v3+%2B+Extras%29+%28Digital%2BScans%29+%281963+-+Ongoing","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"194b71f52bbb51882e060686b432bc1c520d7439","infoHashBuffer":{"type":"Buffer","data":[25,75,113,245,43,187,81,136,46,6,6,134,180,50,188,28,82,13,116,57]},"announce":[],"urlList":[]}}