{"title":"Roger Zelazny - Nine Princes in Amber (The Chronicles of Amber #","uid":12303430,"size":159223421,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1980bee990c865715ecae6292e2df9e0f4e51611&amp;dn=Roger+Zelazny+-+Nine+Princes+in+Amber+%28The+Chronicles+of+Amber+%23&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":2,"uploader":"Cybotage","files":1,"time":1440755051,"description":"Nine Princes in Amber is the first of the 10 books that are The Chronicles of Amber; an epic fantasy series written by six-time Hugo Award winning and three-time Nebula Award winning author, Roger Zelazny.\n\nThe ten books that make up the series are told in two story arcs: The Corwin Cycle and the Merlin Cycle.\n\nThe Audible audio rendition of this classic sci-fi/fantasy series is kicked off by 2012 Audie Award nominee, Alessandro Juliani, who reads the first five books that make up the Corwin Cycle and whose narration vividly brings the world of Amber to life.\n\nAmber is the one real world, of which all others including our own Earth are but Shadows. Amber burns in Corwin's blood. Exiled on Shadow Earth for centuries, the prince is about to return to Amber to make a mad and desperate rush upon the throne.\n\nFrom Arden to the Pattern deep in Castle Amber which defines the very structure of Reality, Corwin must contend with the powers of his eight immortal brothers, all Princes of Amber. His savage path is blocked and guarded by eerie structures beyond imagining impossible realities forged by demonic assassins and staggering Forces that challenge the might of Corwin's superhuman fury.\n\n\n\nRead by Alessandro Juliani\nFormat: MP3\nUnabridged","torrent":{"xt":"urn:btih:1980bee990c865715ecae6292e2df9e0f4e51611","amp;dn":"Roger+Zelazny+-+Nine+Princes+in+Amber+%28The+Chronicles+of+Amber+%23","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1980bee990c865715ecae6292e2df9e0f4e51611","infoHashBuffer":{"type":"Buffer","data":[25,128,190,233,144,200,101,113,94,202,230,41,46,45,249,224,244,229,22,17]},"announce":[],"urlList":[]}}