{"title":"Shellac - Discography (1994-2014) [FLAC]","uid":11037367,"size":1478488837,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1982f4f86892a3e6d1a497fc034558790c8050d8&amp;dn=Shellac+-+Discography+%281994-2014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":2,"uploader":"politux","files":-1,"time":1410809424,"description":"\n  Shellac - Discography (1994-2014) [FLAC]\n\n  Genre: Rock\n  Styles: Math Rock, Alternative, Post-Hardcore\n  Source: CD\n  Codec: FLAC\n  Bit rate: ~ 1,000 kbps\n  Bit depth: 16\n  Sample rate: 44.1 kHz\n\n  1994 At Action Part\n  1994 Live in Tokyo \n  1998 Terraform\n  2000 1000 Hurts\n  2007 Excellent Italian Greyhound\n  2014 Dude Incredible \n\n  More likely to play Reykjavik than Detroit, and more likely to release songs on flexi-discs in Dutch comic books than provide MP3s on their website, Shellac (or Shellac of North America) operated completely outside the typical machinations of the music industry -- their press sheets typically exclaimed &quot;no free lunch,&quot; referring to promo copies -- and trio carved out a sizable niche as a minimalist rock band.\n\nStarted in an informal setting between infamous engineer and guitarist Steve Albini (ex-Just Ducky, Big Black, Rapeman) and drummer Todd Trainer (ex-Rifle Sport, Brick Layer Cake) in 1992, Shellac came into full formation after Albini invited bassist Bob Weston (ex-Sorry, Volcano Suns) to move to Chicago, employing him as an engineer at his studio. A clutch of singles soon appeared in 1993 and 1994 on Touch and Go and Drag City, somewhat following in the footsteps of Albini's Big Black and Rapeman, if only due to his trebly, cutting guitar work and deadpan vocals. As with Big Black, Shellac provided a forum for Albini to air his thoughts on the uglier side of humanity, though lowering the perversity and upping the humor a notch. (An early claim was that all Shellac songs concerned either baseball or Canada, sometimes both in the same song.) The odd rhythms of Trainer and rumbling bass of Weston, however, clearly removed Shellac from any of the members' previous involvements.\n\n The trio's first LP, At Action Park, appeared in late 1994. Four years passed until their proper follow-up, Terraform, which was recorded much earlier than its release date but was delayed due to artwork clearance. Recorded on various dates in 1998 and 1999, their third full-length, 1000 Hurts, was released in the late summer of 2000. Excellent Italian Greyhound followed nearly seven full years later, featuring several songs the band had been playing live for quite some time. The band also recorded a session for John Peel, gave away a recording made for a ballet to 779 friends, and had a live show released in Japan by chum K.K. Null. Other singles and numerous compilation appearances featured Shellac, including a cover of AC/DC's &quot;Jailbreak&quot; for a Skin Graft compilation.","torrent":{"xt":"urn:btih:1982f4f86892a3e6d1a497fc034558790c8050d8","amp;dn":"Shellac+-+Discography+%281994-2014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1982f4f86892a3e6d1a497fc034558790c8050d8","infoHashBuffer":{"type":"Buffer","data":[25,130,244,248,104,146,163,230,209,164,151,252,3,69,88,121,12,128,80,216]},"announce":[],"urlList":[]}}