{"title":"Wolf Hall - Hilary Mantel   (Unabridged)","uid":11677324,"size":709051751,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1a3acc4d0d077faaee3b72fc61f3899a9576aa18&amp;dn=Wolf+Hall+-+Hilary+Mantel+++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"davieboy1966","files":28,"time":1422925043,"description":"ABOUT THE BOOK\nTudor England. Henry VIII is on the throne, but has no heir. Cardinal Wolsey is charged with securing his divorce. Into this atmosphere of distrust comes Thomas Cromwell - a man as ruthlessly ambitious in his wider politics as he is for himself. His reforming agenda is carried out in the grip of a self-interested parliament and a king who fluctuates between romantic passions and murderous rages.\n\n\nABOUT THE AUTHOR\nHilary Mantel, born 06 July 1952, is an English author who has written short stories, essays, biographies and, most famously, historical fiction. She is one of only a few authors to have won the Man Booker Prize twice, for Wolf Hall and its sequel, Bring Up the Bodies.\nShe was born in Glossop, Derbyshire and studied Law at the London School of Economics. She moved to Botswana in 1977 with her husband and later spent four years in Saudi Arabia. Her memoir of this period, Someone to Disturb, won The Spectator's inaugural Shiva Naipaul Memorial Prize. She returned to England in the mid-1980s.\nBefore the success of Wolf Hall she had written nine successful books and regularly wrote for The Spectator and other magazines and newspapers.\n\n\nABOUT THE READER\nSimon Slater been performing, playing and composing from a teenager right through to university when he attended Goldsmiths College at the University of London. He plays piano, double bass, saxophone, clarinet, and the ukulele. His film credits include Dealers, the Iron Lady, Hornblower and Entrapment. His work as a theatrical actor includes a five-year run in the musical Mamma Mia! as Sam Charmichael, as well as Forbidden Broadway (Fortune), Sugar Hill Blues (Hampstead and Warehouse Croydon), The Great White Hope (Tricycle), Aspects of Love (Sydmonton Festival), Waiting for Godot, and Wind in the Willows (Nuffield Southampton). Slater has made guest appearances in TV series, including in Heartbeat, Birds of a Feather, Doctor Who, Inspector Morse, Lovejoy, Monarch of the Glen and Where the Heart Is. In 1987, he appeared as Inspector Kite in the third series of The Bill. Slater has also appeared in the Theatre Royal In Winchester playing Captain Hook in a performance of Peter Pan during the Christmas season of 2010/2011.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:1a3acc4d0d077faaee3b72fc61f3899a9576aa18","amp;dn":"Wolf+Hall+-+Hilary+Mantel+++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a3acc4d0d077faaee3b72fc61f3899a9576aa18","infoHashBuffer":{"type":"Buffer","data":[26,58,204,77,13,7,127,170,238,59,114,252,97,243,137,154,149,118,170,24]},"announce":[],"urlList":[]}}