{"title":"Stephen Hawking - His Life and Works - Kitty Ferguson","uid":11774590,"size":7323531,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1a65a10fdb0d83c1ff6d4d0d7e6cb857a190dd53&amp;dn=Stephen+Hawking+-+His+Life+and+Works+-+Kitty+Ferguson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"Mohammad_AT","files":3,"time":1427222029,"description":"Stephen Hawking is one of the most remarkable figures of our time - a Cambridge genius who has earned international celebrity and become an inspiration to those who have witnessed his triumph over disability. This is Hawking's life story by Kitty Ferguson, written with help from Hawking himself and his close associates.Updated and substantially expanded from her earlier book of 1992, this carefully researched, up to the minute biography gives a rich picture of Hawking's life - his childhood, the heartrending beginning of his struggle with motor neurone disease, his ever-increasing international fame, and his long personal battle for survival in pursuit of a scientific understanding of the universe. Throughout Kitty Ferguson also summarizes and explains the cutting-edge science in which Hawking has been engaged.Stephen Hawking is written with the clarity and simplicity for which all Kitty Ferguson's books have been praised. The result is a captivating account of an extraordinary life and mind","torrent":{"xt":"urn:btih:1a65a10fdb0d83c1ff6d4d0d7e6cb857a190dd53","amp;dn":"Stephen+Hawking+-+His+Life+and+Works+-+Kitty+Ferguson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a65a10fdb0d83c1ff6d4d0d7e6cb857a190dd53","infoHashBuffer":{"type":"Buffer","data":[26,101,161,15,219,13,131,193,255,109,77,13,126,108,184,87,161,144,221,83]},"announce":[],"urlList":[]}}