{"title":"Wittgenstein, Turning Point in the Philosophy of Mathematics [PD","uid":10294273,"size":7275741,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1a73da24b23edf24489fa4a20389a4664d350914&amp;dn=Wittgenstein%2C+Turning+Point+in+the+Philosophy+of+Mathematics+%5BPD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"0xmovva","files":-1,"time":1401901857,"description":"Author: Stuart G. Shanker\nPaperback: 370 pages\nPublisher: State Univ of New York Pr; New edition edition (February 28, 1987)\nLanguage: English\nISBN-10: 0887064833\nISBN-13: 978-0887064838\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n___________________________________________________________________________________\n\n\nOn the first page of Culture and Value we read: 'There is no religious denomination in which the misuse of metaphysical expressions has been responsible for so much sin as it has in mathematics.' Here is a charge that must either be exploded or primed; on no account can it be ignored, whatever one's attitude towards Wittgenstein's conception of philosophy. Unfortunately, the widespread obloquy that Wittgenstein's work in the philosophy of athematics has provoked tends to dampen enthusiasm for such an initiative. Even sympathetic admirers are cowed into submission by such disparaging assessments as Dummett's reproach that 'Many of the thoughts [in Remarks on the Foundations of Mathematics] are expressed in a manner which the author recognised as inaccurate or obscure; some passages contradict others; some are quite inconclusive; some raise objections to ideas which \nWittgenstein held or had held which are not themselves stated clearly in the volume; other passages again, particularly those on consistency and on GOdel's theorem, are of poor quality or contain definite errors.'! It is the spectre of technical mistakes which must be particularly haunting for the aspiring Wittgensteinian; but this issue must be squarely confronted, if only to certify whether or not Remarks on the Foundations of Mathematics is an area which \nwould best be left undisturbed by the prudent Wittgensteinian. \n\nThe origin of this work was a commission to undertake the first step of this unenviable task by identifying the specific mistakes that critics were alluding to in their passing asides on Wittgenstein's failure to grasp the mechanics of GOdel's second incompleteness theorem. It quickly became manifest, however, that far more was involved here than was immediately apparent. It was obvious that Wittgenstein's remarks on GOdel's theorem could not be grasped \nwithout a prior understanding of his attack on meta-mathematics and Hilbert's Programme, yet these latter issues could not be broached before Wittgenstein's discussions of the nature of mathematical propositions and proof had been addressed. But how could the latter topics be understood without placing them in the context of Wittgenstein's attack on the use of 'prose' in the interpretation of mathematics, his many examples of the philosophical confusions that had resulted from the indiscretions of prose, and most \nimportantly of all, his striking new approach to the character of mathematical necessity and the propriety of scepticism in the philosophy of mathematics? \nRunning through all this was a growing awareness that Wittgenstein's attack on GOdel's interpretation of his second incompleteness theorem could not be dissociated from his proposed resolution/dissolution of the 'foundations crisis'. If anything, the critique of GOdel's theorem was merely a by-product of \nthe much larger investigation into what Wittgenstein regarded as the conceptual confusions inspiring the foundations dispute. Thus, what began as a short paper on Wittgenstein's attitude to Godel's theorem had soon lossomed into a full-scale monograph on Wittgenstein's extensive involvement in the philosophy of mathematics. For one thing had become all too apparent: Wittgenstein was assailed by the early reviewers of Remarks on the Foundations of Mathematics for the mistakes which purportedly riddle the book, yet invariably these 'errors' were only listed, never actually substantiated as such. Obviously the great appeal of such a polemic is that it is much easier to dismiss an argument on technical grounds than to refute it philosophically. But what were presented as corrections were, in fact, covert philosophical objections which, because of the prior assumption, were developed without any effort to clarify, let alone challenge, the philosophical background on which Wittgenstein had based his approach to the foundations dispute. Whether or not Wittgenstein's criticisms hit their mark is obviously an issue which we cannot hope to consider until we have first established the grounds for the points which he raised; and whether these grounds are warranted will depend on whether or not Wittgenstein's criticisms hit their mark. It was an too clear \nthat any satisfactory treatment of Wittgenstein's writings in the philosophy of mathematics would have to satisfy both of these demands. Ironically, there is no discussion of GOdel's theorem in what follows; that remains to be pursued in a subsequent work which will be devoted solely to the clarification of Wittgenstein's attack on the standard - meta-mathematical - conception of Godel's second theorem in light of his philosophical scrutiny of the framework which underpins Godel's interpretation of his proof. The present book might be seen as a prolegomenon to this subsequent exercise; its primary goal is to establish the outlines for a fresh approach to Wittgenstein's remarks on the philosophy of mathematics by concentrating on the material of the early 1930s. For unless we carefully retrace the steps which Wittgenstein took from his return to Cambridge and philosophy in 1929 (the time at which the above quotation from Culture and Value was written) the obstacles to understanding his mature writings on philosophy -particularly in the philosophy of mathematics - are formidable, if not insuperable. The great importance of Philosophical Remarks and Philosophical Grammar for our understanding of Wittgenstein's \nlater investigations in the philosophy of mathematics is that Wittgenstein discussed here in considerable detail the various technical themes in higher mathematics that are generally only alluded to in Remarks on the Foundations of Mathematics. It is thus by focusing on these works that we can best expose the fallacies underlying the currently prevailing interpretations that Wittgenstein was intent on some form of 'Anti-realist' attack on the foundations of mathematics, or that he was interested in a species of 'full-blooded conventionalist' or 'radical constructivist' critique. Freed from these critical incubuses, we shall then be in a position to grasp the full implications of Wittgenstein's antimetaphysical exertions in the philosophy of mathematics.\n","torrent":{"xt":"urn:btih:1a73da24b23edf24489fa4a20389a4664d350914","amp;dn":"Wittgenstein%2C+Turning+Point+in+the+Philosophy+of+Mathematics+%5BPD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a73da24b23edf24489fa4a20389a4664d350914","infoHashBuffer":{"type":"Buffer","data":[26,115,218,36,178,62,223,36,72,159,164,162,3,137,164,102,77,53,9,20]},"announce":[],"urlList":[]}}