{"title":"AAVV - The Rocky Horror Picture Show (1989), [Flac] ","uid":12162597,"size":338128085,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1ad119f7dc4afd4e42abc6eab0bad15aa45e6bf7&amp;dn=AAVV+-+The+Rocky+Horror+Picture+Show+%281989%29%2C+%5BFlac%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"Misterx84","files":19,"time":1437945861,"description":"The Rocky Horror Picture Show Soundtrack\n\n.: Recensione :.\n\nGrandioso musical irriverente, esilarante, provocatorio e provocante, The Rocky horror picture show ha fatto la storia del teatro e del cinema. Fisiologicamente la pellicola non pu? prescindere dalla colonna sonora che ne costituisce una buona met?. Le canzoni originali sono interpretate da vecchie volpi (vedi il grande rockettaro soft Meat Loaf recentemente riapparso sugli schermi in Fight Club) e da - almeno allora - novellini sconosciuti (Susan Sarandon in primis); ad ogni modo sono tutte dei piccoli gioielli sonori tra cui spiccano almeno: la mitica Time Warp, la strepitosa Sweet Transvestite, la cavalcata erotica di Touch-A, Touch-A e la lacrimevole I'm going home... Splendida colonna sonora per un'opera geniale che non conosce rughe. Eterno!\n\nFor the 1975 film version of The Rocky Horror Picture Show, American producer Lou Adler wisely mixed the best of the London and Los Angeles stage versions, shooting the movie in England with Tim Curry and several of the other original cast members, plus Meatloaf (years before Bat Out of Hell), and Americans Barry Bostwick and Susan Sarandon as the innocent couple Brad and Janet. Adler also brought back original London stage musicians in place of the slick studio musicians who had marred the L.A. cast album. The film version resequenced the songs and reassigned some of the vocals, with Brad's song &quot;Once in a While&quot; dropped. But it all worked out fine. The strings that were added to ballads like &quot;Science Fiction/Double Feature&quot; only improved them; the rockers rocked out; Bostwick and Sarandon proved to be the best Brad and Janet ever; the original cast members, especially Curry, reveled in the opportunity to immortalize their portrayals; and Rocky Horror's potential as a witty parody of cheap movies, rock &amp; roll, and sexual mores was fully realized. The film soundtrack album became the definitive version of the score, despite lacking the songs &quot;Planet Shmanet Janet&quot; and &quot;The Sword of Damocles.&quot; The Rocky Horror Picture Show was not successful in its initial theatrical run, but then a strange thing happened. In 1976, the Waverly Theater in New York's Greenwich Village began showing the film at midnight on Fridays and Saturdays. Soon, a cult of repeat viewers began turning up every week; they began to dress like the characters, call out their own comments at strategic moments, sing along, and add their own theatrical effects. The phenomenon spread across the U.S., with fans rivaling Trekkies and Deadheads for loyalty and eccentricity, and The Rocky Horror Picture Show took on a life Richard O'Brien never could have anticipated. \n\n.: Cover :.\n\n[img]http://i.imgur.com/1hEv30e.jpg[/img]\n\n.: Dati Album :.\n\nArtista: Vari\nPubblicazione: 1989\nDischi: 1\nTracce: 14 (+ 2 bonus)\nGenere: Colonna sonora, Opera rock\nEtichetta: Sanctuary Records\n\n========================================\n\n.: Dati tecnici del file :.\n\nFormato Audio : FLAC\nFormato/Informazioni : Free Lossless Audio Codec\nDurata : 3min 19s\nModalit? bitrate : Variabile\nBitrate : 864 Kbps\nCanali : 2 canali\nFrequenza campionamento : 44,1 KHz\nProfondit? bit : 20,5MiB (100%)\nDimensione della traccia : 13,0MiB (100%)\n\n\n.: TrackList :.\n\n1. Science Fiction/Double Feature\n2. Dammit Janet\n3. Over at the Frankenstein Place\n4. Time Warp\n5. Sweet Transvestite\n6. I Can Make You a Man\n7. Hot Patootie - Bless My Soul\n8. I Can Make You a Man (Reprise)\n9. Touch-a, Touch-a, Touch Me\n10. Eddie\n11. Floor Show:\na. &quot;Rose Tint My World&quot;\nb. &quot;Fanfare/Don't Dream It&quot;\nc. &quot;Wild and Untamed Thing\n12. I'm Going Home\n13. Super Heroes\n14. Science Fiction/Double Feature (Reprise)\n\nBonus Track:\n\n15. Time Warp (1989 Remix - extended version)\n16. Time Warp (Karaoke)","torrent":{"xt":"urn:btih:1ad119f7dc4afd4e42abc6eab0bad15aa45e6bf7","amp;dn":"AAVV+-+The+Rocky+Horror+Picture+Show+%281989%29%2C+%5BFlac%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ad119f7dc4afd4e42abc6eab0bad15aa45e6bf7","infoHashBuffer":{"type":"Buffer","data":[26,209,25,247,220,74,253,78,66,171,198,234,176,186,209,90,164,94,107,247]},"announce":[],"urlList":[]}}