{"title":"Joseph Dan - On Kabbalah &amp; Jewish Mysticism (3 books)","uid":9959498,"size":16229178,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1add891beef4e7c9d6df8f4535ce8f59d93e7bde&amp;dn=Joseph+Dan+-+On+Kabbalah+%26amp%3B+Jewish+Mysticism+%283+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"workerbee","files":-1,"time":1397500826,"description":"\nJOSEPH DAN (b. 1935) is an Israeli scholar and one of the world's leading authorities on Jewish mysticism.  He taught for over 40 years in the Department of Jewish Thought at the Hebrew University of Jerusalem.  He was awarded the Israel Prize for Jewish thought in 1997.\n\nIn the two anthologies collected here, Dan not only presents illuminating excerpts from the most important mystical texts, but also delves into the very meaning of mysticism itself.  In THE EARLY KABBALAH, he presents selections from the early Kabbalists -- the esoteric tradition that delves into the secrets delivered by God to Moses on Mount Sinai -- from the late 12th and early 13th centuries, before the publication of the Zohar.\n\nIn THE HEART AND THE FOUNTAIN, Dan takes readers through the historical development of Jewish mysticism, from late antiquity to the modern period, exploring the Kabbalah, the emergence of Hasidism, and much more.  He presents the great texts, from Hekhalot Rabbati, &quot;The Greater Book of Divine Palaces,&quot; set in the temple in Jerusalem; to the apocalyptic vision of Abraham Abulafia in the 13th century; to the Zohar, perhaps the best-known volume of all.\n\nIn his contribution to Oxford's &quot;Very Short Introduction&quot; series, Dan offers a concise review of the history and character of the various systems developed by the adherents of the Kabbalah.  He sheds light on the many misconceptions about what Kabbalah is and isn't -- including its connections to magic, astronomy, alchemy, and numerology -- and illuminates the relationship between Kaballah and Christianity on the one hand and New Age religion on the other.\n\n\nThe following books (and several unlisted scholarly articles) are in PDF format:\n\n* THE EARLY KABBALAH (Paulist Press, 1986).  Classics of Western Spirituality series.  Edited and Introduced by Joseph Dan; translated by Ronald C. Kiener; Preface by Moshe Idel.\n\n* THE HEART AND THE FOUNTAIN: An Anthology of Jewish Mystical Experiences [editor] (Oxford University Press, 2002).\n\n* KABBALAH: A Very Short Introduction (Oxford University Press, 2006).\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                     &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n","torrent":{"xt":"urn:btih:1add891beef4e7c9d6df8f4535ce8f59d93e7bde","amp;dn":"Joseph+Dan+-+On+Kabbalah+%26amp%3B+Jewish+Mysticism+%283+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1add891beef4e7c9d6df8f4535ce8f59d93e7bde","infoHashBuffer":{"type":"Buffer","data":[26,221,137,27,238,244,231,201,214,223,143,69,53,206,143,89,217,62,123,222]},"announce":[],"urlList":[]}}