{"title":"Fiasco","uid":7662984,"size":19379982,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:1ae06576fc7ff52c96422c16b15cabced17a4d7c&amp;dn=Fiasco&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"666cat","files":3,"time":1348358544,"description":" &lt;a href=&quot;http://rpg.drivethrustuff.com/product_info.php?products_id=78548&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://rpg.drivethrustuff.com/product_info.php?products_id=78548&lt;/a&gt;\n\n&quot;Fiasco is an award-winning GM-less game for 3-5 players, designed to be played in a few hours with six-sided dice and no preparation. During a game you will engineer and play out stupid, disastrous situations, usually at the intersection of greed, fear, and lust. It's like making your own Coen brothers movie, in about the same amount of time it'd take to watch one.\n\nTHINGS CAN GO WRONG, FAST...\n\n...Maybe some dude from youth group talked you into boosting a case of motor oil, but now your cousin is dead in a swamp and you killed him. Maybe you and your girlfriend figured you could scare your wife into a divorce, but things went pear-shaped and now a gang of cranked-up Mexicans with latex gloves and a pit bull are looking for you.\n\nIt seemed like such a good idea at the time.\n\nFiasco is inspired by cinematic tales of small time capers gone disastrously wrong - inspired by films like Blood Simple, Fargo, The Way of the Gun, Burn After Reading, and A Simple Plan. You'll play ordinary people with powerful ambition and poor impulse control. There will be big dreams and flawed execution. It won't go well for them, to put it mildly, and in the end it will probably all go south in a glorious heap of jealousy, murder, and recrimination. Lives and reputations will be lost, painful wisdom will be gained, and if you are really lucky, your guy just might end up back where he started.\n\nInterested? Check out this substantial preview PDF for a look at the art, rules, and playsets for the game.\n\nThis purchase includes the full-color PDF as well as the EPUB and MOBI versions of the book.&quot;","torrent":{"xt":"urn:btih:1ae06576fc7ff52c96422c16b15cabced17a4d7c","amp;dn":"Fiasco","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ae06576fc7ff52c96422c16b15cabced17a4d7c","infoHashBuffer":{"type":"Buffer","data":[26,224,101,118,252,127,245,44,150,66,44,22,177,92,171,206,209,122,77,124]},"announce":[],"urlList":[]}}