{"title":"Catching the Big Fish - David Lynch","uid":9289937,"size":176411,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1ae0053b2ba24e1f4734f619e6e80f20f0732bdb&amp;dn=Catching+the+Big+Fish+-+David+Lynch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1386071664,"description":"**In this &quot;unexpected delight,&quot;* filmmaker David Lynch describes his personal methods of capturing and working with ideas, and the immense creative benefits he has experienced from the practice of meditation.** David Lynch's *Catching the Big Fish* provides a rare window into the internationally acclaimed filmmaker's methods as an artist, his personal working style, and the immense creative benefits he has experienced from the practice of meditation. *Catching the Big Fish* comes as a revelation to the legion of fans who have longed to better understand Lynch's personal vision. And it is equally compelling to those who wonder how they can nurture their own creativity. **Catching Ideas** * Ideas are like fish. If you want to catch little fish, you can stay in the shallow water. But if you want to catch the big fish, you've got to go deeper. Down deep, the fish are more powerful and more pure. They're huge and abstract. And they're very beautiful. I look for a certain kind of fish that is important to me, one that can translate to cinema. But there are all kinds of fish swimming down there. There are fish for business, fish for sports. There are fish for everything. Everything, anything that is a thing, comes up from the deepest level. Modern physics calls that level the Unified Field. The more your consciousness-your awareness-is expanded, the deeper you go toward this source, and the bigger the fish you can catch.* -from *Catching the Big Fish*","torrent":{"xt":"urn:btih:1ae0053b2ba24e1f4734f619e6e80f20f0732bdb","amp;dn":"Catching+the+Big+Fish+-+David+Lynch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ae0053b2ba24e1f4734f619e6e80f20f0732bdb","infoHashBuffer":{"type":"Buffer","data":[26,224,5,59,43,162,78,31,71,52,246,25,230,232,15,32,240,115,43,219]},"announce":[],"urlList":[]}}