{"title":"Frank Sinatra - In the Wee Small Hours 320cbr (Big Papi) 1991 Ja","uid":9460021,"size":121779716,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1ae4f9d32044554a89f8344fca7e0fbf2982b75f&amp;dn=Frank+Sinatra+-+In+the+Wee+Small+Hours+320cbr+%28Big+Papi%29+1991+Ja&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1389333147,"description":"Source; 1991 CD\n\nThis is the 1991 CD release. Some say the 1998 remastered released has audio flaws. - Big Papi\n\n\n\nBy Candace\nThis is Frank in his &quot;I lost Ava Gardner&quot; period. Never before was he su vulnerable, lonesome or as brilliant. No one has ever phrased a lyric like his man. No one. You feel his pain, his pathos, his despair and his loneliness on this album. It is a completely joyous experience to listen to this man sing particularly on this moving collection of wistful ballads.\nThe title track is an old standard, sung hundreds of times by other singers. But no one can sing it like Sinatra, it's as if you are listening and understanding the lyrics for the first time.\n\nOthers had greater range or greater voices. None had the inimitable gift that Frank Sinatra possessed and that was allowing you to understand a lyric and feel it deep down in your soul. There is only one Sinatra and this ablum epitomizes his vocal range and showcases his beautiful genius with a ballad.\n\nListen to &quot;Mood Indigo&quot; and &quot;Deep in a Dream...&quot; they will send goosebumps through you. For anyone who appreciates Sinatra or just great music, this is a must have.","torrent":{"xt":"urn:btih:1ae4f9d32044554a89f8344fca7e0fbf2982b75f","amp;dn":"Frank+Sinatra+-+In+the+Wee+Small+Hours+320cbr+%28Big+Papi%29+1991+Ja","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ae4f9d32044554a89f8344fca7e0fbf2982b75f","infoHashBuffer":{"type":"Buffer","data":[26,228,249,211,32,68,85,74,137,248,52,79,202,126,15,191,41,130,183,95]},"announce":[],"urlList":[]}}