{"title":"Paranoia XP Collection","uid":4125819,"size":60814848,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1b08e7b70ca608f9f83e183b80f1177d004c2732&amp;dn=Paranoia+XP+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"Y.O.B.","files":9,"time":1207779179,"description":"My little Paranoia XP collection. Don&amp;#039;t know what Paranoia XP is? Wiki says it all...\n\n\nParanoia is a humorous role-playing game set in a dystopian future similar to 1984, Brazil, Brave New World, Alphaville, the &quot;downunder&quot; civilization of A Boy and His Dog, and especially Logan&amp;#039;s Run; however, the tone of the game is rife with black humor, frequently tongue-in-cheek rather than dark and heavy. The game is set in Alpha Complex, an immense and futuristic domed or underground city (GM&amp;#039;s decision) controlled by The Computer, a schizophrenic civil service AI construct. The Computer has made happiness mandatory. Failure to be happy is punishable by summary execution.\n\nThe Computer fears a number of threats to its &amp;#039;perfect&amp;#039; society, such as The Outdoors, mutants, and secret societies (especially communists). However, all of the people who inhabit Alpha Complex are mutants and members of a variety of secret societies - including communists. To deal with these threats, The Computer employs Troubleshooters, whose job is to solve problems: they go out, find trouble and shoot it. Frequently the solution involves identifying and terminating mutants and secret society members. Player characters (PCs) are usually Troubleshooters, although later game supplements offered other roles for player characters. The PCs are also almost invariably mutants and members of secret societies, and so are traitors of the very sort feared by The Computer. The PCs are usually given incomprehensible or self-contradicting mission goals, dangerous, faulty or experimental futuristic gizmos as equipment, as well as contradictory missions from their secret societies. Paranoia missions are typically fatal for the troubleshooters.\n\nThe Troubleshooter&amp;#039;s credo is, &quot;Stay Alert! Trust No One! Keep Your Laser Handy!&quot;\nThe Computer&amp;#039;s credo is, &quot;Trust The Computer. The Computer is Your Friend.&quot;\n\n\nEnjoy!\n","torrent":{"xt":"urn:btih:1b08e7b70ca608f9f83e183b80f1177d004c2732","amp;dn":"Paranoia+XP+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b08e7b70ca608f9f83e183b80f1177d004c2732","infoHashBuffer":{"type":"Buffer","data":[27,8,231,183,12,166,8,249,248,62,24,59,128,241,23,125,0,76,39,50]},"announce":[],"urlList":[]}}