{"title":"The Shock of the New","uid":3673487,"size":2927680466,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1b0fc66f494d431721d9f29d4b12b20fedf064f4&amp;dn=The+Shock+of+the+New&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":3,"uploader":"rumsfeld69","files":10,"time":1177584653,"description":"THE SHOCK OF THE NEW\n\n\nNTSC DVD Rip\n8X 60 minutes\nEnglish only, no subtitles\n\n720x480 Xvid, 29.97 fps, ~160 kbps vbr mp3\n8X 350MB\n\n\nOriginally broadcast in 1980, this milestone BBC series is an eight-part exploration of modern art. It is written and presented by Robert Hughes, art critic and former senior writer for Time. The series looks at different themes rather than presenting the art chronologically.\n\nHughes draws on a wealth of documentary materials from the archives of the BBC, including rare footage and interviews with noted artists. The range of major figures includes Henri Matisse, Pablo Picasso, le Corbusier, Max Ernst, Francis Bacon and Jackson Pollock.\n\nIn the words of Hughes: &quot;Unfortunately, epochs of art don't start or end neatly on cue. Ours is finishing its run now, leaving behind it some of the most challenging, intelligent and beautiful works of art ever made by man, along with a mass of superfluity and rubbish. We're at the end of the Modern era. Art no longer acts on us in the same way that it did on our grandparents. I want to see why.&quot;\n\nThe New York Times says: &quot;Hughes has proven himself to be a wonderful teacher--sharp, individualistic and clear. Agree or disagree, you will not be bored.&quot;\n\n\nThe Mechanical Paradise - Episode 1\nTraces how developments in technology inspired art between 1880 and the end of WWI, leading to movements like cubism and futurism.\n\n\nThe Powers that Be - Episode 2\nHughes explores the interplay between art and politics, seeing how artists were affected by the development of mechanized warfare and ideologies like fascism and communism.\n\n\nThe Landscape of Pleasure - Episode 3\nThe French artists who attempted to reconcile man with nature, from the determination of the impressionists to paint outside to Matisse's vibrant use of color.\n\n\nTrouble in Utopia - Episode 4\nHow modern architects in the wake of the Bauhaus aspired to change societies with their designs, a move represented both by Le Corbusier and the plans for the city Brasilia.\n\n\nThe Threshold of Liberty - Episode 5\nThe art movement that gripped its exponents with the fervor of a religion: surrealism. Artists like Di Chirico, Ernst, Miro and Dali brought the subconscious to the fore and attempted to tap into innocent and irrationality.\n\n\nThe View From the Edge - Episode 6\nExpressionism sprung out of the harsh, secular atmosphere of the 20th Century and evolved, through the strong colors and often sombre moods of artists like Munch, to the non-figurative work of Pollock and De Kooning.\n\n\nCulture as Nature - Episode 7\nArtists began to take man-made images as their inspiration, leading to the pop art of Andy Warhol and Roy Lichtenstein as well as Stuart Davis' collages inspired by jazz.\n\n\nThe Future That Was - Episode 8\nThe final episode in the series explores the decline of modernism and how various artists have reacted to the consequent commercialization of their art.\n","torrent":{"xt":"urn:btih:1b0fc66f494d431721d9f29d4b12b20fedf064f4","amp;dn":"The+Shock+of+the+New","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b0fc66f494d431721d9f29d4b12b20fedf064f4","infoHashBuffer":{"type":"Buffer","data":[27,15,198,111,73,77,67,23,33,217,242,157,75,18,178,15,237,240,100,244]},"announce":[],"urlList":[]}}