{"title":"Mission Hill - Season 1 + Extras [DVD-Rip] (Complete)","uid":4711380,"size":4285302048,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1ba04c01ed4a9ea783cc281c6b8a0ac60f25c160&amp;dn=Mission+Hill+-+Season+1+%2B+Extras+%5BDVD-Rip%5D+%28Complete%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"BloodLogic","files":78,"time":1234034586,"description":"Mission Hill - Season 1 [DVD-Rip] (Complete)\n(1999-2002) (Adultswim * AS * Adult Swim * Warner Bros./The WB * TBS)\n[ADULT-COMEDY]\n\nSeasons 1 + Extras (Complete)\n(with english, espanol, and francais subtitles in optional SRT format)\n(with additional commentary/audio tracks on a second channel)\nSeasons 1 + Extras DVDRip [DVD-RIP] by BloodLogic\n\nIMAGE: http://img175.imageshack.us/img175/1535/missionhillbm1.jpg\n\nDescription: Meet Andy French, a 24-year-old captivatingly lazy guy. Together with his nerdy teenage brother Kevin, he lives in a big city loft. However, these two new roommates couldn't be more polar opposite: Andy can never seem to settle on a particular job or girlfriend, while Kevin never gets anything lower than an A in school nor does he get a girlfriend. &quot;The show takes place in the fictional city of Cosmopolis's equally fictional neighborhood of Mission Hill&quot;. It's a diverse place with interesting people living in it. Fellow roommates include Posey Tyler, the capricious new-age/hippy girl who hides a secret dark side. And there's Andy's mellow best friend Jim Kuback, who's well-connected to the hip downtown scene and has a luxurious job. Together, they get drunk, smoke mysterious substances, and break social standards in an offending and generally unforgivable way.  Across the hall are Natalie, Carlos and their baby. Carlos is a painter of the Dalian persuasian, while Natalie is a professor who rants about &quot;bourgeoise capitalism.&quot; Next door are Gus and Wally, an older gay couple, whose kiss was the first gay kiss ever aired on American television.\n\nWIKI: http://en.wikipedia.org/wiki/Mission_Hill\nIMDB: http://www.imdb.com/title/tt0197148/\n\nCreators: Bill Oakley, Josh Weinstein.\nDirectors: Lauren MacMullan, Ilya Skorupsky, Scott Alberts, Tricia Garcia, Gary McCarver, Christian Roman, Cynthia Wells.\nWriters: Bill Oakley, Josh Weinstein, Aaron Ehasz, Andrew Kreisberg, Ben Kull, Rachel Pulido, Rob Schwartz, Rich Siegel, Richard Siegel, Robin Stein, J. David Stem, David N. Weiss.\nStarring: Nick Jameson, Wallace Langham, Scott Menville, Brian Posehn, Vicki Lewis, Tom Kenny, Herbert Siguenza, Tress MacNeille, Bill Oakley, Josh Weinstein, Lisa Arch, Byrne Offutt, Dave Thomas, Jane Wiedlin, David Clennon.\n\nCommentary/Secondary Audio Track Available: S1E01, S1E03, and S1E07. Other episodes had no secondary audio tracks. (To play with secondary audio track, play in VLC player, right click the screen, and then select Audio Track and &quot;Track 2&quot;. Reverse to &quot;Track 1&quot; to switch back.)\n\nVLC Player Compatible (verson # 0.8.6f): {Tested and Confirmed}\n\nSeason 1...\n\nS1E01 - Pilot (or The Douchebag Aspect)\nS1E02 - Kevin's Problem (or Porno for Pyro)\nS1E03 - Andy and Kevin Make a Friend (or One Bang for Two Brothers)\nS1E04 - Kevin vs. the SAT (or Nocturnal Admissions)\nS1E05 - Andy Gets a Promotion (or How to Get Head in Business Without Really Trying)\nS1E06 - Unemployment 1 (or Brother's Big Boner)\nS1E07 - Unemployment 2 (or Theory of the Leisure Ass)\nS1E08 - Andy Joins the PTA (or Great Sexpectations)\nS1E09 - Andy vs. The Real World (or The Big-Ass Viacom Lawsuit)\nS1E10 - Kevin Finds Love (or Hot for Weirdie)\nS1E11 - Stories of Hope and Forgiveness (or Day of the Jackass)\nS1E12 - Happy Birthday, Kevin (or Happy Birthday, Douchebag)\nS1E13 - Planet 9 from Mission Hill (or I Married a Gay Man from Outer Space)\n\nExtras...\n\nAnimatic Episodes - S1E15 - Freaky Weekend in the Crappy Crudwagon\nAnimatic Episodes - S1E16 - Crap Gets In Your Eyes (Act 1)\nAnimatic Episodes - S1E16 - Crap Gets In Your Eyes (Act 2)\nAnimatic Episodes - S1E16 - Crap Gets In Your Eyes (Act 3, Part 1)\nAnimatic Episodes - S1E16 - Crap Gets In Your Eyes (Act 3, Part 2)\nExtras - Andy the Cartoonist\nExtras - From Concept to Animation\nExtras - Graffiti &amp; Billboards, The\nExtras - Health Class Posters at Pomper High\nExtras - Hot Pants\nExtras - Mouth Test\nExtras - Neighbors, Friends &amp; Locals\nExtras - Pencil Tests VS Actual Animation\nExtras - Production Credits\nExtras - Radiant Color\nExtras - Still Gallery of Voice Over Talent\nPromos - DVD Promo\nPromos - WB Promo\nMission Hill Episode Guide - Extended\nMission Hill Scripts - S1E14 - Supertool, or Meditations on a Career in Advertising.pdf\nMission Hill Scripts - S1E15 - Freaky Weekend in the Crappy Crudwagon, or To Grandmother's House We Go.pdf\nMission Hill Scripts - S1E16 - Crap Gets In Your Eyes, or Pretty in Pink.pdf\nMission Hill Scripts - S1E17 - Premature Matriculation, or Death of a Yale Man.pdf\nMission Hill Scripts - S1E18 - I Was a Teenage Porn Star, or Bye Bye Nerdie.pdf\n\nSubtitles...\n\n(To play the subtitle files, drag and drop them into VLC Player when playing the episode. These are optional subtitles, meaning they do not appear unless you select to play them.)\n\nS1E01 - Pilot (or The Douchebag Aspect) (English).srt\nS1E01 - Pilot (or The Douchebag Aspect) (Espanol).srt\nS1E01 - Pilot (or The Douchebag Aspect) (Francais).srt\nS1E02 - Kevin's Problem (or Porno for Pyro) (English).srt\nS1E02 - Kevin's Problem (or Porno for Pyro) (Espanol).srt\nS1E02 - Kevin's Problem (or Porno for Pyro) (Francais).srt\nS1E03 - Andy and Kevin Make a Friend (or One Bang for Two Brothers) (English).srt\nS1E03 - Andy and Kevin Make a Friend (or One Bang for Two Brothers) (Espanol).srt\nS1E03 - Andy and Kevin Make a Friend (or One Bang for Two Brothers) (Francais).srt\nS1E04 - Kevin vs. the SAT (or Nocturnal Admissions) (English).srt\nS1E04 - Kevin vs. the SAT (or Nocturnal Admissions) (Espanol).srt\nS1E04 - Kevin vs. the SAT (or Nocturnal Admissions) (Francais).srt\nS1E05 - Andy Gets a Promotion (or How to Get Head in Business Without Really Trying) (English).srt\nS1E05 - Andy Gets a Promotion (or How to Get Head in Business Without Really Trying) (Espanol).srt\nS1E05 - Andy Gets a Promotion (or How to Get Head in Business Without Really Trying) (Francais).srt\nS1E06 - Unemployment 1 (or Brother's Big Boner) (English).srt\nS1E06 - Unemployment 1 (or Brother's Big Boner) (Espanol).srt\nS1E06 - Unemployment 1 (or Brother's Big Boner) (Francais).srt\nS1E07 - Unemployment 2 (or Theory of the Leisure Ass) (English).srt\nS1E07 - Unemployment 2 (or Theory of the Leisure Ass) (Espanol).srt\nS1E07 - Unemployment 2 (or Theory of the Leisure Ass) (Francais).srt\nS1E08 - Andy Joins the PTA (or Great Sexpectations) (English).srt\nS1E08 - Andy Joins the PTA (or Great Sexpectations) (Espanol).srt\nS1E08 - Andy Joins the PTA (or Great Sexpectations) (Francais).srt\nS1E09 - Andy vs. The Real World (or The Big-Ass Viacom Lawsuit) (English).srt\nS1E09 - Andy vs. The Real World (or The Big-Ass Viacom Lawsuit) (Espanol).srt\nS1E09 - Andy vs. The Real World (or The Big-Ass Viacom Lawsuit) (Francais).srt\nS1E10 - Kevin Finds Love (or Hot for Weirdie) (English).srt\nS1E10 - Kevin Finds Love (or Hot for Weirdie) (Espanol).srt\nS1E10 - Kevin Finds Love (or Hot for Weirdie) (Francais).srt\nS1E11 - Stories of Hope and Forgiveness (or Day of the Jackass) (English).srt\nS1E11 - Stories of Hope and Forgiveness (or Day of the Jackass) (Espanol).srt\nS1E11 - Stories of Hope and Forgiveness (or Day of the Jackass) (Francais).srt\nS1E12 - Happy Birthday, Kevin (or Happy Birthday, Douchebag) (English).srt\nS1E12 - Happy Birthday, Kevin (or Happy Birthday, Douchebag) (Espanol).srt\nS1E12 - Happy Birthday, Kevin (or Happy Birthday, Douchebag) (Francais).srt\nS1E13 - Planet 9 from Mission Hill (or I Married a Gay Man from Outer Space) (English).srt\nS1E13 - Planet 9 from Mission Hill (or I Married a Gay Man from Outer Space) (Espanol).srt\nS1E13 - Planet 9 from Mission Hill (or I Married a Gay Man from Outer Space) (Francais).srt\n\n[Episode Guide Included.]\n\nThis torrent is a part of Operation: Massive Information Leak, Wave Three.\nBloodLogic","torrent":{"xt":"urn:btih:1ba04c01ed4a9ea783cc281c6b8a0ac60f25c160","amp;dn":"Mission+Hill+-+Season+1+%2B+Extras+%5BDVD-Rip%5D+%28Complete%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ba04c01ed4a9ea783cc281c6b8a0ac60f25c160","infoHashBuffer":{"type":"Buffer","data":[27,160,76,1,237,74,158,167,131,204,40,28,107,138,10,198,15,37,193,96]},"announce":[],"urlList":[]}}