{"title":"Ian Kershaw, &quot;Hitler&quot;","uid":10597561,"size":18112243,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1bd4fcd57a079f58ae0170a43928a031823b48ee&amp;dn=Ian+Kershaw%2C+%26quot%3BHitler%26quot%3B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"mdusanjay","files":-1,"time":1405875540,"description":" Ian Kershaw, &quot;Hitler&quot;\n\nEnglish | 2010 | ISBN: 0141035889 | 1072 pages | EPUB\n\nNow at last in a single, abridged volume - the definitive life. When the two volumes of Ian Kershaw's biography of Hitler, [Hitler 1889-1936: Hubris and Hitler 1936-1945: Nemesis were published, they were immediately greeted around the world as the essential works on perhaps the most malign figure ever to hold power in modern Europe. In the face of considerable demand for such an edition, Kershaw has now created a single volume version. The result is a frightening, fascinating narrative of how a bitter provincial failure from an obscure corner of Austria rose to unparalleled power; how the half-baked, contemptible ideas of a vagrant former art student coalesced into an ideology that for twelve horrific years shaped the fate of millions; and how both in his determination to impose his will militarily and to fend off his many enemies he unleashed a genocidal Armageddon. No one individual can stand in as the scapegoat for the vast social, technological, economic and military forces that shape our societies, but if ever there was one man whose ideas and personality shaped and cowed those forces, as well as embodying them, it was Hitler. This is his story and Kershaw tells it with unique authority, and with moral anger. ","torrent":{"xt":"urn:btih:1bd4fcd57a079f58ae0170a43928a031823b48ee","amp;dn":"Ian+Kershaw%2C+%26quot%3BHitler%26quot%3B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1bd4fcd57a079f58ae0170a43928a031823b48ee","infoHashBuffer":{"type":"Buffer","data":[27,212,252,213,122,7,159,88,174,1,112,164,57,40,160,49,130,59,72,238]},"announce":[],"urlList":[]}}