{"title":"Gray's Anatomy: The Anatomical Basis of Clinical Practice, 41th","uid":13044232,"size":236497689,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1c34faa92eb6f5d7cb23cd1b00e160b5dbd03e0e&amp;dn=Gray%27s+Anatomy%3A+The+Anatomical+Basis+of+Clinical+Practice%2C+41th+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"NoctDeath","files":2,"time":1450558342,"description":"Title: Gray's Anatomy: The Anatomical Basis of Clinical Practice \r\nSeries: Gray's Anatomy \r\nAuthor: Susan Standring \r\nFormat: PDF \r\nHardcover: 1584 pages \r\nPublisher: Elsevier; 41 edition (October 9, 2015) \r\nLanguage: English \r\nISBN: 9780702052309 \r\n\r\n\r\nIn 1858, Drs. Henry Gray and Henry Vandyke Carter created a book for their surgical colleagues that established an enduring standard among anatomical texts. After more than 150 years of continuous publication, Gray’s Anatomy remains the definitive, comprehensive reference on the subject, offering ready access to the information you need to ensure safe, effective practice.\r\n\r\nThis 41st edition has been meticulously revised and updated throughout, reflecting the very latest understanding of clinical anatomy from field leaders around the world. The book’s traditional lavish art programme and clear text have been further honed and enhanced, while major advances in imaging techniques and the new insights they bring are fully captured in new state-of-the-art X-ray, CT, MR, and ultrasonic images.\r\n\r\nThe completely reconfigured accompanying eBook version is richly enhanced with additional content and media, covering all the body regions, cell biology and embryogenesis. This unlocks a whole new level of related information, interactivity and understanding, in keeping with the spirit of innovation that has characterized Gray’s Anatomy since its inception.\r\n\r\n- Presents the most detailed and dependable coverage of anatomy available anywhere.\r\n- Regional organization collects all relevant material on each body area together in one place, making access to core information easier for clinical readers.\r\n- Anatomical information is matched with key clinical information where relevant.\r\nNumerous clinical discussions emphasize considerations that may affect medical care.\r\n- Each chapter has been edited by experts in their field, ensuring access to the very latest evidence-based information on that topic.\r\n- More than 1,000 completely new photographs, including an extensive electronic collection of the latest X-ray, CT, MR, and histological images.\r\n- The downloadable Expert Consult eBook version included with your purchase allows you to search all of the text, figures, references and videos from the book on a variety of devices.\r\n- Carefully selected electronic enhancements include additional text, tables, illustrations, labelled imaging and videos - as well as 24 specially invited ‘Commentaries’ on new and emerging topics related to anatomy","torrent":{"xt":"urn:btih:1c34faa92eb6f5d7cb23cd1b00e160b5dbd03e0e","amp;dn":"Gray%27s+Anatomy%3A+The+Anatomical+Basis+of+Clinical+Practice%2C+41th+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c34faa92eb6f5d7cb23cd1b00e160b5dbd03e0e","infoHashBuffer":{"type":"Buffer","data":[28,52,250,169,46,182,245,215,203,35,205,27,0,225,96,181,219,208,62,14]},"announce":[],"urlList":[]}}