{"title":"Brightest Day 00-24 (2010-2011, Dgtl-HD, Monafekk-Empire)","uid":9533295,"size":904746483,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:1c8baa42f05dec634eeaa894c801e68be8e02791&amp;dn=Brightest+Day+00-24+%282010-2011%2C+Dgtl-HD%2C+Monafekk-Empire%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":4,"uploader":"VikTSlick","files":-1,"time":1390878861,"description":"For more information about this banner relaunch event, please check out the wiki links provided:  &lt;a href=&quot; http://en.wikipedia.org/wiki/Brightest_Day&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://en.wikipedia.org/wiki/Brightest_Day&lt;/a&gt;    &amp;   &lt;a href=&quot; http://dc.wikia.com/wiki/Brightest_Day&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://dc.wikia.com/wiki/Brightest_Day&lt;/a&gt;\n\nAfter the events of &quot;Blackest Night, this banner relaunch event - titled, naturally, &quot;Brightest Day&quot; - dealt with the aftermath as well as exploring the rebirths of several notable resurrected characters, including such DC luminaries as the Martian Manhunter and Aquaman. The series was less successful than both Blackest Night and Sinestro Corps War, both critically and commercially - perhaps due to the sprawling nature of series that carried the banner (over 120 in total!) and also maybe due to crossover fatigue. However, the main series, presented here, was generally well-received and remains an interesting read especially because of the existential crises of several characters - especially notable Firelord and the Spectre.\n\nThis is every issue of the main series, 00-24, in Digital-HD thanks to Monafekk-Empire. Unlike my previous torrents for Blackest Night and Sinestro Corps War, I have chosen NOT to make a &quot;complete edition&quot; torrent for several reasons. One, to quote IGN's reading guide - &quot;Brightest Day isn't structured like most other events. There isn't a singular mini-series or storyline readers need to follow. However, Brightest Day is more than just a simple branding. Every book that carries the banner has a specific story to tell within the framework of Brightest Day.&quot;\n\nSo that's one reason. Two, there are no digital copies I could find of most of the tie-ins, and tracking down every title is probably not worth it since they are so generically tied to the series (like Birds of Prey, for example). Three, there is an already excellent torrent that collects nearly the whole set of tie-ins here:    &lt;a href=&quot; http://thepiratebay.se/torrent/6946003/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/torrent/6946003/&lt;/a&gt;\n\nFifth and finally, there is no official reading order provided by DC, which tells me it is not intended to be read in a particular order anyway. However if you absolutely must do so, use the torrent I provided for the tie-ins and this reading order, and you should be all set:   &lt;a href=&quot; http://www.readingorders.com/GreenLantern/BrightestDay&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.readingorders.com/GreenLantern/BrightestDay&lt;/a&gt;\n\nThanks for reading, please seed and enjoy, peace! :-)","torrent":{"xt":"urn:btih:1c8baa42f05dec634eeaa894c801e68be8e02791","amp;dn":"Brightest+Day+00-24+%282010-2011%2C+Dgtl-HD%2C+Monafekk-Empire%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c8baa42f05dec634eeaa894c801e68be8e02791","infoHashBuffer":{"type":"Buffer","data":[28,139,170,66,240,93,236,99,78,234,168,148,200,1,230,139,232,224,39,145]},"announce":[],"urlList":[]}}