{"title":"David Lanz - Cristofori's Dream 1988 New Age Instrumental","uid":9436589,"size":111552675,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1ca52d0a619980d6970b1fa6b1dc47868fa6b115&amp;dn=David+Lanz+-+Cristofori%27s+Dream+1988+New+Age+Instrumental&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1388918169,"description":"David Lanz - Cristofori's Dream 320cbr (Big Papi) 1988 New Age Instrumental\n\n\nSource: 1988 CD\n\nThis appears to be the original 7 track release as opposed to the 8 track re-release. - Big Papi\n\n\n\nBy Kathy Parsons VINE VOICE\n\nIn the late 1980's, when new age music was becoming more popular, David Lanz started doing more piano work again, rather than synth. His 1988 album, &quot;Cristofori's Dream&quot; is a true classic. Lanz utilized a combination of piano, synthesizers, and other instruments, but the piano really dominates. In this album, Lanz fulfilled a dream of being able to play one of his favorite songs from the `60's, &quot;A Whiter Shade of Pale,&quot; with the original keyboard player from Procol Harum, Matthew Fisher. The title song from this album is David's favorite of his compositions, and remains one of his most popular pieces to date. &quot;Cristofori's Dream&quot; is about the inventor of the piano, Bartolomeo Cristofori, who was a harpsichord builder. As the story David tells goes, Cristofori was working very late in his shop one night, and fell asleep at his workbench. He had a dream of seeing his new invention going through its development all the way to becoming a concert grand piano, and the song ends with the piano turning back into a child's toy or music box. This is one of my all-time favorite pieces of music, and I never tire of hearing or playing it. Other titles include &quot;Spiral Dance,&quot; &quot;Wings to Altair,&quot; and &quot;Summer's Child.&quot;","torrent":{"xt":"urn:btih:1ca52d0a619980d6970b1fa6b1dc47868fa6b115","amp;dn":"David+Lanz+-+Cristofori%27s+Dream+1988+New+Age+Instrumental","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ca52d0a619980d6970b1fa6b1dc47868fa6b115","infoHashBuffer":{"type":"Buffer","data":[28,165,45,10,97,153,128,214,151,11,31,166,177,220,71,134,143,166,177,21]},"announce":[],"urlList":[]}}