{"title":"Arthur Miller - Death of A Salesman and other works (21 books)","uid":11014070,"size":94189611,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1cd0748736e1f22a0951254f8f7fbd0a56857c95&amp;dn=Arthur+Miller+-+Death+of+A+Salesman+and+other+works+%2821+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":3,"uploader":"workerbee","files":-1,"time":1410432796,"description":"\nARTHUR MILLER (1915-2005) was an American playwright, essayist and prominent figure in twentieth-century American theatre.  His writing earned him a lifetime of honors, including the Pulitzer Prize, seven Tony Awards, two Drama Critics Circle Awards, an Obie, an Olivier, the John F. Kennedy Lifetime Achievement Award, the Prince of Asturias Award, and the Jerusalem Prize.\n\nFor nearly six decades, Miller created characters that wrestle with power conflicts, personal and social responsibility, the repercussions of past actions, and the twin poles of guilt and hope. In his writing and in his role in public life, Miller articulated his profound political and moral convictions.  THE CRUCIBLE (1953) is a fictionalization of the Salem witch-hunts of 1692, but it also deals in an allegorical manner with the House Un-American Activities Committee.  Dealing as it did with highly charged current events, the play received unfavorable reviews and Miller was cold-shouldered by many colleagues.\n\nMiller considered the common man &quot;as apt a subject for tragedy in its highest sense as kings were.&quot;  DEATH OF A SALESMAN (1949), Miller's most famous and most produced play, tells the story of Willy Loman, an aging salesman who makes his way &quot;on a smile and a shoeshine.&quot;  Miller lifts Willy's illusions and failures, his anguish and his family relationships, to the scale of a tragic hero.  In 1983, Miller directed the play at the People's Art Theatre in Beijing.\n\nIn addition to his most celebrated plays, this collection includes several volumes of essays and non-fiction, a novel, short stories, and Miller's autobiography.\n\n\nThe following books are in ePUB and PDF formats as noted:\n\n* AFTER THE FALL: A Play in Two Acts - Final Stage Version (Penguin, 1980) -- PDF\n\n* BROKEN GLASS: A Play in Two Acts (Penguin, 1994) -- ePUB\n\n* COLLECTED PLAYS, Volume 1: All My Sons / Death of a Salesman / The Crucible / A Memory of Two Mondays / A View from the Bridge (Viking, 1957) -- PDF\n\n* THE CREATION OF THE WORLD AND OTHER BUSINESS: A Play (Viking, 1973) -- PDF\n\n* THE CRUCIBLE: A Play in Four Acts (Penguin Classics, 1995).  Introduction by Christopher Bigsby -- ePUB + PDF\n\n* THE CRUCIBLE: Text and Criticism (Viking Critical Edition).  Edited by Gerald Weales -- PDF\n\n* DEATH OF A SALESMAN (Penguin Classics, 1998).  Introduction by Christopher Bigsby. -- ePUB + PDF\n\n* ECHOES DOWN THE CORRIDOR: Collected Essays, 1944-2000 (Viking, 2000).  Edited by Steven R. Centola -- PDF\n\n* FOCUS: A Novel (Reynal &amp; Hitchcock, 1945) -- PDF\n\n* HOMELY GIRL, A LIFE &amp; OTHER STORIES (Viking, 1995) -- PDF\n\n* I DON'T NEED YOU ANY MORE: Stories (Viking, 1967) -- PDF\n\n* THE MAN WHO HAD ALL THE LUCK: A Fable (Penguin Classics, 2004).  Introduction by Christopher Bigsby. -- ePUB\n\n* MR. PETERS' CONNECTIONS (Penguin, 1999) -- PDF\n\n* ON POLITICS AND THE ART OF ACTING (Viking, 2001) -- PDF\n\n* THE PORTABLE ARTHUR MILLER (Penguin Classics, 1995).  Edited by Christopher Bigsby.  Includes the full text of Death of a Salesman / The Crucible / After the Fall / The American Clock / The Lost Yankee / Broken Glass. -- PDF\n\n* THE PRICE: A Play (Penguin Classics, 2009) -- ePUB\n\n* RESURRECTION BLUES: A Prologue and Two Acts (Penguin, 2006) -- ePUB\n\n* THE RIDE DOWN MT. MORGAN (Penguin, 1992) -- PDF\n\n* SALESMAN IN BEIJING (Viking, 1984) -- PDF\n\n* TIMEBENDS: A Life (Bloomsbury, 2012) -- ePUB\n\n* A VIEW FROM THE BRIDGE: A Play in Two Acts with a New Introduction (Penguin Classics, 1977) -- ePUB\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                               &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n","torrent":{"xt":"urn:btih:1cd0748736e1f22a0951254f8f7fbd0a56857c95","amp;dn":"Arthur+Miller+-+Death+of+A+Salesman+and+other+works+%2821+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1cd0748736e1f22a0951254f8f7fbd0a56857c95","infoHashBuffer":{"type":"Buffer","data":[28,208,116,135,54,225,242,42,9,81,37,79,143,127,189,10,86,133,124,149]},"announce":[],"urlList":[]}}