{"title":"Discover Magazine USA - April 2015 (gnv64)","uid":11730146,"size":35798893,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1d584ef927b145e3a804d3496e8d13efb1b25954&amp;dn=Discover+Magazine+USA+-+April+2015+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"gnv65","files":3,"time":1425270273,"description":"Discover USA - April 2015 (The Einstein Issue)\nEnglish | 76 pages | PDF | 34.1 mb\n\nTHE EINSTEIN ISSUE\n28 Outsmarting Einstein\nAlbert Einstein's development of the general theory of relativity 100 years ago changed physics forever. Since then, scientists have gone to extraordinary lengths to challenge his ideas. BY BILL ANDREWS\n30 Putting Relativity to the Test\nMany of Einstein's contemporaries doubted relativicy when it debuted. but a long hiscory of experiments has seemingly dispelled thac doubt. BY ADAM HAORAZY\n34 Defying Gravity Just because reletivity has passed a century of tests doesn't mean physicists are complacent. Today, researchers are using the most complex technology yet to challenge the theory - again. BY GABRIEL POPKIN\n38 Beyond Einstein\nWhy is the scientific world so obsessed with pucting relativity on trial? Disproving Einstein would surely go down in the history books, but there's more at stake than just fame. BY STEVEN ADIS\n42 Between the Folds\nThe fixation on tescing relativity may only be matched by a fascination with the organ that enabled Einstein to develop his theory. Researchers\nhave examined every nook and cranny of Einstein's brain to determine what made him so special, but to what end?\n\nOTHER FEATURES\n46 WHAT ARCTIC FOSSILS REVEAL ABOUT OUR FUTURE\nCold Case\nAs Earth warms up, the Arctic faces troubling consequences. To try and predict how our planet's dimatic story will play out, Natalia Rybczynski and her peers are turning to fossils that hint at both the past and the future. sv KllNOALL PowÂ£LL\n54 WHY SLEEP IS A MATTER OF LIFE OR DEATH\nWake-Up Call\nEvidence abounds that sleep 1s essential to stay healthy. But recent research has found catching some Z's doesn't just give you a sound mind in a sound body - it can save your life. BY KENNETH MILLER\n\nCOLUMNS &amp; DEPARTMENTS\n6 EDITOR'S NOTE\nA Hero's Journey\nCelebrating some heroes behind the scenes, both in this issue and, as one reader points out, in life, too.\n18 BIG IDEA\nImpulse Control\nOften, medications are the go-to solution for health problems. But doctors could soon have another way to address these issues, one that literally\nstrikes a nerve.\n24 VITAL SIGNS STEROID SHOCKER\nOne Giant Leap\nLife was picture-perlect for one asthmatic woman with a great job in a n ew city. So why did she suddenly contemplate ending her life?\nBY DOUGLAS ADLER\n60 ORIGIN STORY\nOur First Winter\nThe Dmanisi excavation site holds many secrets in its earthy depths. But perhaps the most tantalizing could rewrite the story of when and how our early hominid ancestors found themselves out of Africa a1Jd enduring chillier climates. BYGEMMATARl,ACH\n64 MIND OVER MATTER\nDivided Loyalties\nWe pledge allegiance to many things: our family, our friends and perhaps our country or hometown. But how do we cope when our loyalties clash?\n68 OUT THERE\nNo Such 1hin as a Black Hole? ust w en wet oug t we wrappe our heads around black holes, new theories tell us to forget what we know. BY COREY S. POWELL\n74 20 THINGS YOU DIDN'T KNOW ABOUT Dust\nDust might d elight some critters,but humans once enlisted the help of &quot;Puffing Billy&quot; to !keep the dust bunnies at bay. And those particles aren't just\ndirty; they can be deadly. Plus, they're everywhere. Even in space! \n &lt;a href=&quot;\nhttp://s14.postimg.org/lnsp96a35/Discover_USA_April_2015.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s14.postimg.org/lnsp96a35/Discover_USA_April_2015.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:1d584ef927b145e3a804d3496e8d13efb1b25954","amp;dn":"Discover+Magazine+USA+-+April+2015+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d584ef927b145e3a804d3496e8d13efb1b25954","infoHashBuffer":{"type":"Buffer","data":[29,88,78,249,39,177,69,227,168,4,211,73,110,141,19,239,177,178,89,84]},"announce":[],"urlList":[]}}