{"title":"Encyclopedia of Holidays And Celebrations (2006) (Pdf) Gooner","uid":12022345,"size":31793666,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1d6225802c29c92ba29afeaf0566223c5fe5b2d2&amp;dn=Encyclopedia+of+Holidays+And+Celebrations+%282006%29+%28Pdf%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1434465061,"description":"Pages: 1852\nPublisher: Facts on File; 1 edition (August 2006)\nLanguage: English\nISBN-10: 0816062358\nISBN-13: 978-0816062355\n\n&quot;Encyclopedia of Holidays and Celebrations: A Country-by-Country Guide&quot; explores major holidays and festivals in 206 countries. The first two volumes are organized alphabetically by country. The third volume features overview articles that provide detailed information about major holidays celebrated around the world, as well as articles on major world religions. Country entries include: general information, including location, population, government, languages, religions, and national holidays; a brief introduction to the country's origins, geography, economy, current lifestyle and culture, and cuisine; subsections on national holidays, religious holidays, regional holidays, and rites of passage; subentries on holidays, including the date it is celebrated; who celebrates it; and a description of the origins, symbols, and rituals associated with the celebration/commemoration; and further reading. Entries on internationally observed holidays include: holidays in an international context; at-a-glance information on the origin, alternate names, dates of observance, and who observes the holiday; an introduction; a detailed description of the origins and history of the holiday; and how it is observed; and further reading. Entries on religious communities include: at-a-glance information about the size of the community and its place of origin; an introduction to the religion; the origins and history of the community; the way in which the community celebrates/commemorates the holiday; and further reading. Two hundred black-and-white photographs complement the text, along with numerous sidebars and callouts focusing on fun facts relating to specific holidays. Additional features include calendar systems around the world, regional maps, indexes by holidays and countries, and a comprehensive index","torrent":{"xt":"urn:btih:1d6225802c29c92ba29afeaf0566223c5fe5b2d2","amp;dn":"Encyclopedia+of+Holidays+And+Celebrations+%282006%29+%28Pdf%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d6225802c29c92ba29afeaf0566223c5fe5b2d2","infoHashBuffer":{"type":"Buffer","data":[29,98,37,128,44,41,201,43,162,154,254,175,5,102,34,60,95,229,178,210]},"announce":[],"urlList":[]}}