{"title":"Low - The Invisible Way (2013) [FLAC]","uid":8274601,"size":216346876,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1d68fbac2c59539f2ada9a00540b7e12100905e1&amp;dn=Low+-+The+Invisible+Way+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"politux","files":-1,"time":1363690759,"description":"  Low - The Invisible Way (2013) [FLAC]\n\n  Released: 2013\n  Genre: Pop/Rock\n  Style: Slowcore, Indie\n  Source: CD (log + cue)  \n  Codec: FLAC\n  Bit Rate: ~ 700 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz   \n\n  01 Plastic Cup\n  02 Amethyst\n  03 So Blue\n  04 Holy Ghost\n  05 Waiting\n  06 Clarence White\n  07 Four Score\n  08 Just Make It Stop\n  09 Mother\n  10 On My Own\n  11 To Our Knees\n\n  An institution of slowcore, one of indie rock's more bittersweet subsets, Low began making huge and haunted sounds out of the most minimal means in the early '90s. The Invisible Way finds the trio 20 years into its craft and returning to parts of its roots while at the same time branching into new sounds. The most noticeable shifts in the band's sound come with the production of Wilco's Jeff Tweedy, working with the band for the first time here. While much of Low's work clung to a formula of reverb and echo that their earliest records took to extremes, the 11 songs here are roomy but not obscured by cavernous sounds. Instead, tracks like &quot;Holy Ghost&quot; and &quot;Amethyst&quot; glow with an earthy sheen, finding their spaciousness more in subtle touches of acoustic instruments and perfectly placed accents of guitar than post-production techniques. The songwriting here harks back somewhat to the understated pastoral majesty of early Low records like Long Division and The Curtain Hits the Cast, with the band creating mysterious and lush beauty by slowing down and lingering over long, thoughtful chord changes and glimmering harmonies. Following more aggressive sidesteps in the band's discography like 2005's The Great Destroyer and 2007's bleak and cacophonous Drums and Guns, the return to basics is refreshing, and the even more naked production is a perfect complement to the songs. \n\n  Drummer/vocalist Mimi Parker sings lead on an unprecedented five songs on this album. Her layered harmonies, pristine but never brittle, make songs like &quot;So Blue&quot; and &quot;Four Score&quot; stand out, at once familiar to Low's melancholic grandeur but with a new confidence not heard before. Parker's sure-footed vocals anchor the Yo La Tengo-channeling upbeat push of standout track &quot;Just Make It Stop,&quot; delivering desperate lines over hopeful melodic chord shifts. Guitarist/vocalist Alan Sparhawk continues his part of the band's evolution as well, offering quizzical and sometimes meandering lyrics for tracks like &quot;Plastic Cup&quot; and &quot;Clarence White,&quot; both of which are epic in contrast to the single-line couplets that defined earlier Low albums. With its brilliant production values and carefully curated arrangements, The Invisible Way shows a band decades into making music but still in a very real state of evolution. While not quite a career-definitive statement, much like the aforementioned Yo La Tengo, Wilco, Belle &amp; Sebastian, or any of the early-'90s bands still exploring their sound, Low give us a definitive chapter for where they are presently, and present it with more clarity and joy than we've heard from them in some time.","torrent":{"xt":"urn:btih:1d68fbac2c59539f2ada9a00540b7e12100905e1","amp;dn":"Low+-+The+Invisible+Way+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d68fbac2c59539f2ada9a00540b7e12100905e1","infoHashBuffer":{"type":"Buffer","data":[29,104,251,172,44,89,83,159,42,218,154,0,84,11,126,18,16,9,5,225]},"announce":[],"urlList":[]}}