{"title":"DMT - The spirit molecule, Rick Strassman","uid":8940766,"size":2459477,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1dbcf96086e938874056911c5c9b4616d893f714&amp;dn=DMT+-+The+spirit+molecule%2C+Rick+Strassman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"InformationShouldBeFree","files":1,"time":1379653586,"description":"From the Wikipedia page:\nDr. Rick Strassman (born February 8, 1952 in Los Angeles, California, United States is a medical doctor specialized in psychiatry with a fellowship in clinical psychopharmacology research. Strassman was the first person in the United States after twenty years of intermission to embark on human research with psychedelic, hallucinogenic, or entheogenic substances. During the intermission period, research was restricted by law to animals studies only.\n\nDr Strassman's studies aimed to investigate the effects of N,N-dimethyltryptamine (DMT), a powerful entheogen, or psychedelic, that he hypothesizes is produced by the human brain in the pineal gland. DMT is found naturally in various natural sources, and is related to human neurotransmitters such as serotonin and melatonin.\n\nThere is speculation involving the role DMT may play in the dream state. Upon entering the REM stage of sleep, minute amounts of DMT are most likely released into the bloodstream after one has fallen asleep. Strassman refers to DMT as the &quot;god molecule&quot; or &quot;spirit molecule&quot; due to many users claiming of contacting non-human or god-like beings under the alkaloid's influence. During the project's five years, he administered approximately 400 doses of DMT to 60 human volunteers. Of the 60 human volunteers who've ingested DMT under Strassman's watch, more than half reported similar experiences. These experiences ranged from profound encounters/interaction with non-human beings to observing highly detailed, self-transforming geometric patterns and other things of similar nature. This research took place at the University of New Mexico's School of Medicine in Albuquerque, New Mexico where he was then tenured Associate Professor of Psychiatry. Dr. Strassman has conjectured that when a person is approaching death or possibly when in a dream state, the pineal gland releases DMT in a relatively large amount, accounting for much of the imagery reported by survivors of near-death experiences.\n\n","torrent":{"xt":"urn:btih:1dbcf96086e938874056911c5c9b4616d893f714","amp;dn":"DMT+-+The+spirit+molecule%2C+Rick+Strassman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1dbcf96086e938874056911c5c9b4616d893f714","infoHashBuffer":{"type":"Buffer","data":[29,188,249,96,134,233,56,135,64,86,145,28,92,155,70,22,216,147,247,20]},"announce":[],"urlList":[]}}