{"title":"Sports Nutrition:Energy Metabolism and Exercise{BBS}","uid":6861565,"size":6564609,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1dddfb55a07272490ef72875d984f714f3df8a00&amp;dn=Sports+Nutrition%3AEnergy+Metabolism+and+Exercise%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":1,"uploader":"bigbluesea","files":-1,"time":1322919389,"description":"Exercise by itself tears down the body. To rebuild that body so that it expresses greater strength, endurance, and speed, requires sound nutritional practices based on fact rather than fad. Those practices must also recognize that specific needs vary greatly according to age, gender, and intensity of exercise.\n\nSports Nutrition: Energy Metabolism and Exercise offers a cutting-edge investigation of energy metabolism and exercise in relation to sports nutrition. Edited by the team of Ira Wolinsky and Judy Driskell, who continue to build on their reputation as leading experts on sports-nutrition, and written by researchers qualified for the task, this myth-busting work presents-\n# New findings on essential energy-yielding nutrients\n# New material on the estimation of energy requirements\nVarious chapters examine the active body's need for energy-yielding carbohydrates, lipids, and proteins. The book also considers laboratory methods for determining the energy expenditure of athletes as well as unique assessment methods used to measure activity in the field. In addition, the text considers important physiological aspects of energy metabolism such as body weight regulation, and examines variances necessitated by gender and age.\n\nBased on rigorous research, this readable work offers sound advice for all those concerned with the proper nourishment of the active body. Nutritionists, trainers, exercise physiologists, and athletes themselves will find much food for thought on nutrition science, as well as practical \n\n\n# Hardcover: 288 pages\n# Publisher: CRC Press; 2 edition (September 14, 2007)\n# Language: English\n# ISBN-10: 0849379504\n# ISBN-13: 978-0849379505","torrent":{"xt":"urn:btih:1dddfb55a07272490ef72875d984f714f3df8a00","amp;dn":"Sports+Nutrition%3AEnergy+Metabolism+and+Exercise%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1dddfb55a07272490ef72875d984f714f3df8a00","infoHashBuffer":{"type":"Buffer","data":[29,221,251,85,160,114,114,73,14,247,40,117,217,132,247,20,243,223,138,0]},"announce":[],"urlList":[]}}