{"title":"Solid State Physics - 2nd Edition - Philip Hofmann","uid":11977485,"size":2841852,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1e9226642904c852f285e0bc76d263906c0edb25&amp;dn=Solid+State+Physics+-+2nd+Edition+-+Philip+Hofmann&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1433081591,"description":"This successful brief course in solid state physics is now in its second edition. The clear and concise introduction not only describes all the basic phenomena and concepts, but also such advanced issues as magnetism and superconductivity. Each section starts with a gentle introduction, covering basic principles, progressing to a more advanced level in order to present a comprehensive overview of the subject. The book is providing qualitative discussions that help undergraduates understand concepts even if they can't follow all the mathematical detail.\n \nThe revised edition has been carefully updated to present an up-to-date account of the essential topics and recent developments in this exciting field of physics. The coverage now includes ground-breaking materials with high relevance for applications in communication and energy, like graphene and topological insulators, as well as transparent conductors.\n \nThe text assumes only basic mathematical knowledge on the part of the reader and includes more than 100 discussion questions and some 70 problems, with solutions free to lecturers from the Wiley-VCH website. The author's webpage provides Online Notes on x-ray scattering, elastic constants, the quantum Hall effect, tight binding model, atomic magnetism, and topological insulators.\n\nThis new edition includes the following updates and new features:\n \n* Expanded coverage of mechanical properties of solids, including an improved discussion of the yield stress\n* Crystal structure, mechanical properties, and band structure of graphene\n* The coverage of electronic properties of metals is expanded by a section on the quantum hall effect including exercises. New topics include the tight-binding model and an expanded discussion on Bloch waves. \n* With respect to semiconductors, the discussion of solar cells has been extended and improved.\n* Revised coverage of magnetism, with additional material on atomic magnetism\n* More extensive treatment of finite solids and nanostructures, now including topological insulators\n* Recommendations for further reading have been updated and increased.\n* New exercises on Hall mobility, light penetrating metals, band structure","torrent":{"xt":"urn:btih:1e9226642904c852f285e0bc76d263906c0edb25","amp;dn":"Solid+State+Physics+-+2nd+Edition+-+Philip+Hofmann","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e9226642904c852f285e0bc76d263906c0edb25","infoHashBuffer":{"type":"Buffer","data":[30,146,38,100,41,4,200,82,242,133,224,188,118,210,99,144,108,14,219,37]},"announce":[],"urlList":[]}}