{"title":"Homeland - Season 1","uid":9561711,"size":7876404361,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1eb582cec4d22989d448a3a2331de3dd2377e3dd&amp;dn=Homeland+-+Season+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":3,"uploader":"POtHS11","files":-1,"time":1391446129,"description":"Season 1 (2011)\n\nThe first season follows Carrie Mathison, a Central Intelligence Agency operations officer who, after conducting an unauthorized operation in Iraq, is put on probation and reassigned to the CIA's Counterterrorism Center in Langley, Virginia. In Iraq, Carrie was warned by an asset that an American prisoner of war had been turned by al-Qaeda.\n\nCarrie's job grows complicated when her boss, Director of the Counterterrorism Center David Estes, calls Carrie and her colleagues in for an emergency briefing. Carrie learns that Nicholas Brody, a U.S. Marine Sergeant who had been reported as missing in action since 2003, has been rescued during a Delta Force raid on a compound belonging to terrorist Abu Nazir. Carrie comes to believe that Brody is the American prisoner of war whom her asset in Iraq was talking about.[9] However, the federal government and her superiors at the CIA consider Brody a war hero.\n\nRealizing it would be nearly impossible to convince her boss to place Brody under surveillance, Carrie approaches the only other person she can trust, her mentor, Saul Berenson. The two must now work together to investigate Brody and prevent another terrorist attack on American soil. Eventually, Brody attempts to kill the Vice President as a suicide bomber but falters at the last moment after an intervention by his daughter Dana, while Carrie becomes more doubtful and paranoid by her belief that Brody is a terrorist.","torrent":{"xt":"urn:btih:1eb582cec4d22989d448a3a2331de3dd2377e3dd","amp;dn":"Homeland+-+Season+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1eb582cec4d22989d448a3a2331de3dd2377e3dd","infoHashBuffer":{"type":"Buffer","data":[30,181,130,206,196,210,41,137,212,72,163,162,51,29,227,221,35,119,227,221]},"announce":[],"urlList":[]}}