{"title":"Way of the Reaper - My Greatest Untold Missions and the Art of B","uid":15612452,"size":588673,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1ec728eb1dd671f554b8fdaf89069c591638eff6&amp;dn=Way+of+the+Reaper+-+My+Greatest+Untold+Missions+and+the+Art+of+B&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"shtihl22","files":1,"time":1471799307,"description":"**********Description***********\r\n\r\n\r\nEnglish | 2016 | ISBN: 1250088356 | 304 Pages | EPUB | 0,6 MB\r\n\r\nFrom the New York Times Bestselling Author and Co-Star of Fox's American Grit comes a rare and powerful book on the art of being a sniper. Way of the Reaper is a step-by-step accounting of how a sniper works, through the lens of Irving's most significant kills - none of which have been told before. Each mission is an in-depth look at a new element of eliminating the enemy, from intel to luck, recon to weaponry. Told in a thrilling narrative, this is also a heart-pounding true story of some of The Reaper's boldest missions including the longest shot of his military career on a human target of over half a mile.\r\n\r\nIn Iraq and Afghanistan, Nick Irving earned his nickname in blood, destroying the enemy with his sniper rifle and in deadly firefights behind a .50 caliber machine gun. He engaged a Taliban suicide bomber during a vicious firefight, used nearly silent sub-sonic ammo, and was the target of snipers himself. Way of the Reaper attempts to place the reader in the heat of battle, experiencing the same dangers, horrors and acts of courage Irving faced as an elite member of the 3rd Ranger Battalion, 75th Ranger Regiment, while also examining the personal ramifications of taking another life.\r\n\r\nReaders will experience the rush of the hunt and the dangers that all snipers must face, while learning what it takes to become an elite manhunter. Like the Reaper himself, this explosive book blazes new territory and takes no prisoners.\r\n\r\n\r\n=======================================\r\n \nhttps://thepiratebay.org/user/shtihl22\r\n\r\n=======================================","torrent":{"xt":"urn:btih:1ec728eb1dd671f554b8fdaf89069c591638eff6","amp;dn":"Way+of+the+Reaper+-+My+Greatest+Untold+Missions+and+the+Art+of+B","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ec728eb1dd671f554b8fdaf89069c591638eff6","infoHashBuffer":{"type":"Buffer","data":[30,199,40,235,29,214,113,245,84,184,253,175,137,6,156,89,22,56,239,246]},"announce":[],"urlList":[]}}