{"title":"Treasure Island Media - THE 1000 LOAD FUCK - Bareback - GAY","uid":5287552,"size":2012600482,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:1efa9fde12057f9ce1a6b5c70febd2a25ba1fd46&amp;dn=Treasure+Island+Media+-+THE+1000+LOAD+FUCK+-+Bareback+-+GAY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":4,"uploader":"johnessex","files":-1,"time":1263770277,"description":"********************************************************************************\nTHIS IS THE LAST ONE I'M SEEDING FOR NOW. Hope others also share what they have.\n********************************************************************************\n\nCodec: DivX Format\nLength: 2 Hours 30 Minutes\nRes: 640x360 - Widescreen &lt;a href=&quot;\nhttp://www.treasureislandmedia.com/TreasureIslandMedia_2007/cart/THE-1-000-LOAD-FUCK.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.treasureislandmedia.com/TreasureIslandMedia_2007/cart/THE-1-000-LOAD-FUCK.html&lt;/a&gt;\n\nTreasure Island Media - THE 1,000 LOAD FUCK - Bareback\n\nI can guarantee you've never seen anything even remotely close to this. We spent two solid years on the main event, the 1,000 load fuck itself (Scene 4). One young man taking a gallon of cum up his eager cum-hungry guts : this one is unprecedented and is destined to become legend.\n\nThe entire dvd is fucking awesome: seriously intense fucking from two brand new T.I.M. exclusives, horse-hung JESSY KARSON and handsome bottom-man SETH. An unbelievable three-way fuck with DAWSON flip-flopping between BRAD McGUIRE and IAN JAY. Plus seven more balls-out scenes of raging cum-fueled man-fucking.\n\nThis over-the-top set of epic world-class fuck-sessions will keep you warm and happy all the way till Spring. Guaranteed!\n\n \n------------------------\n\nNOTE:\n\nA lot of this stuff on eMule, using their client to connect to a server and search for those videos. Most of their videos are there. to get eMule client go here:\n\n------------------------\n\nNOTE:\nBy viewing this torrent page I agree that I am of legal age and not with any local, state, or federal law enforcement agencies whatsoever and that I am not a reporter, writer, or agent for any news or media organization. I am viewing this material at my sole discretion on my own behalf and will not report/disclose my findings and/or comments regarding this material. I subscribe to the principles of the First Amendment of the Constitution of the United States of America which holds that free adult Americans have the right to decide for themselves what they will read and view without governmental interference. ADULT XXX CONTENT FOR ADULT VIEWING ONLY.\t\n","torrent":{"xt":"urn:btih:1efa9fde12057f9ce1a6b5c70febd2a25ba1fd46","amp;dn":"Treasure+Island+Media+-+THE+1000+LOAD+FUCK+-+Bareback+-+GAY","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1efa9fde12057f9ce1a6b5c70febd2a25ba1fd46","infoHashBuffer":{"type":"Buffer","data":[30,250,159,222,18,5,127,156,225,166,181,199,15,235,210,162,91,161,253,70]},"announce":[],"urlList":[]}}