{"title":"[Clips4Sale / Taboo-Fantasy] Shannon (My aunt took my virginity)","uid":13625094,"size":270097957,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:1f501856502e5a73edfde8e2d8b0deae3264ceb5&amp;dn=%5BClips4Sale+%2F+Taboo-Fantasy%5D+Shannon+%28My+aunt+took+my+virginity%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":4,"uploader":"ImgSnaps","files":1,"time":1456007229,"description":"[Clips4Sale / Taboo-Fantasy] Shannon (My aunt took my virginity) 720p [Roleplay]\r\n\r\nScreenshots:\r\n \nhttp://imgsnaps.com/image/ktx\r\n \nhttp://imgsnaps.com/image/ktE\r\n\r\nYoung Justin has gone to visit his Aunt Shannon.\r\nHis Mom and her Sister don't get along, so when Aunt Shannon comes to town, she refuses to stay at Justin's house, she stays in a Hotel.\r\n\r\nShannon is going to take her Nephew out to Dinner, and when he comes to her Hotel, Shannon is not dressed yet.\r\nAs they discuss which Restaurant they should go to, Shannon begins to get dressed.\r\nShe removes her towel, and the naked Shannon begins to put on some Black Thigh High Stockings, as she discusses possible Restaurants with her Nephew.\r\n\r\nIt soon becomes apparent, however, that the young boy is &quot;distracted&quot; by the sight of his Aunt with no clothes on.\r\nShannon apologizes to her Nephew, for getting dressed in front of him, but she notices that the impressionable young boy has an erection.\r\nShannon asks her Nephew if he has ever had sex with a girl before, and it turns out....he is a Virgin!!! Shannon asks the embarrassed young boy if he would like to &quot;try it out&quot;, on her.\r\n\r\nJustin is very shy and confused by the &quot;odd&quot; offer from his Aunt.\r\nShannon convinces Justin that learning how to have sex, might be better to do with somebody he knows and trusts, like his Aunt, rather than learning it &quot;on the streets&quot;.\r\n\r\nThe frightened youngster lets his Aunt Shannon &quot;deflower&quot; him!!! Shannon sucks her Nephew's cock to get him hard, then invites her Nephew to climb on top of her and insert his excited penis inside her.\r\nJustin follows his aunt's lead, and he inserts his cock into his Aunt Shannon's Vagina and begins to pump her.\r\n\r\nLike most boys do their very first time, Justin ejaculates VERY quickly!!!\r\nShannon gives her Nephew a High Five, she has just taken his Virginity!!!","torrent":{"xt":"urn:btih:1f501856502e5a73edfde8e2d8b0deae3264ceb5","amp;dn":"%5BClips4Sale+%2F+Taboo-Fantasy%5D+Shannon+%28My+aunt+took+my+virginity%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f501856502e5a73edfde8e2d8b0deae3264ceb5","infoHashBuffer":{"type":"Buffer","data":[31,80,24,86,80,46,90,115,237,253,232,226,216,176,222,174,50,100,206,181]},"announce":[],"urlList":[]}}