{"title":"Badass: Ultimate Deathmatch  - Skull-Crushing True Stories","uid":15791752,"size":7863437,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1fba071e5cf7ab5ae6fca0769effcaa79d3dd8f1&amp;dn=Badass%3A+Ultimate+Deathmatch++-+Skull-Crushing+True+Stories&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"marty14","files":1,"time":1473387517,"description":"Badass: Ultimate Deathmatch - Skull-Crushing True Stories of the Most Hardcore Duels, Showdowns, Fistfights, Last Stands, Suicide Charges, and Military Engagements of All Time - Ben Thompson [epub]\r\n\r\nFrom the Ben Thompson, author of Badass: The Birth of a Legend, comes a collection of history’s most awe-inspiring duels and showdowns, brutal crusades and epic brawls, and profiles of the fascinating people who fought in them.\r\n\r\nFrom Caliphs to Green Berets, some of civilization’s toughest warriors are profiled in Badass: Ultimate Deathmatch, including Cyrus the Great, St. Moses the Black, and The Rani of Jhansi, as well as in-depth analyses of how they battled their way to victory.\r\n\r\nFeaturing original artworks by top graphic artists and comic book illustrators, and Ben Thompson’s signature wry, side-splitting commentary, Badass: Ultimate Deathmatch is the history of badasses, the only way it should be written: covered in blood!\r\n\r\nThis ain't no table tennis. You're not here to skip rope with your niece. You're here to witness the catastrophically awesome exploits of history's greatest badasses. Not only that, you're here to see what happens when badasses collide, when glory and doom hang in the balance, when two men enter one man leaves. If you dare listen, you'll hear the stories of . . .\r\n\r\nCyrus the Great\r\nThe king who forged the Persian Empire with blood, steel, and a few thousand rampaging camels\r\n\r\nSt. Moses the Black\r\nThe Patron Saint of Asskickings, who taught bandit thugs a lesson in turning the other cheek\r\n\r\nThe War of Aracau\r\nThe only successful indigenous resistance to Spanish colonization, led by a Mapuche warrior who strapped blades to his arms after the conquistadors sawed off his hands\r\n\r\nThe Rani of Jhansi\r\nThe Indian warrior princess who took on the British crown with a sword in each hand and her baby strapped to her back\r\n\r\nTango Mike-Mike\r\nOne lone Green Beret single-handedly rescues an entire Special Forces squad from a pinned-down position deep behind enemy lines in Cambodia\r\n\r\nThe Charge of the Australian Light Horse\r\nEight hundred horsemen armed with bayonets embark on the last great cavalry charge in history, rushing toward trenches filled with machine guns, rifles, and huge bullets","torrent":{"xt":"urn:btih:1fba071e5cf7ab5ae6fca0769effcaa79d3dd8f1","amp;dn":"Badass%3A+Ultimate+Deathmatch++-+Skull-Crushing+True+Stories","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1fba071e5cf7ab5ae6fca0769effcaa79d3dd8f1","infoHashBuffer":{"type":"Buffer","data":[31,186,7,30,92,247,171,90,230,252,160,118,158,255,202,167,157,61,216,241]},"announce":[],"urlList":[]}}