{"title":"MOBILedit Forensic with Search Tool v7.8 - [FirstUploads]","uid":11739497,"size":238918536,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1fc05d98a0f8cbc21e969f984cc874a8869b9663&amp;dn=MOBILedit+Forensic+with+Search+Tool+v7.8+-+%5BFirstUploads%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":2,"uploader":"FirstUploads","files":4,"time":1425720447,"description":"MOBILedit Forensic with Search Tool v7.8 - [FirstUploads]\n\n\nAnalyze the MOBILedit Forensic reports in a new powerful Search Tool\n\nOur classic forensic software MOBILedit Forensic has been enriched by a powerful application capable of searching for information across many devices and large amount of data. Powered by an extremely robust search engine with an intuitive query language for constructing advanced search questions.\nSearch through thousands of phones and terabytes of extracted phone data\n\nThis powerful Search Tool is able to find the evidence in these terrabytes of data. It turns all bytes retrieved from phone into a text format structured in fields such as contacts, messages, applications, files etc. The Search Tool firstly indexes all data with patented full-text technology so afterwards the search is just a matter of milliseconds.\n\n\n\nSearch by keywords or phrases with a powerful searching language\n\nStart with one keyword, end up with a long search script. Collect information about suspect identified by his name, alternatives and nicknames, his other phones, organizations or other connected persons Enhance your searching, lower your search result from thousands to the one that really matters. Use known wildcards or regular expressions, search by exact sentences or allow the powerful in-built dictionary to include variations of words.\nCollect messages, calls or any activity between two or more people in a specific time range\n\nWork with phone extracted data like never before, filter searched content in any way you want. Find connections between many persons, their friends, places, meetings and more. You can set specific time range or specific range of GPS coordinates to enhance your searching. Search Tool will also enable you to analyze and combine search results into one output.\n\n\n\nSearch trough all files, EXIFs, PDFs, DOCs or most database files\n\nWith the Search Tool you can search through many different file types. It can open and convert most known file extensions into a text. For example MS Word files, PDFs or eveh JPGs because in picture files there is an EXIF which stores camera type, GPS coordinates, time and date and many more information which could be relevant for your case.\nExport all data to many different formats, including Html, Xml, plain text format or even I2 or other analytist software\n\nTo get a graphical spider web of dependances, you can use on of predefined reports or you can export all or a part of searched content to I2 and other analysts software. Highlight, save or export only data you want in completely separated storage. You can even export the search query and share it with other coleagues who are using same software.\nSoftware that has been used in forensic for years\n\nThe Search Tool has been developed with the cooperation of Tovek company - well-known company which products has been used in most comprehensive forensic cases for years. Together with Compelson Labs we took a chance to bring you a powerful MOBILedit Forensic built-in application capable of world most powerful searching","torrent":{"xt":"urn:btih:1fc05d98a0f8cbc21e969f984cc874a8869b9663","amp;dn":"MOBILedit+Forensic+with+Search+Tool+v7.8+-+%5BFirstUploads%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1fc05d98a0f8cbc21e969f984cc874a8869b9663","infoHashBuffer":{"type":"Buffer","data":[31,192,93,152,160,248,203,194,30,150,159,152,76,200,116,168,134,155,150,99]},"announce":[],"urlList":[]}}