{"title":"Whiskey Myers - Early Morning Shakes [2014][EAC/FLAC]","uid":10146934,"size":367813857,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1fc19a872a37d357ba16aaecaffe4b1b7160e2df&amp;dn=Whiskey+Myers+-+Early+Morning+Shakes+%5B2014%5D%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"dickspic","files":17,"time":1400063581,"description":"[img]http://i.imgur.com/oIQlZv3.jpg[/img]\n\n\n[b]FLAC / Lossless / Log (100%) / Cue[/b]\n[color=Red]Label/Cat#:[/color] Wiggy Thump / WM 95515\n[color=Red]Country:[/color] \tUSA\n[color=Red]Year:[/color]  February 4, 2014 \n[color=Red]Genre:[/color] americana,red dirt rock\n[color=Red]Format:[/color] CD, Album\n\n[b][color=Blue]01. Early Morning Shakes (03:17)\n02. Hard Row to Hoe (04:27)\n03. Dogwood (04:14)\n04. Shelter from the Rain (03:37)\n05. Home (03:31)\n06. Headstone (04:19)\n07. Where the Sun Don't Shine (03:29)\n08. Reckoning (04:30)\n09. Wild Baby Shake Me (05:53)\n10. Lightning (05:48)\n11. Need a Little Time Off for Bad Behavior (03:27)\n12. Colloquy (06:13)[/color][/b]\n\n[b][color=Green]Early Morning Shakes, the third full-length from Tyler, Texas' Whiskey Myers, was produced by veteran Dave Cobb (who also helmed the sessions for Jason Isbell's Southeastern). Frontman Cody Cannon and company retain the hard-edged brand of Southern rock they've pursued from the beginning, leaving most traces of the Red Dirt scene's brand of country from 2011's Firewater and their self-titled debut fading in the rearview. (Firewater actually debuted at number 26 on Billboard's Country Albums chart.) There are country tinges here, especially in the excellent &quot;Dogwood&quot; and &quot;Shelter from the Rain,&quot; but these have more in common with the music on Dickey Betts' Highway Call than Nashville, and there are two interesting, largely acoustic numbers (&quot;Reckoning&quot; and &quot;Colloquy&quot;). These cuts prove the exceptions on the set. The rest of these songs are constructed of loud and proud guitar riffs, popping rim shots, and blues-rock that nod equally to Led Zeppelin and Lynyrd Skynyrd. (Though they should have known better than to record &quot;Hard Road to Hoe,&quot; which is a blatant rip-off of the former's trademark &quot;Heartbreaker&quot; vamp.) Cobb's collaboration with the band adds an important element, and one that Skynyrd used to great effect: a soaring, soulful, female backing chorus that draws directly on the inspiration of Muscle Shoals-era R&amp;B. It adds another dimension to the twin-guitar attack of Cody Tate and John Jeffers (who never wander off into self-indulgence here). Check the set's first single, &quot;Home,&quot; the opening title track, and &quot;Wild Baby Shake Me&quot; for three excellent examples. &quot;Where the Sun Don't Shine&quot; delves too deeply into Texas's Red Dirt's wanna-be-outlaw songwriting xenophobia. On the other hand, the reading of David Allan Coe's &quot;Need a Little Time Off for Bad Behavior&quot; features the swampy, Deep Purple-esque organ, chugging harmonica, whinnying lap steel, and female backing vocals of the original while adding canny new textures and a funkier, greasier groove. Early Morning Shakes breaks no new ground, but Whiskey Myers aren't trying to. Though the band still needs to focus more on its songwriting, this set gives the listener a real feel for Whiskey Myers' live presence, making this set a kinetic (mostly) enjoyable whole.[/color][/b]","torrent":{"xt":"urn:btih:1fc19a872a37d357ba16aaecaffe4b1b7160e2df","amp;dn":"Whiskey+Myers+-+Early+Morning+Shakes+%5B2014%5D%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1fc19a872a37d357ba16aaecaffe4b1b7160e2df","infoHashBuffer":{"type":"Buffer","data":[31,193,154,135,42,55,211,87,186,22,170,236,175,254,75,27,113,96,226,223]},"announce":[],"urlList":[]}}