{"title":"Ancient Rome - The Rise and Fall of an Empire (BBC - Complete)","uid":5048702,"size":8623925522,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:1fd31dad1990824069ad23aadbfdd8d3b12aea64&amp;dn=Ancient+Rome+-+The+Rise+and+Fall+of+an+Empire+%28BBC+-+Complete%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":4,"uploader":"sheila6","files":-1,"time":1249776682,"description":"Movies : Documentary : DVD Rip : English\n\n\n\n\nGeneral Information\n-----------------------------\nType.................: Movie/Documentary\nPlatform.............: XP/VISTA/WINDOWS 7\nNumber of Parts......: 6\nImage Format.........: .iso\nImage Created with...: Nero\n\n \n\nRelease Notes\n---------------------\nThis dramatised documentary series tells the story of the rise and fall of \nAncient Rome through the six key turning points. Factually accurate and based on \nextensive historical research, it reveals how the greed, lust and ambition of \nmen like Caesar, Nero and Constantine shaped the Roman Empire. It describes how \nRome destroyed Carthage, was conquered by Caesar, how it suppressed the Jewish \nrevolt, and converted to Christianity. CGI is mixed with compelling drama and \nspectacular live-action battles to tell the definitive television story of how \nthe Empire was formed, how it achieved maximum power, and why it eventually \nfailed.\n\n\n\n\nEpisode 1: Caesar\n\n\n\nThis programme focuses on the most famous Roman of all - Caesar. Charming, \nsavage, power-crazed, opportunistic and brilliant, he overthrew a 500-year-old \nRepublic and began the age of the emperors.\n\n\n\n\nEpisode 2: Nero\n\n\n\nThis programme focuses on Nero, charting his obsession with becoming a god, how \nhis plans to turn Rome into a glorious city bankrupted the Empire, how he \nmarried his slaveboy and killed his beloved wife in a frenzy, and how he was \nfinally overthrown.\n\n\n\n\nEpisode 3: Rebellion\n\n\n\nThis episode tells the story of the Jewish Revolt, which swept through Judea in \nAD 66 and threatened to destabilise the whole empire. Rome turned to the \ndisgraced General Vespasian and his son Titus to put it down. Filled with \nspectacular sieges and huge set-piece action, the film pits the discipline and \ningenuity of the Roman army against the passion and commitment of the rebels.\n\n\n\n\nEpisode 4: Revolution\n\n\n\nRome was once a largely democratic society, with regular elections. This \nRepublic lasted for 500 years, but then came Tiberius Gracchus. He believed in \nthe ideals of the Republic - fairness, decency and justice for everyone -but was \nappalled by Rome's aristocrats' treatment of the poor. So he unleashed the power \nof the mob upon the streets of Rome, with devastating consequences.\n\n\n\n\nEpisode 5: Constantine\n\n\n\nThis episode tells the story of how the Emperor Constantine brought Christianity \nto the western world. In AD 312, Rome was in crisis. The empire had been divided \ninto four parts, each with its own emperor who fought one another. Constantine \nintervened and united Rome, using military might and a new religion - \nChristianity.\n\n\n\n\nEpisode 6: The Fall of Rome\n\n\n\nIn AD 410, the Goth hordes sacked the city. This event symbolised Rome's \ncollapse. Within 70 years, the western empire - what we think of as Ancient Rome \n- was abandoned. But it should never have happened at all.\n\n\n\n\n\n\nTechnical Specs:\n\n\nVideo Bitrate: ~ 1575 KB/s\n\nResolution: 672 x 368\nAspect Ratio: 1.82:1\nFramerate: 25 FPS\nQuality Factor: ~ 0.26 B/px\nAudio Bitrate: 192 KB/s (CBR)\nAudio Codec: FAST Multimedia AG DVM (Dolby AC3)\nChannels: 2 @ Sampling Rate: 48 kHz\nLength per Ep: ~ 00:58:30\nFile Size per Ep: ~ 1.6 gb\nSubs: only Romanian.\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:1fd31dad1990824069ad23aadbfdd8d3b12aea64","amp;dn":"Ancient+Rome+-+The+Rise+and+Fall+of+an+Empire+%28BBC+-+Complete%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1fd31dad1990824069ad23aadbfdd8d3b12aea64","infoHashBuffer":{"type":"Buffer","data":[31,211,29,173,25,144,130,64,105,173,35,170,219,253,216,211,177,42,234,100]},"announce":[],"urlList":[]}}