{"title":"Dave Alvin &amp; Phil Alvin - Common Ground: Dave Alvin &amp; Ph","uid":10739122,"size":276920756,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2065ba4c7a934692e0e5980f38fd434e0a4d14cb&amp;dn=Dave+Alvin+%26amp%3B+Phil+Alvin+-+Common+Ground%3A+Dave+Alvin+%26amp%3B+Ph&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"dickspic","files":-1,"time":1407727773,"description":"FLAC / Lossless / Log (100%) / Cue\nLabel/Cat#: Yep Roc #YEP 2384\nCountry: USA\nYear: June 3, 2014\nGenre: americana,folk\nFormat: CD\n\n\n\n\n\n\n01. All By Myself (03:28)\n02. I Feel So Good (04:09)\n03. How You Want It Done? (03:00)\n04. Southern Flood Blues (04:29)\n05. Big Bill Blues (03:19)\n06. Key to the Highway (03:48)\n07. Tomorrow (03:21)\n08. Just a Dream (03:52)\n09. You've Changed (03:12)\n10. Stuff the Call Money (04:44)\n11. Truckin' Little Woman (03:08)\n12. Saturday Night Rub (02:08)\n\n\n\n\n\nBlasters founders Dave Alvin and Phil Alvin have had a famously combative relationship over the years, but as Dave once said, &quot;We argue sometimes, but we never argue about Big Bill Broonzy.&quot; So it's fitting that their love of Big Bill brings them together in the recording studio for their first album together since the Blasters' Hard Line in 1985. Common Ground: Dave Alvin &amp; Phil Alvin Play &amp; Sing the Songs of Big Bill Broonzy features the Alvin Brothers performing a dozen songs from the Broonzy songbook, and while listening to this is a potent reminder of how good Broonzy's songs still sound in the 21st century, it also demonstrates the complementary talents of Dave and Phil Alvin. Dave is the hot-shot (but musically savvy) guitarist whose fiery leads and switchblade solos give the melodies a spark they wouldn't have with Phil calling all the shots, and Phil has the outsized, passionate vocal style that brings Big Bill's tales to life in a way Dave's more modest instrument can't quite match (though Dave sings as well, and doesn't embarrass himself when he steps up to the mike). Put them together, and in this context you don't get the Blasters, but you do get something that recalls a bit of the wild fun that band knew how to conjure. It's clear the Alvins love this music and know how to mess with it in just the right way, and they don't treat Broonzy's tales of all manner of wild living like museum pieces, but as vital, living bits of American music, and that's how they sound on this album. Common Ground isn't &quot;The Return of the Alvin Brothers&quot; so much as a joyous continuation of the mission they launched when the Blasters first hit the stage in 1979, and if they're a little older and craggier in 2014, they clearly know how to make this stuff rock, and this is a modest triumph for one of roots rock's most fascinating partnerships..","torrent":{"xt":"urn:btih:2065ba4c7a934692e0e5980f38fd434e0a4d14cb","amp;dn":"Dave+Alvin+%26amp%3B+Phil+Alvin+-+Common+Ground%3A+Dave+Alvin+%26amp%3B+Ph","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2065ba4c7a934692e0e5980f38fd434e0a4d14cb","infoHashBuffer":{"type":"Buffer","data":[32,101,186,76,122,147,70,146,224,229,152,15,56,253,67,78,10,77,20,203]},"announce":[],"urlList":[]}}