{"title":"AZ Screen Recorder Premium - No Root v4.1 APK [SadeemPC]","uid":15479955,"size":3257889,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:206a5bd0bb7d65867897da35c6c476ab9e1d2103&amp;dn=AZ+Screen+Recorder+Premium+-+No+Root+v4.1+APK+%5BSadeemPC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":2,"uploader":"SadeemPC","files":1,"time":1470236416,"description":"AZ Screen Recorder Premium - No Root v4.1\r\nRequirements: Android 5.0+\r\n\r\nAZ Screen Recorder is the best app to record the screen of your Lollipop. It does NOT require root access, no time limit, no watermark, ad free and very easy to use with one action to start and stop recording.\t\r\n\r\nThis screen recording app will let you make beautiful screencast videos by providing every feature that you need in a simple and elegant user experience design.\r\n\r\nAZ screen recorder lets you record your screen to HD and FullHD videos and it is the only screencast app in the Android market that can be paused and resumed while recording.\r\n\r\nYou can also record audio from the mic and it is automatically muxed into the screencast videos. That makes it very convenient to create tutorial, promotional video, comment about your game and gameplay or record video chat. The floating window always staying on top will let you snap at the exact moment on any screen.\r\n\r\nIn the settings, you can enable screen touches so the people who are watching your videos will know exactly what you are doing.\r\n\r\nAdditionally, there are many other features in this free screen recorder such as setting video resolution, bit-rate, screen orientation, customized timer to stop, saving directory selection, view/share or delete your recorded videos... All of them are free for you!\r\n\r\nOur goal is to develop the best free screen recorder that makes everyone satisfied but if you want to support us and/or want to upgrade to pro version, you can buy the donation package and get the super cool and unique features that cannot be found from any other screen recorder in the market:\r\n- Magic button : a button that controls your recording without showing anything on the screen. Thus, your video viewers will solely focus on the app, the game or whatever you want to screencast.\r\n- Overlay front camera : you can record your face and your emotions in a small overlay window, which can be dragged freely to any position on the screen and customized to any size and opacity.\r\n- Countdown timer : is there something you have to prepare before recording ? Don't worry, the countdown timer will wait until you are ready to start and snap at the moment you want.\r\n- Draw on screen : this unique feature is huge when making a tutorial. You can emphasize, draw a symbol or mark something with any chosen colour directly on your screen.\r\n- Trim videos : the screencast can be long and contains unnecessary information, you can trim the parts you don't want to make your videos even more impressive.\r\n\r\nOur HUGE thanks to Bruno Mioto and Jose Castillo for helping us translating this screen recording app to Portuguese and Spanish.\r\n\r\nWHAT'S NEW:\r\n- Now you can switch controller type: bar or bubble.\r\n- Add button Capture (Screenshot).\r\n- Wifi Transfer mode: easy access output directory from computer.\r\n- Support Norwegian.\r\n\r\nHomepage\r\n\r\n\r\nPREMIUM features Unlocked","torrent":{"xt":"urn:btih:206a5bd0bb7d65867897da35c6c476ab9e1d2103","amp;dn":"AZ+Screen+Recorder+Premium+-+No+Root+v4.1+APK+%5BSadeemPC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"206a5bd0bb7d65867897da35c6c476ab9e1d2103","infoHashBuffer":{"type":"Buffer","data":[32,106,91,208,187,125,101,134,120,151,218,53,198,196,118,171,158,29,33,3]},"announce":[],"urlList":[]}}