{"title":"Fundamentals of Magnetism [2013]","uid":11958909,"size":5389362,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:206ad336f85ea4d2fbc642d33f88f9ed3f485c28&amp;dn=Fundamentals+of+Magnetism+%5B2013%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"NoctDeath","files":2,"time":1432510892,"description":"Title: Fundamentals of Magnetism\nAuthor: Mario Reis\nFormat: PDF\nHardcover: 288 pages\nPublisher: Academic Press; 1 edition (May 31, 2013)\nLanguage: English\nISBN-10: 978-0124055452\n\nThe Fundamentals of Magnetism is a truly unique reference text, that explores the study of magnetism and magnetic behavior with a depth that no other book can provide. It covers the most detailed descriptions of the fundamentals of magnetism providing an emphasis on statistical mechanics which is absolutely critical for understanding magnetic behavior. The books covers the classical areas of basic magnetism, including Landau Theory and magnetic interactions, but features a more concise and easy-to-read style.\n\nPerfect for upper-level graduate students and industry researchers, The Fundamentals of Magnetism provides a solid background of fundamentals with clear and in-depth explanations, in comparison to a brief overview before moving into more advanced topics. Many applications directly for the purpose of a deep understanding of magnetism and other non-cooperative phenomena help readers make the transition from theory to application and experimentation effortless. This book is the true 'study' of the fundamentals of magnetism, enabling readers to move into far more advance aspects of magnetism more easily.\n\n- Offers accessible, self-contained content without needing to seek other sources on topics like Fermion fas; angular moment algebra, etc\n\n- Includes over 60 pages devoted to an in-depth discussion of diamagnetism and paramagnetism, topics usually described in only few pages in other books\n\nIncorporates numerous applications including Molecular Magnets and other non-cooperative phenomena","torrent":{"xt":"urn:btih:206ad336f85ea4d2fbc642d33f88f9ed3f485c28","amp;dn":"Fundamentals+of+Magnetism+%5B2013%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"206ad336f85ea4d2fbc642d33f88f9ed3f485c28","infoHashBuffer":{"type":"Buffer","data":[32,106,211,54,248,94,164,210,251,198,66,211,63,136,249,237,63,72,92,40]},"announce":[],"urlList":[]}}