{"title":"There's Something About Mary(1998)DVDRip.AC3(ENG)-DROCK","uid":6796495,"size":737044564,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:20ac0438c0dcfab037a1f5461b898db8ec47d8ed&amp;dn=There%5C%27s+Something+About+Mary%281998%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"drock232","files":-1,"time":1320477748,"description":"The Farrelly Brothers set this romantic comedy in their home state of Rhode Island. In 1985, when teen-nerd Ted Stroehmann (Ben Stiller) challenges a high-schooler who's bullying retarded Warren Jenson (W. Earl Brown), his concern prompts Warren's sister, the dazzling and desirable Mary Jenson (Cameron Diaz) to choose Ted as her senior prom date, a fact Ted's pals find hard to believe. However, on prom night, Ted gets his penis caught in his zipper, so the much-desired date never happens. Living in Providence and waxing nostalgic 13 years later, Ted hires Pat Healy (Matt Dillon) to locate Mary, and the creepy private investigator finds her in Miami, where she lives with her tan-shriveled roommate Magda (Lin Shaye). After Pat develops a stalker-style fixation on the lovely, unattached Mary, he lies to Ted, telling him that she's now an overweight mother confined to a wheelchair. Employing professional eavesdropping equipment, Pat gathers a dossier on Mary's life and future plans, information that forms the basis for more lies when Pat begins dating her. Sure enough, Mary falls for Pat, although her friend Tucker (Lee Evans) is very suspicious of Pat's claim to be a Harvard-educated architect. Meanwhile, Ted learns the truth but continues to encounter offbeat obstacles as he accelerates to Miami in hopes of finding happiness with his true love. Former Modern Lovers singer Jonathan Richman vocalizes a narrative ballad of onscreen commentary in the Cat Ballou (1965) tradition. Most of the cast sings and frolics to Build Me Up, Buttercup by The Foundations during the closing credits.\n\nRipped with Handbrake.\n\nLength: 1 Hour 59 Minutes\n\nFile Type: MP4","torrent":{"xt":"urn:btih:20ac0438c0dcfab037a1f5461b898db8ec47d8ed","amp;dn":"There%5C%27s+Something+About+Mary%281998%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20ac0438c0dcfab037a1f5461b898db8ec47d8ed","infoHashBuffer":{"type":"Buffer","data":[32,172,4,56,192,220,250,176,55,161,245,70,27,137,141,184,236,71,216,237]},"announce":[],"urlList":[]}}