{"title":"Murdoch Mysteries - Season 02 (2009) - 13 Episodes","uid":10657809,"size":4939788460,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:20af030c079bd023275f088250aaacc2b645a133&amp;dn=Murdoch+Mysteries+-+Season+02+%282009%29+-+13+Episodes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":4,"uploader":"bnaron","files":-1,"time":1406681515,"description":"Murdoch Mysteries - Season 02 (2009) - 13 Episodes\n\n\nSeries Description Courtesy:\n\nWikipedia, the free encyclopedia\nen.wikipedia.org/wiki/Murdoch_Mysteries\n\nMurdoch Mysteries is a Canadian drama television series aired on both City and CBC Television, featuring Yannick Bisson as William Murdoch, a police detective working in Toronto, Ontario, around the turn of the twentieth century. The television series is based on the series of novels by Maureen Jennings.\n\nThe series takes place in Toronto starting in 1895 and follows Detective William Murdoch (Yannick Bisson) of the Toronto Constabulary, who solves many of his cases using methods of detection that were unusual at the time. These methods include fingerprinting (referred to as &quot;finger marks&quot; in the series), blood testing, surveillance, and trace evidence.\n\nSome episodes feature anachronistic technology whereby Murdoch sometimes uses the existing technology of his time to improvise a crude prototype of a technology that would be more readily recognizable to the show's 21st-century audience. In one episode, for instance, he creates a primitive version of sonar to locate a sunken ship in Lake Ontario. In another, he effectively invents wire-tapping. In still another, a foreign police officer has a photograph which Murdoch needs as evidence, so Murdoch asks the other officer to overlay the photograph with a grid which is numerically coded for the colour in each square, and then to transmit the numerical data to Murdoch via telegraph, with the end result that the foreign officer has essentially sent Murdoch a bitmap image they call a &quot;facsimile&quot;, a telefax.\n\nFilming of season two took place in Toronto, Cambridge, and St. George in Ontario, in Drumheller, Alberta, and near Vancouver, British Columbia where they made use of the old set of &quot;Bordertown.&quot;\n\n\nSynopses courtesy of:\n\nThe On-line TV Database\nAn Open Database for Television Fans\nwww.thetvdb.com\n\n\n2009-02-10 - (2 Episode Night) - (1) - Snakes and Ladders (Video: 688x400, 1100kbps, 24fps - Audio: 44.1kHz, 96kbps)\n\nAn investigator arrives from Scotland Yard who is after the infamous Jack the Ripper. Meanwhile, Murdoch takes dancing lessons so that he can escort Dr. Ogden to a ball.\n\n\n2009-02-10 - (2 Episode Night) - (2) - Mild Mild West (Video: 672x400, 1100kbps, 24fps - Audio: 44.1kHz, 96kbps)\n\nWhen the traveling Buffalo Bill Cody Western Extravaganza settles in Toronto, murders happen. Inspector Murdoch must investigate the crimes while his boss becomes enamored with Annie Oakley.\n\n\n2009-02-17 - Dinosaur Fever (Video: 704x416, 1100kbps, 24fps - Audio: 44.1kHz, 96kbps)\n\nWhen the unveiling of a reconstructed dinosaur skeleton at a gala event reveals the dead body of a young man found in its jaws, Murdoch must enter the world of bone-hunters to find the culprit.\n\n\n2009-02-24 - Houdini Whodunit (Video: 688x400, 1100kbps, 24fps - Audio: 44.1kHz, 96kbps)\n\nThe young Harry Houdini becomes Murdoch's prime suspect when he investigates a daring robbery-homicide. Meanwhile, Dr. Ogden's sister comes to visit and soon becomes attracted to Murdoch.\n\n\n2009-03-03 - The Green Muse (Video: 624x352, 1100kbps, 24fps - Audio: 44.1kHz, 96kbps)\n\nThe romance between Inspector Murdoch and Dr. Ogden heats up as Murdoch finds himself investigating the death of a young woman working as a high-class prostitute.\n\n\n2009-03-10 - Shades of Grey (Video: 624x352, 1100kbps, 24fps - Audio: 44.1kHz, 96kbps)\n\nAs they investigate a young woman's death, Murdoch and Dr. Ogden find their relationship threatened when they turn out to be of opposite opinions in the matter of abortion.\n\n\n2009-03-17 - Big Murderer on Campus (Video: 688x400, 1100kbps, 24fps - Audio: 44.1kHz, 96kbps)\n\nDetective Murdoch fears that his relationship with Dr. Ogden has been permanently damaged, as he heads into investigating a seemingly perfect crime, the murder of a university professor. Meanwhile, Constable Crabtree continues his search for his biological mother.\n\n\n2009-03-24 - I, Murdoch (Video: 682x400, 1100kbps, 24fps - Audio: 44.1kHz, 96kbps)\n\nMurdoch finds himself drawn to the widowed mother of a boy who has gone missing, but the case starts to take a strange turn involving spies, midgets and a robotic super weapon.\n\n\n2009-03-31 - Convalescence (Video: 682x400, 1100kbps, 24fps - Audio: 44.1kHz, 96kbps)\n\nDr. Ogden and Enid compete to nurse the injured Murdoch back to health, as in his delirium he begins to suspect his landlady of planning a murder. Meanwhile, Constable Crabtree investigates a case involving a disagreeable parrot.\n\n\n2009-04-07 - Murdoch.com (Video: 640x368, 1100kbps, 24fps - Audio: 44.1kHz, 96kbps)\n\nThe discovery of a decomposed body leads Murdoch into the fascinating world of telegraphy - the 1895 equivalent of the internet.  When Murdoch calls on Enid to assist in the investigation, she finds herself in peril.  Meanwhile, Inspector Brackenreid's erratic behavior has Dr. Ogden questioning the Gold Cure the Inspector is taking to help him stop drinking.\n\n\n2009-04-14 - Let Us Ask the Maiden (Video: 720x416, 1100kbps, 24fps - Audio: 44.1kHz, 96kbps)\n\nMurdoch's investigation into the death of a young Jewish man leads to Toronto's small Jewish getto - the Ward.  There he finds a tale of forbidden romance and himself again being drawn to Dr. Ogden.\n\n\n2009-04-21 - Werewolves (Video: 720x416, 1100kbps, 24fps - Audio: 44.1kHz, 96kbps)\n\nA savage murder, seemingly at the jaws of a wild beast, leads Murdoch into the mysterious worls of North American shamaism and lycanthropy.  While searching for a reational explanation, Murdoch is forced to choose between Enid and Dr. Ogden.\n\n\n2009-04-27 - Anything You Can Do (Video: 688x400, 1100kbps, 24fps - Audio: 44.1kHz, 96kbps)\n\nWhile investigating a murder, Murdoch find himself teamed with a North West Mounted Policeman whose methods and mannerisms are strikingly similar to this own -- perhaps too similar?  Murdoch hope to rekindle his relationship with Dr. Ogden -- but is it too late?\n","torrent":{"xt":"urn:btih:20af030c079bd023275f088250aaacc2b645a133","amp;dn":"Murdoch+Mysteries+-+Season+02+%282009%29+-+13+Episodes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20af030c079bd023275f088250aaacc2b645a133","infoHashBuffer":{"type":"Buffer","data":[32,175,3,12,7,155,208,35,39,95,8,130,80,170,172,194,182,69,161,51]},"announce":[],"urlList":[]}}