{"title":"Emil M. Cioran - Philosophical Works (8 books)","uid":11525392,"size":18654517,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:20fb79e47c9753715320d2913fb6d75bf915db23&amp;dn=Emil+M.+Cioran+-+Philosophical+Works+%288+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"workerbee","files":-1,"time":1416530733,"description":"\n        * *  This is a revised and enlarged version of an earlier torrent * *\n\n\nEMIL M. CIORAN (1911-1995) was a Romanian philosopher and essayist, who published works in both Romanian and French.  His first French book, A SHORT HISTORY OF DECAY (1949), was awarded the Rivarol Prize in 1950.  Soon after, he began to refuse every literary prize he was offered.  The Latin Quarter of Paris became his permanent residence and he lived much of his life in isolation.\n\nHis work is characterized by pessimism, which many critics trace back to events of his childhood (in 1935 his mother is reputed to have told him that if she had known he was going to be so unhappy she would have aborted him).  However, Cioran's pessimism -- even nihilism -- remains both inexhaustible and, in its own particular manner, joyful; it is not the sort of pessimism which can be traced back to simple origins, single origins themselves being questionable.  Preoccupied with the problems of death and suffering, he was attracted to the idea of suicide, believing it to be an idea that could help one go on living, an idea which he fully explored in ON THE HEIGHTS OF DESPAIR (1934).\n\nWilliam H. Gass called Cioran's work &quot;a philosophical romance on the modern themes of alienation, absurdity, boredom, futility, decay, the tyranny of history, the vulgarities of change, awareness as agony, reason as disease&quot;.\n\n\nThe following books are in ePUB format unless otherwise noted:\n\n* ALL GALL IS DIVIDED: The Aphorisms of a Legendary Iconoclast (Arcade, 2012).  Translated by Richard Howard.\n\n* ANATHEMAS AND ADMIRATIONS (Arcade, 2012).  Translated by Richard Howard.\n\n* DRAWN AND QUARTERED (Arcade, 2012).  Translated by Richard Howard.\n\n* THE NEW GODS (Arcade, 2013).  Translated by Richard Howard.\n\n* ON THE HEIGHTS OF DESPAIR (University of Chicago Press, 1992).  Translated with an Introduction by Ilinca Zarifopol-Johnston. -- ePUB + PDF\n\n* A SHORT HISTORY OF DECAY (Arcade, 2012).  Translated by Richard Howard.\n\n* THE TEMPTATION TO EXIT (Arcade, 2013).  Translated by Richard Howard, with an Introduction by Susan Sontag.\n\n* THE TROUBLE WITH BEING BORN (Arcade, 1998).  Translated by Richard Howard. -- Reprocessed scan of a PDF originally uploaded by AreciboMessage, to whom many thanks.\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                                    &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!","torrent":{"xt":"urn:btih:20fb79e47c9753715320d2913fb6d75bf915db23","amp;dn":"Emil+M.+Cioran+-+Philosophical+Works+%288+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20fb79e47c9753715320d2913fb6d75bf915db23","infoHashBuffer":{"type":"Buffer","data":[32,251,121,228,124,151,83,113,83,32,210,145,63,182,215,91,249,21,219,35]},"announce":[],"urlList":[]}}