{"title":"My.Kitchen.Rules.s06e09.WS.PDTV.x264.BF1.mkv","uid":11703213,"size":621238178,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:210fb627ea14fc4cb510307f38086ef7a5f0d730&amp;dn=My.Kitchen.Rules.s06e09.WS.PDTV.x264.BF1.mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":2,"uploader":"bigfish5","files":1,"time":1423959967,"description":"My Kitchen Rules Australia Series 6 Episode 9\n\nNSW's newlyweds Carol and Adam can look after seven kids but can they handle the Instant Restaurant round? Hosted by Pete Evans and Manu Feildel.\n\nCarol and Adam New South Wales\nWe're both highly competitive. \nThey met on a blind date set up by a friend of Carol's who Adam coached in tennis, but neither went along willingly.\n&quot;We'd both been married before so we kind of resisted and were made to go on this date. But here we are now,&quot; explains Carol.\nThe newlyweds have a large blended family with seven children between them and their own 'child' together, beagle puppy Oscar, just eight months old. Carol's two boys Mitch, 19, and James, 18 live with them while Adam's tribe of Annabel, 15, Charlotte, 13, Sophie, 11, Grace, 9, and Lachlan, 8, visit as often as they can.\nTheir favourite pastime is to compete, against anyone, including each other.\n&quot;As a former tennis player, I'm highly competitive,&quot; confesses Adam, 45. &quot;It doesn't matter really what it is, be it a board game, a game of tennis, anything to do with going against Carol. That's how I am. And Carol is just as competitive.&quot;\nCarol, 47, admits she likes to challenge herself. She works in events management and is also a fitness instructor in her spare time.\n&quot;Adam's much better at cardio but I'm better at strength stuff,&quot; she admits.\nAt the age of 22, after seven years living away at the Institute of Sport and in hotel rooms while being a professional tennis player, Adam had very little in the way of cooking skills.\n&quot;I came off the tour and didn't really have any skills so my grandmother signed me up to a cooking course,&quot; he recalls.\nDespite the course being at the famed Le Cordon Bleu culinary school, Adam says it didn't set him up to make gastronomic masterpieces.\n&quot;It was basically the basics of boiling an egg through to cooking toast. So it wasn't like the 3-hatted chef was telling me how to make duck a l'orange. It was very basic but it was actually handy.&quot;\nCarol's evolution in the kitchen started at the feet of her mother who taught her many traditional Japanese dishes.\n&quot;I love desserts; that's what I mostly cook. And my mum didn't really like desserts so whenever she had dinner parties it got to the stage where I would just do the dessert for her,&quot; she explains.\nTogether their cooking style is full of fresh seasonal produce, seafood, Asian influences and plenty of spice.\n&quot;We like to go out to dinner and see something on the menu and bring it home and actually make that.&quot;\n&quot;And we put our own play on that. And that's what we like challenging ourselves with. We like that little puzzle and it's another competitive thing,&quot; says Adam.\nDividing the work in the kitchen, Carol takes the lead on a lot of the prep work although Adam would like to hasten up her knife skills. They'll both work on the entrees, while Adam will serve up the main and Carol will whip up the dessert.\nBut when things go wrong, these guys deal with pressure in very different ways.\nAdam tends to shut up, literally. &quot;I want to talk, but I go very quiet and I just focus. And that's just primarily due to the fact that the sport I used to play everything is internalised.&quot;","torrent":{"xt":"urn:btih:210fb627ea14fc4cb510307f38086ef7a5f0d730","amp;dn":"My.Kitchen.Rules.s06e09.WS.PDTV.x264.BF1.mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"210fb627ea14fc4cb510307f38086ef7a5f0d730","infoHashBuffer":{"type":"Buffer","data":[33,15,182,39,234,20,252,76,181,16,48,127,56,8,110,247,165,240,215,48]},"announce":[],"urlList":[]}}