{"title":"Black Street Hookers Cream Pies #4 - Anal Ebony Porn XXX","uid":9472843,"size":2674290749,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:2159a183bb102195200a1f50400db9d57a203aba&amp;dn=Black+Street+Hookers+Cream+Pies+%234+-+Anal+Ebony+Porn+XXX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":30,"uploader":"KidAtomic","files":-1,"time":1389622776,"description":"Black Street Hookers Cream Pies #4\n\nDeese hoes get off when a load is dropped up in 'em - and this ain't no joke! It feels so good to cum inside them. All these freaks get creamed!!\n\n    Scene 1. Jada Kiss, TT Boy\n    Scene 2. Olivia Winters, Mark Anthony\n    Scene 3. Kandi Kream, TT Boy\n    Scene 4. Avalon, Max Black\n    Scene 5. Riyanna Cash, Brian Pumper\n    Scene 6. Kylie Brown, Nikki Lane, Mark Anthony, TT Boy\n\nLength 2 hrs. 17 mins.\nRating XXX\nReleased Dec 20 2004\nProduction Year 2004\nStudio  Evasive Angles\n\nActresses:\n    Avalon [Creampie]\n    Riyanna Cash (as Cash) [Anal Creampie]\n    Jada Kiss [Creampie IR]\n    Kandi Kream [Anal Creampie IR]\n    Kylie Brown [Creampie IR]\n    Nikki Lane (as Nikki) [Creampie IR]\n    Olivia Winters [Creampie]\n\nActors:\n    Brian Pumper\n    Mark Anthony\n    Max Black\n    TT Boy\n\nJada (not fire) kicks the movie off with TT. She's has light skin and long hair pretty sexy. She's 19. She sux him then does all the other standard positions. Doggy, RC etc. We can see she has a really nice pussy when he does doggy. He cums in her RC and we see the cum drip out a little.\n\nNext we have the hottest girl and scene on the disc. Olivia Winters (what a great name!) is a 19 year nasty girl with light skin and big breasts. She is one of the sexiest black girls to come out since Obsession whom I was obsessed with. She has a very sexy attiutde and gets down with Mark Anthony. He does some good positions with her and puts her through the paces. She's got a nasty BJ and when he does CG we can really see her big ass bouncing. She talks a lot of trash too (You're digging me out, she yells) though her enthusiasm is a little lacking. She is the reason I got this DVD.\n\nNext up is Candy Cream. She's a little darker than the previous two girls. She is average, she seems to rely on makeup a little bit to pretty up her face. She looks really young, but she has a big round bubble ass. TT does anal with her too and cums up in her RC.\n\nAvalon is next. She is not that great to look at but she makes up for it with her energy. She takes on big Maxx. They got a good chemistry together and she seems to know how guys like it. Nasty. Maxx cum in her pussy laying down.\n\nCash is the next girl. She is pretty good to look at with a pretty face and tight slim body. She goes with Brian Pumper who is blinging in his scence. Too bad it looks like he just went on a shopping spree on Canal Street! He leaves it on during his scene though perhaps to impress Cash since we know what she is about. SHe does a good BJ and takes anal too. He cums in her ass and she squeezes it out.\n\nLast is Nikki a big tiitied dark skinned girl and Kylie and big assed light skin girl. Kylie is pretty but has tattoos and peircngs in her face which turn me off a little. Mark Anthony starts off by himself and then TT joins him. TT busts in Nikki RC and then Mark give Kylie a nice cream pie lying on her back. \n","torrent":{"xt":"urn:btih:2159a183bb102195200a1f50400db9d57a203aba","amp;dn":"Black+Street+Hookers+Cream+Pies+%234+-+Anal+Ebony+Porn+XXX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2159a183bb102195200a1f50400db9d57a203aba","infoHashBuffer":{"type":"Buffer","data":[33,89,161,131,187,16,33,149,32,10,31,80,64,13,185,213,122,32,58,186]},"announce":[],"urlList":[]}}