{"title":"Steal This Plot: A Writer's Guide to Story Structure and Plagiar","uid":9596617,"size":236533,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:21c9dc25cf963c41206afe11ca615bb11aacf1ab&amp;dn=Steal+This+Plot%3A+A+Writer%27s+Guide+to+Story+Structure+and+Plagiar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1392033365,"description":"This book is not about cemeteries. Nor is it a mystery-suspense story. It is about writing-the craft of writing and telling a tale. It is about how to use other people's stories, and what we are allowed to do with them. The plot of any story is the key. The plot is the story within the story that propels the action and develops the tale. In Hamlet, for instance, the story deals with who will be the rightful king of Denmark, but the plot is concerned with revenge and ambition. The plot is the nucleus of the action, and it is here that the writer must look to form his efforts. In Part One, the authors deal in depth with the structuring and &quot;spicing&quot; of the story. In Part Two, using classic and modern examples they outline 13 common plot movers: Vengeance Catastrophe Love and Hate The Chase Grief and Loss Rebellion Betrayal Persecution Self-Sacrifice Survival Rivalry Discovery (Quest) Ambition showing you how weave it all together in a tapestry of words rich and satisfying to the reader. Worried you'll go too far in your plot thievery? A thorough look at plagiarism and copyright is also included.\n\nCustomer Reviews\n\n24 of 25 people found the following review helpful\nWell written, interesting, guide\nBy Serene on May 15, 2006\nSteal this plot isn't about stealing, its about borrowing ideas from popular fiction to create new stories. This is an older book, with an unremarkable cover that you can probably find only used, but its well worth tracking down if you can find a copy. I like the authors' breakdown of primary plot line and story 'spicer's (an interesting concept I think I will want to use), and the examples the authors give are well written and interesting. On the flipside, I didn't think each motivation needed to be quite so thoroughly explained as motivational forces such as &quot;self-sacrifice&quot; should be well understood by the average reader.\n\nIn particular, I liked the examples the authors gave on how to incorporate Greek/Roman myth into modern writing.\n\n5 stars. Well worth picking up, some aspects a little pedantic, overall good.\nComment Was this review helpful to you? \nYes\nNo\n29 of 32 people found the following review helpful\nSteal This Book--\nBy Kenneth John Atchity on September 3, 2006\nif necessary, but get it onto your shelf of writers' indispensable books. The authors identify the 13 basic story patterns--Vengeance, Catastrophe, Love and Hate, the Chase, Grief and Loss, Rebellion, Betrayal, Persecution, Self-Sacrifice, etc., and draw upon classic examples to illustrate the obligatory beats to each story pattern. First, this will help you identify which pattern your story draws from; then, it will remind you of what you've forgotten--that's making your version of the story not work. Remember T. S. Eliot's comment: &quot;Immature poets borrow. Mature poets steal.&quot; Yes, the Nobles also deal with the issue of &quot;plagiarism,&quot; but that's NOT the focus of this excellent book.","torrent":{"xt":"urn:btih:21c9dc25cf963c41206afe11ca615bb11aacf1ab","amp;dn":"Steal+This+Plot%3A+A+Writer%27s+Guide+to+Story+Structure+and+Plagiar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21c9dc25cf963c41206afe11ca615bb11aacf1ab","infoHashBuffer":{"type":"Buffer","data":[33,201,220,37,207,150,60,65,32,106,254,17,202,97,91,177,26,172,241,171]},"announce":[],"urlList":[]}}