{"title":"WinRAR x86 (32 bit) 5.01 Final+Key {Team EAT} (Alien)","uid":9649743,"size":1770398,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2278dfc1a0820251784f2ce50fbde1150a5154aa&amp;dn=WinRAR+x86+%2832+bit%29+5.01+Final%2BKey+%7BTeam+EAT%7D+%28Alien%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"Alien119","files":-1,"time":1393055503,"description":"WinRAR 5.01 Final\n\n\nWinRAR is a powerful archive manager. RAR files can usually compress content by 8 percent to 15 percent more than ZIP files can. WinRAR is a powerful compression tool with many integrated additional functions to help you organize your compressed archives. It can backup your data and reduce size of email attachments, decompress RAR, ZIP and other files downloaded from Internet and create new archives in RAR and ZIP file format.\n\nWinRAR puts you ahead of the crowd when it comes to compression. By consistently creating smaller archives, WinRAR is often faster than the competition. This will save you disc space, transmission costs AND valuable working time as well. WinRAR is ideal for multimedia files. WinRAR automatically recognizes and selects the best compression method. The special compression algorithm compresses multimedia files, executables and object libraries\n\nFeatures of WinRAR:\n\n- Using WinRAR puts you ahead of the crowd when it comes to compression by consistently making smaller archives than the competition, saving disk space and transmission costs.\n- WinRAR provides complete support for RAR and ZIP archives and is able to unpack CAB, ARJ, LZH, TAR, GZ, ACE, UUE, BZ2, JAR, ISO, 7Z, Z archives.\n- WinRAR offers a graphic interactive interface utilizing mouse and menus as well as the command line interface.\n- WinRAR is easier to use than many other archivers with the inclusion of a special &quot;Wizard&quot; mode which allows instant access to the basic archiving functions through a simple question and answer procedure. This avoids confusion in the early stages of use.\n- WinRAR offers you the benefit of industry strength archive encryption using AES (Advanced Encryption Standard) with a key of 128 bits.\n- WinRAR supports files and archives up to 8,589 billion gigabytes in size. The number of archived files is, for all practical purposes, unlimited.\n- WinRAR offers the ability to create selfextracting and multivolume archives.\nRecovery record and recovery volumes allow to reconstruct even physically damaged archives.\n- WinRAR features are constantly being developed to keep WinRAR ahead of the pack.\n\n\n\n\n\nWhat's new in version 5.01\n\n\n1. RAR 5.0 archives can include an optional quick open information\ncontrolled with -qo[-|+] switch or &quot;Quick open information&quot; options\ngroup in archiving dialog. It allows to open the archive contents\nin WinRAR faster.\n\nThis version provides better update performance for archives\ncontaining both quick open information and service records,\nsuch as NTFS file security. Also default parameters of quick open\ninformation are optimized to achieve faster open time for such archives.\n\n2. Bugs fixed:\n\na) &quot;Find&quot; command could fail when searching text string in .7z archives;\n\nb) when opening RAR 5.0 archive with encrypted file names stored\nin another such archive, WinRAR could issue an erroneous message\nthat password is incorrect. It happened only if passwords to inner\nand outer archives were different. It did not affect extraction,\nall files could be unpacked regardless of this message;\n\nc) option &quot;Use for all archives&quot; in password dialog did not suppress\nadditional password requests for RAR 5.0 archives with encrypted\nfile names;\n\nd) WinRAR address bar did not process correctly environment variable\nbased paths, such as %temp%;\n\ne) storing NTFS file security and alternate data streams did not work\nfor file pathnames longer than 260 characters;\n\nf) &quot;Test&quot; command could erroneously report damaged data in valid\nrecovery record if only a part of files in RAR 5.0 archive\nwas tested. It did not happen if entire archive contents was tested;\n\ng) &quot;Test&quot; command erroneously reported errors when verifying\nRAR 4.x Unix symbolic links;\n\nh) WinRAR &quot;View&quot; command did not work for files inside of BZIP2 archives;\n\ni) if &quot;High precision modification time&quot; option in archiving dialog\nwas turned off, WinRAR did not store the modification time at all\ninstead of storing a lower precision time;\n\nj) destination paths containing . or .. component did not work\nwhen extracting non-RAR archives in WinRAR command line mode;\n\nk) WinRAR failed to unpack multivolume CAB archives.\n\n\n\nSupported OS:\n\nWindows 7/8/vista/xp\n\n\n\nHomepage: \n &lt;a href=&quot;\nhttp://www.rarlab.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.rarlab.com/&lt;/a&gt;\n\n\n\nInstall Notes:\n\n1] Install the app.\n\n2] Copy the file 'RarReg.key' to directory C:/Programe file/WinRaR. \n\n\nDone you got the full version....\n\n\n\nTested And Working...\nScanned (With Kaspersky) And 100% Clean.\n","torrent":{"xt":"urn:btih:2278dfc1a0820251784f2ce50fbde1150a5154aa","amp;dn":"WinRAR+x86+%2832+bit%29+5.01+Final%2BKey+%7BTeam+EAT%7D+%28Alien%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2278dfc1a0820251784f2ce50fbde1150a5154aa","infoHashBuffer":{"type":"Buffer","data":[34,120,223,193,160,130,2,81,120,79,44,229,15,189,225,21,10,81,84,170]},"announce":[],"urlList":[]}}