{"title":"Story Physics - Larry Brooks","uid":8980842,"size":3813721,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:22a875380bd72e96d48c1372ad3c8ab67e984d2f&amp;dn=Story+Physics+-+Larry+Brooks&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":2,"uploader":"ZamKhan","files":-1,"time":1380562945,"description":"Story Physics: Harnessing the Underlying Forces of Storytelling\nby Larry Brooks\n\nLearn how to make your story soar!\nIn the physical world, gravity, force, and other elements of physics govern your abilities and can be utilized to enhance your every movement. In the world of writing, story physics can be harnessed in much the same way to make your novel or screenplay the best it can be. In Story Physics, best-selling author Larry Brooks introduces you to six key literary forces that, when leveraged in just the right way, enable you to craft a story that's primed for success--and publication.\n\nInside Story Physics, you'll learn how to:\n\nUnderstand and harness the six storytelling forces that are constantly at work in your fiction.\nTransform your story idea into a dramatically compelling concept.\nOptimize the choices you make in terms of character, conflict, subplot, subtext, and more to render the best possible outcome.\nThese literary forces will elevate your story above the competition and help you avoid the rejection pile. With Story Physics, you won't just give your story wings--you'll teach it how to fly.\n&quot;Larry Brooks speaks my kind of language about story. Any writer, even those trucking in the world of nonfiction, will benefit from going deeper into the physics of storytelling as Brooks explains in these pages.&quot; - James Scott Bell, best-selling author of Plot &amp; Structure\n\n&quot;Larry Brooks has done it again! If you liked Story Engineering, I suspect you're going to love Story Physics, which dives even deeper into the essence of story. Story Physics is an essential addition to every novelist's bookshelf.&quot; - Randy Ingermanson, author of Writing Fiction for Dummies","torrent":{"xt":"urn:btih:22a875380bd72e96d48c1372ad3c8ab67e984d2f","amp;dn":"Story+Physics+-+Larry+Brooks","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22a875380bd72e96d48c1372ad3c8ab67e984d2f","infoHashBuffer":{"type":"Buffer","data":[34,168,117,56,11,215,46,150,212,140,19,114,173,60,138,182,126,152,77,47]},"announce":[],"urlList":[]}}