{"title":"Real Subliminal - Extreme Self Motivation","uid":11770480,"size":38438679,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:22ea79d8127d3a22381d6346416ea90306730db2&amp;dn=Real+Subliminal+-+Extreme+Self+Motivation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"acer47x","files":5,"time":1427053760,"description":"Increase your self motivation to extreme levels with this powerful subliminal mp3 album and look forward to a proactive, successful future!\n\nDo you find it hard to motivate yourself to do the things you know need doing?\nDo you find it even harder if the task is not enjoyable?\nDo you find yourself starting a project full of enthusiasm only for your motivation and interest to drop after the initial buzz?\n\nDo you find your levels of motivation at work are low or erratic at best?\nDo you always put things off until the last minute?\nIs your lack of motivation holding you back from getting the success you want?\nDo you wonder why some people do not seem to lack motivation and pursue everything with an intense drive and limitless motivation - without getting distracted or giving up half way through?\n\nThe only difference between these people you is your state of mind! You do not need to continue the rest of your life with this missing drive and lack of motivation! Use the power of subliminal messaging album to target your subconscious mind - the root of your issues - increase your levels of motivation from the inside! Here's how this album will help you:\n\nAchievement of excellence through motivation: Acquire the mental state and qualities of those people who are naturally motivated and get success from life.\nApproach your entire life with a passion, drive, energy and motivation to make the most of everything and achieve success.\nIncrease your levels of discipline to stick to something past the initial buzz, or when things become difficult.\nCharge your desires and level of ambition to fuel your motivation, and not settle for second best.\nStop procrastination: Stop putting things off and learn to simply act straight away, as and when you need to.\nChange the way your mind works to start enjoying getting things done and enjoy the rewards of being highly motivated.\nImagine how your life will be in the future if you do not increase your motivation and productivity - do you want to be stuck in the same pattern of results? Or do you want to make a success of your life? Increase your motivation, drive and ambition with this subliminal mp3 album - look forward to a brighter, more productive, proactive, and successful future!","torrent":{"xt":"urn:btih:22ea79d8127d3a22381d6346416ea90306730db2","amp;dn":"Real+Subliminal+-+Extreme+Self+Motivation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22ea79d8127d3a22381d6346416ea90306730db2","infoHashBuffer":{"type":"Buffer","data":[34,234,121,216,18,125,58,34,56,29,99,70,65,110,169,3,6,115,13,178]},"announce":[],"urlList":[]}}