{"title":"GEARS OF WAR 3 - RROD - XBOX360 - REGION FREE - XGD3 {BOOBSMAN} ","uid":6714590,"size":8377715738,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:230b0a83927bf56d018c51b7e53f6023d233c95f&amp;dn=GEARS+OF+WAR+3+-+RROD+-+XBOX360+-+REGION+FREE+-+XGD3+%7BBOOBSMAN%7D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":5,"uploader":"boobsman","files":87,"time":1317493188,"description":"THIS IS AN XGD3 ISO AND WILL ONLY BE PLAYABLE WHEN LT2.0 IS RELEASED!!!\n\nIn Gears Of War 3 players fight on as Marcus Fenix, the grizzled war hero and leader of Delta Squad. Eighteen months after the fall of the last human city in &quot;Gears of War 2,&quot; the war against the Locust rages on, but a new enemy has emerged. Deep beneath the surface, a fearsome new threat, the Lambent, is infecting the planet from within. With survivors scattered and civilization in ruins, time is running out for Marcus and his comrades as they take up their Lancers to make one last push that will ultimately decide the fate of humanity.\n\nEnthralling cinematic story: Experience the epic finale of the Gears of War trilogy and fight alongside Delta Squad to save humanity. Discover the fate of Marcus and his comrades in this immersive and emotionally engaging story.\n\nUnparalled gameplay: Gears Of War 3 captivates players in an intense action gamer. The latest chapter introduces new playable COG characters and ferocious new enemies.\n\nAmazing visuals: Gears Of War 3 pushes the envelope for stunning visuals on Xbox 360. The game delivers improved graphics, animation and lighting that immerse players in the destroyed beauty of the rich environments.\n\nExplosive multiplayer action: One of the definitive multiplayer experiences on Xbox LIVE, Gears Of War 3 features new cooperative and competitive multiplayer experiences for all types of players.\n\nFour player campaign co-op: Featuring multiple playable characters, including female Gears, the introduction of the four player cooperative campaign mode brings Delta Squad to life. Players and their buddies can fight as brothers-in-arms against the monstrous Locust and Lambent threats in a desperate bid to save humanity.\n\nBeast mode: Introducing a new five player cooperative multiplayer experience in the &quot;Gears&quot; saga, Beast mode lets players assume the role of the Locust army, taking on waves of humans (including Marcus, Dom and the rest of Delta Squad). With up to four friends on Xbox LIVE, the goal is to wipe out the ground walkers who advance with increasing strength and ruthless force.\n\nHorde mode: Evolving the cooperative multiplayer mode pioneered in the previous title, Horde in Gears Of War 3 will feature more gameplay upgrades and distinct new challenges as players work together to take on wave after wave of Locust enemies.\n\nCompetitive multiplayer: The award-winning multiplayer experience continues with new maps and game types that will bring the competition to a whole new level.\n\nPLEASE BE AWARE THIS IS A SCENE RELEASE OF THE GAME BUT IT IS UNTESTED AS LT2.0 HAS NOT BEEN RELEASED YET!!!\n","torrent":{"xt":"urn:btih:230b0a83927bf56d018c51b7e53f6023d233c95f","amp;dn":"GEARS+OF+WAR+3+-+RROD+-+XBOX360+-+REGION+FREE+-+XGD3+%7BBOOBSMAN%7D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"230b0a83927bf56d018c51b7e53f6023d233c95f","infoHashBuffer":{"type":"Buffer","data":[35,11,10,131,146,123,245,109,1,140,81,183,229,63,96,35,210,51,201,95]},"announce":[],"urlList":[]}}