{"title":"Polymer Science and Technology - Robert O. Ebewele","uid":12432121,"size":3532694,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2324449c66d352d5e2f00ffe8d1fb9a8cb8cc295&amp;dn=Polymer+Science+and+Technology+-+Robert+O.+Ebewele&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"clouderone","files":1,"time":1442474189,"description":"Polymer Science and Technology - Robert O. Ebewele (CRC, 2000).pdf\n\nISBN 0-8493-8939-9\n\nYour search for the perfect polymers textbook ends here - with Polymer Science and Technology. By incorporating an innovative approach and consolidating in one volume the fundamentals currently covered piecemeal in several books, this efficient text simplifies the learning of polymer science. \n\nThe book is divided into three main sections: polymer fundamentals; polymer formation and conversion into useful articles; and polymer properties and applications. Polymer Science and Technology emphasizes the basic, qualitative understanding of the concepts rather than rote memorization or detailed mathematical analysis. Since the book focuses on the ultimate property of the finished product, it minimizes laborious descriptions of experimental procedures used for the characterization of polymers. Instead, the author highlights how the various stages involved in the production of the finished product influence its properties. Well-organized, clear-cut, and user-friendly, Polymer Science and Technology is an outstanding textbook for teaching junior and senior level undergraduates and first year graduate students in an introductory course covering the challenging subject of polymers","torrent":{"xt":"urn:btih:2324449c66d352d5e2f00ffe8d1fb9a8cb8cc295","amp;dn":"Polymer+Science+and+Technology+-+Robert+O.+Ebewele","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2324449c66d352d5e2f00ffe8d1fb9a8cb8cc295","infoHashBuffer":{"type":"Buffer","data":[35,36,68,156,102,211,82,213,226,240,15,254,141,31,185,168,203,140,194,149]},"announce":[],"urlList":[]}}