{"title":"Hot Chip - Discography (2004-2013) [FLAC]","uid":8906868,"size":6134125678,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:234908649db52e4fda24cdc158975e58d62d2b21&amp;dn=Hot+Chip+-+Discography+%282004-2013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":3,"uploader":"politux","files":247,"time":1378928387,"description":"  Hot Chip - Discography (2004-2013) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Indie Electronic, Alternative Dance\n  Source: CD, WEB\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  2004 Coming On Strong\n  2006 The Warning\n  2006 The Warning (Japan)\n  2008 Made in the Dark\n  2008 Made in the Dark (Japan)\n  2010 Live 10th November London Alexandra Palace\n  2010 One Life Stand\n  2012 In Our Heads\n  2012 In Our Heads (Expanded Edition)\n  2013 Dark &amp; Stormy\n\n  Singles and EP's\n\n  2006 B-Sides\n  2006 Boy From School\n  2006 Colours\n  2006 Over and Over\n  2006 Over and Over (Promo)\n  2008 One Pure Thought\n  2008 Ready for the Floor\n  2008 Touch Too Much &amp; Hold On\n  2010 One Life Stand - The Remixes\n\n  Hailing from London, Hot Chip entered the picture with the release of their 2000 debut, Mexico. The EP was issued by Victory Garden Records, a label owned and operated by members of London's resident lo-fi psychedelic rock institution Southall Riot. The Mexico EP was a hypnotic wash of subtle -- nearly subliminal -- pulse-like techno beats, acoustic guitars, and plinky pianos, but the vocals were the true star of the show (no small feat in a musical climate overrun with disaffected Lou Reed-esque mumblers and bland Eddie Vedder impersonators). The voices of Alexis Taylor and Joe Goddard are a fine study in contrast. Taylor offers dreamy, effortless falsettos that cut to the heart of the beauty of performers like Jeff Buckley and Nick Drake (minus any of the pretentiousness of Radiohead or even Coldplay, or the bland vocal acrobatics of Remy Zero). Meanwhile, scattered throughout the record (and in the occasional duet), Goddard offers a tone that sounds a bit more world-weary and at times almost gruff in comparison to Taylor, calling to mind Damon Albarn's cool monotone tendencies.\n\n  Self-released by Hot Chip in 2002, Sanfrandisco E-Pee showed the band dabbling in more playful sounds, from the beatbox dubbing of the title track to the closing notes of &quot;Fanta,&quot; in which Taylor pleads with the listener to &quot;make sounds of the summer.&quot; There are moments of gorgeous melancholy as well, but on the whole, the album feels a bit more hopeful than Mexico did. The group signed to revered N.Y.C. record label DFA in 2005 and released the Over and Over EP, as well as the excellent 2006 full-length The Warning. Hot Chip kept busy in 2007 by supporting The Warning with singles and consistent touring, and released a DJ-Kicks mix album. Late that year, the single &quot;Ready for the Floor&quot; heralded the arrival of Made in the Dark, which featured some of the band's most focused grooves and poppiest melodies to date. The mellower One Life Stand followed in 2010, along with a remix collection later that year. Hot Chip left DFA for Domino, which released the more uptempo, experimental In Our Heads in 2012.","torrent":{"xt":"urn:btih:234908649db52e4fda24cdc158975e58d62d2b21","amp;dn":"Hot+Chip+-+Discography+%282004-2013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"234908649db52e4fda24cdc158975e58d62d2b21","infoHashBuffer":{"type":"Buffer","data":[35,73,8,100,157,181,46,79,218,36,205,193,88,151,94,88,214,45,43,33]},"announce":[],"urlList":[]}}