{"title":"Malmhaus aka Metalhead","uid":10505858,"size":1451563026,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:234fbd28efdd7c290df2b3262bf4f3ce913a8543&amp;dn=Malmhaus+aka+Metalhead&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"AlexWitchfinder","files":-1,"time":1404766774,"description":"Its the year 1970. As Black Sabbath records their first album and marks the birth of Heavy Metal, Hera Karlsdottir is born on the cowshed floor at her parents farm in rural Iceland. The years of her youth are carefree until tragedy strikes. Her older brother is killed in an accident and Hera blames herself for his death. In her grief she finds solace in the dark music of Heavy Metal and dreams of becoming a rock star. As the years pass on the farm, buried under a shroud of snow and a looming ominous mountain, Hera practices her guitar and dreams of forming a band. She is a rebellious, misunderstood delinquent in her early twenties who can't help but get into trouble. She dreams of escaping out into the world but somehow always ends up at her own doorstep. When her childhood friend returns intent on marrying her and a young priest moves to the farming community, the wheels of fate start turning. Hera has to grow up, find her own voice and realize she can't run away her whole life.\n\n\nDVD Rip.\nSwedish, English and Portuguese (BR) subtitles.\nThe English and Portuguese subtitles were translated by me from the original swedish one.","torrent":{"xt":"urn:btih:234fbd28efdd7c290df2b3262bf4f3ce913a8543","amp;dn":"Malmhaus+aka+Metalhead","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"234fbd28efdd7c290df2b3262bf4f3ce913a8543","infoHashBuffer":{"type":"Buffer","data":[35,79,189,40,239,221,124,41,13,242,179,38,43,244,243,206,145,58,133,67]},"announce":[],"urlList":[]}}