{"title":"SecurityTube - Wireless LAN Security and Penetration Testing Meg","uid":8268130,"size":4550896917,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:23554b42bb95e01e01c890554cb57351606cdaf6&amp;dn=SecurityTube+-+Wireless+LAN+Security+and+Penetration+Testing+Meg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":2,"uploader":"NepsterJay","files":117,"time":1363548647,"description":"This Megaprimer will provide a highly technical and in-depth treatment of WLAN security and hacking. The emphasis will be to provide the viewers with a deep understanding of the principles behind various attacks and not just a quick how-to guide on publicly available tools. We will start our journey with the very basics by dissecting WLAN packet headers with Wireshark, then graduate to the next level by cracking WEP, WPA/WPA2 and then move on to real life challenges like orchestrating Man-in-the-Middle attacks, attacking WPA-Enterprise networks runnng EAP-TTLS, PEAP etc. and hacking isolated Wireless Clients.\n\nThe Megaprimer is over 40 videos and 12 hours+ long! We've ensured that we go to the absolute depths of each and every topic, not just in theory, but with full practical demonstrations. We hope you will enjoy this!\n\nAs the security field is every changing, so will this Megaprimer. As newer attacks, tools and techniques are discovered, we will be constantly updating this Megaprimer, so please keep checking for course updates.","torrent":{"xt":"urn:btih:23554b42bb95e01e01c890554cb57351606cdaf6","amp;dn":"SecurityTube+-+Wireless+LAN+Security+and+Penetration+Testing+Meg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23554b42bb95e01e01c890554cb57351606cdaf6","infoHashBuffer":{"type":"Buffer","data":[35,85,75,66,187,149,224,30,1,200,144,85,76,181,115,81,96,108,218,246]},"announce":[],"urlList":[]}}