{"title":"The Woodworker &amp; Woodturner- August 2016 (gnv64)","uid":15182451,"size":21835259,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2362cf1bc48deb6fc66498ae7e01904d9ac947bc&amp;dn=The+Woodworker+%26amp%3B+Woodturner-+August+2016+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"gnv65","files":4,"time":1467467577,"description":"The Woodworker &amp; Woodturner- August 2016\r\nEnglish | 92 Pages | True PDF | 20.8 mb\r\n\r\nWOODWORK\r\n14 Keep on trucking! - Taking influence from some downloadable free online plans, Derek Lane sets about making his Mercedes truck build, with a few modifications to add a personal flourish\r\n32 Waste not, want not Converting logs and large sections of timber into boards requires just a few simple techniques – and a willing bandsaw! Dave Roberts explains\r\n36 Sshh! It’s a secret catch - Tony ‘Bodger’ Scott shows how to make a hidden lock for any box\r\n38 Time well spent - Expect the unexpected when judging how long a job will take, advises Stephen Simmons\r\n40 Veneering on the edge - In this month’s archive resource we look at decorative veneering, specifically cross or edgebanding\r\n44 Sliding sash windows - This exercise in traditional joinery could help the competent woodworker win his bread and butter, says Mike Jordan\r\n52 Making a simple fi tted wardrobe: the basics – part 1\r\nThe Editor starts work on a simple fitted wardrobe and looks for the easiest ways to achieve a professional result\r\n54 Back to school - Ray Harding thinks there’s much to learn from school woodworking lessons. We agree… And if you’ve got a woodworking project you remember from your school days, we’d love to hear about it\r\n66 When it all goes wrong Stephen Simmons guides us through the art of correcting those blunders we all know and loathe\r\n90 From the Royal Air Force to factory life - Carrying on with a new series discussing his cabinetmaking career at the busy Harris Lebus factory back in the 1950s, Peter Baker shares more of his tales with us here\r\n\r\nTURNING\r\n26 A decorative touch - Ian Wilkie has a wide range of ideas for various turned bud vase shapes, so why not try turning your own and adding a decorative touch to your home?\r\n57 A piece of cake - Bob Chapman makes use of some cut-price glass domes and decides to turn a cake stand, which could also double up as a cheese dome if you prefer\r\n68 Rethink &amp; remake - Fancy a change from turning timber? Sarah Thirlwell shows you how you can turn laminated paper and cork boxes\r\n\r\nON TEST\r\n78 Clarke IG2000 inverter generator\r\n80 Charnwood W325 heavy-duty mortiser\r\n82 Milwaukee M12CHZ-0 Hackzall\r\n84 Draper Venom hand saws\r\n\r\nREGULARS\r\n3 Welcome\r\n8 AOB &amp; diary\r\n11 Timber directory\r\n13 News from D&amp;M Tools\r\n25 Readers’ letters\r\n40 Archive\r\n64 Subscriptions\r\n89 Marketplace\r\n \nhttps://s31.postimg.org/gppk5s9gb/The_Woodworker_August_2016.jpg","torrent":{"xt":"urn:btih:2362cf1bc48deb6fc66498ae7e01904d9ac947bc","amp;dn":"The+Woodworker+%26amp%3B+Woodturner-+August+2016+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2362cf1bc48deb6fc66498ae7e01904d9ac947bc","infoHashBuffer":{"type":"Buffer","data":[35,98,207,27,196,141,235,111,198,100,152,174,126,1,144,77,154,201,71,188]},"announce":[],"urlList":[]}}