{"title":"Audio Hijack 3.2.0. (Mac OSX)","uid":12424341,"size":16787983,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:236922263319dd4e16dc17555d03ede37a6a5631&amp;dn=Audio+Hijack+3.2.0.+%28Mac+OSX%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"CHibizoid","files":3,"time":1442352946,"description":"From MacTake.com\n\n\t\nQuote:\nAudio Hijack (was Audio Hijack Pro) drastically changes the way you use audio on your computer, giving you the freedom to listen to audio when you want and how you want. Record and enhance any audio with Audio Hijack - it's the cornerstone of your digital audio experience.\n\nAudio Hijack will allow you to record any application's audio, from Internet streams to DVD audio and everywhere in between. If your machine can play it, Audio Hijack can record it. And that's not all - Audio Hijack will also enhance any audio, unsing industry-standard VST and AudioUnit audio effects to make your music sound incredible. Record. Enhance. Enjoy!\n\nWHAT'S NEW\nVersion 3.2.0:\n\n- Major Enhancement: The Time Shift Block has been updated with a more powerful new interface. Its popover now offers controls for 3, 10, and 30 second jumps. Better still, you can now access Time Shift from within any application, with global keyboard shortcuts. Audio Hijack's preferences now enable you to set hotkeys for pausing and resuming, jumping back and forward 10 seconds, and jumping to live.\n- Major Enhancement: The Import and Export of Sessions has been greatly improved. Share Sessions with friends via the Session menu. Export your own Sessions to share, or import Sessions from others!\n- Major Enhancement: The new Peak/RMS Meters Block provides precisely calibrated monitoring, with both RMS and Peak meters, a peak hold line, and a clip indicator.\n- Major Enhancement: The new Sync Block lets you add a precise delay to the audio, of up to 1000 ms (1 second), per Block.\n- Major Enhancement: The Instant On component has been updated to version 8.1, with initial support for Mac OS X 10.11 (El Capitan).\n- Enhancement: The &quot;Session Name&quot; and &quot;File Counter&quot; variables are once again supported, for use in file names and metadata.\n- Enhancement: Tags are now fully supported in FLAC files, and the Recordings tab now properly supports editing tags on FLAC audio files.\n- Minor Enhancement: Popover positions, as well as torn-off and pinned states, are now remembered and restored between launches.\n- Minor Enhancement: The Block library has been updated with a new Advanced section, and the Meters section has been moved up.\n- Minor Enhancement: The new Peak/RMS Meter is now used in the VOIP template.\n- Minor Enhancement: The Genre tag's popup menu now features a &quot;&quot; option, to leave the field empty.\n- Minor Enhancement: Meters now run at a full 60 fps. Smooth, like butter!\n- Bug Fix: Audio playback of FLAC files in the Recordings tab now works as expected.\n- Bug Fix: Numeric tag fields can now be empty, rather than forcing a zero.\n- Bug Fix: Error messages for recording issues have been improved. We don't expect that you'll ever see those anyway, though.\n- Bug Fix: Deleted files now properly stop playing from the Recordings tab.\n- Bug Fix: Improvements to the scheduler to handle rare edge cases will provide even more reliable timed recording.\n- Bug Fix: When editing a tag in the Recordings tab, the tag will now be saved correctly even if action is taken while the tag is still in focus.\n- Bug Fix: Repeating Timer descriptions now display days of week in the same order as the actual day of week buttons. It was pretty goofy that this wasn't always the case.\n- Bug Fix: Popovers are now compatible with Mac OS X 10.11.\n- Other: Audio Hijack now correctly requires Instant On when capturing QuickTime Player on Mac OS X 10.11 (El Capitan).\n- Other: All Library sections except for Sources and Outputs now default to closed","torrent":{"xt":"urn:btih:236922263319dd4e16dc17555d03ede37a6a5631","amp;dn":"Audio+Hijack+3.2.0.+%28Mac+OSX%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"236922263319dd4e16dc17555d03ede37a6a5631","infoHashBuffer":{"type":"Buffer","data":[35,105,34,38,51,25,221,78,22,220,23,85,93,3,237,227,122,106,86,49]},"announce":[],"urlList":[]}}