{"title":"[FSX/P3D] Aerosoft PBY Catalina X v1.20 (New Build)","uid":10314014,"size":414420016,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:23824e3ef01932179f3a6546661defbba7545507&amp;dn=%5BFSX%2FP3D%5D+Aerosoft+PBY+Catalina+X+v1.20+%28New+Build%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"leopard87","files":-1,"time":1402226305,"description":"I managed to find Aerosoft's PBY Catalina X v1.20 somewhere on the internet, but it turned out that v1.20 full installer is buggy as hell and needs some corrections before it works as expected. I fixed the problems as much as I could and built the package into a custom installer for you pirates. Aside from a very small niggle about how the mission is displayed under the mission menu, the package should be bug-free now. The new installer also supports P3D v1 and P3D v2, but remember that this is a fully experimental mod and nothing is guaranteed. Try the package in P3D at your own risk!\n\nIn addition to the triple installer for PBY Catalina X, I have also added other goodies such as a new sound set, more bug fixes for P3D v2 and latest version of the Visual C++ Redistributables to the package to get you going at full pace as soon as possible. Read the Readme file included with the upload first for more info; it is probably more than all you will ever need as long as you don't have something wrong in your hardware/software setup. I have a low upload speed, so I can't keep seeding this forever. If you like this package, please seed it for some time.\n\n\nHUGE THANKS to the original releaser for his generousity!\n\nSeed and enjoy, pirates!","torrent":{"xt":"urn:btih:23824e3ef01932179f3a6546661defbba7545507","amp;dn":"%5BFSX%2FP3D%5D+Aerosoft+PBY+Catalina+X+v1.20+%28New+Build%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23824e3ef01932179f3a6546661defbba7545507","infoHashBuffer":{"type":"Buffer","data":[35,130,78,62,240,25,50,23,159,58,101,70,102,29,239,187,167,84,85,7]},"announce":[],"urlList":[]}}