{"title":"Wandering Mind: What the Brain Does When You're Not Looking","uid":11931939,"size":2641937,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2387f1f58b429f238108786660edd8ea95aa5365&amp;dn=Wandering+Mind%3A+What+the+Brain+Does+When+You%27re+Not+Looking&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"bookzilla","files":1,"time":1431825428,"description":"The Wandering Mind: What the Brain Does When You're Not Looking (2014) epub\n\nThe brain is never inactive, the mind never still. For at least half of our lives, our minds are wandering away from the chores of life - the homework, the tax return, the board meeting, the meal to be cooked, even driving the car ...In this book, I wander through the various hills and valleys of mind-wandering, with the hope of giving it a better name. While psychologists write bestsellers about humans' smarter side - language, cognition, consciousness - and self-help gurus harangue us to be attentive and mindful, we all know that much of the time our minds are just goofing off. So what does the brain do when you're not looking? Rooted in neuroscience, psychology and evolutionary biology but written with Corballis's signature wit and wisdom, The Wandering Mind takes us into the world of the 'default-mode network' to tackle the big questions. What do rats dream about? What's with our fiction addiction? Is the hippocampus where free will takes a holiday? And does mind-wandering drive creativity? In Pieces of Mind, Michael Corballis took 21 short walks around the human brain. In The Wandering Mind he stretches out for a longer hike into those murky regions of the brain where dreams and religion, fiction and fantasy lurk","torrent":{"xt":"urn:btih:2387f1f58b429f238108786660edd8ea95aa5365","amp;dn":"Wandering+Mind%3A+What+the+Brain+Does+When+You%27re+Not+Looking","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2387f1f58b429f238108786660edd8ea95aa5365","infoHashBuffer":{"type":"Buffer","data":[35,135,241,245,139,66,159,35,129,8,120,102,96,237,216,234,149,170,83,101]},"announce":[],"urlList":[]}}