{"title":"The Timeless Way of Building and A Pattern Language","uid":6347643,"size":227897499,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:24481aee9a67a8cf186fd4aa995630a83604b828&amp;dn=The+Timeless+Way+of+Building+and+A+Pattern+Language&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"Supaiku","files":4,"time":1303899494,"description":"My interest in these books came through a reference by Bill Mollison who stated these books as influences in his contribution to the idea of Permaculture and sustainable development.\n\nThe Timeless Way of Building\nChristopher Alexander\n\nReview\n&quot;Excellent text for architectural theory and design--a must for design students.&quot;--Brad Grant, California Polytechnic State University \n\nProduct Description\nThis volume provides the opening work in Christopher Alexander's seminal trilogy on architecture (continued in A Pattern Language and The Oregon Experiment). Here he provides a fascinating introduction to the ideas behind the succeeding two books.\nSee all Editorial Reviews\nProduct Details\n\n    * Hardcover: 552 pages\n    * Publisher: Oxford University Press (1979)\n    * Language: English\n    * ISBN-10: 9780195024029\n    * ISBN-13: 978-0195024029\n    * ASIN: 0195024028\n\n\n\nA Pattern Language: Towns, Buildings, Construction \nChristopher Alexander\n\nThe second of three books published by the Center for Environmental Structure to provide a &quot;working alternative to our present ideas about architecture, building, and planning,&quot; A Pattern Language offers a practical language for building and planning based on natural considerations. The reader is given an overview of some 250 patterns that are the units of this language, each consisting of a design problem, discussion, illustration, and solution. By understanding recurrent design problems in our environment, readers can identify extant patterns in their own design projects and use these patterns to create a language of their own. Extraordinarily thorough, coherent, and accessible, this book has become a bible for homebuilders, contractors, and developers who care about creating healthy, high-level design.\nReview\n&quot;A wise old owl of a book, one to curl up with in an inglenook on a rainy day.... Alexander may be the closest thing home design has to a Zen master.&quot;--The New York Times\n\n&quot;A classic. A must read!&quot;--T. Colbert, University of Houston\n\n&quot;The design student's bible for relativistic environmental design.&quot;--Melinda La Garce, Southern Illinois University\n\n&quot;Brilliant....Here's how to design or redesign any space you're living or working in--from metropolis to room. Consider what you want to happen in the space, and then page through this book. Its radically conservative observations will spark, enhance, organize your best ideas, and a wondrous home, workplace, town will result.&quot;--San Francisco Chronicle\n\n&quot;The most important book in architecture and planning for many decades, a landmark whose clarity and humanity give hope that our private and public spaces can yet be made gracefully habitable.&quot;--The Next Whole Earth Catalog\n\n\nProduct Details\n\n    * Hardcover: 1171 pages\n    * Publisher: Oxford University Press (1977)\n    * Language: English\n    * ISBN-10: 0195019199\n    * ISBN-13: 978-0195019193","torrent":{"xt":"urn:btih:24481aee9a67a8cf186fd4aa995630a83604b828","amp;dn":"The+Timeless+Way+of+Building+and+A+Pattern+Language","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24481aee9a67a8cf186fd4aa995630a83604b828","infoHashBuffer":{"type":"Buffer","data":[36,72,26,238,154,103,168,207,24,111,212,170,153,86,48,168,54,4,184,40]},"announce":[],"urlList":[]}}