{"title":"John Grisham-The Litigators","uid":12965409,"size":333719260,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:244c2fa43daf5e9af919d1b605dd7dc5492c655b&amp;dn=John+Grisham-The+Litigators&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"twocows","files":12,"time":1449885040,"description":"John Grisham-The Litigators\r\n\r\n\r\nThe partners at Finley &amp; Figg—all two of them—often refer to themselves as &quot;a boutique law firm.&quot; Boutique, as in chic, selective, and prosperous. They are, of course, none of these things. What they are is a two-bit operation always in search of their big break, ambulance chasers who've been in the trenches much too long making way too little. Their specialties, so to speak, are quickie divorces and DUIs, with the occasional jackpot of an actual car wreck thrown in. After twenty plus years together, Oscar Finley and Wally Figg bicker like an old married couple but somehow continue to scratch out a half-decent living from their seedy bungalow offices in southwest Chicago.\r\nAnd then change comes their way. More accurately, it stumbles in. David Zinc, a young but already burned-out attorney, walks away from his fast-track career at a fancy downtown firm, goes on a serious bender, and finds himself literally at the doorstep of our boutique firm. Once David sobers up and comes to grips with the fact that he's suddenly unemployed, any job—even one with Finley &amp; Figg—looks okay to him.\r\nWith their new associate on board, F&amp;F is ready to tackle a really big case, a case that could make the partners rich without requiring them to actually practice much law. An extremely popular drug, Krayoxx, the number one cholesterol reducer for the dangerously overweight, produced by Varrick Labs, a giant pharmaceutical company with annual sales of $25 billion, has recently come under fire after several patients taking it have suffered heart attacks. Wally smells money.\r\nA little online research confirms Wally's suspicions—a huge plaintiffs' firm in Florida is putting together a class action suit against Varrick. All Finley &amp; Figg has to do is find a handful of people who have had heart attacks while taking Krayoxx, convince them to become clients, join the class action, and ride along to fame and fortune. With any luck, they won't even have to enter a courtroom!\r\nIt almost seems too good to be true.\r\nAnd it is","torrent":{"xt":"urn:btih:244c2fa43daf5e9af919d1b605dd7dc5492c655b","amp;dn":"John+Grisham-The+Litigators","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"244c2fa43daf5e9af919d1b605dd7dc5492c655b","infoHashBuffer":{"type":"Buffer","data":[36,76,47,164,61,175,94,154,249,25,209,182,5,221,125,197,73,44,101,91]},"announce":[],"urlList":[]}}