{"title":"Audacity - 2.0.6 - Mac OS X (PPC/x86)","uid":11138688,"size":32355392,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:24a1b1d03cd5705a3a10070cd8babd2ab1e5dd69&amp;dn=Audacity+-+2.0.6+-+Mac+OS+X+%28PPC%2Fx86%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"The_Doctor-","files":1,"time":1412140963,"description":"Version 2.0.6 of Audacity for Mac OS X 10.4+ (PPC/x86).\n\nAudacity is free, open source, cross-platform software for recording and editing sounds.\n\nOfficial site: http://audacity.sourceforge.net/\n\nThis version includes help files.\n\nPlease seed for as long as you can.\n\n\n\nChanges in 2.0.6\n\nImprovements\n\nInterface:\n\n    Redesigned, searchable Keyboard Preferences with Tree, Name and Key views.\n    Edit Menu: &quot;Cut&quot; and &quot;Delete&quot; are now in the top level of the menu.\n    Transport Menu now includes &quot;Play/Stop&quot; and &quot;Play/Stop and Set Cursor&quot; (use Keyboard Preferences to create shortcuts for &quot;Play&quot; and &quot;Stop&quot;).\n    Tracks Menu now includes &quot;Mix and Render to New Track&quot;.\n    Track Drop-Down Menu now has Move Track To Top and Move Track To Bottom.\n    New right-click menu choice &quot;Delete Label&quot; to remove single labels.\n    &quot;Snap To&quot; now offers choice of snap to the &quot;closest&quot; or &quot;prior&quot; position. Note: the previous &quot;Snap To On&quot; keyboard shortcut will no longer work.\n    &quot;Snap To&quot; settings are now independent for each project.\n\n\n\nEffects:\n\n    Truncate Silence: redesigned with simpler option &quot;Truncate Detected Silence&quot; to shorten to the specified length without compressing silence.\n    VST effects: New &quot;Settings&quot; dialog lets you specify buffer size (for faster processing) and enable buffer delay compensation (to prevent inserted silence). Compensation may cause a crash in a few plug-ins.\n    VST effects now support standard FXP presets.\n    LV2 effects are now supported on all platforms (textual interface only).\n    Import or export using FFmpeg now requires FFmpeg 1.2 or later (or libav 0.8 or later). For recommended downloads of recent FFmpeg please visit http://manual.audacityteam.org/o/man/faq_installation_and_plug_ins.html#ffdown.\n    New Tamil translation (largely complete).\n    (Windows) FLAC exports can now exceed 2 GB in size.\n    (OS X) Easier Audacity installation using the DMG: drag the Audacity folder to the /Applications shortcut.\n    (Linux) Self-compiled builds of Audacity now search for system LADSPA effects in /usr/lib/ladspa.\n\n\n\nBug Fixes\n\nInterface:\n\n    Region Restore did not restore the region after using Preferences.\n    Dragging selections with the keyboard or Selection Toolbar digits was very slow.\n    (Windows) Help &gt; About Audacity crashed when run in Magyar language.\n    (OS X) Some full and reduced Menu Bar items were not translated.\n    (OS X and Linux) Fixed various interface crashes.\n\n\n\nEffects:\n\n    Reverb and Paulstretch were missing from Chains.\n    Analyze &gt; Contrast could report very inaccurate rms levels.\n    Noise Removal: Attack and decay times were half as long as set.\n    (OS X and Linux) Nyquist effects ran much more slowly than on Windows.\n    Click or drag on the Timeline after Loop Play continued to loop.\n    Transcription Toolbar did not play slower than 0.1x speed.\n    (Linux) Audacity did not build if python 2 was not available.\n\n\n\nFor more information, visit http://wiki.audacityteam.org/wiki/Release_Notes_2.0.6.","torrent":{"xt":"urn:btih:24a1b1d03cd5705a3a10070cd8babd2ab1e5dd69","amp;dn":"Audacity+-+2.0.6+-+Mac+OS+X+%28PPC%2Fx86%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24a1b1d03cd5705a3a10070cd8babd2ab1e5dd69","infoHashBuffer":{"type":"Buffer","data":[36,161,177,208,60,213,112,90,58,16,7,12,216,186,189,42,177,229,221,105]},"announce":[],"urlList":[]}}