{"title":"Lonely Planet - Discover Florida - 1st Ed (2012).epub Gooner","uid":13644506,"size":80100905,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:24bfb4bc413c720f339fca607731db0208b4976d&amp;dn=Lonely+Planet+-+Discover+Florida+-+1st+Ed+%282012%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1456152711,"description":"Lonely Planet - Discover Florida (Travel Guide) - 1st Edition (2012).epub Gooner\r\n\r\nPublisher: Lonely Planet; 1 edition (March 1, 2012)\r\nLanguage: English\r\nISBN-10: 1742204902\r\nISBN-13: 978-1742204901\r\n\r\nLonely Planet: The world's leading travel guide publisher\r\n\r\nLonely Planet Discover Florida is your passport to all the most relevant and up-to-date advice on what to see, what to skip, and what hidden discoveries await you. Fish the Florida Keys, hit up a hot Miami club for all-night dancing, or kayak by cypress domes and mangroves in the Everglades; all with your trusted travel companion. Discover the best of Florida and begin your journey now!\r\n\r\nInside Lonely Planet Discover Florida:\r\n\r\n* Full-color maps and images throughout\r\n\r\n* Highlights and itineraries show you the simplest way to tailor your trip to your own personal needs and interests\r\n\r\n* Insider tips save you time and money and help you get around like a local, avoiding crowds and trouble spots\r\n\r\n* Essential info at your fingertips - including hours of operation, phone numbers, websites, transit tips, and prices\r\n\r\n* Honest reviews for all budgets - including eating, sleeping, sight-seeing, going out, shopping, and hidden gems that most guidebooks miss\r\n\r\n* Cultural insights give you a richer and more rewarding travel experience - including history, art, literature, cinema, music, architecture, landscapes, wildlife, beaches, food, drink, and more\r\n\r\n* Over 25 color local maps\r\n\r\n* Useful features - including Month-by-Month (annual festival calendar), Travel with Kids, and What's New\r\n\r\n* Coverage of Walt Disney World, Orlando, Universal Studios, SeaWorld, Tampa Bay, Gulf Coast, Palm Beach, Gold Coast, The Everglades, Miami, the Keys, and more\r\n\r\nThe Perfect Choice: Lonely Planet Discover Florida, our easy-to-use guide, is perfect for travelers who seek the most popular attractions a destination has to offer. Filled with inspiring and colorful photos, this guide focuses on the best of the best.\r\n\r\n* Looking for a comprehensive guide that recommends a wide range of experiences, both popular and offbeat, and extensively covers all the state has to offer? Check out Lonely Planet's Florida guide.\r\n\r\n* Looking for a guide focused on Miami and the Keys? Check out Lonely Planet's Miami &amp; the Keys guide for a comprehensive look at all region has to offer.\r\nAuthors: Written and researched by Lonely Planet, Adam Karlin, Jeff Campbell, Jennifer Denniston, and Emily Matchar.\r\n\r\nAbout Lonely Planet: Started in 1973, Lonely Planet has become the world's leading travel guide publisher with guidebooks to every destination on the planet, as well as an award-winning website, a suite of mobile and digital travel products, and a dedicated traveler community. Lonely Planet's mission is to enable curious travelers to experience the world and to truly get to the heart of the places they find themselves in","torrent":{"xt":"urn:btih:24bfb4bc413c720f339fca607731db0208b4976d","amp;dn":"Lonely+Planet+-+Discover+Florida+-+1st+Ed+%282012%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24bfb4bc413c720f339fca607731db0208b4976d","infoHashBuffer":{"type":"Buffer","data":[36,191,180,188,65,60,114,15,51,159,202,96,119,49,219,2,8,180,151,109]},"announce":[],"urlList":[]}}