{"title":"[Preston_Blair]Cartoon Animation (The Collector's Series)(chm){Z","uid":10927345,"size":26365847,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2526f3c3c6615430016750bfb66fe6de842e8c0a&amp;dn=%5BPreston_Blair%5DCartoon+Animation+%28The+Collector%27s+Series%29%28chm%29%7BZ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"zombie_rox","files":3,"time":1409373344,"description":"This is the one sourcebook that cartooning and animation enthusiasts have been clamoring about for years! A time-tested classic, this tried-and-true reference is often used as a textbook in cartooning workshops, and beginning and professional cartoonists alike are known to have copies of Cartoon Animation in their libraries. In this comprehensive title, famed animator Preston Blair shares his expertise on how to develop a cartoon character, create dynamic movement, and coordinate dialogue with action. Topics include character development, line of action, dialogue, timing, and, of course, animation! This valuable resource provides all the inspiration and information you need to begin drawing your own animated characters.\n\nSeries: Collector's Series\nPublisher: Walter Foster Publishing; 1 edition (1994)\nLanguage: English\nISBN-10: 1560100842\nISBN-13: 978-1560100843\n\nMore About the Author\n\nBiography\nPreston Blair was a native Californian from Redlands. He attended Pomona College, then studied art at the Otis Art Institute and illustration under Pruett Carter at Chouinard Art Institute (now California Institute of the Arts). He exhibited widely as a member of the California Watercolor Society and the American Watercolor Society in New York.\n\nBlair was one of the fine artists of animation. With the Disney Studio, he designed and animated the hippos in &quot;The Dance of the Hours&quot; and animated Mickey Mouse in the &quot;Sorcerer's Apprentice&quot; (both in Fantasia), parts of Pinocchio, and the segment in Bambi when the owl tell about love in the &quot;tiwitterpatted&quot; speech.\n\nAt MGM, Blair directed Barney Bear shorts, and is well known as the animator and designer of Red Hot Riding Hood in the Tex Avery epic shorts. Later, Blair moved to Connecticut and produced television commercials, educational films, and half-hour cartoon episodes (including the Flinstones) for West Coast producers. More recently, he was an inventor of interactive TV systems using animation methods to teach reading or to provide full-figure game action that simulates reality--for example, playing tennis with an animated opponent.\n\nBlair died in April 1995 at the age of 85.","torrent":{"xt":"urn:btih:2526f3c3c6615430016750bfb66fe6de842e8c0a","amp;dn":"%5BPreston_Blair%5DCartoon+Animation+%28The+Collector%27s+Series%29%28chm%29%7BZ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2526f3c3c6615430016750bfb66fe6de842e8c0a","infoHashBuffer":{"type":"Buffer","data":[37,38,243,195,198,97,84,48,1,103,80,191,182,111,230,222,132,46,140,10]},"announce":[],"urlList":[]}}