{"title":"Breaking Habit of Being Yourself by Joe Dispenza","uid":9341974,"size":1754581,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:258ecbdbe09835f2ae310d62e2570e609de3aaa5&amp;dn=Breaking+Habit+of+Being+Yourself+by+Joe+Dispenza&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"420weedman","files":4,"time":1386953892,"description":"You are not doomed by your genes and hardwired to be a certain way for the rest of your life. A new science is emerging that empowers all human beings to create the reality they choose. In Breaking the Habit of Being Yourself, renowned author, speaker, researcher, and chiropractor Dr. Joe Dispenza combines the fields of quantum physics, neuroscience, brain chemistry, biology, and genetics to show you what is truly possible. \nNot only will you be given the necessary knowledge to change any aspect of yourself, you will be taught the step-by-step tools to apply what you learn in order to make measurable changes in any area of your life. Dr. Joe demystifies ancient understandings and bridges the gap between science and spirituality. Through his powerful workshops and lectures, thousands of people in 25 different countries have used these principles to change from the inside out. Once you break the habit of being yourself and truly change your mind, your life will never be the same!","torrent":{"xt":"urn:btih:258ecbdbe09835f2ae310d62e2570e609de3aaa5","amp;dn":"Breaking+Habit+of+Being+Yourself+by+Joe+Dispenza","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"258ecbdbe09835f2ae310d62e2570e609de3aaa5","infoHashBuffer":{"type":"Buffer","data":[37,142,203,219,224,152,53,242,174,49,13,98,226,87,14,96,157,227,170,165]},"announce":[],"urlList":[]}}