{"title":"James Newton Howard - Nightcrawler OST (2014)","uid":11390834,"size":140779065,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:25c3a37eb3cfa0c03fc3553346221e110e8fafe0&amp;dn=James+Newton+Howard+-+Nightcrawler+OST+%282014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"shambu69","files":-1,"time":1415324239,"description":"\nTracklist:\n01. James Newton Howard - Nightcrawler (1:59) [320 Kb/s]\n02. James Newton Howard - Lou's Inspired (2:10) [320 Kb/s]\n03. James Newton Howard - Driving at Night (0:53) [320 Kb/s]\n04. James Newton Howard - Sell the Bike (1:02) [320 Kb/s]\n05. James Newton Howard - Loder Crashes (2:33) [320 Kb/s]\n06. James Newton Howard - K W L A (1:28) [320 Kb/s]\n07. James Newton Howard - The First Accident (1:50) [320 Kb/s]\n08. James Newton Howard - Day to Night (0:43) [320 Kb/s]\n09. James Newton Howard - Pictures On the Fridge (1:43) [320 Kb/s]\n10. James Newton Howard - The First Night (1:37) [320 Kb/s]\n11. James Newton Howard - Entering the House (3:03)\n12. James Newton Howard - Edit on the Hood (1:08)\n13. James Newton Howard - Lou and Rick on a Roll (2:09)\n14. James Newton Howard - Driving at Night, Again (1:04)\n15. James Newton Howard - Waiting (0:57)\n16. James Newton Howard - Mount Wilson (1:38)\n17. James Newton Howard - The Wrong Way (1:12)\n18. James Newton Howard - Watching the House Footage (1:04)\n19. James Newton Howard - Lou's Philosophy (1:54)\n20. James Newton Howard - Making the News (0:50)\n21. James Newton Howard - Search for the Plate (1:02)\n22. James Newton Howard - The Newscast (3:45)\n23. James Newton Howard - Moving the Body (1:52)\n24. James Newton Howard - Chinatown Express (4:16)\n25. James Newton Howard - Nina and Frank (1:01)\n26. James Newton Howard - The Shootout (4:35)\n27. James Newton Howard - Lou's Free (1:36)\n28. James Newton Howard - If It Bleeds It Leads (2:14)\n\nAbout:\nReleased: Oct 14, 2014\nâ„— 2014 Lakeshore Records\n\nBitrate: 320kbps\n\n&quot;NIGHTCRAWLER is, in my mind, a frontrunner for the title of film of the year. The acting, the story, the dialogue, the cinematography - every part of the film is excellent across the board. But among all of these elements, one aspect of the film kept jumping out to me throughout: the music. It's amazing. That hasn't happened to me since DRIVE (2011).\n\nUnlike the soundtrack for DRIVE, which I also purchased on Amazon, there is no licensed pop music on this soundtrack. It is all original compositions from James Newton Howard. But like DRIVE, every minute of it - especially the stand out track &quot;Pictures on the Fridge&quot; - is beautiful, mystical, and ethereal. It sets an incredible mood for the film to unfold, and pulls you into the seedy underbelly of Los Angeles at night.\n\nDo yourself a favor: get in your car, put this soundtrack on, drop the windows and go for a drive. You won't forget it. &quot; By Michael G. on November 2, 2014\n\n\nBiography\nPianist, producer, and composer James Newton-Howard scored over 60 films beginning in the mid-'80s, including The Fugitive, Space Jam, The Prince of Tides, Pretty Woman, Glengarry Glen Ross, and Waterworld. Newton-Howard began taking classical piano lessons at the age of four, playing on a piano owned by his grandmother, who was the Pittsburgh Symphony's concertmaster and violinist during the 1930s and '40s. He went on to study at the USC School of Music and at the Music Academy of the West (in Santa Barbara, CA) with Reginald Stewart and Leon Fleischer. He also studied under orchestrator Marty Paich, who would later conduct some of Newton-Howard's scores. After graduating from college, Newton-Howard joined a short-lived rock band, then worked for a couple of years as a session musician with artists including Diana Ross, Ringo Starr, and Harry Nilsson. In 1975, he joined the band of the most popular artist of that time, Elton John, toured with them during the mid-'70s and later re-joined for a tour in 1980 and again in 1986. Over the years, Newton-Howard has worked as a songwriter, producer, or arranger with the such artists as Cher, Earth, Wind &amp; Fire, Rickie Lee Jones, Olivia Newton-John, Bob Seger, Rod Stewart, Barbra Streisand, Toto, and more. James Newton-Howard has received Oscars for his film scores in Prince of Tides (1991), The Fugitive (1993), and My Best Friend's Wedding (1997); and an Emmy for his theme for the television show E.R","torrent":{"xt":"urn:btih:25c3a37eb3cfa0c03fc3553346221e110e8fafe0","amp;dn":"James+Newton+Howard+-+Nightcrawler+OST+%282014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25c3a37eb3cfa0c03fc3553346221e110e8fafe0","infoHashBuffer":{"type":"Buffer","data":[37,195,163,126,179,207,160,192,63,195,85,51,70,34,30,17,14,143,175,224]},"announce":[],"urlList":[]}}