{"title":"Interior Detailing: Concept to Construction,1st Edition{BBS}","uid":6835101,"size":8044068,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:25d15546c603cf10e913cece3345f57468f4de6d&amp;dn=Interior+Detailing%3A+Concept+to+Construction%2C1st+Edition%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1322000971,"description":"\nThe all-in-one interior detailing guide that unites creative and technical aspects\n\nA well-executed interior space requires the successful combination of the creative and the technical. Interior Detailing bridges the gap between design and construction, and shows how to develop and transform design concepts into details that meet the constraints, functional requirements, and constructability issues that are part of any interior design element. It offers guidance on how design professionals can combine imaginative thinking and the application of technical resources to create interiors that are aesthetically pleasing, functionally superior, and environmentally sound. Interior Detailing:\n\n    *\n\n      Includes 150 easy-to-understand details showing how to logically think through the design and development of an assembly so that it conforms to the designer's intent and meets the practical requirements of good construction\n    *\n\n      Describes how to solve any detailing design problem in a rational way\n    *\n\n      Contains conceptual and practical approaches to designing and detailing construction components thatform interior spaces\n    *\n\n      Shows how a small number of principles can be used to solve nearly any detailing problem\n\nThis guide covers the subject of interior spaces comprehensively by balancing the contributions of physical beauty and structural integrity in one complete volume. By following the principles laid out in this book, interior designers and architects can plan for the construction of a unique interior environment more thoughtfully and with a clearer, better-defined purpose.\n\n\n\n# Hardcover: 304 pages\n# Publisher: Wiley; 1 edition (September 28, 2010)\n# Language: English\n# ISBN-10: 0470504978\n# ISBN-13: 978-0470504970","torrent":{"xt":"urn:btih:25d15546c603cf10e913cece3345f57468f4de6d","amp;dn":"Interior+Detailing%3A+Concept+to+Construction%2C1st+Edition%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25d15546c603cf10e913cece3345f57468f4de6d","infoHashBuffer":{"type":"Buffer","data":[37,209,85,70,198,3,207,16,233,19,206,206,51,69,245,116,104,244,222,109]},"announce":[],"urlList":[]}}