{"title":"Tan Bionica - Obsesionario - 2010 by Nostica","uid":7022516,"size":132797584,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:261fa28cee72f564dd5ad46e636d8e9ff626bbf6&amp;dn=Tan+Bionica+-+Obsesionario+-+2010+by+Nostica&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"kokipenta","files":20,"time":1328892417,"description":" &lt;a href=&quot;http://www.rock.com.ar/bios/5/5702.shtml&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.rock.com.ar/bios/5/5702.shtml&lt;/a&gt;\n\nTan BiÃƒÂ³nica conjuga ritmos del pop con la mÃƒÂºsica electrÃƒÂ³nica desde sus comienzos, a principios de 2002. CompartiÃƒÂ³ escenarios con Juana La Loca, El Otro Yo, Catupecu Machu, Leo GarcÃƒÂ­a y Miranda!.\n\nLa potente base y los particulares arreglos se cruzan en los caminos del rock que hace bailar acercÃƒÂ¡ndose al deep house o al hip hop y transita entre el swing del funk y la belleza de la canciÃƒÂ³n propiamente dicha.\n\nEl proceso de realizaciÃƒÂ³n del maxi simple \\&quot;Wonderful noches\\&quot;, de junio a noviembre de 2003, contÃƒÂ³ con la participaciÃƒÂ³n de Ramtes GonzÃƒÂ¡lez como ingeniero de grabaciÃƒÂ³n, y la colaboraciÃƒÂ³n de Javier Calequi y Ariel Mizrahi en producciÃƒÂ³n adicional. La mezcla estuvo a cargo Mariano LÃƒÂ³pez y el mastering a cargo de Eduardo Bergallo. Contiene cinco temas, entre los cuales \\&quot;Veneno\\&quot; fue elegido como corte difusiÃƒÂ³n, con un videoclip dirigido por Marcelo Lamorte.\n\nDurante el aÃƒÂ±o 2005 la banda presentÃƒÂ³ los videos de los temas \\&quot;Veneno\\&quot; y \\&quot;Wonderful Noches\\&quot;, este ÃƒÂºltimo fue presentado en el show de televisiÃƒÂ³n \\&quot;Flamantes\\&quot; de la seÃƒÂ±al de cable MTV latina junto con otros artistas de renombre internacional y participÃƒÂ³ en el ranking anual de los \\&quot;100 + pedidos\\&quot; del mismo canal. \\&quot;Wonderful Noches\\&quot; fue dirigido y producido por Ignacio Lecouna y su productora Bit Entertainment en los estudios Central Park. El video fue presentado para el pÃƒÂºblico en El Condado.\n\nA comienzos del aÃƒÂ±o 2006 Tan BiÃƒÂ³nica entrÃƒÂ³ al estudio con el objetivo de pre-producir las canciones de su segundo disco: \\&quot;Canciones del HuracÃƒÂ¡n\\&quot; se editÃƒÂ³ por EMI MÃƒÂºsica Argentina, con 13 nuevas canciones y una versiÃƒÂ³n de \\&quot;Queso Ruso\\&quot;, clÃƒÂ¡sico de Patricio Rey y sus Redonditos de Ricota. \\&quot;Arruinarse\\&quot; fue el primer corte difusiÃƒÂ³n.\n\n\\&quot;Obsesionario\\&quot;, el segundo disco, fue grabado en El Cielito, con producciÃƒÂ³n de los Bersuit Pepe CÃƒÂ©spedes y Oscar Righi, con doce canciones de rock y mÃƒÂºsica electrÃƒÂ³nica. El primer corte de difusiÃƒÂ³n fue \\&quot;Ella\\&quot;, cuyo videoclip fue el primero en nuestro paÃƒÂ­s en grabarse en 360Ã‚Â°.\n\nLa lista de temas es:\n\nElla \n\nBeautiful \n\nObsesionario en La mayor \n\nLoca \n\nEl duelo \n\nDominguicidio \n\nPastillas del olvido \n\nLa suerte estÃƒÂ¡ echada \n\nLa comunidad \n\nPerdida \n\nEl color del ayer \n\nPÃƒÂ©talos \n\n","torrent":{"xt":"urn:btih:261fa28cee72f564dd5ad46e636d8e9ff626bbf6","amp;dn":"Tan+Bionica+-+Obsesionario+-+2010+by+Nostica","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"261fa28cee72f564dd5ad46e636d8e9ff626bbf6","infoHashBuffer":{"type":"Buffer","data":[38,31,162,140,238,114,245,100,221,90,212,110,99,109,142,159,246,38,187,246]},"announce":[],"urlList":[]}}