{"title":"Capital in the Twenty-First Century - Thomas Piketty - Audiobook","uid":10205575,"size":720433445,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2691ffcc9fb23bdfd86637f0d0cfea2252275308&amp;dn=Capital+in+the+Twenty-First+Century+-+Thomas+Piketty+-+Audiobook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"Squiddy82","files":-1,"time":1400844993,"description":"MP3 CBR 64k Joint Stereo.\nThis will work best with dedicated audiobook reader apps.\n\n\nCapital in the Twenty-First Century - Thomas Piketty\n\nWritten by: Thomas Piketty, Arthur Goldhammer (translator)\nNarrated by: L. J. Ganser\nLength: 25 hrs and 3 mins \nFormat: Unabridged\nRelease Date:05-22-14\nProgram Type: Audiobook\n\nWhat are the grand dynamics that drive the accumulation and distribution of capital? Questions about the long-term evolution of inequality, the concentration of wealth, and the prospects for economic growth lie at the heart of political economy. But satisfactory answers have been hard to find for lack of adequate data and clear guiding theories. In Capital in the Twenty-First Century, Thomas Piketty analyzes a unique collection of data from 20 countries, ranging as far back as the 18th century, to uncover key economic and social patterns. His findings will transform debate and set the agenda for the next generation of thought about wealth and inequality.\n\nPiketty shows that modern economic growth and the diffusion of knowledge have allowed us to avoid inequalities on the apocalyptic scale predicted by Karl Marx. But we have not modified the deep structures of capital and inequality as much as we thought in the optimistic decades following World War II. The main driver of inequality - the tendency of returns on capital to exceed the rate of economic growth - today threatens to generate extreme inequalities that stir discontent and undermine democratic values. But economic trends are not acts of God. Political action has curbed dangerous inequalities in the past, Piketty says, and may do so again.\n\nA work of extraordinary ambition, originality, and rigor, Capital in the Twenty-First Century reorients our understanding of economic history and confronts us with sobering lessons for today.","torrent":{"xt":"urn:btih:2691ffcc9fb23bdfd86637f0d0cfea2252275308","amp;dn":"Capital+in+the+Twenty-First+Century+-+Thomas+Piketty+-+Audiobook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2691ffcc9fb23bdfd86637f0d0cfea2252275308","infoHashBuffer":{"type":"Buffer","data":[38,145,255,204,159,178,59,223,216,102,55,240,208,207,234,34,82,39,83,8]},"announce":[],"urlList":[]}}