{"title":"The Symphony of Ages","uid":15932969,"size":15735006,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:269746a09ffe0af5bdd9a06bac216235a3e9b95a&amp;dn=The+Symphony+of+Ages&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":null,"files":9,"time":1475371982,"description":"The Symphony of Ages\r\n\r\n\r\nThe Symphony of Ages books series consists of the Rhapsody Trilogy, the two Middle Books, and, as of June 2015, The War of the Known World Trilogy. The third book in this trilogy, and thus the eighth in the Symphony of Ages series, was published in June 2015.\r\n\r\nThe Rhapsody Trilogy\r\n\r\nThe Rhapsody Trilogy is based on three characters who find themselves in a land on the brink of disaster. Rhapsody, the main character, is a Namer, a profession that includes passing down the history and lore of the people and the land. As a Namer, Rhapsody, can only speak the truth. A Namer has incredible power because when they speak (or sing) they describe the very nature or essence of a person or a thing. In some instances a Namer can change the parameters of a person or a thing by giving it a new name. When Rhapsody meets up with her two future companions she accidentally uses her Naming power to rename The Brother, a ruthless assassin, to &quot;Achmed The Snake.&quot; This accident forces Rhapsody to join Achmed and his companion who are on the run from an ancient and dangerous foe, a F'Dor demon.\r\n\r\nRhapsody: Child of Blood (1999)\r\nProphecy: Child of Earth (2001)\r\nDestiny: Child of the Sky (2002\r\n)\r\nThe Bridge/Middle Duology:\r\n\r\nRhapsody, Achmed, Grunthor live out their new lives after the aftermath of the Cymrian Council. Achmed and Grunthor continue their plans to re-build Ylorc while Rhapsody lives with Ashe in Haguefort, unknown that an enemy thought dead has arisen to wreck vengeance.\r\n\r\nRequiem for the Sun (2003)\r\nElegy for a Lost Star (2004)\r\n\r\nThe War of the Known World Quadrology:\r\n\r\nThe War of the Known World quadrology focuses on the Three facing war that is started by the Merchant turned Emperor Talquist, who used the scale of Twilight to manipulate the scales to rise to power. Various other characters are introduce and supporting characters make a stronger appearance in the trilogy, at the heart of it all Rhapsody must come forth from being a mother to being the Iliachenva’ar once again in order to save her friends and family from annihilation.\r\n\r\nThe Assassin King (2006)\r\nThe Merchant Emperor (2014)\r\nThe Hollow Queen (2015)\r\nThe Weaver's Lament (2016)","torrent":{"xt":"urn:btih:269746a09ffe0af5bdd9a06bac216235a3e9b95a","amp;dn":"The+Symphony+of+Ages","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"269746a09ffe0af5bdd9a06bac216235a3e9b95a","infoHashBuffer":{"type":"Buffer","data":[38,151,70,160,159,254,10,245,189,217,160,107,172,33,98,53,163,233,185,90]},"announce":[],"urlList":[]}}