{"title":"Episodes - The Complete Season 1 [HDTV]","uid":6192613,"size":1714486972,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:26afaab08f433aac37dc11260c3532cb882cda4e&amp;dn=Episodes+-+The+Complete+Season+1+%5BHDTV%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"FaMoUz","files":-1,"time":1298344322,"description":"\n\n\n\n\n\n\n                   Episodes - The Complete Season 1 [HDTV]\n                   _______________________________________\n\n\n\n\n\n\nNFO: tha complete season 1.. all 7 episodes of tha 1st season [HDTV]\n\n\n\n\n\nSources:\n\nEpisodes.S01E01.PROPER.HDTV.XviD-ASAP\n\nEpisodes.S01E02.HDTV.XviD-FQM\n\nEpisodes.S01E03.HDTV.XviD-ASAP\n\nEpisodes.S01E04.HDTV.XviD-FQM\n\nEpisodes.S01E05.HDTV.XviD-FQM\n\nEpisodes.S01E06.HDTV.XviD-ASAP\n\nEpisodes.S01E07.HDTV.XviD-LOL\n\n\n\n\nEpisodes:\n\n\n____________________________________________\n# | Title | Directed by | Original air date |\n__|_______|_____________|___________________|\n\n\n  |             |                 |                 |\n1 | Episode One | James Griffiths | January 9, 2011 |\n\nAfter winning another BAFTA for their hit sitcom, Lyman's Boys, Sean and Beverly Lincoln are approached by American television executive Merc Lapidus who woos them into re-creating their sitcom for an American audience. After initial hesitation, they decide to accept his offer and make the journey from London to Los Angeles. On their first day in pre-production Sean and Beverly are told that Julian Bullard, who stars in the British series of Lyman's Boys, will need to re-audition for the American adaptation. They also learn that Merc has lied to them and has never even seen an episode of their show. Bullard is not given the job and Matt LeBlanc is given the role instead.\n___________________________________________________________________________________\n  |             |                 |                  |\n2 | Episode Two | James Griffiths | January 16, 2011 |\n\nMerc invites Sean and Beverly to an elegant dinner party at his house. At the party, Matt flatters Sean and flirts with Beverly. Matt convinces Merc to change his character from an aged headmaster to a hockey coach, and the name of the show to &quot;Pucks!&quot;\n___________________________________________________________________________________\n  |               |                 |                  |\n3 | Episode Three | James Griffiths | January 23, 2011 |\n\nThe first reading of Pucks! is disrupted by Merc's crass etiquette. Sean and Matt travel to Las Vegas while Beverly is left at home, bitterly disappointed with the changes that Matt has suggested to the show. Matt convinces Sean about the changes. Sean develops a man-crush on Matt in the face of his charm, wealth, and celebrity.\n___________________________________________________________________________________\n  |              |                 |                  |\n4 | Episode Four | James Griffiths | January 30, 2011 |\n\nFilming for the Pucks! pilot begins. Matt hits the drink after he loses his court case over custody of his children. With a photographer waiting to capture Matt drink driving, Sean and Beverly go to pick him up. Beverly and Matt appear to make amends. The morning after, however, Matt's attitude towards Beverly returns.\n___________________________________________________________________________________\n  |              |                 |                  |\n5 | Episode Five | James Griffiths | February 6, 2011 |\n\nMatt invites Sean to a 'Rape Prevention Task Force' gala, where more of Morning's secrets are revealed. Beverly and Carol get stoned and bond over stories of their love lives. Beverly becomes paranoid that Sean is falling for Morning. Sean finds Morning's sex tape on the internet, and watches it while masturbating, unaware that Beverly is watching him.\n___________________________________________________________________________________\n  |             |                 |                   |\n6 | Episode Six | James Griffiths | February 13, 2011 |\n\nBeverly decides to leave Los Angeles for good but is involved with a head on collision with Matt's car after she confronts Sean about his relationship with Morning. Sean has lunch with Merc in an attempt to salvage the Pucks! pilot when Carol reveals that he has become bored with the show. Beverly and Matt kiss when he takes her back to his house following the crash, after finally getting their differences out into the open.\n___________________________________________________________________________________\n  |               |                 |                   |\n7 | Episode Seven | James Griffiths | February 20, 2011 |\n\nAfter a night to remember - and bitterly regret - Beverly returns home to find her husband waiting with open arms. The dreadful Pucks! pilot wraps and Sean and Beverly prepare to return to London. However, a final goodbye between Matt and Sean takes an unexpected turn involving a missing Jaguar, a red-nosed reindeer and the smell of cinnamon.\n___________________________________________________________________________________\n\n\n\n\n\nCast:\n\nMatt LeBlanc................Matt LeBlanc (7 episodes, 2011)\n\nStephen Mangan..............Sean Lincoln (7 episodes, 2011)\n\nTamsin Greig................Beverly Lincoln (7 episodes, 2011)\n\nJohn Pankow.................Merc Lapidus (6 episodes, 2011)\n\nKathleen Rose Perkins.......Carol Rance (6 episodes, 2011)\n\nMircea Monroe...............Morning Randolph (5 episodes, 2011)\n\nJoseph May..................Andy Button (4 episodes, 2011)\n\nDemetri Goritsas............Director (3 episodes, 2011)\n\nDaisy Haggard...............Myra Licht (3 episodes, 2011)\n\nMartin McDougall............Assistant Director (3 episodes, 2011)\n\nBruce Johnson...............Roger (3 episodes, 2011)\n\nGenevieve O'Reilly..........Jamie Lapidus (3 episodes, 2011)\n\nLou Hirsch..................Wallace (3 episodes, 2011)\n\nEros Vlahos.................Pucks!' Boy (3 episodes, 2011) \n\n\n\n\n\nPlot:\n\nBritish-bred writer-producers, Beverly and Sean Lincoln, have it good. A wonderful marriage and a hit TV series to their credit. Things couldn't be better. Until, Merc Lapidus, a Hollywood big shot in charge of a network, gushes over their series at a social gathering. Merc is certain that a remake of the show will go over well with an American audience. After a lucrative offer, the Lincolns pack up and ship out to The States. It doesn't take long for them to figure out, that Hollywood is a place where deals are made and broken in the same breath. They find themselves holding on tight, as creative control of their project starts to slip from their hands. It has been brought to their attention, that &quot;You don't say no to Merc&quot;. To add insult to injury, the original star of the show is tossed out for actor, Matt LeBlanc, a charming, yet, manipulative beast, with a grocery list of demands. LA is not what the Lincolns had in mind, but Sean believes he can swim with the sharks. As for Beverly, she'd rather go back to the UK, than deal with these Episodes.\n\n\n\n\nPLZ HELP SEED &amp; ENJOY...\n","torrent":{"xt":"urn:btih:26afaab08f433aac37dc11260c3532cb882cda4e","amp;dn":"Episodes+-+The+Complete+Season+1+%5BHDTV%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26afaab08f433aac37dc11260c3532cb882cda4e","infoHashBuffer":{"type":"Buffer","data":[38,175,170,176,143,67,58,172,55,220,17,38,12,53,50,203,136,44,218,78]},"announce":[],"urlList":[]}}