{"title":"Focus: The Hidden Driver of Excellence [2013][mobi/epub]","uid":9160588,"size":1295558,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:279391820de9d0ef561db3a0d0125e44612a6498&amp;dn=Focus%3A+The+Hidden+Driver+of+Excellence+%5B2013%5D%5Bmobi%2Fepub%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"AN0NYMOUS142857","files":-1,"time":1383867222,"description":" &lt;a href=&quot;http://lookpic.com/O/i2/147/Q03pEAdJ.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://lookpic.com/O/i2/147/Q03pEAdJ.jpeg&lt;/a&gt;\nFocus: The Hidden Driver of Excellence by Daniel Goleman\n\n\nFormat: mobi/epub\nLength: 320 pages\nGenre: Psychology/Self-Help\nDate: 8 October 2013\n\nBestselling author Daniel Goleman returns with a groundbreaking look at today's scarcest resource and the secret to high performance and fulfillment: attention.\n\nFor more than two decades, psychologist and journalist Daniel Goleman has been scouting the leading edge of the human sciences for what's new, surprising, and important. In Focus, he delves into the science of attention in all its varieties, presenting a long overdue discussion of this little-noticed and under-rated mental asset that matters enormously for how we navigate life.\n\nGoleman boils down attention research into a three parts: inner, other, and outer focus. Goleman shows why high-achievers need all three kinds of focus, as demonstrated by rich case studies from fields as diverse as competitive sports, education, the arts, and business. Those who excel rely on what Goleman calls Smart Practices such as mindfulness meditation, focused preparation and recovery, positive emotions and connections, and mental 'prosthetics' that help them improve habits, add new skills, and sustain excellence. Combining cutting-edge research with practical findings, Focus reveals what distinguishes experts from amateurs and stars from average performers.\n\nAuthor: &lt;a href=&quot;\nhttp://image.bayimg.com/18c60bc6aabf33683e66f943f0241d730bc304b9.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/18c60bc6aabf33683e66f943f0241d730bc304b9.jpg&lt;/a&gt;\nDaniel Goleman is an author, psychologist, and science journalist. He is also the author of the international bestsellers Emotional Intelligence, Working with Emotional Intelligence, and Social Intelligence, and the co-author of the acclaimed business bestseller Primal Leadership. He was a science reporter for the New York Times, was twice nominated for the Pulitzer Prize, and received the American Psychological Association's Lifetime Achievement Award for his media writing. He lives in the Berkshires.\n\nAll thanks goes to the original uploaders","torrent":{"xt":"urn:btih:279391820de9d0ef561db3a0d0125e44612a6498","amp;dn":"Focus%3A+The+Hidden+Driver+of+Excellence+%5B2013%5D%5Bmobi%2Fepub%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"279391820de9d0ef561db3a0d0125e44612a6498","infoHashBuffer":{"type":"Buffer","data":[39,147,145,130,13,233,208,239,86,29,179,160,208,18,94,68,97,42,100,152]},"announce":[],"urlList":[]}}