{"title":"Mastering JavaScript - loseOut.pdf","uid":15543403,"size":3119181,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2795ee22ef3ce39cc9d638583310185a1d4f5400&amp;dn=Mastering+JavaScript+-+loseOut.pdf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"loseOut","files":1,"time":1470944788,"description":"JavaScript is a high-level, dynamic, untyped, lightweight, and interpreted programming language. Along with HTML and CSS, it is one of the three essential technologies of World Wide Web content production, and is an open source and cross-platform technology. The majority of websites employ JavaScript, and it is well supported by all modern web browsers without plugins. However, the JavaScript landscape has changed dramatically in recent years, and you need to adapt to the new world of JavaScript that people now expect. Mastering modern JavaScript techniques and the toolchain are essential to develop web-scale applications.\r\n\r\nMastering JavaScript will be your companion as you master JavaScript and build innovative web applications. To begin with, you will get familiarized with the language constructs and how to make code easy to organize. You will gain a concrete understanding of variable scoping, loops, and best practices on using types and data structures, as well as the coding style and recommended code organization patterns in JavaScript. The book will also teach you how to use arrays and objects as data structures. You will graduate from intermediate-level skills to advanced techniques as you come to understand crucial language concepts and design principles. You will learn about modern libraries and tools so you can write better code","torrent":{"xt":"urn:btih:2795ee22ef3ce39cc9d638583310185a1d4f5400","amp;dn":"Mastering+JavaScript+-+loseOut.pdf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2795ee22ef3ce39cc9d638583310185a1d4f5400","infoHashBuffer":{"type":"Buffer","data":[39,149,238,34,239,60,227,156,201,214,56,88,51,16,24,90,29,79,84,0]},"announce":[],"urlList":[]}}