{"title":"Painter X3 Mac OS","uid":9789394,"size":187161920,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:2820ebfde318e64083abaf3ee18faabb67cdd5d8&amp;dn=Painter+X3+Mac+OS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"Spudboy2012","files":1,"time":1395224546,"description":"Name: Corel Painter X3 SP1 [En]\nVersion: - 13.0.1.1111\n\nMac Platform: Intel\nIncludes: K\n\nOS version: 10.7\nProcessor type(s) &amp; speed: Intel Core 2 Duo\nRAM minimum: 2gb\n\nLink for more information: http://www.corel.com/corel/product/index.jsp?pid=prod5090087\n\nA complete art studio at your fingertips!\n\nNo matter what kind of art you create, with CorelÂ® PainterÂ® X3 you'll find all the tools you need to unlock new artistic possibilities. Work with hundreds of customizable brushes, paper textures and wet and dry media that look and feel just like the real thing! RealBristleâ„¢ technology replicates traditional art supplies more realistically than any other paint program on the market.\n\n\n*Includes Support for OS X Mavericks (10.9)\n\nThe following issues were addressed in Service Pack 1:\n\nApplication Stability\n- Various instabilities were addressed in areas such as layers, brushes, and cloning.\n- Copying a reference layer from an open image no longer causes application instability.\n- Autopainting with Artists Oils no longer causes the application to stop responding.\n- Running Painter 12 and Painter X3 simultaneously with both applications visible no longer causes Painter X3 to stop responding.\n- Renaming a Clone Source Image from the Clone Source Panel no longer causes the application to stop responding.\n- Adding an image that includes a Drop Shadow to the Image Portfolio no longer causes the application to stop responding.\n\nFile Integrity\n- Undoing a multi-layer transformation no longer results in document corruption.\n- Pasting large images into Painter no longer results in document corruption.\n- Using Alt+Tab while copying no longer causes the application to stop responding.\n- Copying and pasting large files from Painter to an external application no longer causes the application to stop responding.\n\nApplication Settings\n- Memory Extender can be disabled/enabled without having to reset your workspace.\n- Multi-core settings are now maintained when changing workspaces.\n\nUsability\n- When using keyboard shortcuts that include special characters, you are no longer required to first click in the document window (For example. - square brackets [] for brush resize and CTRL + / - for zoom level).\n- Using the Arrow Keys to nudge a selection now works as expected.\n- Using the Arrow Keys to nudge shapes now works as expected.\n\nGeneral\n- Layers are no longer flattened when adding a Clone Source by using Open Source Image.\n- PSD files that contain grouped layer masks now open in Painter X3.\n- Playing back brushstrokes by using a script no longer distorts the density of the brushstrokes.\n- Multi-color samples are now maintained when changing brush parameters.\n- Layer Via Copy, Layer Via Paste, and Stroke Selection commands now function as expected.\n- Mac help no longer times out.\n\nWacom Tablet Support\n- Older Wacom drivers may cause application instability on startup or shutdown and may cause issues with your tablet's shortcut keys. To - prevent these issues from occurring, please install the most up-to-date Wacom driver.\n\nOS X Mavericks (10.9) Support\n- Sliders will now appear correctly.\n- Adding a nozzle to the library no longer causes the application to stop responding.\n- Adding an image to the Image Portfolio no longer causes the application to stop responding.\n- Capturing a pattern no longer causes the application to stop responding.\n\n\nNote: This version cannot be updated to a newer version, you will have to wait for the new version to be cracked before you can update to it!\n\n\nHOW TO INSTALL\n1. Mount DMG\n2. Install Corel Painter X3 (Corel Painter X3.mpkg)\n3. Install SP1 (Service Pack 1.mpkg)\n4. Patch (CPX3-Patch.app)","torrent":{"xt":"urn:btih:2820ebfde318e64083abaf3ee18faabb67cdd5d8","amp;dn":"Painter+X3+Mac+OS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2820ebfde318e64083abaf3ee18faabb67cdd5d8","infoHashBuffer":{"type":"Buffer","data":[40,32,235,253,227,24,230,64,131,171,175,62,225,143,170,187,103,205,213,216]},"announce":[],"urlList":[]}}