{"title":"Candy Dulfer - The Essential Candy Dulfer [2008][320 KBPS]","uid":11689438,"size":238565148,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:29080e8249630f3b704d9dff1c59e56b764d5513&amp;dn=Candy+Dulfer+-+The+Essential+Candy+Dulfer+%5B2008%5D%5B320+KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"LameDuck69","files":25,"time":1423459294,"description":"Candy Dulfer - The Essential Candy Dulfer [2008][320 KBPS]\n\n\n\n01 Lily Was Here\n02 Dance Till' You Bop\n03 Sax-A-Go-Go\n04 Pick Up The Pieces\n05 Funkyness\n06 Girls Should Stick Together\n07 So What\n08 Bob's Jazz\n09 2 Funky\n10 Wake Me Up When It's Over\n11 Girls Night Out\n12 What Does It Take (To Win Your Love For Me)\n13 I Can't Make You Love Me (Live)\n14 For The Love Of You (Live)\n15 Don't Go\n16 Still I Love You\n----------------------------------------\n**320 KBPS CBR\n**Cover Art\n----------------------------------------------------\nCandy Dulfer (born 19 September 1969) is a Dutch smooth jazz and funk alto saxophonist who began playing at the age of six. She founded her band, Funky Stuff, when she was fourteen years old. Her debut album Saxuality (1990) received a Grammy Award nomination. Dulfer has released nine studio albums, two live albums, and one compilation album. She has performed and recorded songs with musicians including her father Hans Dulfer, Prince, Dave Stewart, Van Morrison, and Maceo Parker, and has performed live with Alan Parsons (1995) and Pink Floyd (1990). She hosted the Dutch television series Candy meets... (2007), in which she interviews fellow musicians. In 2013 she became a judge in the fifth season of the Dutch version of The X Factor.\n------------------------------------------------------------------------\nCandy Dulfer was born on 19 September 1969 in Amsterdam in the Netherlands, as the daughter of saxophonist Hans Dulfer. She began playing the drums at the age of five. As a six-year-old she started to play the soprano saxophone. At the age of seven she switched to alto saxophone and later began playing in a local concert band Jeugd Doet Leven (English translation: &quot;Youth Brings Life&quot;) in Zuiderwoude.\n\nDulfer played her first solo on stage with her father's band De Perikels (&quot;The Perils&quot;). At the age of eleven, she made her first recordings for the album I Didn't Ask (1981) of De Perikels. In 1982, when she was twelve years old, she played as a member of Rosa King's Ladies Horn section at the North Sea Jazz Festival. According to Dulfer, King encouraged her to become a band leader herself. In 1984, at the age of fourteen, Dulfer started her own band Funky Stuff.\n--------------------------------------------------------------------------------\nDulfer's band performed throughout the Netherlands and in 1987 was the opening act for two of Madonna's European concerts.\n\nIn 1988 Prince invited Dulfer on stage to play an improvised solo during one of his European shows. In 1989 Dulfer appeared in Prince's &quot;Partyman&quot; video.\n\nDulfer performed session work with Eurythmics guitarist and producer Dave Stewart and was a guest musician for Pink Floyd at the band's performance at Knebworth in 1990.\n\nDulfer's debut album, Saxuality, was released in 1990 and was nominated for a Grammy and certified gold for worldwide sales in excess of half a million. Her song &quot;Lily Was Here&quot; reached No. 11 on American the Billboard Hot 100 chart. Though Dulfer has had smooth jazz chart hits such as &quot;For The Love of You&quot; and &quot;Finsbury Park, Cafe 67&quot;.\n\nDulfer was also the featured saxophonist on Van Morrison's A Night in San Francisco, an album in 1993, and performed with Alan Parsons and his band at the World Liberty Concert in 1995.\n\nDulfer collaborated with her father Hans Dulfer on the duet album Dulfer Dulfer in 2001.\n\nIn 2007, she released her ninth studio album Candy Store. The album reached a No. 2 position in Billboard's Top Contemporary Jazz charts. Her song Candy Store and the song &quot;L.A. Citylights&quot; reached the No. 1 position in Smooth Jazz National Airplay charts in the United States.\n\nDulfer is mostly a self-taught musician except for some training in a concert band and a few months of music lessons.\n\nIn 2007 Candy Dulfer was the presenter and interviewer in Candy meets..., her own television program for public broadcaster NPS. In the series she met with Sheila E., Maceo Parker, Hans Dulfer, Van Morrison, Dave Stewart, and Mavis Staples","torrent":{"xt":"urn:btih:29080e8249630f3b704d9dff1c59e56b764d5513","amp;dn":"Candy+Dulfer+-+The+Essential+Candy+Dulfer+%5B2008%5D%5B320+KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29080e8249630f3b704d9dff1c59e56b764d5513","infoHashBuffer":{"type":"Buffer","data":[41,8,14,130,73,99,15,59,112,77,157,255,28,89,229,107,118,77,85,19]},"announce":[],"urlList":[]}}