{"title":"The Bourne Ultimatum [XviD - Ita Eng Ac3][Tntvillage]","uid":5321731,"size":1676611584,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:29ac518801a7efbddb5c5c6f1fbd91149e1b2f79&amp;dn=The+Bourne+Ultimatum+%5BXviD+-+Ita+Eng+Ac3%5D%5BTntvillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":2,"uploader":"RDaneel20","files":1,"time":1264881112,"description":"The Bourne Ultimatum [XviD - Ita Eng Ac3][Tntvillage.Scambioetico]\n\n\n\nThe Bourne Ultimatum\n\nby giggio il grigio\n\n\n\n\n\n\n- Film Information -\n\nOriginal tile: THE BOURNE ULTIMATUM\nDirected by: Paul Greengrass\nInterpreti: Matt Damon, Paddy Considine, Edgar Ramirez, Julia Stiles, Joan Allen, David Strathairn, Scott Adkins\nNationality: USA 2007\nGenre: thriller\n\n\n- Review -\n\nThe Bourne Ultimatum is a 2007 spy film directed by Paul Greengrass and loosely based on the Robert Ludlum novel of the same name. The film is a sequel to The Bourne Supremacy and the third film of the Bourne Series. Matt Damon reprises his role as Ludlum's signature character, former CIA assassin and psychogenic amnesiac Jason Bourne. The film continues the saga of Jason Bourne as he escapes from authorities in Moscow, Russia, and follows the character as he travels to Paris, London, Madrid, Tangier, and New York City to uncover his real identity, while the CIA continues to send assassins after him. The film co-starred Julia Stiles, David Strathairn, Scott Glenn, Paddy Considine, Edgar Ramirez, Albert Finney, and Joan Allen. The script was by Tony Gilroy, Scott Z. Burns, George Nolfi, and an uncredited Tom Stoppard. The producers were Patrick Crowley, Frank Marshall, Paul L. Sandberg, and Doug Liman, who directed the first Bourne movie, The Bourne Identity.\n\nThe Bourne Ultimatum was produced by Universal Pictures and was released on August 3, 2007 in North America, where it grossed $69.3 million in ticket sales in its first weekend of release, making it the highest August opening in the U.S. Although all three films have been commercially successful and critically acclaimed, The Bourne Ultimatum is the only film in the trilogy to have been nominated for an Academy Award, winning all three of its nominations for Best Film Editing, Best Sound, and Best Sound Editing at the 80th Academy Awards. It has however, been criticised for its over use of the free motion method of filming or &quot;Shaky Cam&quot; method which some viewers have described as nauseating.\n\nPlot\n\nThe movie begins before the end of the events in The Bourne Supremacy, as Bourne, wounded by a gunshot from the Russian assassin Kirill, is still evading the Moscow police. He escapes.\nSix weeks later, Simon Ross, a security correspondent for The Guardian, meets with someone in Turin, to discuss Treadstone. Bourne meets Ross at Waterloo Station in London after having read Ross' article in The Guardian that went into detail about Bourne, Treadstone, and &quot;Operation Blackbriar.&quot; As Ross is told by Bourne to meet him at London Waterloo station in London, CIA officer Noah Vosen orders Paz, an assassin, to go after Ross, but intervention by Bourne stops that. Thinking that Bourne is the source, Vosen orders Paz to kill both Bourne and Ross, and in a moment of panic, Ross runs into view of Paz's sniper rifle and is shot dead. In the ensuing chaos, Bourne slips in unnoticed and takes Ross' notes and discovers that his source for the article was Neal Daniels, the Madrid CIA station chief.\nThe CIA also discovers that Ross' source was Daniels and sends a team out to raid his office. Bourne arrives first and finds nothing, as Daniels has already left. He subdues the CIA team as they storm the office. Nicky Parsons then arrives, and she gives the all-clear to Vosen and Deputy Director Pamela Landy, giving both her and Bourne time to escape, whilst the second team meant to arrest Bourne is captured by Spanish police. Parsons tells Bourne that Daniels is in Tangier and the two of them take the ferry to the Moroccan port. On arrival, Parsons logs in and finds the CIA has assigned Desh Bouksani to assassinate Daniels. Desh is given further orders to kill Parsons after Daniels. Bourne attempts to stop Desh, but Desh successfully detonates a bomb that kills Daniels. As Desh attempts to kill Parsons, Bourne attacks and strangles him after a long and brutal fight. Bourne has Parsons dye and cut her hair (much as he did with Marie) and puts her on a bus to escape.\nAt the Tangier morgue, Bourne examines Daniels' charred papers and finds the address of the CIA substation in New York City. Bourne takes a flight to New York City and calls Deputy Director Pamela Landy from a building across the street (recreating the final scene from The Bourne Supremacy). Landy begins walking outside and Bourne texts her to meet at a certain place, knowing the CIA is monitoring the communication. As the CIA teams and Vosen converge on Landy's position, Bourne breaks into Vosen's office and steals classified Blackbriar documents. Bourne then engages in a car chase around New York City with CIA agents and escapes..............\n\nFrom Wikipedia\n\n\n\n\n\n\n\n- Rip Specifications -\n\n[ Info sul file ]\n\nNome: The Bourne Ultimatum.avi\nData: 26/04/2009 01:52:08\nSize: 1,676,611,584 bytes (1598.941 MB)\n\n[ Info generiche ]\n\nLength: 01:50:31 (6630.96 s)\nTipo di contenitore: AVI OpenDML\nStreams totali: 3\nTipo stream n. 0: video\nTipo stream n. 1: audio\nTipo stream n. 2: audio\nAudio streams: 2\n\n\n[ Dati rilevanti ]\n\nResolution: 704 x 288\nLarghezza: multipla di 32\nAltezza: multipla di 32\n\n[ Traccia video ]\n\nFourCC: xvid/XVID\nResolution: 704 x 288\nFrame aspect ratio: 22:9 = 2.444444\nPixel aspect ratio: 1:1 = 1\nDisplay aspect ratio: 22:9 = 2.444444\nFramerate: 25 fps\nFrames totali: 165774\nStream size: 1,028,044,082 bytes\nBitrate: 1240.295923 kbps\nQf: 0.244692\nKey frames: 3419 (0; 300; 600; 667; 669; ... 165571)\nNull frames: 0\nMin key int: 1\nMax key int: 300\nKey int medio: 48.486107\nRitardo: 0 ms\n\n[ Traccia audio n. 1 ]\n\nAudio tag: 0x2000 (AC3)\nBitrate (contenitore): 384 kbps CBR\nCanali (contenitore): 5\nFrequenza (contenitore): 48000 Hz\nChunks: 165763\nStream size: 318,286,080 bytes\nPreload: 480 ms\nMax A/V diff: 496 ms\nChunk-aligned: No\nMode: 3 front, 2 rear, 1 LFE\nRitardo: 0 ms\n\n[ Traccia audio n. 2 ]\n\nAudio tag: 0x2000 (AC3)\nBitrate (contenitore): 384 kbps CBR\nCanali (contenitore): 5\nFrequenza (contenitore): 48000 Hz\nChunks: 165763\nStream size: 318,286,080 bytes\nPreload: 480 ms\nMax A/V diff: 496 ms\nChunk-aligned: No\nMode: 3 front, 2 rear, 1 LFE\nRitardo: 0 ms\n\n[ Info sulla codifica MPEG4 ]\n\nUser data: DivX503b1393p\nUser data: XviD0047\nPacked bitstream: SÃƒÂ¬\nQPel: No\nGMC: No\nInterlaced: No\nAspect ratio: Square pixels\nQuant type: MPEG\n\n[ Profile compliancy ]\n\nProfilo da testare: MTK PAL 6000\nResolution: Ok\nFramerate: Ok\n\n\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:29ac518801a7efbddb5c5c6f1fbd91149e1b2f79","amp;dn":"The+Bourne+Ultimatum+%5BXviD+-+Ita+Eng+Ac3%5D%5BTntvillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29ac518801a7efbddb5c5c6f1fbd91149e1b2f79","infoHashBuffer":{"type":"Buffer","data":[41,172,81,136,1,167,239,189,219,92,92,111,31,189,145,20,158,27,47,121]},"announce":[],"urlList":[]}}