{"title":"A Fabulous Kingdom: The Exploration of the Arctic","uid":15796165,"size":7391258,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2a54a597af4ee38bbc24547c946f774a713cebd3&amp;dn=A+Fabulous+Kingdom%3A+The+Exploration+of+the+Arctic&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":3,"uploader":"marty14","files":1,"time":1473460016,"description":"A Fabulous Kingdom: The Exploration of the Arctic - Charles Officer, Jake Page [epub]\r\n\r\nInconstant and forbidding, the arctic lured misguided voyagers into the cold for centuries--pushing them beyond the limits of their knowledge, technology, and stamina. A Fabulous Kingdom: Tales of the Arctic charts these quests and the eventual race for the North Pole in unprecedented detail, chronicling the lives and misconceptions that would eventually throw light on this &quot;magical realm&quot; of sunless winters.\r\n\r\nSetting the scene with an explanation of the arctic region's geography, geology, and climate, the authors present the physical and ideological barriers that faced early sailors traveling into the uncharted arctic realm. They then follow the explorers and the evolution of the arctic mission, from the early journeys of Viking Ottar, who rounded the North Cape ca. 870, to northern European expeditions in search of a Northwest or Northeast passage to the riches of sixteenth century Asia. The progressive exploits and findings of Martin Frobisher, John Davis, Henry Hudson, and William Edward Parry fueled the public's fascination with this new world of ice. Yet with the ill-fated voyage of Sir John Franklin, nations abandoned their belief in the arctic as the way to wealth. Henceforth, it would be private funding and personal motives that would lead English, Scandinavian, and American men with a redefined purpose: to reach the North Pole.\r\n\r\nWith a fascinating account of nineteenth and twentieth century exploration and the longstanding myth of an open polar sea, the authors reconsider the achievements of the conventional arctic pioneers--Frederick Cook, Robert Peary, and Richard Bird. Moreover, they consider the consequences and rewards of human ambition and our perilous desire to conquer the unknown","torrent":{"xt":"urn:btih:2a54a597af4ee38bbc24547c946f774a713cebd3","amp;dn":"A+Fabulous+Kingdom%3A+The+Exploration+of+the+Arctic","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a54a597af4ee38bbc24547c946f774a713cebd3","infoHashBuffer":{"type":"Buffer","data":[42,84,165,151,175,78,227,139,188,36,84,124,148,111,119,74,113,60,235,211]},"announce":[],"urlList":[]}}