{"title":"Cyclomancy - The Secret Of Psychic Power Control.pdf Gooner","uid":8751582,"size":19103691,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2a93a5efa3681635079fbea2e4b803b2a7cdd5a6&amp;dn=Cyclomancy+-+The+Secret+Of+Psychic+Power+Control.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"GoonerTPB","files":1,"time":1375044639,"description":"Frank Rudolph Young\n\nCyclomancy: The Secret of Psychic Power Control\n\nInfo:\n\nFrank Rudolph Young wrote:\nThe entire billion dollar nlp, seduction and to a large extent the modern radionics revival is being powered by the old, mostly out of print but still available Parker Publishing Company books. The books of Frank R. Young, &quot;The Einstein of The Occult&quot;, are among the most powerful of any of them. Amazing about how one of the female authors was the source of &quot;Remote Viewing&quot; (clairvoyance and out of body projection). The Russians wrote a technical manual 500 pages long on the Astral Body. It was named &quot;The Bio Plasmic Body&quot; I believe and deeply scientific because when it was written mysticism was a capital offense. These things are very real and the ignorance the average person has as regards it is orchestrated for obvious reasons. Fear of loss of power and control. The Russians even weighed the astral body (bio-plasmic body) after F.R.Y. and his family did. It's precisely 3/4s of an ounce. Fact not faith.\n\nSo as anyone who can point and click can discover FOR THEMSELVES, Governments have always made aggressive use of psychic and magic powers while dumbing down the general population with the circus (sports, TV and Hollywood). Don't settle for arguments and flame wars when you can do your own research and don't try to convince the profane. THIS KNOWLEDGE ISN'T FOR EVERYONE, IT DEFENDS ITSELF AND IT IS DANGEROUS IF USED RECKLESSLY. So very true that a Little Goes a Long Way. I speak from personal experience and will not answer your emails so don't bother.\n\nThe original &quot;007&quot; was a magician and spy for the Queen of England in the 16th and 17th centuries. His name was John Dee. True story. So you see it doesn't matter what the unfaithful say and why trouble yourself about that? Show some self control and let the unfaithful be as they are after all we're speaking of mental disciplines and yoga.\n\nFrank Rudolph Young was one of the most interesting and mysterious men of the 20th Century. A real Jedi Master if ever there was one. F.R.Y. had an interesting alias as a young handsome anatomical model. &quot;Mike Marvel&quot; became famous to a generation of fans of isometric body building. On this website you can see a picture of him as a young man and as a senior in his 70s: hikuta.net\n\nThe only interview that exists is in a book by famous author, Brad Steiger. The book is called Psychic Chicago and it contains another photograph of the man of mystery man:\n\nYeah, I know. Don't you ladies all swoon at once. lol\n\nHere is a list of glowing testimonies for the most popular of the 11 or 13 books written by Frank R. Young that are translated and sold around the world:\n\nLast but not least, here is a post by John Peterson who is a world famous author and trainer of &quot;physical culture&quot;. John and his students are uninterested in the occult powers of FRY for the most part (actually some are interested however that isn't their focus in the following post.). You see Frank walked the talk and looked like a million bucks til the day he died. So I repeat. Don't defend Frank Rudolph Young. His immortality speaks for itself. God bless.\n\n&quot;Hey Friends,\n\nYesterday a man e-mailed this question to me about Chiropractor Frank Rudolph Young's books wondering if he included Push-Ups in his training routines. The Answer is a very affirmative Y-E-S, yet not in the way you may think.\n\nHere's the deal. Frank Rudolph Young was brilliant. He compiled many exercises and concepts from Yoga (Maxick), Charles Atlas, Alois P Swoboda, and of course his own personal study. He was an expert in the field of muscular anatomy and applied physiology and as such created some fascinating exercise variations (that were based in what we call DVR/VRT &amp; Isometrics though he never called them by those names) that placed the muscles in unique positions ( that he referred to as their &quot;best angle of Pull&quot;) that allowed one to obtain incredibly intense muscular contractions that could not be achieved in any other way. He strongly denounced weight training as a method of exercise believing that it destroyed the skeletal structure at the expense of superficially building it's muscles for a very limited time. By this Young was referring to the same thing that I often refer to as &quot;Busted Up Weight Lifter Syndrome&quot;.\n\n( For our new participants to our forum &quot;Busted Up Weight Lifter Syndrome&quot; is where a man lifts heavier and heavier weights over a period of years to achieve more intense muscular contractions not realizing that he is destroying and compressing his spinal discs while over taxing his joints, ligaments, and tendons. In time this type of training results in permanent injury for the vast majority of men and as a consequence the man can no longer train. One often sees this kind of man at social gatherings bragging about how much he used to be able to &quot;bench&quot;. Such men are often so busted up and in so much pain that they can no longer train at all. To compensate they live in the past and brag about what they could once do.)\n\nNow back to Frank Rudolph Young. Yes, he taught certain Push-Up variations that I have seen no where else. Some were similar to Atlas style push-Ups in that they created an extended range of motion but the angles were different and they had to be performed exactly as described in order to perform them correctly. Many of his variations were very complex and worded in such a way that they were very difficult to understand. His two books with greatest number of Push-Up variations were 1) Yoga Secrets for Extraordinary Health and Long Life and 2) Somo-Psychic Power.\n\nYoung also wrote many other books on Extra Sensory Perception (ESP) and Psychic (mind) development. In fact, during the 1980's when I became a certified NLP practitioner I was at a seminar during which the group facilitator was making outrageous claims about NLP (Neuro Linguistic Programming) being an entirely new development in the field of neurological science. During a break I kindly told him that before he continues making those assertions in future seminars he should read Frank Rudolph Young's books because he would discover that Young taught many of the exact same concepts under different terminologies. Needless to say, he was amazed when I told him this.\n\nBottom line: I believe Frank Rudolph Young was a genius. And in many ways way ahead of his time. .\n\n---John Peterson&quot;","torrent":{"xt":"urn:btih:2a93a5efa3681635079fbea2e4b803b2a7cdd5a6","amp;dn":"Cyclomancy+-+The+Secret+Of+Psychic+Power+Control.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a93a5efa3681635079fbea2e4b803b2a7cdd5a6","infoHashBuffer":{"type":"Buffer","data":[42,147,165,239,163,104,22,53,7,159,190,162,228,184,3,178,167,205,213,166]},"announce":[],"urlList":[]}}