{"title":"DOOM 2: Hell on Earth","uid":6879437,"size":19141045,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2ac98bbc968f0620caf135f20c2ae81dbe0d007f&amp;dn=DOOM+2%3A+Hell+on+Earth&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":".CLOUD.","files":18,"time":1323596416,"description":"***********************************************************************************\n                                     .CLOUD.\n***********************************************************************************\n\nAn awsome classic game! no keys! Just install and play!\n\n\n    Immediately following the events in Doom, the player once again assumes the role of the nameless space marine. After returning home from Hell, the marine discovers that Earth has also been invaded by the demons, who have killed millions of people.\n\n    The humans who survived the attack have developed a plan to build massive spaceships which will carry the remaining survivors into space. Unfortunately, the only space port that's capable of launching said ships has been taken hostage by the demonic invaders, who have placed a &quot;force field&quot; over it, causing it to malfunction. The marine then battles through thousands of demons, and is able to deactivated the force field, allowing the remaining humans to escape. Once all the survivors escape Earth, the marine is the only human left on the planet.\n\n    Just as he sits down to await death, knowing that he saved mankind, the marine then receives an off-planet transmission from humans in orbit, who have managed to find out where the armies of Hell are coming from. The message reveals that the alien base is in the center of the marine's own home town. The marine then fights through the city until he reaches the base, but sees there is no way to stop the invasion on this side. He then decides to step into the portal to attempt deactivating it from the other side.\n\n    After fighting through the hordes of Hell, the marine reaches the house of the biggest demon (he has) ever seen, called the Icon of Sin. He kills the Icon of Sin by firing rockets into its exposed brain. The Icon of Sin's death results in the destruction of the Hellish portal. Now with Hell in ruins, the marine joins with the other humans in an effort to restore life on Earth.\n\n\nEnjoy! and please seed!\n\n\n***********************************************************************************\n                                     .CLOUD.\n***********************************************************************************","torrent":{"xt":"urn:btih:2ac98bbc968f0620caf135f20c2ae81dbe0d007f","amp;dn":"DOOM+2%3A+Hell+on+Earth","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ac98bbc968f0620caf135f20c2ae81dbe0d007f","infoHashBuffer":{"type":"Buffer","data":[42,201,139,188,150,143,6,32,202,241,53,242,12,42,232,29,190,13,0,127]},"announce":[],"urlList":[]}}