{"title":"The Future of the Brain: The Promise of Tomorrow's Neuroscience","uid":8578697,"size":1903785,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2acca504a03db4e66da669e02a6c43a1636d18d7&amp;dn=The+Future+of+the+Brain%3A+The+Promise+of+Tomorrow%27s+Neuroscience&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1371354710,"description":"Steven Rose, &quot;The Future of the Brain: The Promise and Perils of Tomorrow's Neuroscience&quot;\nISBN: 0195154207 | 2005 | EPUB\n\nBrain repair, smart pills, mind-reading machines--modern neuroscience promises to soon deliver a remarkable array of wonders as well as profound insight into the nature of the brain. But these exciting new breakthroughs, warns Steven Rose, will also raise troubling questions about what it means to be human.\n\nIn The Future of the Brain, Rose explores just how far neuroscience may help us understand the human brain--including consciousness--and to what extent cutting edge technologies should have the power to mend or manipulate the mind. Rose first offers a panoramic look at what we now know about the brain, from its three-billion-year evolution, to its astonishingly rapid development in the embryo, to the miraculous process of infant development. More important, he shows what all this science can--and cannot--tell us about the human condition. He examines questions that still baffle scientists and he explores the potential threats and promises of new technologies and their ethical, legal, and social implications, wondering how far we should go in eliminating unwanted behavior or enhancing desired characteristics, focusing on the new &quot;brain steroids&quot; and on the use of Ritalin to control young children.","torrent":{"xt":"urn:btih:2acca504a03db4e66da669e02a6c43a1636d18d7","amp;dn":"The+Future+of+the+Brain%3A+The+Promise+of+Tomorrow%27s+Neuroscience","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2acca504a03db4e66da669e02a6c43a1636d18d7","infoHashBuffer":{"type":"Buffer","data":[42,204,165,4,160,61,180,230,109,166,105,224,42,108,67,161,99,109,24,215]},"announce":[],"urlList":[]}}