{"title":"Thelonious Monk - Straight No Chaser [1988]","uid":7041681,"size":1467118056,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2b0098d4fbfac2484765005989722e8e87a57aed&amp;dn=Thelonious+Monk+-+Straight+No+Chaser+%5B1988%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"BiCiMAN","files":-1,"time":1329571426,"description":"Info:\n\nSiempre dÃƒÂ©jalos queriendo mÃƒÂ¡s... [Thelonious Monk]\n\nThelonious Sphere Monk (Rocky Mount, Carolina del Norte, 10 de octubre de 1917 - Weehawken, Nueva Jersey, 17 de febrero de 1982), conocido como Thelonious Monk, fue un pianista y compositor estadounidense de jazz. Su estilo interpretativo y compositivo, formado plenamente en 1947, apenas variÃƒÂ³ en los 25 aÃƒÂ±os siguientes. Pianista fundador del bebop, tocÃƒÂ³ tambiÃƒÂ©n bajo el influjo del hard bop y del jazz modal. Es conocido por su estilo ÃƒÂºnico de improvisaciÃƒÂ³n, asÃƒÂ­ como por haber compuesto varios temas clÃƒÂ¡sicos del repertorio jazzÃƒÂ­stico, destacando Round About Midnight, Straight No Chaser, 52nd Street Theme y Blue Monk. Personaje genial y enigmÃƒÂ¡tico, Thelonious Monk estÃƒÂ¡ considerado como uno de los mÃƒÂºsicos mÃƒÂ¡s influyentes de la historia del jazz despuÃƒÂ©s de la II Guerra Mundial, y, junto a Charlie Parker y Dizzy Gillespie, como el tercer pionero del bebop. Su interÃƒÂ©s por descubrir nuevas armonÃƒÂ­as, ritmos y estructuras lo convirtiÃƒÂ³ en un creador fundamental del jazz moderno. Hombre enigmÃƒÂ¡tico, difÃƒÂ­cil de tratar y de entender -a menudo pronunciaba sÃƒÂ³lo palabras ininteligibles-, creÃƒÂ³ un estilo que impresionÃƒÂ³ a la mayorÃƒÂ­a de los mÃƒÂºsicos de su ÃƒÂ©poca. Sin embargo, lo que destilaba su estilo eran ideas habitualmente difÃƒÂ­ciles de digerir y mÃƒÂ¡s difÃƒÂ­ciles de copiar. En 1988, Clint Eastwood se encargÃƒÂ³ de la producciÃƒÂ³n ejecutiva de una pelÃƒÂ­cula sobre Thelonious Monk: 'Straight, No Chaser' (Solo, sin hielo) de Charlotte Zwerin. Zwerin rueda entrevistas a familiares, amigos y compaÃƒÂ±eros mÃƒÂºsicos de Monk. AsÃƒÂ­mismo, recupera fotografÃƒÂ­as de archivo, fragmentos de audio e incorpora interesantes interpretaciones de algunos temas de Monk en solitario y con su banda. Pero lo que consigue atrapar de 'Straight, No Chaser' es el extenso metraje en blanco y negro que sigue al mÃƒÂºsico en su vida cotidiana y que destaca por encima de todo. Escenas con un grano espeso persiguiendo a Monk por el mundo, desde aeropuertos, estudios de grabaciÃƒÂ³n y hoteles. Una manera ÃƒÂºnica de acercarse a uno de los padres del bebop, pieza fundamental de la historia del jazz con mayÃƒÂºsculas. \n\n--------------------------------------------------------------------------------\n\nCalidad: DVDRip\n\nFormato: avi (xvid)\n\nAudio: MP3\n\nIdioma: InglÃƒÂ©s\n\nSubtÃƒÂ­tulos: EspaÃƒÂ±ol (archivo srt)\n\n--------------------------------------------------------------------------------\n\nPOR FAVOR, Ã‚Â¡COMPARTE! | PLEASE, SHARE!","torrent":{"xt":"urn:btih:2b0098d4fbfac2484765005989722e8e87a57aed","amp;dn":"Thelonious+Monk+-+Straight+No+Chaser+%5B1988%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b0098d4fbfac2484765005989722e8e87a57aed","infoHashBuffer":{"type":"Buffer","data":[43,0,152,212,251,250,194,72,71,101,0,89,137,114,46,142,135,165,122,237]},"announce":[],"urlList":[]}}