{"title":"The Architecture of Roman Temples (Art History Ebook)","uid":11777918,"size":209327039,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2b3b0b0ce8522929580e76633584abf22dabec58&amp;dn=The+Architecture+of+Roman+Temples+%28Art+History+Ebook%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"STBGD","files":1,"time":1427406788,"description":"The Architecture of Roman Temples: The Republic to the Middle Empire\n\n2005 | 304 Pages | ISBN: 052181068X | PDF | 199 MB\n\nThis book examines the development of Roman temple architecture from its earliest history in the sixth century B.c. to the reigns of Hadrian and the Antonines in the second century A.D. Although archaeologists, architects, and historians have studied these temples since the Renaissance, this book is unique for its specific analysis of Roman temples as a building type. John Stamper analyzes their formal qualities, the public spaces in which they were located, and, most importantly, the authority of precedent in their designs. The basis ofthat authority was the Temple of Jupiter Capitolinus, the city's first and most important temple. Stamper challenges the accepted reconstruction of this temple, proposing a new reconstruction and an assessment of its role in the transformation of Rome. He also traces Rome's temple architecture as it evolved over time and how it accommodated changing political and religious contexts, as well as the effects of new stylistic influences.\nJohn W. Stamper is Associate Professor and Associate Dean in the School of Architecture at the University of Notre Dame. Both an architect and architectural historian, he is the author of Chicago's North Michigan Avenue: Planning and Development, 1900-1930","torrent":{"xt":"urn:btih:2b3b0b0ce8522929580e76633584abf22dabec58","amp;dn":"The+Architecture+of+Roman+Temples+%28Art+History+Ebook%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b3b0b0ce8522929580e76633584abf22dabec58","infoHashBuffer":{"type":"Buffer","data":[43,59,11,12,232,82,41,41,88,14,118,99,53,132,171,242,45,171,236,88]},"announce":[],"urlList":[]}}