{"title":"RuPauls.Drag.Race.S06E03+Untucked.1080p-fabutrash","uid":9743629,"size":2423375065,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:2b3c31a5589b9f715f5602b7770911196a1571ee&amp;dn=RuPauls.Drag.Race.S06E03%2BUntucked.1080p-fabutrash&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":10,"uploader":"fabutrash","files":-1,"time":1394551587,"description":"RuPauls.Drag.Race.S06E03+Untucked.1080p-fabutrash\n-------------------------------------------------\n\nEpisode: 03 - Scream Queens\n---------------------------\nThe queens put the &quot;fear&quot; in &quot;fierce&quot; as they act in a drag horror movie franchise. With guest judges Lena Headey (Game Of Thrones) and Linda Blair (The Exorcist).\n\nJust when you thought you knew what to expect from RuPaul's Drag Race, along comes the ferociously fabulous and funny Season Six, with enough tricks up its silk chiffon sleeve to keep you on your painted toes! This crop of queens is our most diverse yet, from seasoned pros, to an international drag star, to a former American Idol contestant, and even some fresh-faced ingenue queens who were inspired to be drag performers by watching Season One of RuPaul's Drag Race! That's one leggy legacy. Have we mentioned that these boys are hot? Because they are. Have we mentioned they make even hotter women? Because they do.\n\n\nEpisode: 03 - Scream Queens, Untucked!\n--------------------------------------\nOne of the queens deals with being singled out as the girl most in need of being sent home from the competition. Plus the queens must open four pink boxes containing scary surprises.\n\nRuPaul's Drag Race: Untucked! is the access-all-areas pass to the drama that you didn't see on the runway- the backstage bitchiness, the catfights, the struggles, the tears and the secrets. See what happens behind the scenes when the queens let their tucks breathe... and let their emotions flow. Will the drag queens crack under the pressure of competing to become America's next drag superstar? RuPaul narrates us through the trials and tribulations of what happens when a gaggle of queens are up against each other... and themselves.\n\nTechnical:\n----------\nResolution: HD 1080p (High Definition Shade)\nVideo Codec: H264 MP4\nAudio Codec: AAC Stereo 48000Hz\nRating: TVMA - Mature Audience Only (Uncensored)\n\nGreetings:\n----------\nA big shout out those serving in the military. YOU BETTA WERK! Love you guys xx","torrent":{"xt":"urn:btih:2b3c31a5589b9f715f5602b7770911196a1571ee","amp;dn":"RuPauls.Drag.Race.S06E03%2BUntucked.1080p-fabutrash","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b3c31a5589b9f715f5602b7770911196a1571ee","infoHashBuffer":{"type":"Buffer","data":[43,60,49,165,88,155,159,113,95,86,2,183,119,9,17,25,106,21,113,238]},"announce":[],"urlList":[]}}