{"title":"Wings of Prey Collectors Edition (2011) [PCDVD][MULTi9]","uid":6903869,"size":11948566528,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2b55e9a0b495d0473ed102b5dc9d5229fbdbf527&amp;dn=Wings+of+Prey+Collectors+Edition+%282011%29+%5BPCDVD%5D%5BMULTi9%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":6,"uploader":"webchella","files":1,"time":1324503128,"description":"Wings of Prey Collector's Edition (2011) [PCDVD][MULTi9]\n &lt;a href=&quot;\nhttp://www.ag.ru/games/wings_of_prey&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.ag.ru/games/wings_of_prey&lt;/a&gt; &lt;a href=&quot;\nhttp://uk.pc.ign.com/objects/104/104746.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://uk.pc.ign.com/objects/104/104746.html&lt;/a&gt;\n\nEnglish:\n---------\nYear: 2011\nGenre: Simulator (Flight Combat) / 3D\nPlatform: PC\nDeveloper: Gaijin Entertainment\nPublished by: Gaijin Entertainment\n\nPublication Type: license\nLicense: Freeware\nLanguage: Russian (RUS), English (ENG), German (DE), Spanish (SPA), French (FRE), Italian (ITA), Polish (POL), Japanese (JAP), Czech (CZ)\nSize: 11.13 GB\n\nAll information is: \n\nDescription:\nVersion of the game - 1.0.4.7\nBirds of Prey: The Collector's Edition includes:\n\nBirds of Prey\nDescription:\n&quot;Birds of Prey&quot; - a new military and historical aircraft simulator, which is based on real large-scale operations during the Second World War. The player will take the helm of a fighter, bomber or attack aircraft. Become a member of the most famous battles in the skies over Europe, including the battle for Berlin, Britain and Sicily, as well as Stalingrad and Korsun-Shevchenko battle!\n\n&quot;Birds of Prey&quot; show incredible graphics and a stunning level of realism. The behavior of aircraft reproduced as accurately as possible, and detailed damage system will display the most epic battle in the sky, what you can imagine. Are you ready for an uncompromising air battles? Then fasten your seat belts and stronger pull on his helmet, because you feel one of the most realistic simulator aircraft ever available for PC!\n\nFeatures:\n\nThe battles take part in hundreds of air and ground equipment. You will see from the cockpit of his plane full scale World War II, where the burgeoning explosion front line will unfold before you as the palm.\nTake part in more than 50 missions in the skies over Western and Eastern Europe.\nGo behind the controls of a variety of combat aircraft, including Soviet Elah, and La Yaqui, British Spitfire, American Mustang and Thunderbolt, German Messerschmitt, Focke-Wulf, Junkers, and others.\nFrom a simplified regime for beginners to serious simulation.\nDetailed system damage and the most realistic flight model.\nFour collective mode with up to 32 people.\nSupport all kinds of game controllers, including a 6-DOF TrackIR, TripleHead2GO, as well as headsets for voice chat in multiplayer mode.\nSupport for add-ons downloaded through the service yuPlay: new aircraft and missions.\nInimitable music from a master of notes Jeremy Soule, who worked on projects such as The Elder Scrolls, Unreal II and Baldur's Gate.\n\nBirds of Prey: Wings of Luftwaffe\nDescription:\nSupplement contains ten single missions with support of the cooperative game modes for up to four players, two new aircraft and more than 40 new colorings for aircraft.\n\nIn Wings of Luftwaffe you will end up as a German pilot, becoming a party to the hottest battles in the skies over Britain, Sicily, the USSR, Belgium and Germany. Try to imagine all the passions in a variety of missions, from battles with squadrons of enemy fighters, to the bombing of ground targets in Stalingrad!\n\nAre you ready to take the place of the best Luftwaffe aces? Then slide the lantern and get ready for take off, because the game will throw in the thick of World War II!\n\nFeatures:\n\nTry on the role of a German pilot.\nTake the test in 10 intense missions.\nTake part in the co-op game mode for up to 4 players.\nIf there had been at the helm of two new aircraft: Ju 88 A4 and P-39N-0.\nOver 40 new colorings for aircraft.\n\nMinimum system requirements:\nProcessor: Intel Pentium 4 3200 MHz (or equivalent)\nMemory: 1024 MB\nGraphics Card: NVIDIA GeForce 7600 256 MB\nHard drive (HDD): 10GB of free disk space for installation of the game.\nOperating System: Microsoft Windows XP SP3, library DirectX 9.0c.\nSound Card compatible with DirectX (AC `97 or similar);\n\nRecommended system requirements:\nProcessor: Intel Core 2 Duo 2400 MHz (or equivalent)\nMemory: 2048 MB\nGraphics Card: NVIDIA GeForce GTS 250 512 MB\nHard drive (HDD): 10GB of free disk space for installation of the game.\nOperating System: Microsoft Windows XP SP3 c library DirectX 9.0c / Microsoft Windows Vista SP1 / Microsoft Windows 7\nSound Card compatible with DirectX (AC `97 or similar) with support for 5.1 channel sound.\n\n\nEspaÃƒÂ±ol:\n--------\nAÃƒÂ±o: 2011\nGÃƒÂ©nero: Simulador (Combat Flight) / 3D\nPlataforma: PC\nDesarrollador: Gaijin Entertainment\nPublicado por: Gaijin Entertainment\n\nTipo de PublicaciÃƒÂ³n: licencia\nLicencia: Freeware\nIdioma: Ruso (RUS), InglÃƒÂ©s (ENG), alemÃƒÂ¡n (DE), espaÃƒÂ±ol (SPA), francÃƒÂ©s (FRE), Italia (ITA), Polonia (POL), JapÃƒÂ³n (JAP), Checa (CZ)\nTamaÃƒÂ±o: 11,13 GB\n\nToda la informaciÃƒÂ³n es: http://www.ag.ru/games/wings_of_prey\n\nDescripciÃƒÂ³n:\nVersiÃƒÂ³n del juego - 1.0.4.7\nBirds of Prey: La EdiciÃƒÂ³n Coleccionista incluye:\n\nBirds of Prey\nDescripciÃƒÂ³n:\n&quot;Birds of Prey&quot; - un simulador de nuevos aviones militares e histÃƒÂ³ricos, que se basa en la verdadera gran escala durante la Segunda Guerra Mundial. El jugador tomarÃƒÂ¡ el timÃƒÂ³n de un aviÃƒÂ³n de combate, bombarderos o ataque. Convertirse en un miembro de las batallas mÃƒÂ¡s famosas en los cielos de Europa, incluyendo la batalla de BerlÃƒÂ­n, Gran BretaÃƒÂ±a y Sicilia, asÃƒÂ­ como la batalla de Stalingrado y Korsun-Shevchenko!\n\n&quot;Birds of Prey&quot; mostrar unos grÃƒÂ¡ficos increÃƒÂ­bles y un impresionante nivel de realismo. El comportamiento de los aviones reproduce con la mayor precisiÃƒÂ³n posible, y el sistema mostrarÃƒÂ¡ detallada de los daÃƒÂ±os de la batalla mÃƒÂ¡s ÃƒÂ©pica en el cielo, lo que te puedas imaginar. Ã‚Â¿EstÃƒÂ¡s listo para una batalla aÃƒÂ©rea sin compromisos? A continuaciÃƒÂ³n, abrÃƒÂ³chense los cinturones de seguridad y mÃƒÂ¡s fuerte tirÃƒÂ³n en su casco, porque se siente uno de los aviones simulador mÃƒÂ¡s realista disponible para PC!\n\nCaracterÃƒÂ­sticas:\n\nLas batallas de participar en cientos de equipos de aire y tierra. Como verÃƒÂ¡n en la cabina de su aviÃƒÂ³n a escala real la Segunda Guerra Mundial, donde la lÃƒÂ­nea de frente creciente explosiÃƒÂ³n se desplegarÃƒÂ¡ ante ti como la palma.\nTomar parte en mÃƒÂ¡s de 50 misiones en los cielos de Europa Occidental y Oriental.\nIr a los mandos de una variedad de aviones de combate, incluidos los soviÃƒÂ©ticos Ela, y Yaqui La, Spitfire britÃƒÂ¡nicos, estadounidenses y Mustang Thunderbolt, Messerschmitt alemÃƒÂ¡n, Focke-Wulf, Junkers, y otros.\nDe un rÃƒÂ©gimen simplificado para principiantes a la simulaciÃƒÂ³n seria.\nDaÃƒÂ±os en el sistema detallado y el modelo de vuelo mÃƒÂ¡s realista.\nCuatro modo colectivo con un mÃƒÂ¡ximo de 32 personas.\nSoporta todos los tipos de controladores de juego, incluyendo un TrackIR 6-DOF, TripleHead2Go, asÃƒÂ­ como auriculares para el chat de voz en modo multijugador.\nApoyo a los complementos descargados a travÃƒÂ©s del servicio de yuPlay: nuevos aviones y misiones.\nMÃƒÂºsica inimitable de un maestro de las notas de Jeremy Soule, quien trabajÃƒÂ³ en proyectos como The Elder Scrolls, II Unreal y la Puerta de Baldur.\n\nBirds of Prey: Alas de la Luftwaffe\nDescripciÃƒÂ³n:\nSuplemento contiene diez misiones para un solo con el apoyo de los modos de juego cooperativo para hasta cuatro jugadores, dos nuevos aviones y mÃƒÂ¡s de 40 nuevos colorantes para los aviones.\n\nEn Alas de la Luftwaffe que va a terminar como un piloto alemÃƒÂ¡n, convirtiÃƒÂ©ndose en una de las partes mÃƒÂ¡s calientes de la batalla en los cielos de Gran BretaÃƒÂ±a, Sicilia, la URSS, BÃƒÂ©lgica y Alemania. Trate de imaginar todas las pasiones en una variedad de misiones, de las batallas con los escuadrones de cazas enemigos, al bombardeo de objetivos terrestres en Stalingrado!\n\nÃ‚Â¿EstÃƒÂ¡s listo para tomar el lugar de los mejores ases de la Luftwaffe? A continuaciÃƒÂ³n, deslice la linterna y se preparan para el despegue, porque el juego se lanzan en el fragor de la Segunda Guerra Mundial!\n\nCaracterÃƒÂ­sticas:\n\nProbar el papel de un piloto alemÃƒÂ¡n.\nTomar la prueba en 10 intensas misiones.\nTomar parte en el modo de juego cooperativo para hasta 4 jugadores.\nSi hubiera estado al frente de dos nuevos aviones: Ju 88 A4 y P-0-39N.\nMÃƒÂ¡s de 40 nuevos colorantes para los aviones.\n\nRequisitos mÃƒÂ­nimos del sistema:\nProcesador: Intel Pentium 4 3200 MHz (o equivalente)\nMemoria: 1024 MB\nTarjeta grÃƒÂ¡fica: NVIDIA GeForce 7600 256 MB\nDisco duro (HDD): 10 GB de espacio libre en disco para la instalaciÃƒÂ³n del juego.\nSistema operativo: Microsoft Windows XP SP3, la biblioteca DirectX 9.0c.\nTarjeta de sonido compatible con DirectX (AC `97 o similar);\n\nRequisitos del sistema recomendados:\nProcesador: Intel Core 2 Duo 2400 MHz (o equivalente)\nMemoria: 2048 MB\nTarjeta grÃƒÂ¡fica: NVIDIA GeForce GTS 250 512 MB\nDisco duro (HDD): 10 GB de espacio libre en disco para la instalaciÃƒÂ³n del juego.\nSistema operativo: Microsoft Windows XP Service Pack 3 c biblioteca DirectX 9.0c / Microsoft Windows Vista SP1 / Microsoft Windows 7\nTarjeta de sonido compatible con DirectX (AC `97 o similar) con soporte para sonido de 5.1 canales.","torrent":{"xt":"urn:btih:2b55e9a0b495d0473ed102b5dc9d5229fbdbf527","amp;dn":"Wings+of+Prey+Collectors+Edition+%282011%29+%5BPCDVD%5D%5BMULTi9%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b55e9a0b495d0473ed102b5dc9d5229fbdbf527","infoHashBuffer":{"type":"Buffer","data":[43,85,233,160,180,149,208,71,62,209,2,181,220,157,82,41,251,219,245,39]},"announce":[],"urlList":[]}}