{"title":"The Essential Alice in Chains 2-CD Set [FLAC+MP3](Big Papi)","uid":9633172,"size":1188762268,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2b9cd58596ed31ad693486ae3f710ad3091b5f91&amp;dn=The+Essential+Alice+in+Chains+2-CD+Set+%5BFLAC%2BMP3%5D%28Big+Papi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":4,"uploader":"Big-Papi","files":-1,"time":1392771476,"description":"By Angry Mofo\n\nThere are already two Alice In Chains compilations out there, and they have all of the most popular songs, but they kind of miss the most interesting thing about Alice In Chains. This band is usually classified as either grunge or metal, which is a perfectly accurate label if you only listen to their three studio albums. But they also released two short EPs that showed a much quieter and more contemplative side of their sound. These EPs contain moody, bluesy songs performed on acoustic guitars. I guess it's not really that big of a departure (didn't metal start out as just a really loud variation on the blues?) but it's also quite different from what their less subtle contemporaries were doing.\n\nThe thing is, singer Layne Staley's voice was perfectly suited to low-key introspective songs. He could yell better than most others, too, but on the softer numbers, he could sing in a very haunting, sombre drawl that many later singers have tried and failed to imitate. And that gave depth to Alice In Chains. Somehow they always seemed more serious than the other grunge bands.\n\nThe ideal Alice In Chains compilation should show that side together with the loud, rockin' singles. This compilation tries to do that, but misses the two most important songs. It contains almost all of the band's most popular album Dirt, except, inexplicably, the one softer song &quot;Down In A Hole,&quot; which perfectly encapsulates this thoughtful side of the band and contrasts well with the loud and angry songs on the album. Then, the compilation touches on the band's second EP Jar Of Flies, but doesn't include the opening song &quot;Rotten Apple,&quot; which has a beautiful opening build-up and a moving, world-weary vocal by Staley. Immediately, the compilation's claim to gathering the &quot;essential&quot; Alice in Chains goes out the window. It's a pity. The record company really could have fit both songs somewhere on two CDs.\n\nThe truly &quot;essential&quot; Alice In Chains consists of two albums, Dirt and Jar Of Flies. Those two albums cost less put together than this one. So, if you don't know anything about this band, it would be more logical to get those two albums instead of this compilation. And if you're a big fan of the band, then you probably already have the box set, so this compilation will contain nothing that you aren't familiar with.\n\nBut if you already own and like Dirt and Jar Of Flies, but not the other albums, then this compilation becomes surprisingly relevant. First of all, it contains the entire Sap EP (except for the bonus track, which isn't good anyway). Then, it has four songs from the band's first album Facelift, including both of the well-known singles. This should be all you need from the debut unless you're a really big fan, in which case you already own the whole album. The band's third and final album is represented by four very good songs, one in a live rendition. The rest of the album is also good, so maybe the compilation should have covered more of it at the expense of some songs from Dirt, but again, compilations aren't really made for the band's biggest fans.\n\nFurther still, the compilation contains two non-album tracks, &quot;What The Hell Have I&quot; and &quot;A Little Bitter,&quot; which appeared on the Last Action Hero soundtrack. &quot;A Little Bitter&quot; doesn't appear on either of the previous two Alice In Chains compilations, so it's even kind of rare. There are also a couple of tracks from the Unplugged live album. They're not really essential, but if you have Dirt and Jar Of Flies, you might find them interesting.\n\nAnd finally, this compilation contains both of the band's last songs, &quot;Get Born Again&quot; and &quot;Died,&quot; which were recorded during a brief reunion in 1998. &quot;Get Born Again&quot; is included on the Nothing Safe compilation, but &quot;Died&quot; has previously been unavailable anywhere other than the box set. These are the most valuable inclusions on this compilation, because they're the band's best &quot;metal&quot; songs, featuring Layne Staley's finest performances. &quot;Died&quot; is not only the more obscure of the two, but the better one as well. Staley's lyrics were always really vague, but this song contains a seemingly clear allusion to events in his own life, and listening to it, maybe it's understandable that he sort of gave up.\n\nIn conclusion, this compilation doesn't replace the best Alice In Chains albums, but it does replace all of the previous compilations. If you can't or don't want to get the box set, then this is a good choice to round off your Alice In Chains collection, since it does give you a few great rarities and a whole EP in addition to the hits and album tracks. But if you really want to have all of their songs, then of course there's no point in bothering with it. Then again, if that's the case, then you own the box set, and you're not reading this review.\n\n\n---------------------------------------------------------------------\nAlice in Chains - The Essential Alice in Chains\n---------------------------------------------------------------------\n\nArtist...............: Alice in Chains\nAlbum................: The Essential Alice in Chains\nGenre................: Pop/Rock\nSource...............: CD\nYear.................: 2006\n\nFLAC\n\nRipper...............: EAC (Secure mode) / LAME 3.92 &amp; Asus CD-S520\nCodec................: Free Lossless Audio Codec (FLAC)\nVersion..............: reference libFLAC 1.2.1 20070917\nQuality..............: Lossless, (avg. compression: 67 %)\nChannels.............: Stereo / 44100 HZ / 16 Bit\n\nMP3 V0 (Highest Quality Available For MP3)\n\nRipper...............: EAC (Secure mode) / LAME 3.92 &amp; Asus CD-S520\nCodec................: LAME 3.99\nVersion..............: MPEG 1 Layer III\nQuality..............: Extreme, (avg. bitrate: 278kbps)\nChannels.............: Joint Stereo / 44100 hz\n\n---------------------------------------------------------------------\nDisc 1 Tracklisting\n---------------------------------------------------------------------\n\n1. Alice in Chains - We Die Young [02:32]\n2. Alice in Chains - Man in the Box [04:46]\n3. Alice in Chains - Sea of Sorrow [05:50]\n4. Alice in Chains - Love, Hate, Love [06:28]\n5. Alice in Chains - Am I Inside [05:09]\n6. Alice in Chains - Brother [04:28]\n7. Alice in Chains - Got Me Wrong [04:11]\n8. Alice in Chains - Right Turn [03:14]\n9. Alice in Chains - Rain When I Die [06:03]\n10. Alice in Chains - Them Bones [02:30]\n11. Alice in Chains - Angry Chair [04:48]\n12. Alice in Chains - Dam That River [03:10]\n13. Alice in Chains - Dirt [05:16]\n14. Alice in Chains - God Smack [03:50]\n15. Alice in Chains - Hate to Feel [05:16]\n16. Alice in Chains - Rooster [06:16]\n\nPlaying Time.........: 01:13:56\n\n---------------------------------------------------------------------\nDisc 2 Tracklisting\n---------------------------------------------------------------------\n\n1. Alice in Chains - No Excuses [04:16]\n2. Alice in Chains - I Stay Away [04:14]\n3. Alice in Chains - What the Hell Have I (Remix) [03:54]\n4. Alice in Chains - A Little Bitter (Remix) [03:48]\n5. Alice in Chains - Grind [04:46]\n6. Alice in Chains - Heaven Beside You [05:29]\n7. Alice in Chains - Again [04:05]\n8. Alice in Chains - Over Now (Unplugged Version) [05:57]\n9. Alice in Chains - Nutshell (Unplugged Version) [04:32]\n10. Alice in Chains - Get Born Again [05:24]\n11. Alice in Chains - Died [05:57]\n12. Alice in Chains - Would? [03:28]\n\nPlaying Time.........: 55:54\n\n\n---------------------------------------------------------------------\n\nRipped using dBpoweramp. No need for error logs the AccurateRip data is \nembedded in each track. Big Papi may try and slip one by now and then so \nkeep a close eye on him!! \n\nAll Big Papi rips are directly from CD or vinyl unless stated otherwise.\n---------------------------------------------------------------------","torrent":{"xt":"urn:btih:2b9cd58596ed31ad693486ae3f710ad3091b5f91","amp;dn":"The+Essential+Alice+in+Chains+2-CD+Set+%5BFLAC%2BMP3%5D%28Big+Papi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b9cd58596ed31ad693486ae3f710ad3091b5f91","infoHashBuffer":{"type":"Buffer","data":[43,156,213,133,150,237,49,173,105,52,134,174,63,113,10,211,9,27,95,145]},"announce":[],"urlList":[]}}