{"title":"The Curious Incident of the Dog in the Nighttime","uid":3756670,"size":224746063,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2c46c6fc357cdb3a309baa72b8325e0b82453d0c&amp;dn=The+Curious+Incident+of+the+Dog+in+the+Nighttime&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"smartskallen","files":110,"time":1185715752,"description":"It&amp;#039;s not just the hook, though the hook is peculiar and oddly affecting. &quot;When I was writing,&quot; the author allows, &quot;I really thought to myself, Who on Earth is going to want to read about a fifteen-year-old kid with a disability living in Swindon with his father? And I thought, I better make the plot good.&quot; The hook?the plot ? is significantly better than good, but it&amp;#039;s the irresistible voice of Mark Haddon&amp;#039;s young narrator, Christopher Boone, that elevates this literary debut to fantastic heights. \nIt was 7 minutes after midnight. The dog was lying on the grass in the middle of the lawn in front of Mrs. Shears&amp;#039; house. Its eyes were closed. It looked as if it was running on its side, the way dogs run when they think they are chasing a cat in a dream. But the dog was not running or asleep. The dog was dead. There was a garden fork sticking out of the dog. \n \n&quot;This is a murder mystery novel,&quot; the boy with Behavioral Problems explains a few pages further on. A fan of Sherlock Holmes stories, Christopher decides to investigate the poodle&amp;#039;s murder and turn the story into a book of his own. \n\nChristopher is quite good at puzzles, at math, and at remembering. He is, however, entirely incapable of delineating among the various grades of human emotion on the scale between happy and sad, which makes for a curious, if not altogether perplexing perspective. The narrator may not recognize them, but emotions lurk behind virtually every clue he uncovers. Still, his pitch never varies. Christopher never slips off course. The author&amp;#039;s foremost accomplishment, in a book chock full of them, is to deliver a wrenching domestic fiction in such clipped, deductive prose. The Curious Incident of the Dog in the Night-Time is an emotional roller coaster. And as if that&amp;#039;s not enough, it&amp;#039;s often very funny, too. \n\n&quot;It&amp;#039;s hilarious on one page, then two pages later you want to cry.&quot; \n\n\n\nAsperger syndrome in first person.\n","torrent":{"xt":"urn:btih:2c46c6fc357cdb3a309baa72b8325e0b82453d0c","amp;dn":"The+Curious+Incident+of+the+Dog+in+the+Nighttime","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c46c6fc357cdb3a309baa72b8325e0b82453d0c","infoHashBuffer":{"type":"Buffer","data":[44,70,198,252,53,124,219,58,48,155,170,114,184,50,94,11,130,69,61,12]},"announce":[],"urlList":[]}}