{"title":"[Clips4Sale] Charlee Chase (Happy Birthday Son)","uid":9321045,"size":974320413,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:2c9ca4fe046bf5418aae551a76a55db8a76fe0c2&amp;dn=%5BClips4Sale%5D+Charlee+Chase+%28Happy+Birthday+Son%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"chkm8te","files":1,"time":1386552262,"description":"[Clips4Sale] Charlee Chase (Happy Birthday Son)\n\nIt's Lance's birthday and his mom decides that the best present she can give him is a good long fuck.\nIt's Lance's birthday and his mother, Charlee Chase, decides that she needs to give him a really special present. Charlee puts on some very sexy lingerie and finds Lance lounging on his bed. Lance is a little shocked to see his step mom coming into his room wearing sexy lingerie. Charlee tells him happy birthday and informs him that she's there to give him a special present and that the special present was her having sex with him.\nLance is both shocked and excited by this. He asks what his father would do if he found out. Charlee informs him that it was Lance's father's idea and that they had already discussed her coming to his room and fucking him for his birthday. Lance now realizes that he's going to get the best birthday present he's ever had.\nCharlee gets on the bed with Lance and pulls his pants down and start sucking his cock. As she sucks his cock he becomes harder and more excited. After having his cock so expertly sucked by Charlee Chase he turns her over and starts to lick her pussy to get it good and wet so he can put his dick deep inside her. He finds out just how much his step mom loves to have her pussy licked seeing her get wetter and wetter.\nFinally its time to fuck his mother. He loves the feel of his cock sliding so deep in her pussy. She loves the feel of his cock and as he fucks her in different positions her pussy cream runs out on his cock nice and creamy white.\nAfter totally satisfying his mother with his cock she asks him if he want to cum. He says yes and she asks him to cum on her face and tits so she can play with his cum and taste it. Lance being the good son does as he's asked and blows his cum all over Charlee's face and tits. It's been the best birthday he's ever had.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=9q2rzp2w0n6hluqcdmtp.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=9q2rzp2w0n6hluqcdmtp.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=kq127shslfw39vuzgiuu.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=kq127shslfw39vuzgiuu.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:2c9ca4fe046bf5418aae551a76a55db8a76fe0c2","amp;dn":"%5BClips4Sale%5D+Charlee+Chase+%28Happy+Birthday+Son%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c9ca4fe046bf5418aae551a76a55db8a76fe0c2","infoHashBuffer":{"type":"Buffer","data":[44,156,164,254,4,107,245,65,138,174,85,26,118,165,93,184,167,111,224,194]},"announce":[],"urlList":[]}}