{"title":"The New Rules of Lifting for Life: An All-New Muscle-Building, F","uid":8390628,"size":16620365,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2d375af5b57b5eefd4b08bf50c511f44673e4168&amp;dn=The+New+Rules+of+Lifting+for+Life%3A+An+All-New+Muscle-Building%2C+F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"MANTESH","files":1,"time":1366419006,"description":" &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51aAXbYuQ9L.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51aAXbYuQ9L.jpg&lt;/a&gt;\n\n\n - The New Rules of Lifting For Life: An All-New Muscle-Building, Fat-Blasting Plan for Men and Women Who Want to Ace Their Midlife Exams\n\nPublisher: Avery Trade\nAlwyn Cosgrove, Lou Schuler\n2012\nLanguage: English\nISBN-10: 1583335137\nISBN-13: 978-1583335130\nASIN: B0074VTHIY \nPDF \n320 pages \n15.8 MB\n\nA customizable-and realistic-fitness program specifically created for midlifers who want to lose weight, revitalize energy, and build habits for increased longevity. \n\nToday's exercising adults are caught in a bind: Those who take it seriously and work out aggressively end up with chronic aches and pains in midlife because they don't know how to adjust their programs as they get older. And those who take it easy end up with overfed, underdeveloped bodies that don't respond well when they decide to get serious about exercise.\n Lou Schuler and Alwyn Cosgrove, fitness experts and authors of The New Rules of Lifting series know all too well that these readers need a program of their own. That's because they are these readers. Schuler started working out in his early teens. After forty years, he realized he couldn't do the programs in his own books without lots of modifications. And Cosgrove, a former European champion in tae kwon do, is a two- time survivor of stage IV cancer who found himself with limited endurance and a body that stubbornly refused to add muscle or shed fat.\n So the authors set out to create a new template for exercise, one that delivers serious results but is also flexible enough to accommodate individual limitations. The New Rules of Lifting for Life offers a six-month plan that balances total-body strength, endurance, mobility, balance, coordination, and athleticism. The workouts are challenging and, in conjunction with the suggested diet modifications, will help readers change the way their bodies look, feel, and perform. And not just temporarily- The New Rules of Lifting for Life allows you to enjoy productive and pain-free workouts for many years to come.\n\n","torrent":{"xt":"urn:btih:2d375af5b57b5eefd4b08bf50c511f44673e4168","amp;dn":"The+New+Rules+of+Lifting+for+Life%3A+An+All-New+Muscle-Building%2C+F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d375af5b57b5eefd4b08bf50c511f44673e4168","infoHashBuffer":{"type":"Buffer","data":[45,55,90,245,181,123,94,239,212,176,139,245,12,81,31,68,103,62,65,104]},"announce":[],"urlList":[]}}