{"title":"The Genius of Dogs (epub - mobi)","uid":12118216,"size":19286940,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2d43228acde5134bf6b1700aa302f3ddef849f0f&amp;dn=The+Genius+of+Dogs+%28epub+-+mobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"lezm.jjlp","files":3,"time":1436774150,"description":"The Genius of Dogs: How Dogs Are Smarter Than You Think\nby Bryan Hare, Vanessa Woods\n2013 | 384 Pages | ISBN: 0142180467 | EPUB + MOBI | 10 MB + 9 MB\n\nThe journey began with a gut reaction. When award-winning scientist Dr Brian Hare watched a chimpanzee fail to read a simple human hand gesture in an intelligence test, he blurted out, ?My dog can do that!? The psychologist running the test challenged him to prove it, sending Hare on an odyssey to unlock the cognitive and evolutionary mysteries of our four-legged friends.\nHare's research over the past two decades has yielded startling discoveries about how dogs think. He has pioneered studies that have proven that dogs exhibit a brand of genius for getting along with people that is unique in the animal kingdom, and that when dogs domesticated themselves around 40,000 years ago they became far more like human infants than their wolf ancestors. These findings are transforming how we live and work with our canine friends, and how we understand them. Is your dog purposefully disobeying you? Probably, and often behind your back. Should you act like top dog to maintain control? No, you're better off displaying your friendliness - not just to your dog but to everyone around you. Which breed is cleverest? As it happens, breed doesn't matter much, though other factors do.\nThese are just some of the extraordinary insights to be found in The Genius of Dogs the seminal book on how dogs evolved their unique intelligence alongside human companions, and how you can use this groundbreaking science to build a better relationship with your own dog","torrent":{"xt":"urn:btih:2d43228acde5134bf6b1700aa302f3ddef849f0f","amp;dn":"The+Genius+of+Dogs+%28epub+-+mobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d43228acde5134bf6b1700aa302f3ddef849f0f","infoHashBuffer":{"type":"Buffer","data":[45,67,34,138,205,229,19,75,246,177,112,10,163,2,243,221,239,132,159,15]},"announce":[],"urlList":[]}}