{"title":"[Clips4Sale / BareBackStudios] Vanessa Cage (My Daughter Taboo D","uid":15576411,"size":541256329,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:2d61512989883b25cc4a3556b0bc830300b4d5e6&amp;dn=%5BClips4Sale+%2F+BareBackStudios%5D+Vanessa+Cage+%28My+Daughter+Taboo+D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":3,"uploader":"LucasCar","files":2,"time":1471341122,"description":"[Clips4Sale / BareBackStudios] Vanessa Cage (My Daughter Taboo Desires) 480p [Roleplay]\r\n\r\nScene 1\r\n\r\nThe dad goes to the washroom in the morning with a boner, daughter's hiding in-wait, daughter gives BJ as the dad worries and locks the door.\r\nMom comes around, knocks on the door to inform breakfast is ready, and also asks about where the daughter could be.\r\nAction continues till finish.\r\nDaughter asks about how dad's off work today, he confirms and she hints at what's more to come.\r\n\r\nScene 2\r\n\r\nAfter breakfast, Vanessa tells her parents that she doesn't have any classes.\r\nMom thinks it's BS and has a short argument with her,Vanessa gets out of the dinning/living room.\r\nDad's in the kitchen cleaning up, while replying to the mum ranting, agitated, about Vanessa.\r\nVanessa sneaks into the kitchen and starts blowing the dad.\r\nMom ends rant, and tells dad she's gotta get ready for work.\r\nAs Cory goes to get ready, the dad starts having sex with the daughter in the kitchen.\r\nNear the end mum reenters the living room and asks the dad to have a word with the daughter.\r\nAs Cory continues the conversation from the dinning/living room, the dad finishes, the dad replies and tells her to have an awesome day at work while Vanessa sneaks out of the kitchen.\r\n\r\nScene 3\r\n\r\nMontage of sex scenes from various times and locations of the day.\r\nSex/BJ in Vanessa's room.\r\nSex/BJ in the Living room during lunch\r\nSex/BJ in Mom's/Cory's Bedroom\r\nDaughter gets ready to head out and Dad is about to GiveVanessa a Final Cream Pie, while dad is on the phone with Cory as she's informing that she'll be late\r\nand asking about Vanessa.\r\nAt the end Vanessa tells dad he can fuck her anytime he wants and asks him to come to her room that night.\r\n\r\nScene 4\r\n\r\nMom's out cold, sleeping (may it be wine or ambien). Dad's trying to sleep, and Vanessa sneaks in, goes under the sheets to give dad a BJ.\r\nDad doesn't know what to do and just receives the BJ; till he wants to fuck her, so he takes Vanessa out of the room.\r\nThey proceed to the living room and the start fucking till finish.\r\nVanessa talks about how she's contemplating on skipping class tomorrow for more action.\r\nDad laughs it off, and leaves.\r\nVanessa says see you tomorrow in the washroom again.\r\n \nhttp://screenimage.net/img-57b2c6332d9a3.html\r\n\r\n\r\n\r\n★ ★ ★  For more Exclusive Porn please visit ★ ★ ★\r\n \nhttps://thepiratebay.org/user/LucasCar","torrent":{"xt":"urn:btih:2d61512989883b25cc4a3556b0bc830300b4d5e6","amp;dn":"%5BClips4Sale+%2F+BareBackStudios%5D+Vanessa+Cage+%28My+Daughter+Taboo+D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d61512989883b25cc4a3556b0bc830300b4d5e6","infoHashBuffer":{"type":"Buffer","data":[45,97,81,41,137,136,59,37,204,74,53,86,176,188,131,3,0,180,213,230]},"announce":[],"urlList":[]}}