{"title":"BBC Revolution and Romance 2of3 1080p HDTV x264-MVGroup","uid":15512878,"size":1888959223,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:2da609ccba119e2bf12754d264e24d33c9056e7e&amp;dn=BBC+Revolution+and+Romance+2of3+1080p+HDTV+x264-MVGroup&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":2,"uploader":"MVGroup","files":1,"time":1470672609,"description":"Revolution and Romance: Musical Masters of the 19th Century 2of3 Talkin' 'Bout a Revolution\r\n\r\nSuzy Klein explores the transformation of music in the 19th century. In an age of political and industrial revolution, she tells how music became the leading art form.\r\n\r\nPart 2: Talkin' 'Bout a Revolution\r\nIn the 19th century music wasn't just a backdrop to life, easing pain and enhancing pleasure. It became a revolutionary force that could - and did - change the world.\r\n\r\nAs the impact of the violence and turmoil unleashed in the French Revolution reverberated around Europe, it was music that most viscerally carried the message that the people could stand up to kings and emperors. In France during the revolution, La Marseillaise emerged as a rallying cry - sung by the mob as they stormed the royal palace. When Napoleon imposed his grip on the nation it became an anthem of subversion, along with countless songs that pilloried the return to autocracy and the crushing of freedom.\r\n\r\nBut it was not just on the streets, as Suzy shows, that revolutionary fervour was stoked up. Even opera, intended by the authorities to reinforce the status quo, became politically potent, fanning the flames of nationalism and revolution throughout Europe. One French opera actually helped trigger a revolution when it was performed in Belgium in 1830.\r\n\r\nSuzy shows how music came to express not only revolutionary fervour, but also the growing force of nationalism that was sweeping Europe. She discovers how Chopin's music, beneath its lyrical surface, expressed more powerfully than words the defiant spirit of the Polish people suffering under the oppression of a foreign power. And she explores how Carl Weber's lovely work Der Freischütz articulated the longings for nationhood of the Germans and inspired Richard Wagner to attempt the transformation of the human spirit through his work.\r\n\r\nBut it was Italian opera composer Giuseppe Verdi whose music had the most profound political impact in the 19th century. Suzy travels to Parma, Verdi's home town, to meet the disciples who keep his flame alive to this day, venerating the man whose music embodied the fight for freedom and whose very name came to symbolize Italy's fight for nationhood.\r\n\r\nTechnical Spec\r\nVideo Codec: x264 CABAC   \r\nVideo Bitrate: CRF 21 (~4007Kbps)\r\nVideo Resolution: 1920x1080\r\nVideo Aspect Ratio: 16:9\r\nFrames Rate: 25 FPS\r\nAudio Codec: AAC-LC\r\nAudio Bitrate: Q=0.47 VBR 48KHz (~128Kbps)\r\nAudio Channels: 2\r\nRun-Time: 59 mins\r\nNumber Of Parts: 3\r\nPart Size: 1.71 GB (average)\r\nSource: HDTV\r\nSubtitles: Merged","torrent":{"xt":"urn:btih:2da609ccba119e2bf12754d264e24d33c9056e7e","amp;dn":"BBC+Revolution+and+Romance+2of3+1080p+HDTV+x264-MVGroup","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2da609ccba119e2bf12754d264e24d33c9056e7e","infoHashBuffer":{"type":"Buffer","data":[45,166,9,204,186,17,158,43,241,39,84,210,100,226,77,51,201,5,110,126]},"announce":[],"urlList":[]}}