{"title":"Stevie Ray Vaughan - Live at Montreaux","uid":11012996,"size":1423507184,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2dabcecd5a5a29b60517e2ef2cf1c9eb4d227923&amp;dn=Stevie+Ray+Vaughan+-+Live+at+Montreaux&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"marxph","files":3,"time":1410407341,"description":"In early 1982, Double Trouble played a show at the Continental Club in Austin, TX. Impressed by the show, legendary producer Jerry Wexler recommended the band play the Montreux Jazz Festival in Switzerland.[1] Booked to play at Montreux International Festival XVI on July 17, 1982, the band's appearance marked the first time that an unsigned act would appear at the prestigious event. Booked on an acoustic night, Double Trouble's performance was met by boos. Vaughan's high volume electric blues was not popular with the European crowd, who preferred a quieter, folk blues style.\n\nFortunately for the band, the first Montreux trip was not a bust. In a last-ditch effort to save the trip, the band's manager, Chelsey Millikin, booked the band to play the casino's after hours bar for two nights running. On the first night, Vaughan was approached by David Bowie, who had seen the Montreux performance, and was interested in having Vaughan play on one of his albums. This would lead to Vaughan's guitar work on Bowie's album, Let's Dance. On the second night, Millikin introduced Vaughan to Jackson Browne, who was impressed by the band's sound. Browne and his band joined Double Trouble on stage, where they jammed until seven the next morning. Browne was so moved by Double Trouble's music that he offered them use of his private recording studio, free of charge. Vaughan and Double Trouble would take Browne up on his offer, and the ensuing recordings would become Texas Flood, which would bring the band into the national spotlight.\n\nStevie Ray Vaughan and Double Trouble returned to the Montreux Jazz Festival in 1985 as headliners and were well received by the audience.\n\n[url]http://srvrocks.com/montreux_liner_notes.htm[/url]\n\n\nghost dog...","torrent":{"xt":"urn:btih:2dabcecd5a5a29b60517e2ef2cf1c9eb4d227923","amp;dn":"Stevie+Ray+Vaughan+-+Live+at+Montreaux","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2dabcecd5a5a29b60517e2ef2cf1c9eb4d227923","infoHashBuffer":{"type":"Buffer","data":[45,171,206,205,90,90,41,182,5,23,226,239,44,241,201,235,77,34,121,35]},"announce":[],"urlList":[]}}