{"title":"Flavius Josephus - The Jewish War &amp; other works (6 books)","uid":11024103,"size":44858544,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2e6b320a170f8965a71ac5794bf3253c4414be11&amp;dn=Flavius+Josephus+-+The+Jewish+War+%26amp%3B+other+works+%286+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"workerbee","files":-1,"time":1410645079,"description":"\nTITUS FLAVIUS JOSEPHUS (37 - ca. 100 CE) was a first-century Jewish-Roman historian and hagiographer, who was born in Jerusalem (then part of Roman Judea) to a father of priestly descent and a mother who claimed royal ancestry.  He initially fought against the Romans during the First Jewish-Roman War as head of Jewish forces in Galilee, until surrendering in 67 to Roman forces led by Vespasian.  After Vespasian became Emperor in 69, he granted Josephus his freedom, at which time Josephus assumed the emperor's family name of Flavius and was granted Roman citizenship.  He became an advisor and friend of Vespasian's son Titus, serving as his translator when Titus led the Siege of Jerusalem, which resulted -- when the Jewish revolt did not surrender -- in the city's destruction and the looting and destruction of Herod's Temple (Second Temple).\n\nJosephus is without a doubt the most important witness to ancient Judaism from the close of the biblical period to the aftermath of the destruction of the temple in 70 CE.  His surviving works provide the narrative structure for interpreting the other, more fragmentary written sources and physical remains for this period.  His descriptions of the Temple, the Judean countryside, Jewish-Roman relations and conflicts, and groups and institutions of ancient Judea have become indispensable for the student of early Judaism, of Classics, and of Christian origins alike.\n\nHis most important work is THE JEWISH WAR, a description of Jewish history from the capture of Jerusalem by the Seleucid ruler Antiochus IV Epiphanes in 164 BCE to the fall and destruction of Jerusalem in 70 CE.  The book was written ca. 75 CE, originally in Josephus's &quot;paternal tongue&quot;, probably Aramaic, though this version has not survived, and was later translated into Greek, probably under the supervision of Josephus himself.\n\nAGAINST APION is a two-volume defence of Judaism as classical religion and philosophy, stressing its antiquity, as opposed to what Josephus claimed was the relatively more recent tradition of the Greeks.  Some anti-Judaic allegations ascribed by Josephus to the Greek writer Apion, and myths accredited to Manetho are also addressed.\n\nTHE LIFE OF JOSEPHUS is an autobiographical text written ca. 94-99 CE in which the author for the most part re-visits the events of the War, apparently in response to allegations made against him by Justus of Tiberias.\n\n\nThe following books are in PDF format:\n\n* AGAINST APION (Brill, 2007).  Translation and Commentary by John M. G. Barclay.\n\n* THE COMPLETE WORKS (Christian Classics Ethereal Library, n.d.).  Translated by William Whiston.\n\n* THE JEWISH WAR (Penguin Classics, 1970).  Translated with an Introduction by G. A. Williamson.\n\n* JEWS IN THE HELLENISTIC WORLD: Josephus, Aristeas, The Sibylline Oracles, Eupolemus (Cambridge UP, 1985).  Edited and translated by John R. Bartlett.\n\n* JUDEAN WAR 2 (Brill, 2008).  Translation and Commentary by Steve Mason.\n\n* THE LIFE OF JOSEPHUS (Brill, 2001).  Translation and Commentary by Steve Mason.\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                                  &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n","torrent":{"xt":"urn:btih:2e6b320a170f8965a71ac5794bf3253c4414be11","amp;dn":"Flavius+Josephus+-+The+Jewish+War+%26amp%3B+other+works+%286+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e6b320a170f8965a71ac5794bf3253c4414be11","infoHashBuffer":{"type":"Buffer","data":[46,107,50,10,23,15,137,101,167,26,197,121,75,243,37,60,68,20,190,17]},"announce":[],"urlList":[]}}