{"title":"V. S. Naipaul - Nobel Prize in Literature, 2001 (31 books)","uid":14078057,"size":67980846,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2f2d834cc6ea73dbc0a98110c70337c39d240814&amp;dn=V.+S.+Naipaul+-+Nobel+Prize+in+Literature%2C+2001+%2831+books%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"workerbee","files":61,"time":1459214570,"description":"VIDIADHAR SURAJPRASAD NAIPAUL (b. 1932) is a Trinidadian-born British writer known for his comic early novels set in Trinidad and Tobago, his bleaker later novels of the wider world, and his autobiographical chronicles of life and travels.  He was awarded the 2001 Nobel Prize in Literature &quot;for having united perceptive narrative and incorruptible scrutiny in works that compel us to see the presence of suppressed histories.&quot;  The Committee added: &quot;Naipaul is a modern philosophe carrying on the tradition that started originally with Lettres persanes and Candide. In a vigilant style, which has been deservedly admired, he transforms rage into precision and allows events to speak with their own inherent irony.&quot;\n\nHis earliest books (THE MYSTIC MASSEUR, 1957; THE SUFFRAGE OF ELVIRA, 1958; and MIGUEL STREET, 1959) are ironic and satirical accounts of life in the Caribbean.  His fourth novel, A HOUSE FOR MR. BISWAS (1961), also set in Trinidad, was a much more important work and won him major recognition, centering on the main character's attempt to assert his personal identity and establish his independence as symbolized by owning his own house.  Naipaul's subsequent novels used other national settings but continued to explore the personal and collective alienation experienced in new nations that were struggling to integrate their native and Western-colonial heritages.  The three stories in IN A FREE STATE (1971), which won Britain's Booker Prize, are set in various countries; GUERRILLAS (1975) is a despairing look at an abortive uprising on a Caribbean island; and A BEND IN THE RIVER (1979) pessimistically examines the uncertain future of a newly independent state in Central Africa. A WAY IN THE WORLD (1994) is an essay-like novel examining how history forms individuals' characters.  HALF A LIFE (2001) is a novel about an Indian immigrant to England and then Africa.  He becomes &quot;half a person,&quot; as Naipaul has said, &quot;living a borrowed life.&quot;  Released the year that Naipaul received the Nobel Prize, HALF A LIFE was considered by many critics to illustrate beautifully the reasons that he won the prize.\n\nNaipaul began to experience the inadequacy of fiction while he was working on THE LOSS OF EL DORADO (1969), in which after extensive study of the archives he described the appalling colonial history of Trinidad.  Other significant nonfiction works are three studies of India: AN AREA OF DARKNESS (1965); INDIA: A WOUNDED CIVILIZATION (1977); and INDIA: A MILLION MUTINIES NOW (1990).  He has also published two examinations of Islam: AMONG THE BELIEVERS (1981) describes a six-month journey across the Asian continent where Islamic fundamentalism was growing; and BEYOND BELIEF (1998), a portrayal of the Islamic faith in the lives of ordinary people in Iran, Pakistan, Indonesia, and Malaysia.  Subsequent works include THE WRITER AND THE WORLD (2002) and LITERARY OCCASIONS (2003), both collections of previously published essays.  In THE MASQUE OF AFRICA (2010), based on his travels in Cte d'Ivoire, Gabon, Ghana, Nigeria, Uganda, and South Africa, Naipaul returned to his exploration of religion, focusing on African beliefs. \n\n\nThe following books are in ePUB format unless otherwise indicated:\n\n\n                                   == FICTION ==\n\n* Bend in the River, A (Vintage, 1989)\n\n* Collected Short Fiction (Everyman's Library, 2011)\n\n* Enigma of Arrival, The (Vintage, 1988)\n\n* Flag on the Island, A (included in &quot;Collected Short Fiction&quot;)\n\n* Guerrillas (Vintage, 1990)\n\n* Half a Life (Vintage, 2001)\n\n* House for Mr Biswas, A (Vintage, 2001)\n\n* In a Free State (Vintage, 2002)\n\n* Magic Seeds (Vintage, 2005)\n\n* Miguel Street (Vintage, 2002)\n\n* Mimic Men, The (Vintage, 2001)\n\n* Mystic Masseur, The (Vintage, 2002)\n\n* Nightwatchman's Occurrence Book &amp; Other Comic Inventions, The (Vintage, 2002)\n\n* Suffrage of Elvira, The (included in &quot;Three Novels&quot;)\n\n* Three Novels: The Mystic Masseur / The Suffrage of Elvira / Miguel Street (Knopf, 1982) -- PDF\n\n* Way in the World, A (Vintage, 1995)\n\n\n                                 == NON-FICTION ==\n\n* Among the Believers: An Islamic Journey (Vintage, 1982)\n\n* Area of Darkness, An:  A Discovery of India (Vintage, 2002)\n\n* Art of Fiction, No. 154 (Paris Review, Fall 1998).  Interview by Jonathan Rosen and Tarun Tejpal. -- PDF\n\n* Between Father and Son: Family Letters (Vintage, 2001).  Edited by Gillon Aitken.\n\n* Beyond Belief: Islamic Excursions among the Converted Peoples (Vintage, 1999)\n\n* Finding the Centre: Two Narratives (Vintage, 1986) -- PDF\n\n* India: A Million Mutinies Now (Vintage, 2011)\n\n* India: A Wounded Civilization (Vintage, 2003)\n\n* Literary Occasions: Essays (Vintage, 2004)\n\n* Loss of El Dorado, The: A Colonial History (Vintage, 2003)\n\n* Masque of Africa, The: Glimpses of African Belief (Knopf, 2010)\n\n* Middle Passage, The: The Caribbean Revisited (Vintage, 2002)\n\n* Return of Eva Perón and The Killings in Trinidad (Vintage, 1981) -- PDF\n\n* Turn in the South, A (Vintage, 1990)\n\n* Two Worlds: The Nobel Lecture (2001) -- PDF\n\n* Writer and the World, The: Essays (Vintage, 2003)\n\n* Writer's People, A: Ways of Looking and Feeling: An Essay in Five Parts (Vintage, 2009)\n\n_____________________________________________________________________________\n\n\nCONTACT ME: You can reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\n                      \nhttps://pirates-forum.org/User-workerbee  \n\nPLEASE HELP TO SEED!  If you like these books and want others to have access to them, please help to seed for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:2f2d834cc6ea73dbc0a98110c70337c39d240814","amp;dn":"V.+S.+Naipaul+-+Nobel+Prize+in+Literature%2C+2001+%2831+books%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f2d834cc6ea73dbc0a98110c70337c39d240814","infoHashBuffer":{"type":"Buffer","data":[47,45,131,76,198,234,115,219,192,169,129,16,199,3,55,195,157,36,8,20]},"announce":[],"urlList":[]}}