{"title":"Abs on the Ball: A Pilates Approach to Building Superb Abdominal","uid":8343141,"size":14994454,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2f984651b547790b3ca667685f8970792937af78&amp;dn=Abs+on+the+Ball%3A+A+Pilates+Approach+to+Building+Superb+Abdominal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1365136656,"description":"\nColleen Craig, &quot;Abs on the Ball: A Pilates Approach to Building Superb Abdominals&quot;\nEnglish | ISBN: 089281098X | 2003 | EPUB | 192 pages | 14,3 MB\n\nInnovative abdominal exercises to help tone the abdomen, improve posture, and build a strong back using the Swiss exercise ball.\n* Offers a 10-minute and 20-minute workout for all levels of fitness.\n* Shows how the mobility of the ball targets underutilized muscles.\n* Shows how traditional sit-ups and &quot;ab&quot; machines limit how much abdominal muscles can be trained and also aggravate lower back pain and neck tension.\n\nThe exercise ball has long been recommended by doctors, physical therapists, and Olympic coaches for people suffering from back pain. Now Colleen Craig, author of the bestselling book Pilates on the Ball, reveals why the exercise ball is unmatched as a tool for building superb abdominal strength. She presents a selection of over 80 innovative exercises, including some of the key powerhouse-builders from the Pilates Method, all of which she has adapted specifically to the ball.\nCraig shows how traditional sit-ups and &quot;ab&quot; machines actually limit the degree to which abdominal muscles can be trained and can even aggravate lower back pain and neck tension. In contrast, the very mobility of the ball targets underutilized muscles, recruiting both deep and superficial abdominal muscle fibers to enhance results.\nAbs on the Ball includes exercises for all ability levels that show how to properly use the breath and how to activate the correct muscles during a workout--from the core exercises of the Waterfall, Oblique Curls, and Full Abdominal Curls to the more advanced Side Twist Plank, the Teaser, and Backward Crunch. The author also offers a 10- and 20-minute workout designed not only to build the abdominal core, but also to strengthen and train deep muscles in the back and hip in order to soothe lower back pain and increase overall body strength, balance, and coordination.\n","torrent":{"xt":"urn:btih:2f984651b547790b3ca667685f8970792937af78","amp;dn":"Abs+on+the+Ball%3A+A+Pilates+Approach+to+Building+Superb+Abdominal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f984651b547790b3ca667685f8970792937af78","infoHashBuffer":{"type":"Buffer","data":[47,152,70,81,181,71,121,11,60,166,103,104,95,137,112,121,41,55,175,120]},"announce":[],"urlList":[]}}