{"title":"Eric Van Lustbader - The Bourne Ascendancy (Jason Bourne #12)","uid":11925805,"size":215020580,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:301c85e64a60370eb76e2d1e028856aadd0e5c1e&amp;dn=Eric+Van+Lustbader+-+The+Bourne+Ascendancy+%28Jason+Bourne+%2312%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"Cybotage","files":1,"time":1431706169,"description":"Jason Bourne is one of the most popular and compelling characters in contemporary fiction. Originally created by bestselling author Robert Ludlum, the Jason Bourne series was later adapted into films that have become modern classics. Now, New York Times bestselling writer Eric Van Lustbader carries on Jason Bourne's story with a new novel about the rogue secret agent who has lost his memory . . .\n\nTHE BOURNE ASCENDANCY\n\nIn this thrilling and absorbing new novel Jason Bourne is faced with an impossible mission. He has been hired to impersonate a high-level government minister at a political summit meeting in Qatar, shielding the minister from any assassination attempts. Suddenly, armed gunmen storm the room, killing everyone but Bourne. Their target, however, isn't the minister Bourne impersonates....it is Bourne himself.\n\nKidnapped and transported to an underground bunker, Bourne finds himself face-to-face with an infamous terrorist named El Ghadan (&quot;Tomorrow&quot;). El Ghadan holds as his captive Soraya Moore, former co-director of Treadstone, and a close friend to Bourne, along with her two year old daughter.\n\nMeanwhile, the President of the United States is in the midst of brokering a historic peace treaty between the Israelis and the Palestinians-an event that El Ghadan is desperate to prevent. He demands that Bourne carry out a special mission: kill the President. If Bourne refuses, Soraya and her daughter will die.\n\nBourne must make a monstrous choice: save Soraya and her daughter, or save the President.\n\n\nRead by Holter Graham\nFormat: M4A\nBitrate: 32 Kbps\nLength: 14 hrs and 51 mins\nUnabridged","torrent":{"xt":"urn:btih:301c85e64a60370eb76e2d1e028856aadd0e5c1e","amp;dn":"Eric+Van+Lustbader+-+The+Bourne+Ascendancy+%28Jason+Bourne+%2312%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"301c85e64a60370eb76e2d1e028856aadd0e5c1e","infoHashBuffer":{"type":"Buffer","data":[48,28,133,230,74,96,55,14,183,110,45,30,2,136,86,170,221,14,92,30]},"announce":[],"urlList":[]}}