{"title":"Dark Tower Series (Stephen King Books 1-7)-2010kaiser","uid":7995494,"size":14491892,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3055bb3c483bc29c75d148f248781f0356fca43e&amp;dn=Dark+Tower+Series+%28Stephen+King+Books+1-7%29-2010kaiser&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"2010kaiser","files":-1,"time":1357603840,"description":"              Dark Tower Series (Stephen King Books 1-7)-2010kaiser\n              ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\n\n\n\n1. The Dark Tower: The Gunslinger (1982)\n========================================\n\nIt tells the story of the gunslinger, Roland of Gilead, and his quest to catch the man in black, the first of many steps towards his ultimate destination - the Dark Tower.\n\n2. The Dark Tower II: The Drawing of the Three (1987)\n=====================================================\n\nThe book begins less than seven hours after the end of The Dark Tower: The Gunslinger after The Man in Black has described The Gunslinger's fate using tarot cards. Roland wakes up on a beach, where he is suddenly attacked by a strange, lobster-like creature, which he dubs a &quot;lobstrosity.&quot;\n\n3. The Dark Tower III: The Waste Lands (1991)\n=============================================\n\nThe story begins five weeks after the end of The Drawing of the Three. Roland, Susannah, and Eddie have moved east from the shore of the Western Sea, and into the woods of Out-World. After an encounter with a gigantic cyborg bear named Shardik, they discover one of the six mystical Beams that hold the world together. The three gunslingers follow the Path of the Beam inland to Mid-World.\n\n4. The Dark Tower IV: Wizard and Glass (1997)\n=============================================\n\nThe novel begins where The Waste Lands ended. After Jake, Eddie, Susannah and Roland fruitlessly riddle Blaine the Mono for several hours, Eddie defeats the mad computer by telling childish jokes. Blaine is unable to handle Eddie's &quot;illogical&quot; riddles, and short-circuits.\n\n5. The Dark Tower V: Wolves of the Calla (2003)\n===============================================\n\nAfter escaping the alternate Topeka and the evil wizard Randall Flagg, Roland's ka-tet travel to the farming village of Calla Bryn Sturgis where they meet the townsfolk, as well as Father Callahan, who was originally introduced in 'Salem's Lot.\n\n6. The Dark Tower VI: Song of Susannah (2004)\n=============================================\n\nTaking place mainly in our world (New York City and East Stoneham, Maine), this book picks up where Wolves of the Calla left off, with the ka-tet employing the help of the Manni to open the magic door inside Doorway Cave. The ka-tet are split up by the magic door, or perhaps ka, and sent to different 'wheres' and 'whens' in order to accomplish several essential goals pertaining to their quest towards the mysterious Dark Tower.\n\n7. The Dark Tower VII: The Dark Tower (2004)\n============================================\n\nBeginning where book six left off, Jake Chambers and Father Callahan battle the evil infestation within the Dixie Pig, a vampire lounge in New York City featuring roasted human flesh and doors to other worlds. After fighting off and destroying numerous &quot;low-men&quot; and Type One Vampires, Callahan sacrifices himself to let Jake survive.\n\n\n2010kaiser home page at The Pirate Bay link below:\n\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2010kaiser/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2010kaiser/&lt;/a&gt;\n\n\nCheck out the new PirateWiki! Where knowledge is shared ;-)\n\n          &lt;a href=&quot;\nhttps://forum.suprbay.org/wiki/index.php?title=Portal:Main_Page&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/wiki/index.php?title=Portal:Main_Page&lt;/a&gt;\n\n\nFor re-seed requests, help, support or anything else relating to The Pirate Bay. You'll find it all, and more, at suprbay. The official support forum of The Pirate Bay. Visit it at the link below:\n\n &lt;a href=&quot;\nhttps://forum.suprbay.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/&lt;/a&gt; \n\n\nENJOY AND SEED!!!","torrent":{"xt":"urn:btih:3055bb3c483bc29c75d148f248781f0356fca43e","amp;dn":"Dark+Tower+Series+%28Stephen+King+Books+1-7%29-2010kaiser","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3055bb3c483bc29c75d148f248781f0356fca43e","infoHashBuffer":{"type":"Buffer","data":[48,85,187,60,72,59,194,156,117,209,72,242,72,120,31,3,86,252,164,62]},"announce":[],"urlList":[]}}