{"title":"Supertramp - ...Famous Last Words... REMASTERED","uid":10284934,"size":408940034,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3078a7bbebb6a69e9147e64378607a74e86795ff&amp;dn=Supertramp+-+...Famous+Last+Words...+REMASTERED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":4,"uploader":"Big-Papi","files":-1,"time":1401766155,"description":"Source: CD + Fresh Cover Art Scan\n\nimage\n\n\nBy Alan Caylow\nHow does a band follow up a mega-smash album? Simple: they just follow it up. 1979's &quot;Breakfast In America&quot; was such a gargantuan success all over the place for Supertramp, that, after the world tour in support of the album, the band took some well-deserved rest for a couple of years before re-grouping for their next disc. However, one of the band's key members, singer/songwriter Roger Hodgson, wasn't so sure about his future with the group, and the next album, 1982's &quot;Famous Last Words,&quot; would be his last album with the band (hence the title?). \n\nNB: now for the world's longest sentence! - \n\nAs Hodgson's swan song with the group, &quot;Famous Last Words&quot; certainly has an element of sadness attached to it, and although the album did not signal the end of Supertramp, it did signal the end of an era. It was nowhere near as commercially successful as &quot;Breakfast In America&quot; (how could it have been?), but &quot;Famous Last Words&quot; is still an excellent, heartfelt album filled with the high quality mix of pop, jazz, &amp; rock that this great band are famous for. Hodgson's opener, &quot;Crazy,&quot; is a great piano-thumper, while co-leader Rick Davies' &quot;Put On Your Old Brown Shoes&quot; is an excellent shuffler to clap along to. Hodgson's &quot;It's Raining Again&quot; is a very nice, uplifting song (and a Top 20 hit single), and &quot;Bonnie&quot; is a great showcase number for Davies. Next up is Hodgson's haunting, achingly beautiful &quot;Know Who You Are,&quot; one of the very best songs he has ever written. Davies then picks things up with the great 50's fun of &quot;My Kind Of Lady,&quot; followed by Hodgson's majestic &quot;C'est Le Bon&quot; (featuring Ann &amp; Nancy Wilson of Heart on background vocals), and finally, for a powerful one-two punch of dramatic Supertramp rock, there's the double-header of Davies' &quot;Waiting So Long,&quot; and Hodgson's grand finale---and, judging by the lyrics, his farewell to the band---&quot;Don't Leave Me Now.&quot;After the tour for &quot;Famous Last Words,&quot; Roger Hodgson left Supertramp, apparently because he &amp; Davies could no longer agree on the band's musical direction (Hodgson wanted the group to stay more pop, Davies wanted the group to be more jazzy). Since then, Rick Davies continues to helm Supertramp on his own, and the band has since recorded four great albums, starting with 1985's &quot;Brother Where You Bound,&quot; and continues to tour. Hodgson has also recorded four fine solo albums since his departure from the group, and he recently went on tour with Ringo Starr, so both camps are doing just fine. While Hodgson may not be interested in returning to Supertramp (and he has said as such), we can be grateful of the terrific music he did make with the band---seven albums worth, in fact, as well as the live double-album, &quot;Paris.&quot; &quot;Famous Last Words&quot; is a fond farewell to Roger Hodgson, and a lovely album to close out his time with Supertramp. A definite must-buy. :-)\n\n\n---------------------------------------------------------------------\nSupertramp - ...Famous Last Words...\n---------------------------------------------------------------------\n\nArtist...............: Supertramp\nAlbum................: ...Famous Last Words...\nGenre................: Pop/Rock\nSource...............: CD\nYear.................: 1982\n\nFLAC\n\nRipper...............: EAC (Secure mode) / LAME 3.92 &amp; Asus CD-S520\nCodec................: Free Lossless Audio Codec (FLAC)\nVersion..............: reference libFLAC 1.2.1 20070917\nQuality..............: Lossless, (avg. compression: 61 %)\nChannels.............: Stereo / 44100 HZ / 16 Bit\n\nMP3 V0 (Highest Quality Available For MP3)\n\nRipper...............: EAC (Secure mode) / LAME 3.92 &amp; Asus CD-S520\nCodec................: LAME 3.99\nVersion..............: MPEG 1 Layer III\nQuality..............: Extreme, (avg. bitrate: 264kbps)\nChannels.............: Joint Stereo / 44100 hz\n\n-------------------------------------------------------------------\nTracklisting\n---------------------------------------------------------------------\n\n1. Supertramp - Crazy [04:44]\n2. Supertramp - Put on Your Old Brown Shoes [04:22]\n3. Supertramp - It's Raining Again [04:24]\n4. Supertramp - Bonnie [05:37]\n5. Supertramp - Know Who You Are [04:59]\n6. Supertramp - My Kind of Lady [05:15]\n7. Supertramp - C'est le Bon [05:32]\n8. Supertramp - Waiting So Long [06:34]\n9. Supertramp - Don't Leave Me Now [06:24]\n\nPlaying Time.........: 47:56\nTotal Size...........: 295.85 MB","torrent":{"xt":"urn:btih:3078a7bbebb6a69e9147e64378607a74e86795ff","amp;dn":"Supertramp+-+...Famous+Last+Words...+REMASTERED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3078a7bbebb6a69e9147e64378607a74e86795ff","infoHashBuffer":{"type":"Buffer","data":[48,120,167,187,235,182,166,158,145,71,230,67,120,96,122,116,232,103,149,255]},"announce":[],"urlList":[]}}