{"title":"Art of Product Design, The [PDF] [StormRG]","uid":11673981,"size":1086855,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:30818da54711cb7bffb389f37347af5fa9d0602c&amp;dn=Art+of+Product+Design%2C+The+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"krystine","files":2,"time":1422775830,"description":"The Art of Product Design: Changing How Things Get Made\nAuthor: Hardi Meybaum\nPublished: 2014\nPublisher: Wiley\nISBN: 9781118763346\nFormat: Retail PDF\n\nEmbrace Open Engineering and accelerate the design and manufacturing processes Product development is a team sport, but most companies don't practice it that way. Organizations should be drawing on the creativity of engaged customers and outsiders, but instead they rely on the same small group of internal &quot;experts&quot; for new ideas. Designers and engineers should be connecting with marketing, sales, customer support, suppliers, and most importantly, customers. The Art of Product Design explains the rise of &quot;Open Engineering,&quot; a way of breaking down barriers and taking advantage of web-based communities, knowledge, and tools to accelerate the design and manufacturing processes. Explains how to establish open flows of information inside and outside an organization, increasing the quality and frequency of input from different groups and stakeholders Hardi Meybaum is the founder and CEO of GrabCad, the largest community of mechanical engineers and designers in the world Open Engineering is crowdsourcing, it's collaborating, it's sharing and connecting. And it's helping a growing number of companies create better products faster than they ever imagined. The Art of Product Design shows you how to harness its power for your company","torrent":{"xt":"urn:btih:30818da54711cb7bffb389f37347af5fa9d0602c","amp;dn":"Art+of+Product+Design%2C+The+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30818da54711cb7bffb389f37347af5fa9d0602c","infoHashBuffer":{"type":"Buffer","data":[48,129,141,165,71,17,203,123,255,179,137,243,115,71,175,95,169,208,96,44]},"announce":[],"urlList":[]}}