{"title":"Paul McKenna - I Can Make You Thin System 4 CD Set [MP3]","uid":12287627,"size":306140180,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:311a76eb6043245957cc71d776cc7b6027bb7cd1&amp;dn=Paul+McKenna+-+I+Can+Make+You+Thin+System+4+CD+Set+%5BMP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"elessedilgirl","files":9,"time":1440497032,"description":"Welcome to a revolutionary way to stop overeating, control cravings, and feel totally motivated to take exercise.\n\nPaul McKenna's I Can Make You Thin System is a breakthrough audio program that re-patterns your thoughts, attitudes and beliefs about yourself, your health and food to help you get control of your diet, and lose weight easily.\n\nUnless you have a way to change what food means to you on a deep unconscious level, your automatic responses relating to food are NEVER going to change for long before you go right back to your old ways. And no &quot;how-to&quot; book, pill or powder is going to change that.\n\nThe difference with this system is that it changes what food means to you. It can help you easily, naturally and without struggle to say &quot;no&quot; to second helpings and to any foods that don't support you in your health and weight loss goals.\n\nAs you use Paul's amazing system the latest psychological techniques will automatically help you start losing weight straight away. You can use it again and again to make you feel happier about yourself as you go all the way to your ideal shape, size and weight.\n\nMP3 - 320 kbps - CBR","torrent":{"xt":"urn:btih:311a76eb6043245957cc71d776cc7b6027bb7cd1","amp;dn":"Paul+McKenna+-+I+Can+Make+You+Thin+System+4+CD+Set+%5BMP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"311a76eb6043245957cc71d776cc7b6027bb7cd1","infoHashBuffer":{"type":"Buffer","data":[49,26,118,235,96,67,36,89,87,204,113,215,118,204,123,96,39,187,124,209]},"announce":[],"urlList":[]}}