{"title":"Essential Interviewing and Counseling Skills- Prout (2014) [PDF]","uid":11050917,"size":2379210,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:319dc6d9d983b367656e3df0a5cceb26e3100977&amp;dn=Essential+Interviewing+and+Counseling+Skills-+Prout+%282014%29+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"F1restorm","files":-1,"time":1411028159,"description":"Essential Interviewing and Counseling Skills: An Integrated Approach to Practice\nAuthor: Dr Tracy Prout\nPublished: 2014\nPublisher: Springer Publishing \nISBN: 9780826199157 \nFormat: Retail PDF\n___________________________________________________________________________\n\nThis is the only comprehensive text to focus on the development of practical interviewing and counseling skills for master's-level mental health counseling students. It is structured around the goals established by the CACREP's 2009 document on standards for MHC programs, and uniquely encompasses both theory and practice from the perspectives of a diverse array of theoretical schools and practice strategies. The benefits of integrating complementary therapy approaches according to the needs of the client and the importance of multicultural considerations in interviewing and counseling are consistent themes throughout.\n\nThe book's hands-on guidance regarding interviewing and counseling skills, along with its embrace of different therapeutic modalities, will enable students to learn how to provide care to clients that is tailored to their specific needs. Each chapter includes a highlighted section that draws students' attention to topics related to diversity, and strategies for working with clients from a variety of populations. Issues related to race, ethnicity, immigration, and country of origin are highlighted along with age, gender, sexual orientation, religion, language, and physical and cognitive abilities. The use of case examples from multiple theoretical orientations offers a realistic view of what actually occurs in a consulting room. The book also addresses working with clients who have serious emotional or psychological difficulties and covers evidenced-based practice, assessment, and diagnosis, and when and how to terminate treatment. \n","torrent":{"xt":"urn:btih:319dc6d9d983b367656e3df0a5cceb26e3100977","amp;dn":"Essential+Interviewing+and+Counseling+Skills-+Prout+%282014%29+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"319dc6d9d983b367656e3df0a5cceb26e3100977","infoHashBuffer":{"type":"Buffer","data":[49,157,198,217,217,131,179,103,101,110,61,240,165,204,235,38,227,16,9,119]},"announce":[],"urlList":[]}}