{"title":"The Golden Age of Chinese Archaeology.pdf","uid":12081569,"size":109942562,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:320e9b1de93deee8b25aadbc9437e304f109db5b&amp;dn=The+Golden+Age+of+Chinese+Archaeology.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"STBGD","files":1,"time":1435784042,"description":"The Golden Age of Chinese Archaeology: Celebrated Discoveries From the People's Republic of China\nNational Gallery of Art | 1999 | ISBN: 0300081324 | English | 588 pages | PDF | 105 MB\n\n\nFifty years of scientific archaeology in the People's Republic of China (PRC) have redefined early Chinese culture. This handsome volume surveys some of the most spectacular recent finds and their role in reshaping the history of civilization in ancient China. The National Gallery of Art in Washington, D.C., teamed up with Kansas City's Nelson-Atkins Museum of Art to organize a second extravaganza of unburied treasures, emphasizing discoveries made since their last show in 1974. The more than 175 objects from four historical periods and in numerous media represent important early sites and a diversity of cultures located outside the central Yellow River area--most notably in the south and southwest regions, like the state of Chu. The range is vast, from roughly painted pots about 6,000 years old to lovely clay and marble figures modeling the courtly fashions of 1,000 years ago. The excellent photographs and short texts on individual objects and their excavation sites describe their artistic and historical importance and prompt readers to savor individual artifacts over broad sweeps of history. Linger over a unique pottery basin painted with diagonal lozenges; an over-life-size bronze figure and related heads with strikingly geometrical features; various fantastic creatures in bronze and jade; lacquer bowls and silk garment fragments that have unbelievably survived the centuries; and polychromed Buddhist deities that reveal details like blue mustaches and eyebrows","torrent":{"xt":"urn:btih:320e9b1de93deee8b25aadbc9437e304f109db5b","amp;dn":"The+Golden+Age+of+Chinese+Archaeology.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"320e9b1de93deee8b25aadbc9437e304f109db5b","infoHashBuffer":{"type":"Buffer","data":[50,14,155,29,233,61,238,232,178,90,173,188,148,55,227,4,241,9,219,91]},"announce":[],"urlList":[]}}