{"title":"I DREAM OF JEANNIE - THE COMPLETE TV-RIP SERIES - ALL 5 SEASONS","uid":4161292,"size":14624238274,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:327900e826ecaee5e3d8e7f70e50d45a8e00fbb8&amp;dn=I+DREAM+OF+JEANNIE+-+THE+COMPLETE+TV-RIP+SERIES+-+ALL+5+SEASONS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":6,"uploader":"dadniel","files":140,"time":1209389100,"description":"I DREAM OF JEANNIE - THE COMPLETE TV-RIP SERIES - ALL 5 SEASONS\n\nThe show I Dream Of Jeannie ran for 5 seasons and produced 139 episodes (109 were in color and 30 black and white). The show was written, produced and created by Sidney Sheldon. The show went into production in December, 1964. The 1st season 30 episodes were filmed in black and white film. (The black and white episodes have been colorized for reruns by some syndicated packages). The show went into color in 1966. The show finished filming in January, 1970. \n\nThe show premiered September 18, 1965 and the last first run episode aired May 26, 1970 and then reruns began until September, 1970 and then reruns went into international syndication and the show is still rerunning. \n\nBarbara Eden played Jeannie's sister in 9 episodes of I Dream Of Jeannie and Jeannie's Mother, Mrs. Jeannie, in 2 episodes. Barbara Eden and Larry Hagman reunited for the movie A Howling in The Woods in 1971 and in 5 episodes of Dallas in 1990 and there were movie reunions I Dream Of Jeannie....15 Years Later which aired October 20, 1985 with Barbara Eden reprising her Roles of Jeannie and Jeannie's sister with Bill Daily and Hayden Rorke and Wayne Rogers replacing Larry Hagman in the role of Jeannie's master husband and I Still Dream Of Jeannie which aired October 20, 1991 with Barbara Eden reprising her roles again of Jeannie and Jeannie's sister with Bill Daily and a Jeannie reunion in The Today Show interview with Barbara Eden and Larry Hagman that aired March 1, 1995 and Barbara Eden reprised her role of Jeannie in the movie A Very Brady Sequel and in a commercial for Lexus in 1998, Donny and Marie Show with Barbara Eden, Larry Hagman, Bill Daily and Sidney Sheldon that aired in November, 1999 and Barbara Eden hosted a 8 part segment for the syndicated Entertainment Tonight and Entertainment This Week in May, 1984 about 1960's comedy shows and one of these was the show I Dream Of Jeannie and had interviews with Larry Hagman (Master), Bill Daily (Roger) and Hayden Rorke (Dr. Bellows). \n\nTHIS IS A ONE OF A KIND COLLECTION \nCOMPLETE, ALL EXISTING 139 EPISODES COMPLETELY COMMERCIAL FREE AND UNEDITED \nCOMPLETE: ALL 5 SEASONS\nall 100% in chronological order from the pilot to the finale\nPresented in full screen format - exactly as it was shown on television \nPresented in English\nEvery file about 100MB","torrent":{"xt":"urn:btih:327900e826ecaee5e3d8e7f70e50d45a8e00fbb8","amp;dn":"I+DREAM+OF+JEANNIE+-+THE+COMPLETE+TV-RIP+SERIES+-+ALL+5+SEASONS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"327900e826ecaee5e3d8e7f70e50d45a8e00fbb8","infoHashBuffer":{"type":"Buffer","data":[50,121,0,232,38,236,174,229,227,216,231,247,14,80,212,90,142,0,251,184]},"announce":[],"urlList":[]}}