{"title":"Learn Handgun &amp; Rifle Reloading In Under 41 Minutes (AVI)","uid":4450600,"size":731272465,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:32c820cacec2f33d7a2fe7c881d152994bd02d30&amp;dn=Learn+Handgun+%26+Rifle+Reloading+In+Under+41+Minutes+%28AVI%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"x_DontTreadOnMe_x","files":3,"time":1224204145,"description":"If you are new to reloading let this new 2005 DVD be your guide to saving 50% or more on ammunition. You probably have a specific bullet or bullets you want to reload. For this video an RCBS Rock Chucker Master Reloading Kit was chosen as the press--because it is one of the most popular presses out there--that is, you can find the press and parts for it easily--as well as used parts, etc. The chances are that no matter what bullet you want to reload RCBS'll have the tools for it. (And RCBS even has its own bullet line, Speer, with it's own loading manual. But you can load any bullet line with this RCBS press.) Even if you decide to buy a multistep loading press, or a press from a different manufacturer, the basic procedures are the same so you won't go wrong buying this video. In this video you'll learn to reload both straight cases (usually referred to as handgun cases) and necked-down cases (usually referred to as rifle cases), so most of the ammo out there is covered, and there will be no need to buy a separate rifle or pistol video. You will, of course, need to buy, safety glasses or goggles, a loading press, and obtain a loading manual (to tell you what powder to use with the bullet you are loading)--but many presses come with manuals included, as discussed in the video. Where possible, other manufacturer's tools are used. For example the video uses a Lyman caliper, and Frankford Arsenal case tumbler(an inexpensive, tough little tumbler.) Thus &quot;Learn Handgun &amp; Rifle Reloading in Under 41 Minutes&quot; is probably the best reloading video for the beginner. Without a wasted moment this video shows you how to set up an inexpensive, space-saving(spouse-pleasing) workbench, how-to setup an RCBS Rock Chucker Press, how to remove spent primers, resize cases, insert new primers, measure and load powder, and insert a new bullet.\n(about 41 minutes)\n\n~~~\n\nI am always adding new things, so check this account often.\n\nVisit roguesci (dot) org (slash) theforum, and register, for the world's longest running largest explosives and weapons forum on the web!","torrent":{"xt":"urn:btih:32c820cacec2f33d7a2fe7c881d152994bd02d30","amp;dn":"Learn+Handgun+%26+Rifle+Reloading+In+Under+41+Minutes+%28AVI%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32c820cacec2f33d7a2fe7c881d152994bd02d30","infoHashBuffer":{"type":"Buffer","data":[50,200,32,202,206,194,243,61,122,47,231,200,129,209,82,153,75,208,45,48]},"announce":[],"urlList":[]}}