{"title":"ImgBurn 2.5.7.0 Latest stable version 5/19/2013","uid":8491316,"size":6118990,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3308e4a243195eda72957a13fd6d813302d360fb&amp;dn=ImgBurn+2.5.7.0+Latest+stable+version+5%2F19%2F2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"prodallasosoft","files":1,"time":1369010067,"description":"ImgBurn is a lightweight CD / DVD / HD DVD / Blu-ray burning application that everyone should have in their toolkit!\n\nIt has several 'Modes', each one for performing a different task:\n\n    Read - Read a disc to an image file\n    Build - Create an image file from files on your computer or network - or you can write the files directly to a disc\n    Write - Write an image file to a disc\n    Verify - Check a disc is 100% readable. Optionally, you can also have ImgBurn compare it against a given image file to ensure the actual data is correct\n\nImgBurn supports a wide range of image file formats - including BIN, CCD, CDI, CUE, DI, DVD, GI, IMG, ISO, MDS, NRG and PDI.\n\nIt can burn Audio CD's from any file type supported via DirectShow / ACM - including AAC, APE, FLAC, M4A, MP3, MP4, MPC, OGG, PCM, WAV, WMA and WV.\n\nYou can use it to build DVD Video discs (from a VIDEO_TS folder), HD DVD Video discs (from a HVDVD_TS folder) and Blu-ray Video discs (from a BDAV / BDMV folder) with ease.\n\nIt supports Unicode folder/file names, so you shouldn't run in to any problems if you're using an international character set.\n\nImgBurn supports all the Microsoft Windows OS's - Windows 95, Windows 98, Windows Me, Windows NT4, Windows 2000, Windows XP, Windows 2003, Windows Vista, Windows 2008, Windows 7 and Windows 8 (including all the 64-bit versions). If you use Wine, it should also run on Linux and other x86-based Unixes.\n\nIt's a very flexible application with several advanced features that are often lacking in other tools, especially when it comes to burning DVD Video discs. It supports all the latest drives without the need for updates (including booktype / bitsetting / advanced settings on many of the major ones - i.e. BenQ, LiteOn, LG, NEC, Optiarc, Pioneer, Plextor, Samsung, Sony).\n\nScanned (With Kaspersky) And 100% Clean.\n\nPlease Leave A Comment Confirming This Pack\n\nPLEASE SEED !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n\nAs always, this is a exe.Install!\n\nSEED AND ENJOY !\n\nTHE UPLOADS ARE VIRUS / MALWARE FREE.\n\nLEAVE COMMENTS FOR OTHER DOWNLOADERS TO REFER.\n\nAND REMEMBER TO ENJOY ! \n\nIF YOU DON'T SEED, YOU DON'T NEED THIS TORRENT!!! BE KIND TO OTHER DOWNLOADERS ! YO \t\t\t\t\t\t","torrent":{"xt":"urn:btih:3308e4a243195eda72957a13fd6d813302d360fb","amp;dn":"ImgBurn+2.5.7.0+Latest+stable+version+5%2F19%2F2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3308e4a243195eda72957a13fd6d813302d360fb","infoHashBuffer":{"type":"Buffer","data":[51,8,228,162,67,25,94,218,114,149,122,19,253,109,129,51,2,211,96,251]},"announce":[],"urlList":[]}}