{"title":"VA - Woodstock Original Soundtrack And More Vol.1 (2014 24-192)","uid":14829062,"size":5725763440,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:33885b27f6b947d3211a2ae7d40a2b2c96ff0029&amp;dn=VA+-+Woodstock+Original+Soundtrack+And+More+Vol.1+%282014+24-192%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":3,"uploader":"bluesmax","files":33,"time":1465325909,"description":"Various Artists - Woodstock: Music From The Original Soundtrack And More, Vol. 1\r\nLabel: Rhino Atlantic\r\nFormat: WEB, 21 files FLAC, Soundtrack Album, Reissue, Remastered, 24bit 192kHz HDtracks\r\nReleased: 2014\r\nOriginally released 1970\r\nRecorded live at The Woodstock Music &amp; Art Fair, Bethel, NY from August 15 to 17, 1969\r\n\r\n\r\nTracklist:\r\n\r\n01. I Had A Dream (Live Woodstock Version with additional stage dialogue) (John B. Sebastian) (2:53)\r\n02. Going Up The Country (Live Woodstock Version with additional stage dialogue &amp; stage announcements) (Canned Heat) (5:53)\r\n03. Freedom (Live Woodstock Version with additional stage dialogue) (Richie Havens) (5:26)\r\n04. Rock &amp; Soul Music (Live Woodstock Version with additional stage dialogue) (Country Joe &amp; The Fish) (2:09)\r\n05. Coming Into Los Angeles (Live Woodstock Version with additional stage dialogue) (Arlo Guthrie) (2:50)\r\n06. At The Hop (Live Woodstock Version with additional stage dialogue) (Sha Na Na) (2:34)\r\n07. The &quot;Fish&quot; Cheer / I-Feel-Like-I'm-Fixin'-To-Die Rag (Live Woodstock Version with additional stage dialogue) (Country Joe McDonald) (3:17)\r\n08. Drug Store Truck Drivin' Man feat. Jeffrey Shurtleff (Live Woodstock Version with additional stage dialogue) (Joan Baez) (3:09)\r\n09. Joe Hill (Live Woodstock Version with additional stage dialogue &amp; stage announcements) (Joan Baez) (5:33)\r\n10. Suite: Judy Blue Eyes (Live Woodstock Version with additional stage dialogue) (Crosby, Stills &amp; Nash) (8:23)\r\n11. Sea Of Madness (Live Woodstock Version with additional stage dialogue) (Crosby, Stills, Nash &amp; Young) (4:25)\r\n12. Wooden Ships (Live Woodstock Version with additional stage dialogue) (Crosby, Stills, Nash &amp; Young) (5:57)\r\n13. We're Not Gonna Take It (From &quot;Tommy&quot; Live Woodstock Version with additional stage dialogue &amp; stage announcements) (The Who) (6:43)\r\n14. With A Little Help From My Friends (Live Woodstock Version with additional stage dialogue, rainstorm, crowd sounds, stage announcements, &amp; general hysteria) (Joe Cocker) (10:16)\r\n15. Soul Sacrifice (Live Woodstock Version with crowd rain chant, additional stage dialogue &amp; stage announcements) (Santana) (13:46)\r\n16. I'm Going Home (Live Woodstock Version) (Ten Years After) (9:49)\r\n17. Volunteers (Live Woodstock Version with additional stage dialogue) (Jefferson Airplane) (3:45)\r\n18. Medley: Dance To The Music / Music Lover / I Want To Take You Higher (Live Woodstock Version with additional stage dialogue) (Sly &amp; The Family Stone) (14:04)\r\n19. Rainbows All Over Your Blues (Live Woodstock Version with additional stage dialogue) (John B. Sebastian) (3:53)\r\n20. Love March (Live Woodstock Version with additional stage dialogue) (The Paul Butterfield Blues Band) (10:21)\r\n21. Star Spangled Banner / Purple Haze / Instrumental Solo (Live Woodstock Version with additional stage dialogue &amp; stage announcements) (Jimi Hendrix) (13:42)","torrent":{"xt":"urn:btih:33885b27f6b947d3211a2ae7d40a2b2c96ff0029","amp;dn":"VA+-+Woodstock+Original+Soundtrack+And+More+Vol.1+%282014+24-192%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33885b27f6b947d3211a2ae7d40a2b2c96ff0029","infoHashBuffer":{"type":"Buffer","data":[51,136,91,39,246,185,71,211,33,26,42,231,212,10,43,44,150,255,0,41]},"announce":[],"urlList":[]}}