{"title":"Stravinsky and Prokofiev: Works for Strings - Bashmet (2007)","uid":15967677,"size":349086280,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:33cb5ed5b377bc54084978d420a6599d0a8485d3&amp;dn=Stravinsky+and+Prokofiev%3A+Works+for+Strings+-+Bashmet+%282007%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":2,"uploader":"Scheheraz","files":51,"time":1475741429,"description":"http://cps-static.rovicorp.com/3/JPG_500/MI0001/139/MI0001139211.jpg[/img][/center]\r\n\r\nAllMusic Review by Stephen Eddins:\r\n&quot;Yuri Bashmet's performances with the Moscow Soloists of a ballet and concerto by Stravinsky and transcriptions of a set of piano pieces by Prokofiev are notable for two things. First is the elegance and refinement of his readings. The subject of Stravinsky's ballet Apollo makes the work's intelligent rigor and restraint obvious, and the performance is scrupulously polished and thoughtfully considered. A second, seemingly contradictory characteristic is the sensuality Bashmet brings to the score. It would be easy to argue that most dance is essentially Dionysian, with its overt celebration of the body. The fact that Stravinsky brought his Apollonian sensibility to this Dionysian art form certainly created the kind of dynamic tension that makes the works so intriguing. While Bashmet brilliantly conveys the music's intellectuality, he also infuses it with a rhythmic fluidity and sense of corporeality that leave no doubt this music was created to accompany bodies in motion. He brings the same approach to the Concerto in D for strings, which is a thoroughly neo-classical piece, but one in which Bashmet's rhythmic springiness is completely effective.\r\nConductor Rudolf Barshai arranged 15 of Prokofiev's set of 20 very brief piano pieces, Visions fugitives, for string orchestra in 1962, and composer Roman Balashov arranged the remaining five for this recording, finally bringing completion to the set. The pieces work extremely well in arrangement and lose none of their charm and piquancy in the transfer from piano to strings. Here, too, the ensemble plays with complete assurance, and Bashmet's interpretation has just the sense of the delicate and the absurd that the pieces require. Onyx's sound is outstanding -- realistic and clean, with a strong sense of presence.&quot;\r\n\r\nIGOR STRAVINSKY (1882-1971)\r\n- Apollo (composed 1928 as Apollon musagète, rev. 1947)[/b]\r\n- Concerto in D for Strings (1946)\r\nSERGEI PROKOFIEV (1891-1953)\r\n- 20 Visions fugitives op. 22 (1915-17)\r\n\r\nMoscow Soloists\r\nYuri Bashmet - Director","torrent":{"xt":"urn:btih:33cb5ed5b377bc54084978d420a6599d0a8485d3","amp;dn":"Stravinsky+and+Prokofiev%3A+Works+for+Strings+-+Bashmet+%282007%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33cb5ed5b377bc54084978d420a6599d0a8485d3","infoHashBuffer":{"type":"Buffer","data":[51,203,94,213,179,119,188,84,8,73,120,212,32,166,89,157,10,132,133,211]},"announce":[],"urlList":[]}}