{"title":"Billie Holiday - 1992 - The Complete On Verve (1945-1959) FLAC","uid":9355389,"size":3007350199,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:349587adea090732166ed373fed6f107dece1392&amp;dn=Billie+Holiday+-+1992+-+The+Complete+On+Verve+%281945-1959%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"eika256","files":-1,"time":1387207755,"description":"Billie Holiday - 1992 - The Complete On Verve (1945-1959)\n\nThis is a rather incredible collection: ten CDs enclosed in a tight black box that includes every one of the recordings Verve owns of Billie Holiday, not only the many studio recordings of 1952-57 (which feature Lady Day joined by such jazz all-stars as trumpeters Charlie Shavers and Harry &quot;Sweets&quot; Edison, altoist Benny Carter, and the tenors of Flip Phillips, Paul Quinichette and Ben Webster). Also included are prime performances at Jazz at the Philharmonic concerts in 1945-1947, an enjoyable European gig from 1954, her &quot;comeback&quot; Carnegie Hall concert of 1956, Holiday's rather sad final studio album from 1959, and even lengthy tapes from two informal rehearsals. It's a perfect purchase for the true Billie Holiday fanatic. (AllMusic)\n\nIncludes a 220-page book with liner notes, photographs, reproductions \nof Billie Holiday's Verve album covers, and extensive interviews with \nOscar Peterson, Jimmy Rowles, Harry &quot;Sweets&quot; Edison and Barney Kessel. \nOf 10 CDs contained in the set, 8 are of studio and concert \nrecordings, including her Carnegie Hall debut concert, Jazz At The \nPhilharmonic recordings, Lady Day's last recording session, and 2 \nunissued alternate takes. The other 2 CDs contain rehearsal sessions.\n\nPersonnel includes: \nBillie Holiday (vocals)\nWillie Smith, Benny Carter (alto saxophone)\nIllinois Jacquet, Wardell Gray, Charlie Ventura, Coleman Hawkins, Lester Young, Flip Phillips (tenor saxophone)\nHoward McGee, Buck Clayton, Charlie Shavers, Harry &quot;Sweets&quot; Edison, Roy Eldridge (trumpet) \nTrummy Young (trombone)\nRed Norvo (vibraphone)\nMilt Raskin, Ken Kersey, Oscar Peterson, Sonny Clark, Billy Taylor, Jimmy Rowles, Wynton Kelly, Tony Scott, Mal Waldron (piano)\nFreddie Green (guitar) \nTiny Grimes, Barney Kessel, Herb Ellis (electric guitar) \nCharles Mingus, Curly Russell, Al McKibbon, Ray Brown, Red Mitchell, Milt Hinton, Joe Benjamin (bass) \nDavid Coleman, J.C. Heard, Alvin Stoller, Ed Shaughnessy, Cozy Cole, Jo Jones (drums).\n\nProducers include:\nNorman Granz, Ray Ellis, Leonard Feather, Leroy Lovett, Tony Scott.\n\nCompilation producer: Phil Schaap.\nIncludes liner notes by Buck Clayton, Phil Schaap, Bob Porter, and Joel E. Siegel.\n\nDigitally remastered by Thomas &quot;Curly&quot; Ruff, Suha Gur, Andrew Nicholas, Joseph M.Palmaccio, Patrick Ryan (Polygram Studios).\n\nTHE COMPLETE BILLIE HOLIDAY ON VERVE, 1945-1959 won the 1994 Grammy \nAward for &quot;Recording Package,&quot; &quot;Album Notes&quot; and &quot;Historical Album.&quot;\n\nEnjoy and share!","torrent":{"xt":"urn:btih:349587adea090732166ed373fed6f107dece1392","amp;dn":"Billie+Holiday+-+1992+-+The+Complete+On+Verve+%281945-1959%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"349587adea090732166ed373fed6f107dece1392","infoHashBuffer":{"type":"Buffer","data":[52,149,135,173,234,9,7,50,22,110,211,115,254,214,241,7,222,206,19,146]},"announce":[],"urlList":[]}}