{"title":"MPEG Streamclip 1.2b2","uid":3988589,"size":12962399,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:34a74b4b3f7c298acb50cb54ae0b19e96b4c80e9&amp;dn=MPEG+Streamclip+1.2b2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"z247","files":5,"time":1200935085,"description":"MPEG Streamclip is a converter, an exporter, a player, an editor, a downloader.\n\nIt can open many file formats: muxed files MPEG, MPG, VOB, PS, M2P, MOD, VRO, DAT, DCM, VDR, PVR; transport streams TS, M2T, MTS, MMV, REC, VID, AUD, AVR, TP, TP0, TRP; demuxed files M2V, M1V, MPV, AIFF, AIF, M1A, MP2, MPA, AC3; QuickTime-compatible files MOV, DV, AVI, MP4, DIVX; pictures TIFF, JPEG;\n\nMPEG Streamclip supports MPEG-1 video, MPEG layer 1/2 audio, AC3/A52 audio and PCM audio. MPEG-2 video is supported if you have QuickTime Alternative ($0) and you chose to install the Extra QuickTime plugins.\nIf you have Apple QuickTime, and do not want to replace it with QuickTime Alternative, you can buy the MPEG-2 Playback Component ($19.99) from Apple Computer.\n\n\nConverter features:\n? from MPEG, MPG, VOB, PS, M2P, MOD, VRO, DAT, TS, M2T, MMV, REC, VID, AVR\n\tto MPEG, TS, REC, VID, M2V, AIFF, MPA, AC3\n? multiplexing of M2V, M1V, MPV files with AIFF, M1A, MP2, MPA, AC3 files\n\tto MPEG, TS, REC, VID, M2V, AIFF, MPA, AC3\n\t(just open the M2V or M1V file, and the audio file with the same name will be multiplexed on the fly).\n? very fast, no loss of video quality, perfect audio/video sync\n? compatible with DVD authoring applications\n? special Headed format to import unsupported frame sizes in DVD authoring applications\n? special Unscaled demuxed files, for the QuickTime Pro media authoring application\n? can automatically join multiple VOB or TS files\n? manual command to scan the stream and fix timecode breaks\n? batch conversion\n\nExporter features:\n? from MOV, DV, AVI, DIVX, MP4, MPEG, MPG, VOB, PS, M2P, MOD, VRO, DAT, TS, M2T, MMV, REC, VID, AVR, M2V\n\tto MOV, DV, AVI, DIVX, MP4\n? supports any QuickTime-compatible video codec available for Windows, and many audio formats\n? very high quality encoding, all in YUV color space, either unscaled or with 2D-FIR scaling (better than bicubic)\n? motion-adaptive deinterlacing and chroma reinterlacing, with perfect audio/video sync\n? internal high-quality audio resampler\n? batch export\n\nPlayer features:\n? playback of QuickTime-compatible files\n? playback of muxed/demuxed MPEG/VOB files and transport streams with MPEG, AC3, PCM/AIFF audio\n? playback of MPEG files larger than 4GB, or segmented in many files\n? support for multiple audio tracks in transport streams and MPEG/VOB files\n? full screen playback, zoom with arrow keys\n\nEditor features:\n? cut/copy/paste of MPEG files and transport streams, at keyframe (GOP) level\n? frame accurate cut/copy/paste of QuickTime files\n? trimming function, with unique &quot;revert trimming&quot; feature\n? access to keyframes with arrow keys\n? edit list\n\nDownloader features:\n? playback and download of AVI, DIVX, MOV, MP4 files directly over the Internet\n? in some cases, playback and download of video files by entering the address of the web page in which the file is embedded\n? editing before saving the movie to disk\n? batch download\n\nAnd many more features are available!\n\n\n\nThe program is freeware. Everything what is needed (instructions, QT Lite, MPEG-2 plugin) is included in the package. The program itself does not install in the system, so it does not make any mess in the registry. I use it for transcoding to H.264 and I find it stable. There is a version for Apple platforms.\n\n\nEnjoy!","torrent":{"xt":"urn:btih:34a74b4b3f7c298acb50cb54ae0b19e96b4c80e9","amp;dn":"MPEG+Streamclip+1.2b2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34a74b4b3f7c298acb50cb54ae0b19e96b4c80e9","infoHashBuffer":{"type":"Buffer","data":[52,167,75,75,63,124,41,138,203,80,203,84,174,11,25,233,107,76,128,233]},"announce":[],"urlList":[]}}