{"title":"Oh, God! (1977) [DVDRip, 1.85 WS, Eng] - QuincyMKT","uid":4071765,"size":735813632,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:34e533925530676555011627ec1f84d39fc024dc&amp;dn=Oh%2C+God%21+%281977%29+%5BDVDRip%2C+1.85+WS%2C+Eng%5D+-+QuincyMKT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"media2007","files":-1,"time":1205086530,"description":"Oh, God! (1977)\n\nOh, God! is a 1977 comedy film, starring John Denver and George Burns. Based on a novel by Avery Corman, the film, whose screenplay was written by Larry Gelbart, and which was directed by Carl Reiner, was released on Friday, October 7, 1977. The story centers upon an unassuming supermarket manager (Denver) who encounters God (Burns), who picks him to spread his message, despite the skepticism of the media, religious authorities, and his own wife (Teri Garr).\n\nGod appears as a kindly old man to Jerry Landers (Denver), an assistant supermarket manager. After some mixups in trying to set up an &quot;interview,&quot; He tells Jerry that he has been selected to be His messenger to the modern world, much like a contemporary Moses. A bit timidly at first, Landers dutifully tells the world of his encounters with God. Understandably scoffed at first, Landers's life is turned upside down as theologians attempt to discredit him. Eventually, Jerry decides to prove his story in a court of law, after being sued for slander by a preacher God called a &quot;fake&quot;.\n\nThe basis of Jerry's defense is the idea that God's existence is a reasonable possibility, and that if He chooses he can materialize and sit in the witness chair. He pleads for the judge to give him the benefit of the doubt that his story is true.\n\nThe judge threatens to charge Jerry with contempt for &quot;what you apparently thought was a clever stunt.&quot; Suddenly, without opening the doors, God appears and asks to be sworn in. &quot;If it please the court, and even if it doesn't please the court, I'm God, your honor.&quot;\n\nGod provides some miracles, to help the people believe, then He issues a parting shot: &quot;It can work. Don't hurt each other. If it's hard to have faith in me, maybe it will help to know that I have faith in you.&quot;\n\nQuincyMKT\npresenting hard-to-find movies on bittotrrent\nkeep this movie alive - please keep seeding after downloading\n","torrent":{"xt":"urn:btih:34e533925530676555011627ec1f84d39fc024dc","amp;dn":"Oh%2C+God%21+%281977%29+%5BDVDRip%2C+1.85+WS%2C+Eng%5D+-+QuincyMKT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34e533925530676555011627ec1f84d39fc024dc","infoHashBuffer":{"type":"Buffer","data":[52,229,51,146,85,48,103,101,85,1,22,39,236,31,132,211,159,192,36,220]},"announce":[],"urlList":[]}}