{"title":"Manel - Jo Competeixo (2016)","uid":14626490,"size":133019775,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3569621c5fac8e030a6d3efad418fb86dd451e7e&amp;dn=Manel+-+Jo+Competeixo+%282016%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"trucamdema","files":11,"time":1463313834,"description":"Ja ha arribat a la nostra botiga Jo competeixo el quart treball dels Manel, gravat per primer cop a Nova York i amb l'ajuda d'un productor, Jake Aron.\r\nInclou 11 nous temes que es podran escoltar per primer cop en directe, al concert de presentació que faran durant el Primavera Sound de Barcelona el proper 4 de juny.\r\nEls temes són 'Les cosines', 'Cançó del dubte', 'Arriba l'alba a Sant Petersburg', 'La serotonina', 'Temptacions de Collserola', 'M'hi vaig llançar', 'L'espectre de Maria Antonieta', 'BBVA', 'Sabotatge', 'Avança, vianant' i 'Jo competeixo', que dóna nom a l'àlbum.\r\n\r\nUns temes que, segons han explicat, sonen diferent del que han fet fins ara. \r\n\r\n\r\n\r\nManel is a Catalan folk-pop band that made its critically acclaimed album debut in 2008 with Els Millors Professors Europeus. Founded in 2007 in Barcelona, Spain, the band is comprised of Guillem Gisbert (lead vocals), Roger Padilla (guitar, vocals), Martí Maymó (bass, vocals), and Arnau Vallvé (drums, vocals). They made their full-length album debut in 2008 with Els Millors Professors Europeus on the label Discmedi. Sung in Catalan, the album was critically acclaimed in publications such as Rockdelux and showed up on numerous Albums of the Year lists, and the accolades helped drive sales of Els Millors Professors Europeus, which spent much of 2009 on the Spanish albums chart and went on to sell more than 30,000 copies. A promotional video was released for the single &quot;Dona Estrangera.&quot; The band's success prompted a resurgence of interest in the Catalan language and culture, and earned them a major-label deal with Warner Music. Their eagerly-anticipated follow-up 10 Milles per Veure una Bona Armadura hit number one in the Spanish album charts in 2011 -- the first all-Catalan album to do so in 15 years -- despite the defiantly uncommercial nature of their music: dark, melancholic, sometimes gothic, often lacking traditional pop song structure, and littered with obscure references (the title, &quot;Ten Miles To See a Good Suit of Armor&quot;, is a line from Shakespeare's Much Ado About Nothing). The band toured Europe and were particularly popular in Germany, perhaps with the Mittelalter crowd","torrent":{"xt":"urn:btih:3569621c5fac8e030a6d3efad418fb86dd451e7e","amp;dn":"Manel+-+Jo+Competeixo+%282016%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3569621c5fac8e030a6d3efad418fb86dd451e7e","infoHashBuffer":{"type":"Buffer","data":[53,105,98,28,95,172,142,3,10,109,62,250,212,24,251,134,221,69,30,126]},"announce":[],"urlList":[]}}