{"title":"Aristophanes - The Complete Greek Comedies (7 books)","uid":9591128,"size":16667755,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:35aa5eebaf0230a202892378ab90acbbe3841ee2&amp;dn=Aristophanes+-+The+Complete+Greek+Comedies+%287+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"workerbee","files":-1,"time":1391901933,"description":"\nARISTOPHANES (ca. 446 BCE - 386 BCE) was a comic playwright in ancient Athens.  Eleven of his thirty plays survive virtually complete.  These, together with fragments of some of his other plays, provide the only real examples of a genre of comic drama known as Old Comedy, and they are used to define the genre.\n\nKnown as the &quot;Father of Comedy&quot; and the &quot;Prince of Ancient Comedy&quot;, Aristophanes has been said to recreate the life of ancient Athens more convincingly than any other author.  His powers of ridicule were feared and acknowledged by influential contemporaries.  Plato singled out Aristophanes' play THE CLOUDS as slander that contributed to the trial and subsequent condemning to death of Socrates although other satirical playwrights had also caricatured the philosopher.  His second play, THE BABYLONIANS (now lost), was denounced by the demagogue Cleon as a slander against the Athenian polis.\n\nHis plays have a significance that goes beyond their artistic function, as historical documents that open the window on life and politics in classical Athens, in which respect they are perhaps as important as the writings of Thucydides.  The artistic influence of the plays is immeasurable and have impacted the history of European theater.\n\n\nThe following books are in PDF format unless otherwise noted:\n\n* BIRDS (Richer Resources, 2008).  Translated by Ian Johnston.\n\n* BIRDS &amp; OTHER PLAYS [Lysistrata / Assembly-Women / Wealth] (Oxford World's Classics, 1999).  Translated with an Introduction and Notes by Stephen Halliwell.\n\n* CLOUDS (Richer Resources, 2008).  Translated by Ian Johnston.\n\n* CLOUDS (Hackett, 2002).  Translated by Peter Meineck.  Note: This translation is included in THE TRIALS OF SOCRATES: SIX CLASSIC TEXTS, edited by C. D. C. Reeve (Hackett, 2002), which also contains texts by Plato and Xenophon.\n\n* THE COMPLETE PLAYS (New American Library, 2005).  Translated by Paul Roche. -- ePUB\n\n* FROGS (Richer Resources, 2008).  Translated by Ian Johnston.\n\n* FROGS &amp; OTHER PLAYS [Wasps / Women at the Thesmophoria] (Penguin Classics, 2007).  Translated by David Barrett, revised with an Introduction and Notes by Shomit Dutta. -- ePUB\n","torrent":{"xt":"urn:btih:35aa5eebaf0230a202892378ab90acbbe3841ee2","amp;dn":"Aristophanes+-+The+Complete+Greek+Comedies+%287+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35aa5eebaf0230a202892378ab90acbbe3841ee2","infoHashBuffer":{"type":"Buffer","data":[53,170,94,235,175,2,48,162,2,137,35,120,171,144,172,187,227,132,30,226]},"announce":[],"urlList":[]}}