{"title":"The Bob Newhart Show - Season 4","uid":6381355,"size":6528442650,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:35bd9c5b49df6cc0a06201710a8fe0eff8f8fa65&amp;dn=The+Bob+Newhart+Show+-+Season+4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":4,"uploader":"rambam1776","files":-1,"time":1305038080,"description":"The Bob Newhart Show Typical Episode Stats\n\nVideo Codec..........: XviD ISO MPEG-4 \nVideo Bitrate........: 1192kbps \nDuration.............: 25:07.327\nResolution...........: 600*456 \nFramerate............: 23.976 \nAudio Codec..........: 0x2000 (Dolby AC3) AC3 \nAudio Bitrate........: 192 kbps CBR \nAudio Channels.......: 2 \nFilesize.............: 262,939,806 \nSUBTITLES............: English\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Bob_Newhart_Show&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Bob_Newhart_Show&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0068049/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0068049/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bayimg.com/AAhLBaaDm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/AAhLBaaDm&lt;/a&gt;\n\nSeason Four Episodes\n\nThe Bob Newhart Show Gag Reel     \nThe Bob Newhart Show s04e01 - The Longest Goodbye     \nThe Bob Newhart Show s04e02 - Here's Looking at You, Kid     \nThe Bob Newhart Show s04e03 - Death of a Fruitman     \nThe Bob Newhart Show s04e04 - Change Is Gonna Do Me Good     \nThe Bob Newhart Show s04e05 - The Heavyweights     \nThe Bob Newhart Show s04e06 - Carol's Wedding     \nThe Bob Newhart Show s04e07 - Shrinks Across the Sea     \nThe Bob Newhart Show s04e08 - What's It All About     \nThe Bob Newhart Show s04e09 - Who Is Mr. X     \nThe Bob Newhart Show s04e10 - Seemed Like a Good Idea At the Time     \nThe Bob Newhart Show s04e11 - Over the River and Through the Woods     \nThe Bob Newhart Show s04e12 - Father and Sons and Mothers     \nThe Bob Newhart Show s04e13 - The Article     \nThe Bob Newhart Show s04e14 - A Matter of Vice-Principal     \nThe Bob Newhart Show s04e15 - Bob...Tonsils...Hospital     \nThe Bob Newhart Show s04e16 - No Sale     \nThe Bob Newhart Show s04e17 - Carol at 601     \nThe Bob Newhart Show s04e18 - The Way We Weren't     \nThe Bob Newhart Show s04e19 - My Boy Guillermo     \nThe Bob Newhart Show s04e20 - Duke of Dunk     \nThe Bob Newhart Show s04e21 - Guaranteed Not to Shrink     \nThe Bob Newhart Show s04e22 - Birth of a Salesman     \nThe Bob Newhart Show s04e23 - The Boy Next Door     \nThe Bob Newhart Show s04e24 - Peeper Two     \nThe Bob Newhart Show Season 4 Featurette     \nThe Bob Newhart Show Typical Episode Stats \n\n\n\nThe Bob Newhart Show is an American situation comedy produced by MTM Enterprises, which aired 142 original episodes on CBS from September 16, 1972 to April 1, 1978. Comedian Bob Newhart portrayed a psychologist having to deal with his patients and fellow office workers. The show was filmed before a live audience.\n\nPremise\n\nThe popular CBS series stars Newhart as Robert Hartley, Ph.D., a Chicago psychologist. The show divided most of its action between the character's home life and work, with Suzanne Pleshette as Hartley's supportive (though occasionally sarcastic) wife Emily, and Bill Daily as their friendly but inept neighbor, airline navigator Howard Borden. At the medical office where Hartley had his psychology practice, Peter Bonerz appeared as Jerry Robinson, D.D.S., an orthodontist who shared the office suite, and Marcia Wallace portrayed their joke-loving receptionist, Carol Kester (later Kester-Bondurant).\n\nTwo of Hartley's more memorable regular patients were the mean-spirited and neurotic Elliot Carlin (Jack Riley) and the milquetoast Marine veteran Emil Peterson (John Fiedler). (Carlin was ranked 49th in TV Guide's List of the 50 Greatest TV Characters of All Time, and Riley reprised the character in guest appearances on both St. Elsewhere and Newhart.)\n\nMost of the situations involved Newhart's character playing straight man to his wife, colleagues, friends and patients, an extension of Newhart's stand-up comedy routines, where Newhart would play one side of a telephone conversation, the other side of which was not heard. Emily routinely acted as straight man to dimwitted Howard, and on occasion to Bob.\n\nCast\n\nBob Newhart as Dr. Robert Hartley, psychologist\nSuzanne Pleshette as Emily Hartley (nÃƒÂ©e Harrison), his wife, a school teacher\nBill Daily as Howard Borden, their next-door neighbor, an airline navigator; becomes Bob's brother-in-law\nPeter Bonerz as Dr. Jerry Robinson, Bob's friend, an orthodontist\nMarcia Wallace as Carol Kester, their receptionist\n\nBob's patients\n\nJack Riley as Elliot Carlin (29 episodes)\nRenÃƒÂ©e Lippin as Michelle Nardo (15)\nFlorida Friebus as Mrs. Lillian Bakerman (10)\nJohn Fiedler as Mr. Emil Peterson (9)\nOliver Clark as Mr. Ed Herd (6)\nNoam Pitlik as Mr. Victor Gianelli (5)\nDaniel J. Travanti as Mr. Gianelli (1)\nHoward Hesseman as Mr. Craig Plager (5)\nLucien Scott as Mr. Vickers (5)\nMerie Earle as Mrs. Loomis (3)\nRhoda Gemignani as Miss Joan Rossi (3)\nJerry Fogel as Paul Billingham (2)\nRichard Libertini as Franklin Pitt (2)\nMichael Conrad as Mr. Trevesco (2)\n\nBob and Emily's relatives\n\nPat Finley as Ellen Hartley, Bob's sister; later Howard's girlfriend (15 episodes)\nMartha Scott as Mrs. Martha Hartley, Bob's mother (4)\nBarnard Hughes as Herb Hartley, Bob's father (3)\nJohn Randolph as Junior Harrison, Emily's father (3)\nAnn Rutherford as Aggie Harrison, Emily's mother (2)\n\nNeighbors, friends and others\n\nPatricia Smith as Margaret Hoover, Emily's friend (7 episodes)\nTom Poston as Cliff &quot;The Peeper&quot; Murdock, Bob's college friend from Vermont (5)\nMoosie Drier as Howie Borden, Howard's son (5)\nWill Mackenzie as Larry Bondurant, Carol's boyfriend (later husband) (5)\nRichard Schaal as Chuck Brock, a boyfriend of Carol's (3)\nJill Jaress as Mary Ellen, a girlfriend of Jerry's (4)\nGail Strickland as Courtney Simpson, a girlfriend of Jerry's (2)\nRaÃƒÂºl JuliÃƒÂ¡ as Dr. Greg Robinson, Jerry's brother (1)\n\nRimbau Medical Arts Center\n\nLarry Gelman as Dr. Bernie Tupperman, urologist (12 episodes)\nHoward Platt as Dr. Newman, cosmetic surgeon (4)\nShirley O'Hara as Debbie, temp receptionist (3)\nPhillip R. Allen as Dr. Walburn, another psychologist (2)\nTeri Garr as Miss Brennan, Dr. Walburn's receptionist (2)\n","torrent":{"xt":"urn:btih:35bd9c5b49df6cc0a06201710a8fe0eff8f8fa65","amp;dn":"The+Bob+Newhart+Show+-+Season+4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35bd9c5b49df6cc0a06201710a8fe0eff8f8fa65","infoHashBuffer":{"type":"Buffer","data":[53,189,156,91,73,223,108,192,160,98,1,113,10,143,224,239,248,248,250,101]},"announce":[],"urlList":[]}}