{"title":"Dragonslayer 1981 Honeyko x264 RESTORED uncut widescreen","uid":6273144,"size":3967600422,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:36516f4a3845212d79a9c340630fc5f6b9045565&amp;dn=Dragonslayer+1981+Honeyko+x264+RESTORED+uncut+widescreen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":4,"uploader":"mike18xx2","files":-1,"time":1301153964,"description":"Dragonslayer, 1981 ...fantasy, suspense, adventure, horror, romance,\ndrama, dragon, medieval weaponry, kings, wizards, classical music\n\nReturn with us once again to the thrilling days of yesteryear when\nmovie-makers still knew how to shoot, edit, and score a film, and\nweren't afraid to cast older actors in more than half the roles.\n\n-- Still the best movie dragon of them all: The monster in this film\nisn't the misunderstood, anthropomorphic, sympathetic CGI creature you've\ncome to expect from more recent rubbish like &quot;Dragonheart&quot;, let alone one\nwhich will let you saddle it up (&quot;Eragon&quot;, &quot;Dungeons and Dragons&quot; ). No,\nthis film's dragon is a menacing, malevolent lizard with a taste for the\nflesh of sacrificed virgins, and whomever else gets in his way.\n\nVideo Source ....: Region 1 widescreen NTSC\nVideo Codec .....: x264, CQ16, FRFun7, LimitedSharpenFaster, MVDegrain3\nAudio Codec .....: Nero AAC 5.1, Lame MP3 DPLII stereo surround-sound\nFrame Size ......: 960x480 (upsampled 720x360), 1135x480 Anamorphic DAR\nFPS .............: 23.976 original, because &quot;tinny PAL&quot; stinks.\n\nAudio English 5.1 and stereo, German stereo.\n\nSubtitles: Bulgarian Danish Dutch English + Hearing-Impaired\nFinnish-Suomi French German Italian Norwegian Polish Portuguese-BR\nRomanian Serbian Slovenian Spanish Swedish\n\nAlex North soundtrack: 320Kbps lame MP3 (&quot;Unauthorized&quot; and La-la releases).\n\nEncoding: like many 1980s films initially rushed onto plastic when DVDs\nwere in their infancy in the 90s, Dragonslayer was given a poor treatment\nby modern standards: the film was not restored and compression technique\nwas crude. Combined with Dragonslayer being filmed under entirely natural\nlighting and virtually all scenes being dark and filled with smoke, mist\nor cloud -- it results in the film being arguably the dirtiest, grainiest\nproject I have ever worked with: in some shots literally more than 50% of\nthe pixels on the screen at any given moment were grain. On top of that\nwas the noticeable aliasing due to only 360 NTSC vertical display lines.\n\nA combination of FRFun7 and MVDegrain3 filters removed virtually all\nof the grain without introducing banding; upsizing by 33% vertically\nsmoothed the aliasing without blurring the picture.\n\nSubjective appearance compared to original DVD grainbomb: vastly superior.\n\nScenes frequently cut: The bathing scene, and the priest getting fried.\nWARNING: PAL DVDs are &quot;tinny&quot;, letterboxed, and may have cut version.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0082288/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0082288/&lt;/a&gt;\n\n\n- - - - -\n\n\nA monster movie where the monster is well worth the big wait;\n***** 6 Jan 2005 Amazon review By Lawrance M. Bernabo\n\nUltimately, &quot;Dragonslayer&quot; succeeds where the vast majority of monster movies fail, which is the point at which you get to see the creature and it is a big disappointment. Very few movies had really great monsters when I was growing up and you get to the point where you just expect them to be bad. Even when the make up is pretty good, say Boris Karloff in the original version of &quot;The Mummy&quot; or Oliver Reed in &quot;The Curse of the Werewolf,&quot; you get shorted on how often the monster actually gets to be on screen. &quot;Dragonslayer&quot; ups the ante because there is a big build up to the point when you finally get to see the dragon. But for my money it is well worth the wait because the folks at Industrial Light &amp; Magic deliver even though we are talking 1981 special effects.\n\nThe story in &quot;Dragonslayer&quot; combines a couple of recognizable plot lines from the fantasy genre. First there is the hapless young apprentice, Galen (Peter MacNicol), trying to learn his craft from a great wizard, Ulrich (Ralph Richardson). I am certainly reminded of Mickey Mouse from &quot;The Sorcerer's Apprentice&quot; in &quot;Fantasia,&quot; except that Galen is a lot more earnest. Second, there is the fact that Casiodorus Rex (Peter Eyre), the ruler of the land, has been sacrificing virgins to keep the local dragon from leveling the countryside. Young Valerian (Caitlin Clarke) arrives to beseech Ulrich, the last wizard around, to kill the dragon, which is probably the last of its kind as well.\n\nThe only problem is that Ulrich has died, which means that young Galen has to become a dragonslayer. Galen wants to do the great deed for the right reasons, but there is also the Princess Elspeth (Chloe Salaman) to consider, along with all the other young virgins forced to participate in the grim lottery. Casiodorus is not thrilled by the prospect of the fate of his kingdom resting on the shoulders of Galen, so he tries to thwart the young man's plans. However, there is somebody who thinks that the rules of the game in Urland have to be changed.\n\nBeyond the Oscar nominated special effects (and musical score by Alex North) what makes &quot;Dragonslayer&quot; work is that it takes place in a grungy medieval world where everybody is dirty and outright despair seems like an appropriate response to each sunrise. In such a world sacrificing a virgin once a year seems rather reasonable, and an act of heroism seems improbable, especially when your hopes rest on the baby-faced Galen. The atmosphere and the special effects fit together just perfectly, and Ralph Richardson's performance as the sorcerer gives the film its memorable performance.\n\nThe casting of MacNichol is seen as problematic by some, especially those familiar with his stellar comedy work on &quot;Chicago Hope&quot; and &quot;Ally McBeal,&quot; but I think he works well in this particular context. The idea here is that the hero is not somebody who wants to be a great fighter with a sword but a sorcerer using potions and magicks. MacNichol looks like somebody who would be more comfortable with a staff than a sword, so that when he actually has to pick up a spear and shield to fight the dragon he looks really uncomfortable. Then he sees the dragon and he looks scared. We see the dragon, so we completely understand.\n\nAlthough a lot of the elements are familiar to everyone weaned on Tolkien and excited by the original &quot;Star Wars&quot; films, there are some attempts to be different. I especially liked the fate of the Princess and the ending has a sense of fatalism we rarely get in a fantasy film, with or without a monster. Unfortunately, the DVD version of &quot;Dragonslayer&quot; has absolutely nothing in terms of bonus features (not even the trailer), but at least the film is presented in anamorphic widescreen so you can enjoy all of the Scottish landscape. More importantly, there is the CGI dragon that mandates this one getting five stars because that dragon is that good. When a movie delivers the goods with the monster the way &quot;Dragonslayer&quot; does, attention must be paid.","torrent":{"xt":"urn:btih:36516f4a3845212d79a9c340630fc5f6b9045565","amp;dn":"Dragonslayer+1981+Honeyko+x264+RESTORED+uncut+widescreen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36516f4a3845212d79a9c340630fc5f6b9045565","infoHashBuffer":{"type":"Buffer","data":[54,81,111,74,56,69,33,45,121,169,195,64,99,15,197,246,185,4,85,101]},"announce":[],"urlList":[]}}