{"title":"Kyoto - City of Zen - Visiting the Heritage Sites of Japans Anci","uid":9047607,"size":26390456,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:36634e126dffe878a7b0e7f281c74e90471f96bf&amp;dn=Kyoto+-+City+of+Zen+-+Visiting+the+Heritage+Sites+of+Japans+Anci&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"STBGD","files":-1,"time":1381791786,"description":"Judith Clancy, &quot;Kyoto - City of Zen: Visiting the Heritage Sites of Japan's Ancient Capital&quot; \nEnglish | ISBN: 4805309784 | 2013 |PDF | 144 pages | 25 MB\n\nAn elaborate kaleidoscope of craft, artistry and religion, Kyoto is one of the world's most popular travel destinations. Art and design form the weft and warp of this vibrant 1,200-year-old city, home to hundreds of gardens, palaces, villas and magnificent wooden temples, including seventeen UNESCO World Heritage sites.\n\nLike a Zen koan, Kyoto defies easy description. Its citizens may work at Nintendo designing video games, at a company designing precision medical instruments, or sitting cross-legged meticulously affixing micro-thin flakes of gold foil onto a painting. All of them share a living heritage grounded in centuries of traditional culture.\n\nIn Kyoto: City of Zen, local Kyoto expert Judith Clancy presents the most important gardens, temples, shrines and palaces of this ancient capital city and enduring cultural center. In addition to unveiling the city's spiritual and historical riches, this book shares with readers the exquisite foods, artistic crafts, religious ceremonies and architectural traditions that have flourished in Kyoto for over a millennium. Tea ceremonies, calligraphy, weaving, pottery, painting, drama, and many more traditional arts and crafts are presented through more than 350 photographs by Ben Simmons, whose images capture the true essence of Kyoto. The city's natural setting also comes into focus as you walk along leafy mountain paths and through spectacular parks and gardens viewing the best foliage each season has to offer.","torrent":{"xt":"urn:btih:36634e126dffe878a7b0e7f281c74e90471f96bf","amp;dn":"Kyoto+-+City+of+Zen+-+Visiting+the+Heritage+Sites+of+Japans+Anci","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36634e126dffe878a7b0e7f281c74e90471f96bf","infoHashBuffer":{"type":"Buffer","data":[54,99,78,18,109,255,232,120,167,176,231,242,129,199,78,144,71,31,150,191]},"announce":[],"urlList":[]}}