{"title":"The Unwritten Rules of Social Relationships Temple Grandin","uid":4378434,"size":2542569,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:36c01052c2e62a597e5d3ec3609a7d6f67046f63&amp;dn=The+Unwritten+Rules+of+Social+Relationships+Temple+Grandin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"adhdbrigaden","files":1,"time":1220489181,"description":"The Unwritten Rules of Social Relationships: Decoding Social Mysteries Through the Unique Perspectives of Autism and aspergers syndrome \n\nBy Temple Grandin, Sean Barron\n\n\nProduct Description: \n\nDr. Grandin and Barron address the social challenges those with autism and Asperger's face, explaining in the process how confusing and illogical normal societal rules can be. They also address the &quot;unwritten rules&quot; that most children understand instinctively but are a mystery to those on the spectrum. They teach how to trust feelings, be assertive in a positive way, and deal with negative people and situations.\n\n\n\n\n&quot;Unwritten Rules of Social Relationships&quot; Decoding Social Mysteries Through the Unique Perspectives of Autism&quot;, by Temple Grandin &amp; Sean Baron and Editor Veronica Zysk. Future Horizons, TX 2005. ISBN 1-932565-06-X. HC 383 pages, no illust., 3 pgs. Ref. 9 1/4&quot; x 6 1/4&quot;. \n\nAn intense, factual expose of the autistic mind-set interpreted through the minds of two published writers, both of whom worked successfully to overcome their ASD (autism spectrum disorder) disabilities, including AS (Asperger's) or Aspies. The book's format was uniquely addressed by having a skilled editor monitor major issues and allowing the authors to define &amp; explicate personal experiences &amp; varied techniques they used to overcome obstacles and deficiencies, nearly all of which involved social interaction with peers, parents &amp; professionals (teachers or employers). \n\nImportantly the spectral divergence of afflictions were compared and categorized into basic subtypes as Imaging vs Logical (flat affect) vs Emotional types; noting need to become integrated in society through compensatory, modified behaviors, while stressing importance of obtaining early help through parenting, mentors, professionals and inherent need to gain motivation and self-esteem. Great emphasis is placed on the &quot;Ten Unwritten Rules of Social Relationship&quot;, most of which are social skills &amp; behaviors taught under generic term of manners, etc., and are discussed in a highly emphatic but coherent manner. Specific weak links in ASD include rigidity of thought &amp; behavior, difficulty in multi-tasking, emotional absence or lability, lack of perspective thinking, and naivetÃƒÆ’Ã‚Â© or guilelessness wherein unfair advantage is easily taken of them. \n\nThe book, as a primer teaching tool, rightfully contains modest prolixity, which in and of itself is common to ASD. The mismatch of the sensory inputs (visual, auditory, touch, etc.) often requires environmental adjustments or elimination, at times the use of medications or special diets, and regular exercise is emphasized. Conclusions include some brief synopses of other ASDs having diverse problems, some undiagnosed until adulthood. Current era where societal integration is less tightly bonded, family units fragmented and a heightened if not frantic pace of living reigns in a culture of increasing acceptance of using drugs, alcohol, smoking, sex, video-games, C-Ps and self-importance causes authors to suggest current-day treatment is more difficult than during the 50's and 60's when B&amp;W TV was monitored. \n\nThis is a book that everyone, affected or not, would learn a great deal about successful societal integration.\n\nExcellent way for neurotypicals to understand moore than the stereotypical social world of Neurotypicals: NT. \n\n","torrent":{"xt":"urn:btih:36c01052c2e62a597e5d3ec3609a7d6f67046f63","amp;dn":"The+Unwritten+Rules+of+Social+Relationships+Temple+Grandin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36c01052c2e62a597e5d3ec3609a7d6f67046f63","infoHashBuffer":{"type":"Buffer","data":[54,192,16,82,194,230,42,89,126,93,62,195,96,154,125,111,103,4,111,99]},"announce":[],"urlList":[]}}