{"title":"Encyclopedia of Modern China - 1st Edition (4 volume set) (2009)","uid":12178349,"size":101618800,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:36d1b02ca052f66f42e65788c4e4fa315d44262d&amp;dn=Encyclopedia+of+Modern+China+-+1st+Edition+%284+volume+set%29+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"GoonerTPB","files":1,"time":1438362453,"description":"Publisher: Charles Scribners &amp; Sons; 1 edition (July 31, 2009)\nLanguage: English\nISBN-10: 0684315661\nISBN-13: 978-0684315669\n\nAn exciting addition to Scribner's World History program, the Encyclopedia of Modern China is designed for academic and professional users-from advanced high school students and undergraduates to professors, journalists, and business people-as well as public library patrons. The encyclopedia showcases the work of an international body of prominent scholars, who offer accessible, original, and authoritative analysis of all aspects of the history and culture of China since 1800. In more than 2,000 pages of alphabetical entries, each ranging from 500 to 5,000 words, Encyclopedia of Modern China provides critical information on the most populous country and most dynamic trade market in the world: the people, politics, economics, religion, philosophy, traditions, art, and literature of this ancient and enduring civilization is explored from the beginning of the nineteenth century to the present day. Given China's increasing role in world affairs, its modern history and culture are of great interest to many, and this work is designed to bring reliable and accessible facts and analysis to students, professionals, and others who study and interact with China and her people. Commissioned contributors from colleges and universities in China and around the world provide authoritative content and fresh scholarly analysis: Scores of tables, charts, graphs, and maps illustrate key points. A glossary appendix listing transliteration of unique names, terms, and expressions. A cumulative index, cross references, and lists of related topics in each article provide multiple access points to the cross-disciplinary content. All articles end with bibliographies, suggesting important sources for reference and further reading. A chronology of Chinese history since 1800 outlines key events in the nation's recent history, and offers international parallels for context and perspective. An appendix of primary sources helps to enhance readers' understanding of life in modern China","torrent":{"xt":"urn:btih:36d1b02ca052f66f42e65788c4e4fa315d44262d","amp;dn":"Encyclopedia+of+Modern+China+-+1st+Edition+%284+volume+set%29+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36d1b02ca052f66f42e65788c4e4fa315d44262d","infoHashBuffer":{"type":"Buffer","data":[54,209,176,44,160,82,246,111,66,230,87,136,196,228,250,49,93,68,38,45]},"announce":[],"urlList":[]}}