{"title":"How To Not Write Bad - The Most Common Writing Problems (Epub,Mo","uid":9636353,"size":642055,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:36e87d267a2a1bb77b083c524b9319973961a262&amp;dn=How+To+Not+Write+Bad+-+The+Most+Common+Writing+Problems+%28Epub%2CMo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":2,"uploader":"GoonerTPB","files":2,"time":1392850669,"description":"How to Not Write Bad: The Most Common Writing Problems and the Best Ways to Avoid Them by Ben Yagoda\n\n\nFormat: mobi/epub\nGenre: Language/Writing Skills\nPrint Length: 175 pages\nRelease Date: 5 February 2013\n\nBen Yagoda's How to Not Write Bad illustrates how we can all write better, more clearly, and for a wider readership.\n\nHe offers advice on what he calls &quot;not-writing-badly,&quot; which consists of the ability, first, to craft sentences that are correct in terms of spelling, diction (word choice), punctuation, and grammar, and that also display clarity, precision, and grace. Then he focuses on crafting whole paragraphs with attention to cadence, consistency of tone, sentence transitions, and paragraph length.\n\nIn a fun, comprehensive guide, Yagoda lays out the simple steps we can all take to make our writing more effective, more interestingand just plain better.\n\nReview:\n\nFirst off, I'm not a journalist or an English professor. I'm just a guy who wants to improve my writing. Ben Yagoda's &quot;How to Not Write Bad&quot; seeks to help people do just that, being a short guide that covers the key points on how to write well. If this sounds dull, it's not; the author throws in hilarious writing samples from his students, and other examples of bad writing that make this book an educational but funny read (perhaps until the reader realizes he or she is guilty of some of these common errors).\n\nMr. Yagoda covers many examples of bad-writing we're all guilty of, from the more basic:\n\n- &quot;Don't use a long word when there's a shorter one that means the same thing.&quot;\n\n- &quot;Avoid word repetition. Do not avoid it by means of 'elegant variation'--the use of a synonym for the express purpose of avoiding word repetition.&quot;\n\n- &quot;Never use whomever.&quot;\n\nTo the more advanced:\n\n- &quot;The trick is, when there's no readily apparent way to avoid repetition, it often works to find a word referring to a broader or narrower category of the first one. So painting/work is okay (broader), as is painting/neo-expressionistic portraits (narrower). But paintings/canvases is elegant variation.&quot;\n\n- &quot;Shark cage diving is a compound adjective--that is, a phrase made up of two or more words, that modifies a noun--and compound adjectives before a noun (experience) get hyphenated: 'my shark-cage-diving experience.'&quot;","torrent":{"xt":"urn:btih:36e87d267a2a1bb77b083c524b9319973961a262","amp;dn":"How+To+Not+Write+Bad+-+The+Most+Common+Writing+Problems+%28Epub%2CMo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36e87d267a2a1bb77b083c524b9319973961a262","infoHashBuffer":{"type":"Buffer","data":[54,232,125,38,122,42,27,183,123,8,60,82,75,147,25,151,57,97,162,98]},"announce":[],"urlList":[]}}