{"title":"Funny Girl - Original Broadway Cast - Barbara Streisand 320cbr (","uid":9461273,"size":127584650,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3744b93dd6e92c78fcee76dba75aa3b0c10936d7&amp;dn=Funny+Girl+-+Original+Broadway+Cast+-+Barbara+Streisand+320cbr+%28&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1389359183,"description":"Source: 1992 CD\nimage\n\nBy A Customer\nFUNNY GIRL has become inextricably linked with the phenomenon that is &quot;Barbra Streisand&quot;. She created the role on Broadway in 1964, played it [for a time] in London, then went to Hollywood to do the film. After that? Well, the rest is history.\n\nYet this recording is where some argue she is heard at her best. Not quite 22 when she did the show, her voice on the CD is a marvel - no other word for it. She brings new meaning to the word &quot;clarion&quot;, providing [I think] some of the most thrilling moments to be heard on ANY cast recording. &quot;People&quot; comes from this score and Streisand did a beautiful reading of it in the film. But it can't compare with the simplicity of her version on the stage - it's just exquisite. The score itself is top-notch and compares favorably with Jule Styne's masterpiece, GYPSY. Bob Merrill's lyrics [remember it was HE who gave us those memorable words to &quot;People&quot;&gt; are first-rate, proving that he really was a talent of the first water. Sydney Chaplin as Nicky Arnstein, while not possessing the richest of baritones, is no slouch with a song, and does a really fun, sexy, version of &quot;You Are Woman&quot;. A number of songs left out of the film are of course to be found here on the Original Cast CD. Among those is the lovely, lovely &quot;The Music That Makes Me Dance&quot; which Miss Streisand turns into a gorgeous, very moving showstopper. It's one of those Broadway Cast Albums that really is special. With a star perhaps bigger than any in recent history, a score that is up with the best of the sixties, and a recording that's rich-sounding and theatrical, you won't regret this joining your collection. And by the way, THAT overture [like so many from Styne, the overture &quot;king&quot;&gt; is a treat in itself: talk about &quot;setting the mood&quot;! What more can you ask for? Streisand and a score to die for.","torrent":{"xt":"urn:btih:3744b93dd6e92c78fcee76dba75aa3b0c10936d7","amp;dn":"Funny+Girl+-+Original+Broadway+Cast+-+Barbara+Streisand+320cbr+%28","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3744b93dd6e92c78fcee76dba75aa3b0c10936d7","infoHashBuffer":{"type":"Buffer","data":[55,68,185,61,214,233,44,120,252,238,118,219,167,90,163,176,193,9,54,215]},"announce":[],"urlList":[]}}