{"title":"Losing My Virginity By Richard Branson [PDF, ePub, Mobi]","uid":7956549,"size":12967646,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:37a0301c2f47471db9d428d9f06a2c9d41b43ccc&amp;dn=Losing+My+Virginity+By+Richard+Branson+%5BPDF%2C+ePub%2C+Mobi%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"theBooks","files":-1,"time":1356448962,"description":"Losing My Virginity: How I Survived, Had Fun, and Made a Fortune Doing Business My Way\nAuthor(s): Richard Branson\nPublisher: Crown Business\nDate: 2011\nPages: 424 in PDF format\nFormat: PDF, ePub, Kindle\nLanguage: English\nISBN-10: 0307720748\nISBN-13: 978-0307720740\nSize: 12.66 MB\n\n\nDescription:\n\n&quot;Oh, screw it, let's do it.&quot;\n\nThat's the philosophy that has allowed Richard Branson, in slightly more than twenty-five years, to spawn so many successful ventures. From the airline business (Virgin Atlantic Airways), to music (Virgin Records and V2), to cola (Virgin Cola), to retail (Virgin Megastores), and nearly a hundred others, ranging from financial services to bridal wear, Branson has a track record second to none.\n\nLosing My Virginity is the unusual, frequently outrageous autobiography of one of the great business geniuses of our time. When Richard Branson started his first business, he and his friends decided that &quot;since we're complete virgins at business, let's call it just that: Virgin.&quot; Since then, Branson has written his own &quot;rules&quot; for success, creating a group of companies with a global presence, but no central headquarters, no management hierarchy, and minimal bureaucracy.\n\nMany of Richard Branson's companies--airlines, retailing, and cola are good examples--were started in the face of entrenched competition. The experts said, &quot;Don't do it.&quot; But Branson found golden opportunities in markets in which customers have been ripped off or underserved, where confusion reigns, and the competition is complacent. \n\nAnd in this stressed-out, overworked age, Richard Branson gives us a new model: a dynamic, hardworking, successful entrepreneur who lives life to the fullest. Family, friends, fun, and adventure are equally important as business in Branson'slife.\n\nLosing My Virginity is a portrait of a productive, sane, balanced life, filled with rich and colorful stories:\n\n* Crash-landing his hot-air balloon in the Algerian desert, yet remaining determined to have another go at being the first to circle the globe\n* Signing the Sex Pistols, Janet Jackson, the Rolling Stones, Boy George, and Phil Collins\n* Fighting back when British Airways took on Virgin Atlantic and successfully suing this pillar of the British business establishment\n* Swimming two miles to safety during a violent storm off the coast of Mexico\n* Selling Virgin Records to save Virgin Atlantic\n* Staging a rescue flight into Baghdad before the start of the Gulf War...\n* And much more.\n\nLosing My Virginity is the ultimate tale of personal and business survival from a man who combines the business prowess of Bill Gates and the promotional instincts of P. T. Barnum.\n\n\nAmazon Customer Ratings:\n\n34 Reviews\n5 star: (23)\n4 star: (8)\n3 star: (3)\n2 star: (0)\n1 star: (0)\n\nPlease Seed if you want to help :)","torrent":{"xt":"urn:btih:37a0301c2f47471db9d428d9f06a2c9d41b43ccc","amp;dn":"Losing+My+Virginity+By+Richard+Branson+%5BPDF%2C+ePub%2C+Mobi%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37a0301c2f47471db9d428d9f06a2c9d41b43ccc","infoHashBuffer":{"type":"Buffer","data":[55,160,48,28,47,71,71,29,185,212,40,217,240,106,44,157,65,180,60,204]},"announce":[],"urlList":[]}}