{"title":"Miles Davis - Relaxin' with the Miles Davis Quintet (1957","uid":4620014,"size":90979905,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:37cc695dcba19ccdec7bf1c1eeffacd01c56af2b&amp;dn=Miles+Davis+-+Relaxin%5C%27+with+the+Miles+Davis+Quintet+%281957&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"schon55","files":13,"time":1230996463,"description":"Miles Davis - Relaxin' with the Miles Davis Quintet (1957) \nOriginal Release Date: 1957 \nLabel: Ojc \nBitrate: 320 kbps\n\n&quot;Along with Steamin, Workin, and Cookin, &quot;Relaxin&quot; offers an up close and personal look at Miles' group ca. 1955, in their transition phase between Prestige and Columbia records.  From the opening chimes of &quot;If I were A Bell,&quot; Miles dominates the proceedings as only he can- his tone, sense of time, style, and the use of his famous Harmon Mute never better. He was definitely a man on a mission, and his leadership on his trumpet is simply astounding.\n\nThe band also cooks on saxophonist Sonny Rollins' staple &quot; Oleo &quot; (as in oleo margarine, for the kids out there.. a simple form of clarified margarine ), with Chambers' fast walking bass complimenting Philly Joe Jones' incomperable drumming, complete with his famous &quot;Philly Licks&quot; ( playing rim shots versus the snare to keep the beat going ).\n\n&quot;I Could Write a Book&quot; is highlighted by great interplay between Miles, drummer Jones, and bassist Paul Chambers.\n\nThe rest of the lp comprises slower, more laid back numbers, right for, well .. relaxin, I suppose.\n\nA wonderful lp of great material, &quot;Relaxin,&quot; like the other 3 lps of the series, showcase Miles and the group enjoying themselves greatly. The results show as much.&quot; ~ Sean M Kelly\n\nEditorial Reviews\nAmazon.com\nThis CD comes from the marathon 1956 Prestige sessions with the first of Miles Davis's great quintets: John Coltrane on tenor, Red Garland on piano, Paul Chambers on bass, and Philly Joe Jones on drums. The group recorded four LPs for Prestige, contemporaneous with the early Columbia material recently celebrated on the Davis-Coltrane Complete Columbia Studio Sessions. Relaxin' emphasizes Davis's concentrated ballad style, with his middle-register trumpet played through a Harmon mute very close to the microphone. What might be a mere buzz in lesser hands becomes restrained passion and detailed expression on the slow tempos of &quot;You're My Everything&quot; and &quot;It Could Happen to You,&quot; while Davis conveys joy on the faster tempo of &quot;I Could Write a Book.&quot; &quot;If I Were a Bell,&quot; from Frank Loesser's then contemporary Guys and Dolls, is another melodic highlight.\nThe boppish side of the band is heard on Sonny Rollins's &quot;Oleo,&quot; a tour de force animated by Chambers's limber walking bass, and on Dizzy Gillespie's &quot;Woody 'n' You,&quot; the only tune with Davis playing his trumpet with an open bell. Coltrane was entering a period of sustained musical growth, still beholden to Charlie Parker and Rollins, but with flashes of the convulsive power and incendiary questing that his work would soon attain. As different as the two horns are, they reflect the band's ineffable mix of hot and cool elements, from Garland's masterful vamps to the explosive power of Philly Joe Jones. Davis and his cohort were defining the modern mainstream, providing models that are still durable today. ~ Stuart Broomer \n\nProduct Description\nOne of the strongest of Miles Davis' recordings with his first classic quintet (a group also including the young tenor saxophonist John Coltrane, pianist Red Garland, bassist Paul Chambers and drummer Philly Joe Jones), this CD reissue is highlighted by If I Were a Bell, I Could Write a Book and Sonny Rollins' Oleo. Actually all six selections are quite rewarding and helped set the standard for bands of the era. 6 tracks. ~ OJC/ Prestige label. \n\nThe Personnel:\nMiles Davis - Trumpet\nJohn Coltrane - Tenor saxophone\nPhilly Joe Jones - Drums\nRed Garland - Piano\nPaul Chambers - Bass\n\nMiles Davis - Relaxin' with the Miles Davis Quintet (1957) Tracks:\n01 Studio Chatter 0:13\n02 If I Were A Bell 8:10\n03 Studio Chatter 0:30\n04 You're My Everything 4:52\n05 I Could Write a Book 5:12\n06 Studio Chatter 0:26\n07 Oleo 5:56\n08 It Could Happen to You 6:39\n09 Woody 'n' You 5:03","torrent":{"xt":"urn:btih:37cc695dcba19ccdec7bf1c1eeffacd01c56af2b","amp;dn":"Miles+Davis+-+Relaxin%5C%27+with+the+Miles+Davis+Quintet+%281957","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37cc695dcba19ccdec7bf1c1eeffacd01c56af2b","infoHashBuffer":{"type":"Buffer","data":[55,204,105,93,203,161,156,205,236,123,241,193,238,255,172,208,28,86,175,43]},"announce":[],"urlList":[]}}