{"title":"[SoM]Cinderella man[DvdRip-Xvid-Ita-Mp3]","uid":4536282,"size":734388224,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:37d23f9eeca4e11870906f1a63be43e0de07dab5&amp;dn=%5BSoM%5DCinderella+man%5BDvdRip-Xvid-Ita-Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"mitimex","files":1,"time":1227744989,"description":"Braddock ÃƒÂ¨ un giovane irlandese cresciuto nelle strade. ÃƒË† una promessa della boxe nella categoria dei massimi leggeri ma si trova costretto a smettere dopo aver perso numerosi incontri. Nel periodo in cui gli Stati Uniti attraversano la Grande Depressione, Braddock svolge diversi lavori di fatica, specie come portuale, per mantenere la sua famiglia, ma sogna ancora di tornare alla boxe ad alto livello. Grazie alla cancellazione all&amp;#039;ultimo minuto dell&amp;#039;impegno di un altro pugile, Braddock ha una seconda possibilitÃƒÂ  per combattere ma si trova ad affrontare il numero due al mondo e viene considerato solo come un allenamento. Braddock stupisce gli esperti del pugilato e i fans mettendo al tappeto alla terza ripresa il suo eccellente avversario. Pur combattendo con costanti ferite alle mani, Braddock continua a vincere e in breve tempo viene a rappresentare le speranze e le aspirazioni del pubblico americano alle prese con la Depressione. Soprannominato &quot;Cinderella Man&quot; (&quot;il Cenerentolo&quot;), in una delle piÃƒÂ¹ grandi sorprese della storia del pugilato riesce a sconfiggere l&amp;#039;invincibile Max Baer e a divenire il campione mondiale dei pesi massimi.","torrent":{"xt":"urn:btih:37d23f9eeca4e11870906f1a63be43e0de07dab5","amp;dn":"%5BSoM%5DCinderella+man%5BDvdRip-Xvid-Ita-Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37d23f9eeca4e11870906f1a63be43e0de07dab5","infoHashBuffer":{"type":"Buffer","data":[55,210,63,158,236,164,225,24,112,144,111,26,99,190,67,224,222,7,218,181]},"announce":[],"urlList":[]}}