{"title":"Windows 7 and Windows Vista Recovery Discs [x86&amp;x64] BY KAILASH","uid":6313721,"size":608231318,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:381d4cb87869b9791baa796520563f01d1ade8e1&amp;dn=Windows+7+and+Windows+Vista+Recovery+Discs+%5Bx86%26x64%5D+BY+KAILASH&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"kailash263","files":12,"time":1302627374,"description":"If you\\'re like most PC users, you probably got Windows 7 with a new PC or laptop. And if you\\'re like 99% of the population, you get your new machines from one of the major manufacturers. Dell, Acer, HP, Toshiba, Lenovo; who all have one thing in common: they don\\'t give you a real Windows 7 installation disc with your purchase. Instead, they bundle what they call a \\&quot;recovery disc\\&quot; (that\\'s if you\\'re lucky - otherwise you\\'ll have a recovery partition instead) with your machine and leave it at that.\n\n\nIt doesn\\'t matter that you just paid a thousand dollars for a machine that comes with a valid Windows 7 license - your computer manufacturer just don\\'t want to spend the money (or perhaps take on the responsibility) of giving you a Windows 7 installation DVD to accompany your expensive purchase.\n\nThe problem is, with Windows 7, the installation media serves more than one purpose. It\\'s not just a way to get Windows installed, it\\'s also the only way of recovering a borked installation. The Windows 7 DVD has a complete \\&quot;recovery center\\&quot; that provides you with the option of recovering your system via automated recovery (searches for problems and attempts to fix them automatically), rolling-back to a system restore point, recovering a full PC backup, or accessing a command-line recovery console for advanced recovery purposes.\n\nThankfully, Microsoft seems to have realized this problem, and have thankfully made a recovery disc for this purpose. It contains the contents of the Windows 7 DVD\\'s \\&quot;recovery center,\\&quot; as we\\'ve come to refer to it. It cannot be used to install or reinstall Windows 7, and just serves as a Windows PE interface to recovering your PC. Technically, one could re-create this installation media with freely-downloadable media from Microsoft (namely the Microsoft WAIK kit, a multi-gigabyte download); but it\\'s damn-decent of Microsoft to make this available to Windows\\' users who might not be capable of creating such a thing on their own. You can make your own copy from Windows 7 Ultimate Edition, but now you have an easier alternative.\n\nWhat it does: The Windows 7 Recovery Disc can be used to access a system recovery menu, giving you options of using System Restore, Complete PC Backup, automated system repair, and a command-line prompt for manual advanced recovery.\n\nWhat it doesn\\'t do: You cannot use the Windows 7 Recovery Disc to re-install Windows - it only fixes (not replaces!) Windows.\n\nWhy you need it: If you bought your PC from a major retailer, you didn\\'t get this CD with your hefty purchase.\n\n\nWindows Vista Recovery Discs\n\nIf you\\'re like most PC users, you probably got Windows Vista with a new PC or laptop. And if you\\'re like 99% of the population, you get your new machines from one of the major manufacturers. Dell, Acer, HP, Toshiba, Lenovo, they all have one thing in common: they don\\'t give you a real Windows Vista installation disc with your purchase. Instead, they bundle what they call a \\&quot;recovery disc\\&quot; (that\\'s if you\\'re lucky - otherwise you\\'ll have a recovery partition instead) with your machine and leave it at that.\n\nIt doesn\\'t matter that you just paid a thousand dollars for a machine that comes with a valid Windows Vista license - your computer manufacturer just don\\'t want to spend the money (or perhaps take on the responsibility) of giving you a Windows Vista installation DVD to accompany your expensive purchase.\n\nThe problem is, with Windows Vista, the installation media serves more than one purpose. It\\'s not just a way to get Windows installed, it\\'s also the only way of recovering a borked installation. The Windows Vista DVD has a \\&quot;recovery center\\&quot; that provides you with the option of recovering your system via automated recovery (searches for problems and attempts to fix them automatically), rolling-back to a system restore point, recovering a full PC backup, or accessing a command-line recovery console for advanced recovery purposes.\n\nMicrosoft seems to have realized this problem, and have thankfully made a recovery disc for this purpose. It contains the contents of the Windows Vista DVD\\'s \\&quot;recovery center,\\&quot; as we\\'ve come to refer to it. It cannot be used to install or reinstall Windows Vista, and just serves as a Windows PE interface to recovering your PC. Technically, one could re-create this installation media with freely-downloadable media from Microsoft (namely the Microsoft WAIK kit, a multi-gigabyte download); but it\\'s damn-decent of Microsoft to make this available to Windows\\' users who might not be capable of creating such a thing on their own.\n\nFor your convenience I\\'ve supplied both the 32x/86x and 64x version of each recovery disc and Portable PowerISO v4.7 to burn them.\n\nFOR SCREENSHOT PLS SEE THE TAG COLUMN.\n\nPLS SEED.\n\nTHANKX FOR  DOWNLOADING","torrent":{"xt":"urn:btih:381d4cb87869b9791baa796520563f01d1ade8e1","amp;dn":"Windows+7+and+Windows+Vista+Recovery+Discs+%5Bx86%26x64%5D+BY+KAILASH","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"381d4cb87869b9791baa796520563f01d1ade8e1","infoHashBuffer":{"type":"Buffer","data":[56,29,76,184,120,105,185,121,27,170,121,101,32,86,63,1,209,173,232,225]},"announce":[],"urlList":[]}}