{"title":"Modern Optical Spectroscopy 2nd ed - William W. Parson","uid":15984376,"size":13661372,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3874c3e5b4ec71436932e7a9b6e29debe59751c3&amp;dn=Modern+Optical+Spectroscopy+2nd+ed+-+William+W.+Parson&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"clouderone","files":1,"time":1475946351,"description":"Modern Optical Spectroscopy 2nd ed - William W. Parson (Springer, 2015).pdf\r\n\r\nThis textbook offers clear explanations of optical spectroscopic phenomena and shows how spectroscopic techniques are used in modern molecular and cellular biophysics and biochemistry. The topics covered include electronic and vibrational absorption, fluorescence, resonance energy transfer, exciton interactions, circular dichroism, coherence and dephasing, ultrafast pump-probe and photon-echo spectroscopy, single-molecule and fluorescence-correlation spectroscopy, Raman scattering, and multiphoton absorption. This revised and updated edition provides expanded discussions of quantum optics, metal-ligand charge-transfer transitions, entropy changes during photoexcitation, electron transfer from excited molecules, normal-mode calculations, vibrational Stark effects, studies of fast processes by resonance energy transfer in single molecules, and two-dimensional electronic and vibrational spectroscopy.\r\n\r\nThe explanations are sufficiently thorough and detailed to be useful for researchers and graduate students and advanced undergraduates in chemistry, biochemistry and biophysics. They are based on time-dependent quantum mechanics, but are developed from first principles with a clarity that makes them accessible to readers with little prior training in this field. Extra topics and highlights are featured in special boxes throughout the text. The author also provides helpful exercises for each chapter","torrent":{"xt":"urn:btih:3874c3e5b4ec71436932e7a9b6e29debe59751c3","amp;dn":"Modern+Optical+Spectroscopy+2nd+ed+-+William+W.+Parson","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3874c3e5b4ec71436932e7a9b6e29debe59751c3","infoHashBuffer":{"type":"Buffer","data":[56,116,195,229,180,236,113,67,105,50,231,169,182,226,157,235,229,151,81,195]},"announce":[],"urlList":[]}}