{"title":"A Soldiers Revenge - Matthew Dunn [EN EPUB MOBI] [ebook] [p_s]","uid":16008427,"size":1293426,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3899ec2a26a5c9acfdb3857ad9554ac967673d8e&amp;dn=A+Soldiers+Revenge+-+Matthew+Dunn+%5BEN+EPUB+MOBI%5D+%5Bebook%5D+%5Bp_s%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"perfect_stan","files":3,"time":1476207359,"description":"A Soldier’s Revenge by Matthew Dunn (Spycatcher #6)\r\nEnglish | 2016 | Spy Thriller, Espionage | 1.2 MB\r\n\r\n\r\nFormer operative Will Cochrane wakes up in New York’s Waldorf Astoria and is horrified to see blood on his hands—something he remembers absolutely nothing about. When he then finds a woman murdered in his bathroom he knows he’s stepped into a wilderness of terror that is far more dangerous than anything he’s ever faced.\r\nWith no memory of the night before nor of the unfortunate woman, Will believes he is being framed and needs to outrun the police who will be looking for him very soon. Until this moment, Will has been on the precipice of a new life, one outside the intelligence service, and one that includes fatherhood. He’s agreed to adopt the twin sons of his former colleague and Navy SEAL operative Roger Koenig, and had been on his way to pick them up before he’d awakened to the carnage in New York.\r\nWill knows his only chance to clear his name is to find the real killer while he’s still free. But he also has to find the twins, suspecting that they’re in danger as well. In Virginia, he discovers one boy alive and his brother missing and most likely kidnapped. What he also finds is the killer’s trail in the form of a man’s voice, which Will recognizes and believes belongs to an old nemesis, a Russian agent he has tangled with before. With local police, the FBI, and even his friends pursuing him, the clever and ruthless operative must track down his adversary, save the boys, and prove his innocence before it’s too late.\r\nA superb blend of action and thrills that will keep readers on the edge of their seats, A Soldier’s Revenge is perfect for fans of Brad Thor, Daniel Silva, and Lee Child.\r\n\r\nEnjoy and please SEED!!!","torrent":{"xt":"urn:btih:3899ec2a26a5c9acfdb3857ad9554ac967673d8e","amp;dn":"A+Soldiers+Revenge+-+Matthew+Dunn+%5BEN+EPUB+MOBI%5D+%5Bebook%5D+%5Bp_s%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3899ec2a26a5c9acfdb3857ad9554ac967673d8e","infoHashBuffer":{"type":"Buffer","data":[56,153,236,42,38,165,201,172,253,179,133,122,217,85,74,201,103,103,61,142]},"announce":[],"urlList":[]}}