{"title":"CBT Nuggets CCENT &amp; CCNA","uid":9843721,"size":2542223163,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:38ae63f8f554d4b403c32d5de9dee7c5c51be60e&amp;dn=CBT+Nuggets+CCENT+%26amp%3B+CCNA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":3,"uploader":"c0mmand3r","files":66,"time":1396036628,"description":"These videos are listed as TV shows and named according to PLEX Identification standards for TVDb.com. If you like these then you should try the full course at CBTNuggets.com\n\n\nCisco CCENT ICND1 640-822 - Interconnecting Cisco Networking Devices Part 1; Successful networking careers begin with Cisco CCENT/CCNA certification and the fundamental knowledge it represents. This series shows you the hands-on skills you need to meet the network support needs of employers and clients. This video series also teaches you the essential skills for passing the CCENT certification exam. You proceed at your own pace, watching videos that break down the CCENT certification process and basic Cisco networking into bite-sized nuggets. Video by video you learn how to install, operate and troubleshoot a small enterprise branch network -- including basic network security.\n\n\n\n\nCisco CCNA ICND2 640-816 - Interconnecting Cisco Networking Devices Part 2; Cisco CCNA certification proves your professional worth. It tells prospective employers that you can handle the day-to-day work of running a mid- to large-sized Cisco network. The two-exam CCNA process covers lots of innovative features, which better reflect the skills and knowledge you'll need on the job. Passing both exams is your first step towards higher-level Cisco certification, and trainer Jeremy Cioara has mapped these CCNA training videos to the 640-816 test. This CCNA training is not to be missed. ","torrent":{"xt":"urn:btih:38ae63f8f554d4b403c32d5de9dee7c5c51be60e","amp;dn":"CBT+Nuggets+CCENT+%26amp%3B+CCNA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38ae63f8f554d4b403c32d5de9dee7c5c51be60e","infoHashBuffer":{"type":"Buffer","data":[56,174,99,248,245,84,212,180,3,195,45,93,233,222,231,197,197,27,230,14]},"announce":[],"urlList":[]}}