{"title":"Luis Bunuel - le Voie Lactee (the Milky Way) (1969)","uid":3506475,"size":735601798,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:38b21cea6fcb3c4041810a82b4d0e9083e15c879&amp;dn=Luis+Bunuel+-+le+Voie+Lactee+%28the+Milky+Way%29+%281969%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"stu","files":4,"time":1153687958,"description":"La Voie lactÃƒÂ©e (1969) (aka: The Milky Way) \nBy Luis BuÃƒÂ±uel\n\nFrench (original language)\nEnglish Subtitles\n\n------------------------------------\n\nFile Size (in bytes) ..: 735,518,720\nRuntime (# of frames) .: 1:37:35 (146,375 frames) \n\nVideo Codec ...........: Xvid\nFrame Size ............: 512x304\nFPS ...................: 25 \nVideo Bitrate .........: 916 kb/s \nBits per Pixel ........: 0.235 bpp \nB-VOP, N-VOP, QPel, GMC ......: [B-VOP]...[N-VOP]...[QPel]...[] \n\nAudio Codec ...........: 0x0055(MP3, ISO) MPEG-1 Layer 3 LAME 3.90\nSample Rate ...........: 48000 Hz \nAudio bitrate .........: 135 kb/s [2 channel(s)] VBR audio \nInterleave ............: 40 ms \nNo. of audio streams ..: 1\n\n------------------------------------\n\nPlot Outline: Two tramps going on a pilgrimage to Santiago de Compostela in Spain, meet different christian heresies. They meet too the Marquis of Sade.\n\n?In the 7th century A.D. according to legend, a star guided some shepherds to where St. James' body was hidden, hence the name Compostela; from Campus Stelle - the Field of the Star. In most Western European languages, the Milky Way is also known as 'The road to St. James'?\n\nWhilst Jesus contemplates a shave and organises a feast, two men are on a pilgrimage from France to Santiago de Compostela. At the start, on the map, their two dimensional route appears simple enough to traverse. But it has failed to render the dimension of time, and in particular, BuÃƒÂ±uel?s time. As they wonder the road to St. James, they contemplate, and partake, in a vast range of catholic dogmas and heretical activities from throughout history. A true pilgrimage it seems requires a deep, timeless, search through the laws and events that shape your religion. \nThree main questions are raised: \n1. Will their French i.d papers get them safely through their journey?, 2. Who?s opinion is correct; the Marquis de Sade?s or the chained girl ThÃƒÂ©rÃƒÂ¨se?s and 3. What is your exact view on their situation?\n\nFrom Luis BuÃƒÂ±uel?s My Last Sigh:\nThe idea of making a film about Christian heresies first came to me just after my arrival in Mexico, when I read Menendez Pelayo?s Historia de los heterodoxies espanoles. Its accounts of martyred heretics fascinated me - these men who were as convinced of their truths as the orthodox Christians were of theirs. In fact, what?s always intrigued me about the behavior of heretics is not only their strange inventiveness, but the certainty that they posses the absolute truth. As Breton once wrote, despite his aversion to religion, the surrealists had ?certain points of contact? with the heretics.\nEverything in the milky way is based on authentic historical documents. The archbishop whose corpse is exhumed and publicly burned (when personal papers tinged with heretical ideas are found after his death) was in fact a real archbishop, Carranza of Toledo. We did a great deal of research for this film, primarily in Abbe Pluquet?s Dictionnair des heresises. Carriere and I wrote the first draft in the fall of 1967 at the Parador Carorla in the Andalusion mountains, where the road ended at the door of our hotel and where the few hunters around left at dawn and returned at nightfall, bringing back the occasional corpse of an ibex. We spent days discussing the holy trinity, the dual nature of Christ, and the mysteries of the virgin Mary, and we were both happily surprised when Silberman agreed to the project. The script was finished at San Jose Purua during February and march 1968, and although filming was temporarily delayed by the commotion of that may, we finished the shoot in Paris during the summer. Paul Frankeur and Laurent Terzieff played the two pilgrims walking to Santiago de Compostella who meet, on their way, a series of characters from all ages and places representing the principle heresies of our culture. The title comes from the idea of the original name of the milky way, Saint John?s way, so called because it directed wayfarers from all over northern Europe to Spain.\nOnce again I worked with Pierre Clementi, Julien Bertheau, Claudio Brook, and Michel Piccoli, but I also discovered Delphine Seyrig, whom I?d bounced on my knee when she was a little girl in New York during the war. And for the second and last time I also put Christ himself, played by Bernard Verley, on camera. I wanted to show him as an ordinary man, laughing, running, mistaking his way, preparing to shave - to show, in other words, all those aspects so completely alien to our traditional iconography. It seems to me that in the evolution of contemporary religion, Christ occupies a disproportionately privileged place in relation to the two other figures in the holy trinity. God the father still exists, of course, but hes become vague and distant; and as for the unfortunate holy ghost, no one bothers with him at all anymore. He must be begging at the roadside by now.\nDespite the difficulty of the subject, the public seemed to like the film, thanks largely to Silberman?s superlative public relations work. Like Nazarin, however, it provoked conflicting reactions. Calos Fuentes saw it as an antireligious war movie, while Julio Corazar went so far as to suggest that the Vatican must have put up the money for it. These arguments over intention leave me finally indifferent, since in my opinion the milky way is neither for nor against anything at all. Beside the situation itself and the authentic doctrinal dispute it evokes, the film is above all a journey through fanaticism, where each person obstinately clings to his own particle of truth, ready if need be to kill or to die for it. The road traveled by the two pilgrims can represent, finally, any political or even aesthetic ideology. \n\n------------------------------------\n\n\nSEED AT LEAST AS MUCH AS YOU HAVE DOWNLOADED...PLEASE!\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE' \n\n\n... simply search for 'freakyflicks' \n***************************************\n************** FREAKYFLICKS ***********\n***************************************","torrent":{"xt":"urn:btih:38b21cea6fcb3c4041810a82b4d0e9083e15c879","amp;dn":"Luis+Bunuel+-+le+Voie+Lactee+%28the+Milky+Way%29+%281969%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38b21cea6fcb3c4041810a82b4d0e9083e15c879","infoHashBuffer":{"type":"Buffer","data":[56,178,28,234,111,203,60,64,65,129,10,130,180,208,233,8,62,21,200,121]},"announce":[],"urlList":[]}}