{"title":"Confucius - The Analects (4 translations)","uid":9880817,"size":105752899,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:38d959cee1dd2680a71e1ef62d7b38c3617bb4b9&amp;dn=Confucius+-+The+Analects+%284+translations%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"workerbee","files":-1,"time":1396545513,"description":"\nCONFUCIUS (551-479 BCE) was a Chinese teacher, editor, politician, and philosopher of the Spring and Autumn period of Chinese history.\n\nCompiled by disciples of Confucius in the centuries following his death in 479 BCE, THE ANALECTS, or Lunyu (lit. &quot;Selected Sayings&quot;), is a collection of aphorisms and historical anecdotes embodying the basic values of the Confucian tradition: learning, morality, ritual decorum, and filial piety.  Reflecting the model eras of Chinese antiquity, the Analects offers valuable insights into successful governance and the ideal organization of society.  Filled with humor and sarcasm, it reads like a casual conversation between teacher and student, emphasizing the role of the individual in the attainment of knowledge and the value of using historical events and people to illuminate moral and political concepts.\n\nTHE ANALECTS has been one of the most widely read and studied books in China for the last 2,000 years, and continues to have a substantial influence on Chinese and East Asian thought and values today.\n\n\nThe following 4 translations are a mix of PDF and/or ePUB formats:\n\n* THE ANALECTS: With Selections from Traditional Commentaries (Hackett, 2003).  Translated by Edward Slingerland. -- PDF + ePUB\n\n* THE ANALECTS OF CONFUCIUS (Columbia University Press, 2007).  Translated by Burton Watson. -- ePUB\n\n* THE ESSENTIAL CONFUCIUS: The Heart of Confucius' Teachings in Authentic I Ching Order (HarperCollins, 1992).  Translated and presented by Thomas Cleary. -- PDF\n\n* THE ORIGINAL ANALECTS: Sayings of Confucius and His Successors (Columbia University Press, 1998).  Translation and Commentary by E. Bruce Brooks and A. Taeko Brooks. -- PDF\n\n_______________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n              &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n","torrent":{"xt":"urn:btih:38d959cee1dd2680a71e1ef62d7b38c3617bb4b9","amp;dn":"Confucius+-+The+Analects+%284+translations%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38d959cee1dd2680a71e1ef62d7b38c3617bb4b9","infoHashBuffer":{"type":"Buffer","data":[56,217,89,206,225,221,38,128,167,30,30,246,45,123,56,195,97,123,180,185]},"announce":[],"urlList":[]}}