{"title":"Richard M. Dolan - The Cover-Up Exposed 1973-1991 - epub [TKRG]","uid":15931758,"size":772765,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:38ff24aaddf5ebb6156d33ea09c41a2b586de8e2&amp;dn=Richard+M.+Dolan+-+The+Cover-Up+Exposed+1973-1991+-+epub+%5BTKRG%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"roflcopter2110","files":1,"time":1475363883,"description":"https://cdn.pximg.xyz/538bbc3c4facf38e563895ed67bba141.png\r\n \nhttp://boltimg.com/images/fYjfM.jpg\r\n\r\nRichard M. Dolan - The Cover-Up Exposed 1973-1991 - epub [TKRG]\r\n\r\nThis is the 2nd volume in Richard Dolan's series, &quot;UFOs and the National Security State,&quot; which covers all aspects of the UFO phenomenon from the 1940s to the present day. Volume 2, &quot;The Cover-Up Exposed, 1973-1991,&quot; analyzes the UFO sightings, politics, and research that occurred during the last two decades of the cold war. \r\n\r\nWorking from archival sources, professional journals, and his own investigations, Dolan describes UFO encounters worldwide, demonstrating that the phenomenon is global, and the result of advanced technology. \r\n\r\nMany cases involved sensitive military airspace. These include intrusions over American and Canadian air bases; attempts to intercept a UFO over Tehran; the landing of an unknown object near two airbases in Britain; large boomerang-shaped craft near New York City; unexplained triangular craft seen throughout the U.S. and Europe; strange objects in Earth orbit seen by Soviet and American astronauts; and encounters with UFOs from around the world. \r\n\r\nDolan also studies &quot;UFO politics,&quot; describes the black-budget connection, and provides a geopolitical analysis to explain the whys and hows of UFO secrecy. \r\n\r\nFinally, he provides a history of UFO research itself. He recreates the discussions and debates concerning alien abductions, animal mutilations, intelligence community infiltration into UFO research, the controversial MJ-12 documents, the Gulf Breeze controversy, reverse engineering of alien technology, crop circles, and more. Dolan also studies the effect of such new technologies as the Internet on UFO research. \r\n\r\nThis is a complete history of the phenomenon, the secrecy, and the response by researchers who sought to understand the mystery. Behind it all is the backdrop of a world in technological, economic, and political transformation. \r\n\r\n&quot;UFOs and the National Security State: The Cover-Up Exposed, 1973-1991,&quot; takes the reader through a turning point in the history of the UFO phenomenon, as well as the history of the modern world","torrent":{"xt":"urn:btih:38ff24aaddf5ebb6156d33ea09c41a2b586de8e2","amp;dn":"Richard+M.+Dolan+-+The+Cover-Up+Exposed+1973-1991+-+epub+%5BTKRG%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38ff24aaddf5ebb6156d33ea09c41a2b586de8e2","infoHashBuffer":{"type":"Buffer","data":[56,255,36,170,221,245,235,182,21,109,51,234,9,196,26,43,88,109,232,226]},"announce":[],"urlList":[]}}