{"title":"Radio Tarifa - Cruzando El Rio [FLAC] TQMP","uid":6005828,"size":245577271,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:39bfba0580efc05fc9e44f84a98e95d6738179c0&amp;dn=Radio+Tarifa+-+Cruzando+El+Rio+%5BFLAC%5D+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"pastafari","files":-1,"time":1291317799,"description":"Radio Tarifa - Cruzando El Rio\n2001\n\nBrought to you by TQMP\nThe Quality Music Project\n\nBiography -\n\nRadio Tarifa is one the outstanding world music groups of the turn of their time. Their name derives from the town of Tarifa, which is the part of Spain nearest to Morocco. The group's mixture of Spanish and Arabic music is not itself new (see Juan PeÃƒÂ±a Lebrijano. for example). What is new is that instead of simply fusing musical styles as they currently exist, Radio Tarifa goes back in time to the common past of those styles, back to before 1492 when the Moors and Jews were exiled from Spain, and imagines a shared style that might have evolved had history been different, including not just elements of Spanish and Arabic music but also other musics of the Mediterranean, of the Middle Ages, of the Caribbean. This invented style is not only fascinating in its own right, but sheds light upon the real styles of Spain, most notably flamenco. Until the success of their first album Rumba Argelina, Radio Tarifa was not a full-fledged performing band, but a nucleus of three musicians who brought other performers into the studio as needed. This nucleus consists of Spaniards FaÃƒÂ­n SÃƒÂ¡nchez DueÃƒÂ±as (percussion and other instruments) and BenjamÃƒÂ­n Escoriza (vocals) and Frenchman Vincent Molino - sometimes listed as Vincent Molino Cook - (winds). Arranger DueÃƒÂ±as might fairly be described as the leader and theoretician of the group. He and Molino founded an early music group, playing music from the late Middle Ages and Renaissance) called Ars Antiqua Musicalis, although this group was never commercially successful. Later DueÃƒÂ±as met BenjamÃƒÂ­n Escoriza, a troubadour flamenco singer raised by Gypsies. The last piece was in place. Rumba Argelina was a work of love and vision and experimental daring recorded in 1993, released in Europe by World Circuit Records in 1996 and finally landing on American shores in 1997 via a collaboration of World Circuit and Nonesuch. The critical and popular success of Rumba Argelina made it possible for Radio Tarifa to put together a full-fledged touring band, which has crossed both Europe and the United States, as well as enabling a follow-up album Temporal, which means &quot;Storm.&quot; This second album, from 1997, moves in the direction of the roots of flamenco and is less pan-Mediterranean than its predecessor and was also a success. Cruzando el Rio appeared in spring 2001.\n-- All Music Guide\n\nReview -\n\nFusion is an overworked word, covering a multitude of sins, but in Cruzando El Rio it's used to stunning effect. Tarifa is a windswept town at the southernmost tip of the Iberian peninsula: it's a point where Iberian and Arabic civilisations have always met. But Radio Tarifa--the station's in the mind, not in physical reality--forges links in the fourth dimension as well, back to the songs of medieval Spain and across to those of medieval Japan. The results are invigoratingly gamey, thanks to the timbre of their voices and the instrumental textures they create. The first track melds Renaissance oboes, an electric guitar and a Moroccan banjo; the second blends these oboes with the ney flute and the Egyptian double clarinet; the third tricks out a medieval Muslim-Spanish piece with some distinctly jazzy riffs. The male singers swing between raunchiness and graceful tremulousness while the female singer's voice has a gentle balladeering strength. The pure percussion number feels like a pleasurable itch that gets under the skin. \n-- amazon.co.uk\n\nTracks\n01- OsÃƒÂº\n02- Sin palabras\n03- El viaje de Lea\n04- Ramo verde\n05- La molinera\n06- Cruzando el rÃƒÂ­o\n07- Patas negras\n08- Gujo Bushi\n09- Alab\n10- El quinto\n11- Si j'ai perdu mon ami\n\nArtwork, EAC log and CUE sheet included.\n\nAudio format: FLAC (Free Lossless Audio Codec) &lt;a href=&quot;\nhttp://flac.sourceforge.net/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://flac.sourceforge.net/index.html&lt;/a&gt; \n\nEnjoy, seed and inhale!\n\nLegalise it!\n\nPastafariCubensis &lt;a href=&quot;\nhttp://thepiratebay.se/user/pastafari/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pastafari/&lt;/a&gt;","torrent":{"xt":"urn:btih:39bfba0580efc05fc9e44f84a98e95d6738179c0","amp;dn":"Radio+Tarifa+-+Cruzando+El+Rio+%5BFLAC%5D+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39bfba0580efc05fc9e44f84a98e95d6738179c0","infoHashBuffer":{"type":"Buffer","data":[57,191,186,5,128,239,192,95,201,228,79,132,169,142,149,214,115,129,121,192]},"announce":[],"urlList":[]}}