{"title":"Suzanne Collins - De Hongerspelen (trilogie)(2008-2010), NL Eboo","uid":6571126,"size":1781921,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3a16adadb632228b5a160c49cbab935cd0218599&amp;dn=Suzanne+Collins+-+De+Hongerspelen+%28trilogie%29%282008-2010%29%2C+NL+Eboo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"MeMar","files":-1,"time":1311975094,"description":"Suzanne Collins - De Hongerspelen (trilogie)(2008-2010), NL Ebook(ePub), DMT\nAuteur: Suzanne Collins\nNederlands\nUitgever: Van Goor\nVertaling: Maria Postema\n &lt;a href=&quot;\nhttp://nl.wikipedia.org/wiki/Suzanne_Collins&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://nl.wikipedia.org/wiki/Suzanne_Collins&lt;/a&gt;\n\nINTRODUCTIE:\nHet verhaal speelt zich af in de toekomst in Noord-Amerika, waar zich een nieuw land heeft gevormd, \nnamelijk Panem, dat 12 districten telt en een hoofdstad, het Capitool. Oorspronkelijk waren dat 13 \ndistricten, maar in een opstand van 74 jaar geleden heeft het Capitool het 13e district genadeloos \nafgeslacht. Als een herinnering voor de rebellen aan die opstand, werden de Hongerspelen in het \nleven geroepen. Dit houdt in dat elk jaar van elk district twee deelnemers (een meisje en een jongen) \ntussen 12 en 18 jaar moeten participeren in de Hongerspelen, een gevecht tot de dood waar het hele \nland verplicht naar moet kijken.\n\n\nDe Hongerspelen (2008)\nOriginele titel: The Hunger Games\n\nwww.boekmeter.nl/book/18809\n\nIn de overblijfselen van een plek die ooit bekend stond als Noord-Amerika ligt het land Panem, een \nblinkende Capitol omgeven door twaalf afÃ‚Â¬gelegen Districten. Elk jaar worden de Districten door de \nCapitol gedwongen om ÃƒÂ©ÃƒÂ©n jongen en ÃƒÂ©ÃƒÂ©n meisje in de leeftijd van 12 tot 18 te sturen om deel te \nnemen aan de Hongerspelen - een bruut en angstaanjagend gevecht op leven en dood. Deze spelen \nworden uitgezonden op televisie ter vermaak van heel Panem. Overleven is de tweede natuur van de \n16-jarige Katniss Everdeen, die dagelijks een strijd levert om haar moeder en jongere zusje van eten \nte voorzien door stiekem te jagen en eten te verzamelen buiten de hekken van District 12. Wanneer \nPrim, haar zusje, de aangewezen strijder is voor de komende Hongerspelen, werpt Katniss zich op om \nhaar plek in te nemen. Ze weet dat dit haar doodvonnis kan betekenen. Haar enige kans om te \noverleven, ligt in haar vermogen steeds de juiste afweging te maken. Kiest ze voor overleven of \nvoor vriendschap? Voor de liefde of voor haar leven? Voor samen of alleen?\n\nVlammen (2009)\nOriginele titel: Catching Fire\n &lt;a href=&quot;\nhttp://www.boekmeter.nl/book/18797&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.boekmeter.nl/book/18797&lt;/a&gt;\n\nHoe onwaarschijnlijk het ook is, Katniss Everdeen heeft de jaarlijkse Hongerspelen gewonnen, samen \nmet haar medestrijder Peeta Mellark. Maar ze hebben de overwinning behaald in weerwil van het \nCapitool en de wrede regels die er gelden. Katniss en Peeta zouden dolgelukkig moeten zijn, want ze \nzijn voor de rest van hun leven zeker van roem en rijkdom voor henzelf en hun familie. Maar er gaan \ngeruchten over een opstand in verschillende districten. Tot hun schrik worden Katniss en Peeta door \nhun overwinning het symbool van die opstand. Het Capitool is kwaad en het Capitool wil wraak.\n\nSpotgaai (2010)\nOriginele titel: Mockingjay\n &lt;a href=&quot;\nhttp://www.boekmeter.nl/book/24518&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.boekmeter.nl/book/24518&lt;/a&gt;\n\nKatniss heeft de Hongerspelen voor de tweede keer gewonnen. Maar nu ze uit de bloederige arena \ngekomen is, is ze nog niet veilig. Het Capitool is woedend en wil wraak. Wie zou de prijs moeten \nbetalen? Juist: Katniss, voor de tweede keer. En bovendien heeft president Snow duidelijk gemaakt \ndat het voor niemand anders veilig is op de koop toe. Niet haar familie, niet haar vrienden, niet de \nmensen van District 12...\n\nCategorie: Beeld\nFormaat: ePub\nTaal: Nederlands \nGenre:  Avontuur\n\nDeze boeken worden u aangeboden door:\n\nDUTCH MOVIE THEATER\n\n","torrent":{"xt":"urn:btih:3a16adadb632228b5a160c49cbab935cd0218599","amp;dn":"Suzanne+Collins+-+De+Hongerspelen+%28trilogie%29%282008-2010%29%2C+NL+Eboo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a16adadb632228b5a160c49cbab935cd0218599","infoHashBuffer":{"type":"Buffer","data":[58,22,173,173,182,50,34,139,90,22,12,73,203,171,147,92,208,33,133,153]},"announce":[],"urlList":[]}}