{"title":"The Lost World of the Old Ones: Discoveries in the Ancient ...","uid":15760397,"size":33261449,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3a32d1537288062be584556c5f297634c43dd493&amp;dn=The+Lost+World+of+the+Old+Ones%3A+Discoveries+in+the+Ancient+...&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"marty14","files":1,"time":1473107239,"description":"The Lost World of the Old Ones: Discoveries in the Ancient Southwest - David Roberts [epub]\r\n\r\nFor more than 5,000 years the Ancestral Puebloans Native Americans who flourished long before the first contact with Europeans occupied the Four Corners region of the southwestern United States. Just before AD 1300, they abandoned their homeland in a migration that remains one of prehistory's greatest puzzles. Northern and southern neighbors of the Ancestral Puebloans, the Fremont and Mogollon likewise flourished for millennia before migrating or disappearing. Fortunately, the Old Ones, as some of their present-day descendants call them, left behind awe-inspiring ruins, dazzling rock art, and sophisticated artifacts ranging from painted pots to woven baskets. Some of their sites and relics had been seen by no one during the 700 years before David Roberts and his companions rediscovered them.\r\n\r\nIn The Lost World of the Old Ones, Roberts continues the hunt for answers begun in his classic book,In Search of the Old Ones. His new findings paint a different, fuller portrait of these enigmatic ancients thanks to the breakthroughs of recent archaeologists. Roberts also recounts his last twenty years of far-flung exploits in the backcountry with the verve of a seasoned travel writer. His adventures range across Utah, Arizona, New Mexico, and southwestern Colorado, illuminating the mysteries of the Old Ones as well as of the more recent Navajo and Comanche.\r\n\r\nRoberts calls on his climbing and exploratory expertise to reach remote sanctuaries of the ancients hidden within nearly vertical cliffs, many of which are unknown to archaeologists and park rangers. This ongoing quest combines the shock of new discovery with a deeply felt connection to the landscape, and it will change the way readers experience, and imagine, the American Southwest","torrent":{"xt":"urn:btih:3a32d1537288062be584556c5f297634c43dd493","amp;dn":"The+Lost+World+of+the+Old+Ones%3A+Discoveries+in+the+Ancient+...","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a32d1537288062be584556c5f297634c43dd493","infoHashBuffer":{"type":"Buffer","data":[58,50,209,83,114,136,6,43,229,132,85,108,95,41,118,52,196,61,212,147]},"announce":[],"urlList":[]}}