{"title":"Enchanted Objects: Design, Human Desire, - David Rose Audiobook","uid":10615630,"size":222024289,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3a5b8eafc601ec1fd4d3019448514c1a631d9e39&amp;dn=Enchanted+Objects%3A+Design%2C+Human+Desire%2C+-+David+Rose+Audiobook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":3,"uploader":"Squiddy82","files":-1,"time":1406111457,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nEnchanted Objects: Design, Human Desire, and the Internet of Things\n\nWritten by: David Rose\nNarrated by: Corey Brill\nLength: 7 hrs and 41 mins\nFormat: Unabridged\nRelease Date:07-15-14\n\nIn the tradition of Who Owns the Future? and The Second Machine Age, an MIT Media Lab scientist imagines how everyday objects can intuit our needs and improve our lives.\n\nWe are now standing at the precipice of the next transformative development: The Internet of Things. Soon, connected technology will be embedded in hundreds of everyday objects we already use: our cars, wallets, watches, umbrellas, even our trash cans. These objects will respond to our needs, come to know us, and learn to think on our behalf. David Rose calls these devices - which are just beginning to creep into the marketplace - Enchanted Objects.\n\nSome believe the future will look like more of the same - more smartphones, tablets, screens embedded in every conceivable surface. Rose has a different vision: Technology that atomizes, combining itself with the objects that make up the very fabric of daily living. Such technology will be woven into the background of our environment, enhancing human relationships and channeling desires for omniscience, long life, and creative expression. The enchanted objects of fairy tales and science fiction will enter real life.\n\nGroundbreaking, timely, and provocative, Enchanted Objects is a blueprint for a better future, where efficient solutions come hand in hand with technology that delights our senses. It is essential listening for designers, technologists, entrepreneurs, business leaders, and anyone who wishes to understand the future and stay relevant in the Internet of Things. ","torrent":{"xt":"urn:btih:3a5b8eafc601ec1fd4d3019448514c1a631d9e39","amp;dn":"Enchanted+Objects%3A+Design%2C+Human+Desire%2C+-+David+Rose+Audiobook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a5b8eafc601ec1fd4d3019448514c1a631d9e39","infoHashBuffer":{"type":"Buffer","data":[58,91,142,175,198,1,236,31,212,211,1,148,72,81,76,26,99,29,158,57]},"announce":[],"urlList":[]}}