{"title":"Experimental Homebrewing: Mad Science in the Pursuit of Great Be","uid":11509581,"size":46848163,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3a7e54bb61be29339744ebd2dcd6719f51064331&amp;dn=Experimental+Homebrewing%3A+Mad+Science+in+the+Pursuit+of+Great+Be&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"Jallentino","files":-1,"time":1416389802,"description":"Experimental Homebrewing: Mad Science in the Pursuit of Great Beer by Drew Beechum, Denny Conn\nEnglish | 2014 | ISBN: 0760345384 | 240 pages | EPUB | 45 MB\n\nWhen most brewers think of an experimental beer, odd creations come to mind. And sure, in this book you can learn how to brew with ingredients like bacon, chanterelle mushrooms, defatted cacao nibs, and peanut butter powder. However, experimental homebrewing is more than that. It's about making good beer--the best beer, in fact. It's about tweaking process, designing solid recipes, and blind evaluations. So put on your goggles, step inside the lab, and learn from two of the craziest scientists around: Drew Beechum and Denny Conn. Get your hands dirty and tackle a money-saving project or try your hand at an off-the-wall technique. Freeze yourself an Eisbeer, make a batch of canned starter wort, fake a cask ale, extract flavors with distillation, or sit down at the microscope and do some yeast cell counting. More than 30 recipes and a full chapter of open-ended experiments will complete your transformation. Before you realize it, you'll be donning a white lab coat and sharing your own delicious results!","torrent":{"xt":"urn:btih:3a7e54bb61be29339744ebd2dcd6719f51064331","amp;dn":"Experimental+Homebrewing%3A+Mad+Science+in+the+Pursuit+of+Great+Be","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a7e54bb61be29339744ebd2dcd6719f51064331","infoHashBuffer":{"type":"Buffer","data":[58,126,84,187,97,190,41,51,151,68,235,210,220,214,113,159,81,6,67,49]},"announce":[],"urlList":[]}}