{"title":"Beginning HTML, XHTML, CSS and JavaScript - Jon Duckett","uid":10555266,"size":11125512,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3a8b88452beb65a7ea2bb6d7b8f300bb055cbe4a&amp;dn=Beginning+HTML%2C+XHTML%2C+CSS+and+JavaScript+-+Jon+Duckett&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1405383089,"description":"An indispensable introductory guide to creating web pages using the most up-to-date standards\nThis beginner guide shows you how to use XHTML, CSS, and JavaScript to create compelling Web sites. While learning these technologies, you will discover coding practices such as writing code that works on multiple browsers including mobile devices, how to use AJAX frameworks to add interactivity to your pages, and how to ensure your pages meet accessible requirements.\n\nPacked with real-world examples, the book not only teaches you how to write Web sites using XHTML, CSS and JavaScript, but it also teaches you design principles that help you create attractive web sites and practical advice on how to make web pages more usable. In addition, special checklists and appendices review key topics and provide helpful references that re-enforce the basics you've learned.\n\nServes as an ideal beginners guide to writing web pages using XHTML\nExplains how to use CSS to make pages more appealing and add interactivity to pages using JavaScript and AJAX frameworks\nShare advice on design principles and how to make pages more attractive and offers practical help with usability and accessibility\nFeatures checklists and appendices that review key topics","torrent":{"xt":"urn:btih:3a8b88452beb65a7ea2bb6d7b8f300bb055cbe4a","amp;dn":"Beginning+HTML%2C+XHTML%2C+CSS+and+JavaScript+-+Jon+Duckett","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a8b88452beb65a7ea2bb6d7b8f300bb055cbe4a","infoHashBuffer":{"type":"Buffer","data":[58,139,136,69,43,235,101,167,234,43,182,215,184,243,0,187,5,92,190,74]},"announce":[],"urlList":[]}}