{"title":"James.Bond.007.Anthology.Repack-R.G.Mechanics","uid":10910150,"size":15637868580,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3abea93763ce73174620229aa539bf35d1c78bd1&amp;dn=James.Bond.007.Anthology.Repack-R.G.Mechanics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":4,"uploader":"Taker009","files":-1,"time":1409265399,"description":"James.Bond.007.Anthology.Repack-R.G.Mechanics\n\n\nRelease Info:\n\nJames Bond 007-Nightfire\n\n\nYear: 2002\nGenre: Action (FPS)\nDeveloper: Gearbox Software\nPublisher: EA Games\nPublication Type: RePack\nGame Language: Eng | Rus\nVoice Language: Eng | Rus\nCrack: enclosing\n\n\nSystem Requirements:\n\nOperating system: Windows XP, Windows Vista, Windows 7\nProcessor: Pentium III 1GHz\nMemory: 256 MB\nVideo: 64 MB\nSound Card: Sound device compatible with DirectX 9.0\nFree space on hard disk: 2 GB\n\n\nGame information:\n\nSpy shooter, created based on the popular movie agent James Bond,\nwho once again have to overcome plenty of obstacles to save the world,\nto reveal a monstrous conspiracy organization for the protection of nature,\nseeking to arrange a nuclear apocalypse in the world, catch his leader.\nHe will travel to the Austrian mountains and a secret base on the ocean\nfloor to outer space. In total, the game has 20 missions for both single\nand multiplayer games. Will not do well without all sorts of tricks Bond\nsuper spy ammunition with objects (night vision goggles, shooting a fountain\npen, a laptop computer hacking various information systems), many types of\nweapons, beautiful cars and naturally beautiful women ...\n\nJames Bond 007-Quantum of Solace\n\n\n\nYear: 2008\nGenre: Action (Shooter) / Arcade / 3D / 1st Person / 3rd Person\nDeveloper: Treyarch, Nerve Software and Beenox Studios\nPublisher: Activision\nPublished in Russia: New Disk\nPublication Type: RiP\nGame Language: Eng | Rus\nVoice Language: Eng | Rus\nCrack: RELOADED\n\n\n\nSystem Requirements:\n\nOperating system: Windows XP, Windows Vista, Windows 7\nProcessor: Pentium (R) 4 2.4GHz or Athlon XP (TM) 64 2800 + MHz or any 1.8Ghz Dual Core\nMemory: 512 MB\nVideo: 128 MB DirectX 9 compatible (GeForce 6600 or Radeon 9800)\nSound Card: Sound device compatible with DirectX 9.0\nFree space on hard disk: 13 GB\n\nGame information:\n\nAny spy had not yet managed to surpass in skill and charisma\nof legendary James Bond. The agent of Her Majesty addresses\nthe most difficult tasks. In perfectly ironed tuxedo and with\na radiant smile, he uncovers a global conspiracy, and suppresses\nthe diabolical plans and embarks on a most improbable scam.\nDesperate shootings, the rapid pursuit, covert sabotage of\nbreathtaking - with the help of Quantum of Solace you personally\nto uncover all aspects of life spy!\n\nNow you have a unique chance to become James Bond XXI century.\nAppearance and physique hero exactly recreated in the image of\nDaniel Craig. You will find yourself in the middle of two films.\nFamiliar scenes and new points of &quot;Casino Royale&quot; and\n&quot;Quantum of Solace&quot; is transmitted branded atmosphere and style\nof stories about the agent &quot;007&quot;. With incredibly realistic\ngraphics and sound immerse yourself in the exciting world of\ndeceit, intrigue, betrayal, madly expensive cars and seductive\ngirlfriends. It's time to try on a tuxedo!\n\nGame Features:\n\nNew Bond. First in the games of the agent &quot;007&quot; appears a new\nimage of James Bond, Daniel Craig effectively detected. You'll\nsee a hero like that, remember how it &quot;Casino Royale&quot; and\n&quot;Quantum of Solace.&quot;\n\nThe right choice. Each new job is not like previous one.\nYou never know for sure how to do this time. Use different\ntactics depending on events and situations. Quietly remove\nthe victim in a dark corner, to engage in a fierce fight,\nor to arrange a shoot in the middle of the hotel lounge - it's up to you.\n\nLooking from the outside. The most notorious scoundrel resist\nJames Bond. Increase your chances of winning by using just two\ntypes - from the first and third person.\nLike in the movies! Thanks to modern special effects,\nimmersion in the charming and ruthless world of James\nBond will be complete. Spectacular views, spectacular\nexplosions, stunts and graceful technique &quot;picture-in-picture&quot; -\nthis is not a complete list of graphic techniques.\nAround the world. You will visit Bolivia, Montenegro,\nVenice and Austria. Each area has its indescribable flavor.\n\nJames Bond 007-Blood Stone\n\nYear: 2010\nGenre: Action (Shooter) / Arcade / Racing (Cars) / 3D / 3rd Person\nDeveloper: Bizarre Creations\nPublisher: Activision\nPublication Type: RiP\nGame Language: Eng | Rus\nVoice Language: Eng | Rus\nCrack: RELOADED\n\n\nSystem Requirements:\n\nOperating system: Windows XP, Windows Vista, Windows 7\nProcessor: Core 2 Duo E4300 1,8 GHz / Athlon 64 X2 4000 +\nMemory: 2 GB\nVideo Card: Nvidia Geforce GTX 260 / Radeon HD 4800, DirectX 9 compatible\nSound Card: Sound device compatible with DirectX Â® 9.0\nFree space on hard disk: 10 GB\n\nGame information:\n\nThe storyline of the game James Bond 007: Blood Stone created\nFershtaynom Bruce (Bruce Feirstein) - author of the script\nkinoblokbasterov famous &quot;Golden Eye&quot;, &quot;Tomorrow Never Dies&quot;,\n&quot;The World Is Not Enough&quot;. Exterior of the main characters of\nthe game repeats the images of characters in the movie,\nstarring Daniel Craig which were made ??and Judi Dench, and\nthe image of the new Bond girl can be easily find out the\nsinger Joss Stone. Also, these stars took part in the sound\nof the original version of the game. Actor Motion Capture,\nfulfilled the role of superspy, was understudy Daniel Craig -\nBen Cooke. In addition to the exciting story campaign,\nthe game represented a multiplayer mode for up to sixteen\nparticipants. With extensive tools anyone can create an\nagent for my taste - and looks set to pick up equipment.\n\nGame Features:\n\nLike in the movies. Project developers strongly adheres\nto style the latest James Bond film. Players have to shoot\nto kill out of hiding, to fight hand to hand and participate\nin a dizzying chase on luxury cars.\n\nRevived legend. The game's storyline was created by Bruce\nFershtaynom (Bruce Feirstein) - author of the script\nkinoblokbasterov famous &quot;Golden Eye&quot;, &quot;Tomorrow Never Dies&quot;,\n&quot;The World Is Not Enough&quot;. And he once again skillfully\nshowed the world of international espionage where everyone\ncan be a traitor.\n\nAll the familiar faces. Exterior of the main characters of\nthe game repeats the images of characters in the movie,\nstarring Daniel Craig which were made and Judi Dench\n(Dame Judith Olivia Dench), and the image of the new\nBond girl can be easily find out the singer Joss Stone\n(Joss Stone). Also, these actors took part in the sound\nof the game. In addition, the actor Motion Capture,\nfulfilled the role of superspy, was understudy Daniel\nCraig - Ben Cooke (Ben Cooke).\n\nJames Bond 007 - Legends\n\n\n\n\nYear: 2012\nGenre: Action (Shooter) / FPS\nDeveloper: Eurocom\nPublisher: Activision\nPublished in Russia: New Disk\nPublication Type: RePack\nGame Language: Eng |Rus\nVoiceLanguage: Eng |Rus\nCrack: ALI213\n\n\n\nSystem Requirements:\n\nOperating system: Windows XP, Windows Vista, Windows 7\nProcessor: AMD / INTEL 2.0 GHZ\nMemory: 2 GB\nVideo: 256 MB (ATI Radeon X1600 / NVIDIA GeForce 7600 / INTEL HD 2000)\nSound Card: Sound device compatible with DirectXÂ® 9.0\nFree space on hard disk: 12 GB\n\nGame information:\n\nNew game blockbuster 007 Legends, prepared for the fiftieth anniversary\nof the world-famous franchise, will allow players to remember the key\npoints and to perform the most exciting task of the popular James Bond\nfilms. The first and only game of this magnitude, 007 Legends has an\noriginal story based on the events of six classic films about the\nadventures of a secret agent, including a new, twenty-third of the\nfilm &quot;007: Coordinates&quot; Skayfoll. &quot; Players awaits action worthy of\nthe Bond, as well as a unique spy gear, an impressive arsenal of\nweapons and clever selection of cars. Armed to the teeth and prepared\nfor the deadly tasks, players will face the iconic villains in the\nstruggle that all means are good.You are waiting for the fighting\nskills and techniques, dizzying special effects ... and of course,\nbeautiful women who have become the hallmark 007.\n\nGame Features:\n\nHack safes and computers to gain access to classified information\nand documents.\nExperience the exciting chase and a fierce firefight in the style\nof a unique 007.\nUse the iconic cars, gadgets and secret weapon for successful assignments.\nTake part in missions to protect, destruction and espionage in the\nsingle and cooperative play.\nProve your friends and acquaintances that you are the best agent\nin the multiplayer campaign in the game on a single screen.\n\n\n\n\nRepack Features:  \n\nJames Bond 007-Nightfire\n\nVersion of the game - v1.1\nDo not cut / recoded\nRussian localization of 8 bit\nAbility to select a combination of text and voice\n\nJames Bond 007-Quantum of Solace\n\nVersion of the game - v1.1\nDo not recoded\nCut multiplayer\nAbility to select a combination of text and voice\n\nJames Bond 007-Blood Stone\n\nVersion of the game - v1.0.0.1\nDo not recoded\nCut multiplayer\nAbility to select a combination of text and voice\n\nJames Bond 007-Legends\n\nUpdate 1\nDo not recoded\nAbility to select a combination of text and voice\n\nAdditions:\n\nSkyfall DLC\n","torrent":{"xt":"urn:btih:3abea93763ce73174620229aa539bf35d1c78bd1","amp;dn":"James.Bond.007.Anthology.Repack-R.G.Mechanics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3abea93763ce73174620229aa539bf35d1c78bd1","infoHashBuffer":{"type":"Buffer","data":[58,190,169,55,99,206,115,23,70,32,34,154,165,57,191,53,209,199,139,209]},"announce":[],"urlList":[]}}