{"title":"Wislawa Szymborska - Nobel Prize in Literature, 1996 (8 books)","uid":14116887,"size":11083600,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3baaa8ad410f38eb6ec51023b9d2313bbf2e21ec&amp;dn=Wislawa+Szymborska+-+Nobel+Prize+in+Literature%2C+1996+%288+books%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"workerbee","files":15,"time":1459428219,"description":"\nMARIA WISLAWA ANNA SZYMBORSKA (1923-2012) was a Polish poet, essayist, and translator.  She was awarded the 1996 Nobel Prize in Literature &quot;for poetry that with ironic precision allows the historical and biological context to come to light in fragments of human reality.&quot;  She also received the Polish PEN Club prize, the Goethe Prize, and the Herder Prize.\r\n\r\nDescribed by Robert Hass as &quot;unquestionably one of the great living European poets&quot; and by Charles Simic as &quot;one of the finest poets living today,&quot; Szymborska mesmerizes her readers with poetry that captivates their minds and captures their hearts.  Her work is noted for its wit, irony, and deceptive simplicity.  During her lifetime she wrote around 400 poems, seemingly simple but subtle and deep, using common everyday images -- an onion, a cat -- to reflect on larger truths about life's big subjects: love, death and passing time.  Her poetry examines domestic details and occasions, playing these against the backdrop of history.\r\n\r\nIn addition to a several collections of Szymborska's verse, a volume of her book reviews entitled NONREQUIRED READING (2002), reflecting her eclectic tastes and interests, is also included here.\r\n\r\n\r\nThe following books are in ePUB format unless otherwise noted:\r\n\r\n* Here (Houghton Mifflin, 2012).  Bilingual edition.  Translated by Clare Cavanagh and Stanislaw Baranczak.\r\n\r\n* Map: Collected and Last Poems (Houghton Mifflin, 2015).  Translated by Clare Cavanagh and Stanislaw Baranczak.\r\n\r\n* Monologue of a Dog: New Poems (Houghton Mifflin, 2015).  Bilingual edition.  Translated by Clare Cavanagh and Stanislaw Baranczak.\r\n\r\n* Nonrequired Reading: Prose Pieces (Houghton Mifflin, 2002).  Translated by Clare Cavanagh.\r\n\r\n* Nothing Twice: Selected Poems (Wydawnictwo Literackie, 1997).  Bilingual edition.  Translated by Clare Cavanagh and Stanislaw Baranczak. -- PDF\r\n\r\n* Poems New and Collected, 1957-1997 (Harcourt, 1998).  Translated by Clare Cavanagh and Stanislaw Baranczak.\r\n\r\n* The Poet and the World: The Nobel Lecture (Nobel Foundation, 1996).  Translated by Clare Cavanagh and Stanislaw Baranczak. -- PDF\r\n\r\n* View with a Grain of Sand: Selected Poems (Harcourt, 1995).  Translated by Stanislaw Baranczak and Clare Cavanagh. -- PDF\r\n\r\n_____________________________________________________________________________\r\n\r\n\r\nCONTACT ME: You can reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\r\n                           \nhttps://pirates-forum.org/User-workerbee  \r\n\r\nPLEASE HELP TO SEED!  If you like these books and want others to have access to them, please help to seed for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:3baaa8ad410f38eb6ec51023b9d2313bbf2e21ec","amp;dn":"Wislawa+Szymborska+-+Nobel+Prize+in+Literature%2C+1996+%288+books%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3baaa8ad410f38eb6ec51023b9d2313bbf2e21ec","infoHashBuffer":{"type":"Buffer","data":[59,170,168,173,65,15,56,235,110,197,16,35,185,210,49,59,191,46,33,236]},"announce":[],"urlList":[]}}