{"title":"Castlevania - Curse of Darkness [NTSC], PS2","uid":5093697,"size":2651008660,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:3bd3749800113e29eea6c99ff0ab29741e75fd0f&amp;dn=Castlevania+-+Curse+of+Darkness+%5BNTSC%5D%2C+PS2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"Big_dude","files":-1,"time":1253367056,"description":"Castlevania Curse of Darkness for the Ps2  \t\t            Rel. 11/01/2005\n                                           \n\nFormat:        DVD5 NTSC-USA\nLang:          English\nDiscs:         1\nImage:         ISO\nBy:            Konami\nRequirements:  Modded/Chipped Ps2 or Swap Magic Disc Method. \n\n\nCompressed with WinRar, Game was tested and works. \nTry 7zip its free google it, if don't have WinRar.\n\n\nNote: No PS2 backup disc/game or Copy will work unless your console is modded or\n      if you use Swap Magic.\n\n\nYou could try the homebrew exploit to (Free Mc Boot - Also known as soft modding for ps2), if your ps2 system isn't hard modded with a chip or if Swap Magic isn't working as a last resort. There are ps2 emulators but its not 100% &amp; the quality isn't as good as playing your game on your ps2 console.\n\nIf your using swap magic and don't have a flip top, you'll need to first\nremove the front cover of the disc tray for use of the slide card.\n\nHere's a link for how to remove the front cover...\n        &lt;a href=&quot;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&lt;/a&gt;\n\nAnd here's some links on using the slide tool to open the tray to swap in your ps2 copy or backup game.\n        &lt;a href=&quot;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&lt;/a&gt;\n       &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&lt;/a&gt;\n       &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&lt;/a&gt;\n\nThose that don't have a modded Ps2 Here's a few links for Free MC Boot &amp; how to use it to soft mod your ps2 so you can be able to play burned games. Free Mc Boot won't work on newer models of ps2 you'll have to use an older version the tutorial explains this.\n\n-- &lt;a href=&quot; http://bootleg.sksapps.com/tutorials/fmcb/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bootleg.sksapps.com/tutorials/fmcb/&lt;/a&gt;\n\nThen you will also need to patch the iso (the PS2 game) with ESR disc patcher GUI v0.24a if your using free mc boot with ESR Elf to boot your p2 copies or backups (No-swapping required for esr method).\n\nAfter patching burn the iso with Imgburn or Dvd Decrypter to respectable media\nthen use the ESR through fmcb after you installed everything to boot your game.\n\nYou will still need to use the proper media for the game to run or load properly regardless if your using fmcb, a modded ps2, or swap magic. Verbatim or Tayio yuden is preferred.\n\nNote: If fmcb isn't working and your Ps2 isn't Modded, Swap Magic should do the\ntrick.\n\n\nGame Description:\n\nIn Castlevania Curse of Darkness you play Hector, a former Dracula servant and a Devil Forgemaster, who disowns his dark gifts and aims to live a normal life. This event left Dracula vulnerable to the attacks of the Belmont clan. Now that Dracula is vanished, you must fight back the curse cast upon all Europe. There is but one problem, another Dracula servant does not approve with your plan.\n\nBeing a Devil Forgemaster now gives the player an ability to forge familiars to fight by your side. As the player himself, they have levels and they can even morph to a different stage depending which weapon you use to fight with them.\n\nThe game has some basic role-playing elements such as character attributes and experience. Unlike Castlevania: Lament of Innocence, you are now able to use many types of weapons: Axes, swords, spears, knuckles and even shields for example. You can also craft your own weapons either by using an existing weapon as a base, and having some additional material such as bronze, steel and aluminium or having an extra amount of materials.\n\nThe battle system allows you to lock on to an enemy and hit them with multiple combos. You have some control on your Innocent Devil, and can command it to use certain skills, guard you and join the fight.\n\n\nGame Pics Included.\n\n\nBurn with DVD Decrypter, (Included in download).  \n\nBest to burn at 8x or 4x speed.\n\nUse Verbatim or Tayio Yuden DVD Media for best quality, or if other media isn't working.\n\n\nIf using DVD+R then booktype to DVD-ROM. \n(If your mod-chip, or Ps2 doesn't support DVD+R).\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\nEnjoy!","torrent":{"xt":"urn:btih:3bd3749800113e29eea6c99ff0ab29741e75fd0f","amp;dn":"Castlevania+-+Curse+of+Darkness+%5BNTSC%5D%2C+PS2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3bd3749800113e29eea6c99ff0ab29741e75fd0f","infoHashBuffer":{"type":"Buffer","data":[59,211,116,152,0,17,62,41,238,166,201,159,240,171,41,116,30,117,253,15]},"announce":[],"urlList":[]}}