{"title":"Staten Italy: Nothin' but the Best Italian-Americn Classics (gnv","uid":11821092,"size":75097684,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3c3f5f48cffec2ea341702179023c18e439cdced&amp;dn=Staten+Italy%3A+Nothin%27+but+the+Best+Italian-Americn+Classics+%28gnv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":2,"uploader":"gnv65","files":3,"time":1429264337,"description":"Staten Italy: Nothin' but the Best Italian-American Classics, from Our Block to Yours\nby Francis Garcia and Sal Basille\nGrand Central Life &amp; Style | March 2015 | ISBN: 1455583545 | ePUB | 256 pages | 71.6 mb\n\nThe delicious Italian-American comfort food we all remember, love, and crave, from the owners of the legendary Artichoke Pizza.\nAuthors Fran and Sal are two regular guys from the neighborhood, cousins and best friends, whose DNA reads garlic and oil (they're fifth generation in the food business) and whose six hugely successful restaurants, starting with the legendary Artichoke Pizza, have impressed critics, fellow chefs, and chowhounds alike. They have written a book celebrating big flavor, along with loving (and hilarious) family stories, and rooted in the great Italian-American tradition, handed down through the generations. The recipes are unfussy...simple and fast for school nights, fancier for weekends and holidays and offer readers a transporting, full-bodied take-away, rather than just a book about spaghetti and meatballs. Here you will find Eggs Pizziaola, Pork Cutlets with Hot Peppers and Vinegar, their famous Cauliflower Fritters, and many more authentic dishes served up with gusto.\n\nAbout the Authors\nFrancis Garcia and Sal Basille opened Artichoke Basille's on 14th Street in 2008 and immediately scored glowing reviews in the New York Times, New York Post, and New York Magazine. David Chang, Keith Richards, Leonardo DiCaprio, Drew Barrymore, and Martin Scorsese are all fans. They've expanded Artichoke to six locations (in New York City and Berkeley, California), launched a frozen pizza line, and are hosts of the Cooking Channel's Pizza Masters.\n &lt;a href=&quot;\nhttp://s13.postimg.org/4oczpfszr/Staten_Italy.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s13.postimg.org/4oczpfszr/Staten_Italy.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:3c3f5f48cffec2ea341702179023c18e439cdced","amp;dn":"Staten+Italy%3A+Nothin%27+but+the+Best+Italian-Americn+Classics+%28gnv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c3f5f48cffec2ea341702179023c18e439cdced","infoHashBuffer":{"type":"Buffer","data":[60,63,95,72,207,254,194,234,52,23,2,23,144,35,193,142,67,156,220,237]},"announce":[],"urlList":[]}}