{"title":"PLANETARY 001-027 (Digital) (HD) (Zone-Empire) Plus 3 Crossovers","uid":8319315,"size":799302767,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:3c6db605ee5f51ae02d49160ce9bf8e45d68c07b&amp;dn=PLANETARY+001-027+%28Digital%29+%28HD%29+%28Zone-Empire%29+Plus+3+Crossovers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"STFmaryville","files":-1,"time":1364603093,"description":"These are new high-definition (1920 pixel width) releases of Planetary, the critically acclaimed series from Wildstorm published by Image Comics (and later, for the majority of publication, by DC Comics).\n\nAll credit goes to Zone-Empire for the awesome new releases!\n\nWritten by Warren Ellis, drawn by John Cassaday, and colored by Laura Martin.\n\nIf you haven't read this amazing series, don't miss out! (Hey Mothra67, some of your Golden Age greats are in here... sort of.)\n\nAlso included are the 3 crossover specials, also Empire releases but not in 1920HD.\n\nPlease seed and share with our friends here at TPB!  --STFmaryville\n\n------\n\nFrom Wikipedia, with a few corrections:\n\nPlanetary was originally intended to be a 24-issue bi-monthly series, with issue #1 cover-dated April 1999. The series was on hold for two years (2001 to 2003) due to the illness of writer Warren Ellis and other commitments by artist John Cassaday. Laura Martin (also credited as Laura DePuy) colored almost every issue of the series. The series returned in 2004 and the last 6 issues trickled in over 5 years (2005-2009), concluding after a 3-year delay with issue #27 in October 2009.\n\nEllis intended the focus of the book to be the superhero genre, rather than the superheroes themselves. &quot;I wanted to do something that actually went deeper into the sub-genre, exposed its roots and showed its branches.&quot; He stated in his series proposal: &quot;[W]hat if you had a hundred years of superhero history just slowly leaking out into this young and modern superhero world of the Wildstorm Universe? What if you could take everything old and make it new again?&quot;\n\nRich Kreiner described John Cassaday's artwork in The Comics Journal as being &quot;close to the gold standard for fabulous realism in mainstream comics&quot;. Tom Underhill noted colorist Laura Martin's contribution as &quot;every bit as compelling&quot; as Cassaday's in his review for The Comics Journal.\n\nOne of the series main features is the portrayal of alternate versions of many figures from popular culture, such as Godzilla, Tarzan, Sherlock Holmes, and Doc Savage. This extends to comic book characters from both DC Comics (e.g. Superman, Green Lantern and Wonder Woman) and Marvel Comics (e.g. The Fantastic Four, Hulk and Thor).\n\n------\n\nDescribing themselves as &quot;Archaeologists of the Impossible&quot;, Planetary is an organization intent on discovering the world's secret history. Funded by the mysterious Fourth Man, the field team consists of three superhuman beings: Jakita Wagner, who is strong, fast and near-invulnerable; The Drummer, who can detect and manipulate information streams, such as computers and other electronics; and new recruit Elijah Snow, who creates intense cold and extracts heat. Planetary member Ambrose Chase, who can create a &quot;selective physics-distortion field&quot; was also a member of the field team until apparently killed.\n\nThe field team travel the world investigating strange phenomena - including monsters, aliens and other superhumans, unusual relics and suppressed military secrets - for both the betterment of mankind and out of sheer curiosity. The group is sporadically opposed by a rival group called the Four, a parallel Fantastic Four of metahumans (Dr. Randall Dowling, Kim Suskind, William Leather and Jacob Greene) intent on using the secrets of the world for personal gain.\n\nThe team also appeared in three one-shots, published from 2000 to 2003:\n\nPlanetary/The Authority: Ruling the World: Featuring the two Wildstorm teams in a plot inspired by the stories of H. P. Lovecraft and featuring Lovecraft himself. Art by Phil Jimenez.\n\nPlanetary/JLA: Terra Occulta: Featuring alternate versions of Superman, Batman and Wonder Woman, who oppose a version of Planetary that has made choices like the Four. Art by Jerry Ordway.\n\nPlanetary/Batman: Night on Earth: Featuring versions and interpretations of Batman spanning the character's history, including Bob Kane's original, a version based on Adam West's TV portrayal and Frank Miller's Dark Knight. Art by John Cassaday.","torrent":{"xt":"urn:btih:3c6db605ee5f51ae02d49160ce9bf8e45d68c07b","amp;dn":"PLANETARY+001-027+%28Digital%29+%28HD%29+%28Zone-Empire%29+Plus+3+Crossovers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c6db605ee5f51ae02d49160ce9bf8e45d68c07b","infoHashBuffer":{"type":"Buffer","data":[60,109,182,5,238,95,81,174,2,212,145,96,206,155,248,228,93,104,192,123]},"announce":[],"urlList":[]}}