{"title":"VA - Classic Jazz-Funk Mastercuts Volume 1@320","uid":4113950,"size":188366208,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3cd76fd49dc1220830c3aab1efd8fd6f976eca02&amp;dn=VA+-+Classic+Jazz-Funk+Mastercuts+Volume+1%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"alekow1","files":18,"time":1207202487,"description":"The Mastercuts label&amp;#039;s great Classic Jazz-Funk series kicked off in 1991, and like the remainder of volumes released in its wake throughout the &amp;#039;90s, the first volume more or less concentrates on the &amp;#039;70s end of jazz-funk, as opposed to the form&amp;#039;s beginnings during the &amp;#039;60s. Jazz artists were incorporating more potent and often easily danceable backbeats and were also allowing for the R&amp;B of the time to infiltrate their sound, causing purists to shriek in horror at the break from tradition and -- just as importantly -- the crossover appeal. Though this series was aimed at the rare groove crowd in the U.K. that was at full boil during the &amp;#039;90s, many of these cuts have always been valued in the underground clubs of the U.S. -- from David Mancuso&amp;#039;s earliest New York Loft parties in the &amp;#039;70s and on through the gatherings that have featured roots-conscious house DJs from Chicago, Detroit, New York, and New Jersey. Not only that, but rap DJs have constantly visited the jazz-funk well for prime sample material. Featured on Classic Jazz-Funk, Vol. 1 are Donald Byrd&amp;#039;s &quot;Change&quot; (perhaps the classic jazz-funk song), Gil Scott-Heron&amp;#039;s &quot;The Bottle&quot; (a cautionary, gloriously flute-inflected jam with a thick bottom), Johnny Hammond&amp;#039;s &quot;Los Conquistadores Chocolates&quot; (a Latin-tinged delight featuring scratchy guitars, crazy key work, gauzy strings, and just a little flute), and Lonnie Liston Smith &amp; the Cosmic Echoes&amp;#039; &quot;Expansions&quot; (a brilliant, typically soaring keyboard number with endlessly rolling percussion and -- of course -- some sprightly flute). Other selections from Harvey Mason, Dizzy Gillespie, Ronnie Laws, and Spyro Gyra round out the disc. As with the other volumes in the series, it&amp;#039;s a valuable history lesson and an uplifting listen that packs a mighty wallop.\n\n\n\n1. Lonnie Liston Smith - Expansions (Original 12&quot; Mix)\n2. Ronnie Laws - Always There (Original 12&quot; Mix)\n3. Gil Scott-Heron - The Bottle (Original Version) (Original 12&quot; Mix)\n4. Donald Byrd - Change (Makes You Want To Hustle) (Original Full LP Version\n5. Wilton Felder - Inherit The Wind (Original 12&quot; Mix)\n6. Spyro Gyra - Shaker Song (Original 12&quot; Mix)\n7. Azymuth - Jazz Carnival (Original 12&quot; Mix)\n8. Johnny Hammond - Los Conquistadores Chocolates (Original Full LP Version)\n9. Eddie Henderson - Say You Will (Original 12&quot; Mix)\n10. John Klemmer - Brasilia (Original Full LP Version)\n11. Harvey Mason - Till You Take My Love (Original 12&quot; Mix)\n12. Dizzy Gillespie - Unicorn (Original 12&quot; Mix)\n\n\nLabel: Beechwood Music\nDate: 1991\n\nBITRATE: 320\n\nMy cd-rip (EAC and Lame)\nCovers Included\n\n\nEnjoy,Seed and Share\t\n","torrent":{"xt":"urn:btih:3cd76fd49dc1220830c3aab1efd8fd6f976eca02","amp;dn":"VA+-+Classic+Jazz-Funk+Mastercuts+Volume+1%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3cd76fd49dc1220830c3aab1efd8fd6f976eca02","infoHashBuffer":{"type":"Buffer","data":[60,215,111,212,157,193,34,8,48,195,170,177,239,216,253,111,151,110,202,2]},"announce":[],"urlList":[]}}