{"title":"The Yardbirds - The Very Best of the Yardbirds [2008]  FLAC","uid":6935464,"size":400895287,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3d217b5fb29d0e269fb3ac98b6f1c5a8f26f7390&amp;dn=The+Yardbirds+-+The+Very+Best+of+the+Yardbirds+%5B2008%5D++FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"keeybee","files":29,"time":1325807808,"description":"Please seed!\n\nThe Yardbirds are an English rock band that had a string of hits in the mid 1960s, including &quot;For Your Love&quot;, &quot;Over Under Sideways Down&quot; and &quot;Heart Full of Soul&quot;. The group is notable for having started the careers of three of rock's most famous guitarists: Eric Clapton, Jeff Beck and Jimmy Page, all of whom were in the top five of Rolling Stone's 100 Top Guitarists list (Clapton as #2, Page as #3, and Beck at #5). A blues-based band that broadened its range into\npop and rock, The Yardbirds were pioneers in guitar innovations of the 1960s: fuzz tone, feedback, distortion, backwards echo, improved amplification, etc. Pat Pemberton, writing for Spinner, holds that the Yardbirds were &quot;the most impressive guitar band in rock music&quot;. After the Yardbirds broke up in 1968, their current lead guitarist Jimmy Page founded what became Led Zeppelin. &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Yardbirds&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Yardbirds&lt;/a&gt;\n\n\nThe Yardbirds - The Very Best Of The Yardbirds\nMusic Club 2008\n\n01  The Yardbirds - For Your Love, feat. Eric Clapton\n02  The Yardbirds - Heart Full of Soul, feat. Eric Clapton\n03  The Yardbirds - Good Morning Little Schoolgirl, feat. Eric Clapton\n04  The Yardbirds - Still I'm Sad, feat. Jeff Beck\n05  The Yardbirds - Evil Hearted You, feat. Jeff Beck\n06  The Yardbirds - A Certain Girl, feat. Eric Clapton\n07  The Yardbirds - Jeff's Blues, feat. Jeff Beck\n08  The Yardbirds - I Wish You Would, feat. Eric Clapton\n09  The Yardbirds - New York City, feat. Jeff Beck\n10  The Yardbirds - I'm not Talking, feat. Jeff Beck\n11  The Yardbirds - You're a Better Man Than I, feat. Jeff Beck\n12  The Yardbirds - Shapes of Things, feat. Jeff Beck\n13  The Yardbirds - I'm a Man, feat. Jeff Beck\n14  The Yardbirds - Boom Boom, feat. Eric Clapton\n15  The Yardbirds - Smokestack Lightning (Live), feat. Eric Clapton\n16  The Yardbirds - Let it Rock (Live), feat. Eric Clapton\n17  The Yardbirds - You Can't Judge a Book by its Cover (Live), feat. Eric Clapton\n18  The Yardbirds - Who Do You Love (Live), feat. Eric Clapton\n19  The Yardbirds - Too Much Monkey Business (Live), feat. Eric Clapton\n20  The Yardbirds - Respectable (Live), feat. Eric Clapton\n21  The Yardbirds - Pretty Girl (Live), feat. Eric Clapton\n22  The Yardbirds - Stroll On, feat. Jimmy Page\n &lt;a href=&quot;\nhttp://www.allmusic.com/album/the-very-best-of-the-yardbirds-music-club-r496122&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/album/the-very-best-of-the-yardbirds-music-club-r496122&lt;/a&gt;","torrent":{"xt":"urn:btih:3d217b5fb29d0e269fb3ac98b6f1c5a8f26f7390","amp;dn":"The+Yardbirds+-+The+Very+Best+of+the+Yardbirds+%5B2008%5D++FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d217b5fb29d0e269fb3ac98b6f1c5a8f26f7390","infoHashBuffer":{"type":"Buffer","data":[61,33,123,95,178,157,14,38,159,179,172,152,182,241,197,168,242,111,115,144]},"announce":[],"urlList":[]}}