{"title":"The Plots Against Hitler - Danny Orbach [EN EPUB] [ebook] [p_s]","uid":16025058,"size":5901150,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3d3f7124a020b43791b9a3f61325c07d30a8ac16&amp;dn=The+Plots+Against+Hitler+-+Danny+Orbach+%5BEN+EPUB%5D+%5Bebook%5D+%5Bp_s%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":2,"uploader":"perfect_stan","files":1,"time":1476376945,"description":"The Plots Against Hitler by Danny Orbach\r\nEnglish | 2016 | Non-Fiction, History | 5.6 MB\r\n\r\n\r\nA new and definitive account of the anti-Nazi underground in Germany and its numerous efforts to assassinate Adolf Hitler\r\nIn 1933, Adolf Hitler became Chancellor of Germany. A year later, all parties but the Nazis had been outlawed, freedom of the press was but a memory, and Hitler’s dominance seemed complete. Yet over the next few years, an unlikely clutch of conspirators emerged – soldiers, schoolteachers, politicians, diplomats, theologians, even a carpenter – who would try repeatedly to end the Fuhrer’s genocidal reign. This dramatic and deeply researched book tells the full story of those noble, ingenious, and doomed efforts. This is history at its most suspenseful, as we witness secret midnight meetings, crises of conscience, fierce debates among old friends about whether and how to dismantle Nazism, and the various plots themselves being devised and executed.\r\nOrbach’s fresh research takes advantage of his singular skills as linguist and historian to offer profound insight into the conspirators’ methods, motivations, fears, and hopes. Though we know how this story ends, we’ve had no idea until now how close it came – several times – to ending very differently. The Plots Against Hitler fundamentally alters our view of World War II and sheds bright – even redemptive – light on its darkest days.\r\n\r\nEnjoy and please SEED!!!","torrent":{"xt":"urn:btih:3d3f7124a020b43791b9a3f61325c07d30a8ac16","amp;dn":"The+Plots+Against+Hitler+-+Danny+Orbach+%5BEN+EPUB%5D+%5Bebook%5D+%5Bp_s%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d3f7124a020b43791b9a3f61325c07d30a8ac16","infoHashBuffer":{"type":"Buffer","data":[61,63,113,36,160,32,180,55,145,185,163,246,19,37,192,125,48,168,172,22]},"announce":[],"urlList":[]}}