{"title":"Blondie - Greatest Hits Deluxe Redux Ghosts Of Download 2014 FLA","uid":10608525,"size":707020657,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3d494b8212faaffe09523ff91e1f6accd136a04e&amp;dn=Blondie+-+Greatest+Hits+Deluxe+Redux+Ghosts+Of+Download+2014+FLA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":2,"uploader":"vtwin88cube","files":-1,"time":1406011565,"description":"Blondie 4(0)-Ever\nGreatest Hits Deluxe Redux + Ghosts Of Download (2014)\n\n\n\n\n\nallmusic.com...\n\nWhile it's an inarguably good thing that Blondie is still extant in the 21st century, the band's 2014 release Blondie 4(0)-Ever suggests the predicaments imposed by the band's past and present as they acknowledge their 40th anniversary. Blondie 4(0)-Ever bundles together two albums, a collection of new material called Ghosts of Download, and Greatest Hits Deluxe Redux, a re-recorded set of Blondie favorites. While 2011's Panic of Girls suggested that Blondie was striving to make a place in their new music for all of their many influences, Ghosts of Download is an album clearly made with the dancefloor in mind; electronic beats and gleaming synthesized melodies dominate the tunes, and while all members of the current lineup are listed in the credits, except for the vocals and some very occasional guitar lines from Chris Stein, just about everything here appears to have come from a keyboard or a computer program. Ghosts of Download lacks the wit and adventure of Blondie's best moments, and the presence of the numerous guest stars on these sessions (including Beth Ditto of the Gossip and Latin EDM artists Systema Solar) suggest Stein and Deborah Harry struggled to find their own voice within this material, which ignores pop and rock in favor of dance-influenced sounds without the playful downtown cheek of &quot;Heart of Glass&quot; or &quot;Rapture.&quot; As for Harry, her vocals are cool, stylish, and well-controlled, but there's a lack of fire or dynamics in her performances that suggests she's chosen a deliberately narrow range as time takes its inevitable toll on her voice (she was 68 years old when she cut these sessions, and while she sounds quite good for her age, she's clearly not the singer she once was). And was anyone really waiting for Blondie to cover Frankie Goes to Hollywood, especially with such a disinterested tone? On disc two, Greatest Hits Deluxe Redux contains newly re-recorded versions of 11 of their better-known sides, and like most examples of an artist re-doing their hits, these performances fall significantly short in a side by side comparison with the originals, though this is livelier than the Ghosts of Download sessions and features the full band playing with professionalism and a certain elan (Clem Burke's drumming is as crisp and forceful as ever). Harry's vocals are more pleasing here as well; while her range is still narrower than in her prime, she cheats the missing notes more gracefully, perhaps because she's been doing it on-stage for some time now. But one would imagine that anyone who is enough of a fan to buy Blondie's 10th studio album in the year 2014 would already own these 11 songs in their original form, and Greatest Hits Deluxe Redux adds little value to this package, nice as it is to hear some of these tunes again.\n\n\nGenre................: Pop\nYear.................: 2014\nQuality..............: Free Lossless Audio Codec (FLAC)\nIncluded.............: Front Cover, Cue, Log, Audiochecker\n\n\n\nCD1 - Greatest Hits Deluxe Redux\n\n01.Heart Of Glass\n02.Dreaming\n03.The Tide Is High\n04.Maria\n05.Sunday Girl\n06.Hanging On The Telephone\n07.Rapture\n08.One Way Or Another\n09.Call Me\n10.Atomic\n11.Rip Her To Shreds\n\n\n\nCD2 - Ghosts Of Download\n\n01.Sugar On The Side (Feat. Sytema Solar)\n02.Rave (Feat. Miss Guy)\n03.A Rose By Any Other Name (Feat. Beth Ditto)\n04.Winter\n05.I Want To Drag You Around\n06.I Screwed Up (Feat. Los Rakas)\n07.Relax (Feat. Keilah Baez, Felicia Dennis And Keisha Williams)\n08.Take Me In The Night\n09.Make A Way\n10.Mile High\n11.Euphoria\n12.Take It Back\n13.Backroom\n\n\n\n\n\nSupport The Artists.\nBuy it if you like it!\n\nThanks for Seeding\nCheers...","torrent":{"xt":"urn:btih:3d494b8212faaffe09523ff91e1f6accd136a04e","amp;dn":"Blondie+-+Greatest+Hits+Deluxe+Redux+Ghosts+Of+Download+2014+FLA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d494b8212faaffe09523ff91e1f6accd136a04e","infoHashBuffer":{"type":"Buffer","data":[61,73,75,130,18,250,175,254,9,82,63,249,30,31,106,204,209,54,160,78]},"announce":[],"urlList":[]}}