{"title":"EltimaSoftware Flash Decompiler Trillix v5.3.1370 Incl Crack [ia","uid":7835638,"size":18575721,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3d5e1fbf4ac450762f08b278170bdbe00455be0f&amp;dn=EltimaSoftware+Flash+Decompiler+Trillix+v5.3.1370+Incl+Crack+%5Bia&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"TorDigger","files":3,"time":1353181149,"description":"Flash Decompiler Trillix\n\nFlash Decompiler Trillix is a feature rich and powerful SWF to FLA converter, which will help you decompile Flash movies, convert SWF elements into multiple formats and edit SWF files (texts, hyperlinks and more) on the go without Adobe Flash installed. Since version 4.X you can also convert Flex files back into Flex projects in case your SWF files were built in Flex! \n\nMoreover, you will be able to extract all elements from SWF files and save them to your hard drive in various formats.\n\nAnd last, but not least, is that Flash Decompiler supports batch conversion mode. You can simply leave several files to be converted and go have a cup of coffee while Flash Decompiler is working. \n\nFlash Decompiler doesn't decompile Captivate projectors (EXE), projectors created outside of Adobe Flash.\n\nWith Flash Decompiler you can:\n\nConvert SWF to FLA or Flex source code\nDid you lose your original FLAs or Flex project files? Did your computer crash? Actually, it doesn't matter where your original FLAs now, but it is a great problem if you don't have them. Actually, the solution is right in front of you. Flash Decompiler by Eltima is able to restore your original source code FLA or Flex so you can edit and alter them in any way you want in the native Flash environment.\n\nEdit SWF files\nUnique Edit SWF capabilities of Flash Decompiler let you edit existing sounds, images, colors, gradients, lines, texts and static links even without conversion to FLA or Flex source format. A built-in explorer makes browsing your PC for Flash movies and adding them even for batch decompilation and conversion extremely simple. Intellectual item-by-item preview, user-friendly controls with fully-customizable interface make Flash Decompiler a feature-rich user-friendly environment for professional work.\n\nExtract SWF elements\nWith Flash Decompiler you can easily export SWF elements to your hard drive: Flash Video to AVI, MPEG, FLV and FLA, save sounds as WAV or MP3, images - as PNG, JPEG and BMP, texts as RTF, TXT and HTML. Flash Decompiler Trillix lets you convert the whole SWF file into FLA, or export certain Flash resources into FLA format. Flash Player EXE files are decompiled the same easy way as common SWF files. \n\nPLUS! Capture SWF movies from the Internet with Flash Decompiler! Now Flash Decompiler also features 2 web plug-ins for Internet Explorer and FireFox to save Flash movies online.\n\nFull features list:\n\nFull support of Flash 5, 6, 7, 8, 9, 10, Flash CS5 and CS5.5 including AS 2.0 and 3.0\nSupport of Adobe Flash Professional CS6\nExtract all Flash file resources into various formats\nSupport of SWF files built in Flex (v3 and v4 supported)\nExtract Flash video into AVI, MPEG and other playable formats\nFlash files conversion into Adobe Flash CS5 file format (.xfl - XML-based FLA)\nBasic conversion of SWF files with a standard Flash preloader (e.g. files with TLF texts)\nBasic decompilation of Adobe AIR applications\nBatch decompilation and conversion of Flash movies\nEdit more Flash objects now without converting to FLA: images, texts, static links, sounds, colors and lines\nSupport of SWF files embedded into a SWF file as binary data (nested SWF files)\nNew scalable shining interface with ribbon bar\nAdvanced built-in Flash player to preview and playback your Flash movies\nP-code and common ActionScript representation. Also Hex dump view (currently not in AS 3.0)\nDetailed configuration of SWF to FLA conversion (motion tweens, library, FLA format, AS and other settings)\nTake screenshots of Flash file played\nUnique global ActionScripts search in all tasks simultaneously\nMulti-window interface with a possibility to work with and compare several SWF files at a time\nSimple and effective adding of multiple files or folders to the Tasks list\nEasily change the background color of any SWF file\nDetailed tag information panel\nDump View, which shows the detailed tag structure of a SWF file\nSave Flash Movie in Internet Explorer and FireFox plug-ins are supplied for simple saving of SWF movies online\nThe software is digitally signed to verify Eltima quality and software authenticity\nMany other convenient features for professional Flash decompilation\n\nSupported OS:\n\nWindows XP 32-bit, Windows XP 64-bit, Windows 2003 32-bit, Windows 2003 64-bit, Windows 2008 32-bit, Windows 2008 64-bit\nWindows Vista 32-bit, Windows Vista 64-bit, Windows 7 32-bit, Windows 7 64-bit, Windows 8 32-bit, Windows 8 64-bit, Windows server 2012\n\nHomepage: http://www.eltima.com/products/flashdecompiler/\n\nInstallation Instructions:\n\n1. Install program.\n2. Copy content from crack folder and paste into default installation directory.\n3. Done, Enjoy.\n","torrent":{"xt":"urn:btih:3d5e1fbf4ac450762f08b278170bdbe00455be0f","amp;dn":"EltimaSoftware+Flash+Decompiler+Trillix+v5.3.1370+Incl+Crack+%5Bia","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d5e1fbf4ac450762f08b278170bdbe00455be0f","infoHashBuffer":{"type":"Buffer","data":[61,94,31,191,74,196,80,118,47,8,178,120,23,11,219,224,4,85,190,15]},"announce":[],"urlList":[]}}