{"title":"Google chrome 48.0.2540.0 latest version","uid":12616831,"size":53982880,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3d9f20a1b17ffe130beaba5552197712e9887f10&amp;dn=Google+chrome+48.0.2540.0+latest+version+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"Ggamer1","files":2,"time":1445530495,"description":"Google Chrome 48.0.2540.0 Dev\r\n\r\n\r\n\r\n\r\ngame changing browser Chrome combines sophisticated technology with \r\n a simple UI, to create a faster, safer and easier browsing experience. Launched in 2008, Google Chrome quickly dominated the browser market to become the most used browser globally within 4 years of its public release. Google’s rapid and continuous development cycle ensures the browser continues to compete with the other most popular and advanced web browsers available.\r\n\r\n Speed\r\n\r\n Perhaps the area Google invested most of its development time to differentiate from other browsers. Google Chrome launches extremely quickly from your desktop, runs applications at speed thanks to a powerful JavaScript engine and loads pages rapidly using the WebKit open source rendering engine. Add to this quicker search and navigation options from the simplified UI and you have a browser that is pretty hard to beat on speed, especially if gaming is your thing.\r\n\r\n Clean, simple UI\r\n\r\n Google Chrome’s most striking feature and a substantial factor in its popularity - the simple UI hasn’t changed much since the beta launch in 2008. Google focused on trimming down unnecessary toolbar space to maximise browsing real estate. The browser is made up of 3 rows of tools, the top layer horizontally stacks automatically adjusting tabs, next to a simple new tabs icon and the standard minimize, expand &amp; close windows controls. The middle row includes 3 navigation controls (Back, Forward &amp; Stop/Refresh), a URL box which also allows direct Google web searching and a star bookmarking icon. Extensions and browser settings icons line up to the right of the URL box. The third row is made up of bookmark folders and installed apps. Easily overlooked now, this clean UI was a breath of fresh air compared to the overcrowded toolbars of popular browsers pre-2008.\r\n\r\n Privacy\r\n\r\n Another hugely popular feature, Incognito mode allows you to browse privately by disabling history recording, reducing traceable breadcrumbs and removing tracking cookies on shutdown. Chrome’s settings also allow you to customize regular browsing privacy preferences.\r\n\r\n Security\r\n\r\n Chrome’s Sandboxing prevents malware automatically installing on your computer or affecting other browser tabs. Chrome also has Safe Browsing technology built in with malware and phishing protection that warns you if you encounter a website suspected of containing malicious software/activity. Regular automatic updates ensure security features are up to date and effective.\r\n\r\n Customization\r\n\r\n A vast selection of apps, extensions, themes and settings make your browsing experience unique to you. Improve productivity, security, navigation speed, pretty much anything you can think of with apps and extensions from the Google Chrome Store. Install themes created by top artists or make your own using mychrometheme.com. Sign in with your Google Account to back up your contacts, preferences, history as well as access all your Google tools with a single login","torrent":{"xt":"urn:btih:3d9f20a1b17ffe130beaba5552197712e9887f10","amp;dn":"Google+chrome+48.0.2540.0+latest+version+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d9f20a1b17ffe130beaba5552197712e9887f10","infoHashBuffer":{"type":"Buffer","data":[61,159,32,161,177,127,254,19,11,234,186,85,82,25,119,18,233,136,127,16]},"announce":[],"urlList":[]}}