{"title":"FIDLAR - Too (2015) [16.44 CD FLAC]","uid":14698278,"size":312187499,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3deea199be36fbb3fb6e0a94a08760d8e3827f43&amp;dn=FIDLAR+-+Too+%282015%29+%5B16.44+CD+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"politux","files":15,"time":1464269046,"description":"FIDLAR - Too (2015) [16.44 CD FLAC]\n\n  Genre: Rock\n  Styles: Alternative, Pop Punk, Garage\n  Source: CD (log + cue)\n  Codec: FLAC  \n  Bit rate: ~ 1,000 kbps\n  Bit depth: 16\n  Sample rate: 44.1 kHz\n\n  When L.A. garage punks FIDLAR emerged in 2013 with their self-titled debut, they were lauded for their mix of classic SoCal punk (Circle Jerks, Descendents, Fear, etc.) and brash, melodic indie jangle with occasional clamorous surf tones. That first slab introduced their fuck-all world-view of cheap beer, cheap drugs, skating, surfing, and partying, and, in spite of its abrasive and somewhat simplistic subject matter, was a pretty fun ride. In guitarist/singer Elvis Kuehn and drummer Max Kuehn, sons of L.A. staple Greg Kuehn (T.S.O.L., X), the band had a bona fide West Coast punk pedigree, and in frontman Zac Carper they also had a raging junkie, both adding different aspects to their mystique. On their sophomore outing, 2015's Too, FIDLAR make efforts to evolve their sound and confront their demons, all while continuing to uphold their credo of &quot;fuck it, dog, life's a risk,&quot; the phrase implied by their acronymic band name. Chalk it up to growing pains and the hand dealt by living hard, but Too is definitely a mixed bag. After a harrowing two years of out-of-control heroin addiction and depression, Carper finally managed to clean himself up midway through recording and the influence of his newfound sobriety weaves incongruously among the party anthems that were FIDLAR's stock-in-trade the first time around. Carper's life change manifests itself well on the creepy acoustic dirge &quot;Overdose,&quot; though not so well on the misguided &quot;Sober,&quot; which tries to shed a comedic light on his issues but merely comes off as irritating. Elsewhere though, Too benefits from the efforts of producer Jay Joyce, who injects some rock muscle into standout cuts like &quot;40 oz on Repeat,&quot; &quot;Why Generation,&quot; and &quot;Hey Johnny,&quot; highlighting the band's versatility and knack for nuance. While parts of Too show FIDLAR trying to find their footing, it's all part of their evolution and is not without its charms","torrent":{"xt":"urn:btih:3deea199be36fbb3fb6e0a94a08760d8e3827f43","amp;dn":"FIDLAR+-+Too+%282015%29+%5B16.44+CD+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3deea199be36fbb3fb6e0a94a08760d8e3827f43","infoHashBuffer":{"type":"Buffer","data":[61,238,161,153,190,54,251,179,251,110,10,148,160,135,96,216,227,130,127,67]},"announce":[],"urlList":[]}}