{"title":"Lodoss War (Complete Saga) Dual Audio","uid":4875110,"size":14002841870,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:3def23a049905451cfc5df36d28348d0fd68b276&amp;dn=Lodoss+War+%28Complete+Saga%29+Dual+Audio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":7,"uploader":"Sinshenron","files":95,"time":1241087570,"description":"This torrent include the 13 episode OVA, the 27 episode TV, the animated film, and the 3 part Chaos Ring OVA. Watch them in the numbered order (I number them chronologically).\n\nThey are either in mkv format, or ogm format.\nEach episodes contain dual audio (english/japanese), and english sub.\n\n1. Record of Lodoss War 13 eps.\nPlot Summary: Created from the aftermath of the last great battle of the gods, Lodoss and its kingdoms have been plagued by war for thousands of years. As a quiet peace and unity finally become foreseeable over the land, an unknown evil begins to stir. An ancient witch has awakened, bent on preserving the island of Lodoss by creating political unbalance throughout the many kingdoms and keeping any one from maintaining central control. Only a mixed-race party of six young champions, led by the young warrior Parn, stand between this new threat and Lodoss' decent back into the darkness of war and destruction.\n\n2.Chronicle of the Heroic Knight 27 episode\nPlot Summary: Five years after the death of the Emperor of Marmo in the War of Heroes, Parn is now the Free Knight of Lodoss, he and his old allies now famous through the land. However, the Emperor's right-hand-man, Ashram, seeks the scepter of domination to re-unify Lodoss under his former leader's banner. Meanwhile, beyond his attempts at conquest lies a more sinister force beginning to set the stage for the resurrection of the goddess of death and destruction...\n\n3. Legend of Chrystania\nPlot Summary: Ashram, desperate to find a home for his people, is tricked into selling his soul. 300 years later, Pirotesse's devotion to her king remains unshaken. In the sacred world of Crystania, amidst a civil war waged by shape-changing warriors, she searches for her beloved Ashram. She meets Redon, a young prince obsessed with avenging his murdered parents. Together, they confront Ashram's captor -- the bloodthirsty Barbas, who aspires to rule Crystania as &quot;The God's King&quot;.\n\n4.The Chaos Ring\nPlot Summary: Dreams begin to haunt Lady Sheru -- dreams of her past life as Pirotesse. Her love, Ashram, is being tormented at the hands of the soul of Barbas posing as their former king, Beld of Marmo. Interpreting this as a plea for help, Sheru searches for a way to save him by entering the chaos realm using the Chaos Ring. Meanwhile, Redon and his friends are called to arms again as ancient creatures begin to appear after being sealed away for centuries. Both their paths will cross once again, and on their shoulders will the fate of Crystania lie.\n\n\nSeed after complete so everyone can enjoy this classic.\n\nBy Pothb@ Demonoid","torrent":{"xt":"urn:btih:3def23a049905451cfc5df36d28348d0fd68b276","amp;dn":"Lodoss+War+%28Complete+Saga%29+Dual+Audio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3def23a049905451cfc5df36d28348d0fd68b276","infoHashBuffer":{"type":"Buffer","data":[61,239,35,160,73,144,84,81,207,197,223,54,210,131,72,208,253,104,178,118]},"announce":[],"urlList":[]}}