{"title":"Game of Thrones S02E10 (2012)DivX nl subs NLtoppers","uid":7932139,"size":372268054,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3e3ffe966b79ff5f64918b055dbab1530c2eff94&amp;dn=Game+of+Thrones+S02E10+%282012%29DivX+nl+subs+NLtoppers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":2,"uploader":"ChickieChicken","files":-1,"time":1355704904,"description":"Game of Thrones is een HBO-serie gebaseerd op de fantasyboeken \n ''Een Lied van IJs en Vuur'' van George R. R. Martin. Het gaat \n over een machtsstrijd om de ijzeren troon tussen zeven \n verschillende adellijke families op het fictieve continent \n Westeros. \n\n Robert Baratheon is koning van Westeros, maar al snel ontdekt \n hij dat zijn troon zeer gewild is onder de adellijke families. \n\n Om het allemaal nog erger te maken staat er in het Noorden een \n oud kwaad op, klaar om het verscheurde Westeros binnen te vallen\n\n\nSeizoen 2 Aflevering 10:&quot;Valar Morghulis&quot;\n\n  \n Alan Taylor David Benioff &amp; D. B. Weiss June 3, 2012 4.20[70] \nThe aftermath of the Battle of the Blackwater sees Joffrey set Sansa aside in favor of marrying Margaery Tyrell while Tyrion fears for his and Shae's safety now that his father has replaced him as Hand of the King. Melisandre gives a defeated Stannis a new hope. Brienne runs into trouble while escorting Jaime to King's Landing. Catelyn tries to convince Robb that his romance with Talisa is dangerous, but he defies her and the two are married. In Qarth, Daenerys ventures into the House of the Undying and successfully retrieves her dragons. She then seals the traitor Xaro Xhoan Daxos inside his own vault and claims his riches for herself to buy a ship. In Winterfell, Theon is betrayed by his own men in the face of an inevitable siege while Winterfell is put to the torch. Osha and Hodor sneak brothers Bran and Rickon away from the smoldering ruins and take them North toward the Wall. Arya, having escaped Harrenhal with Hot Pie and Gendry, receives the gift of a valuable coin from Jaqen. North of the Wall, Qhorin Halfhand forces Jon to kill him to prove his loyalty to the Wildlings and an army of White Walkers surround the Fist of the First Men. \n\nBy Chickie\n\n\n","torrent":{"xt":"urn:btih:3e3ffe966b79ff5f64918b055dbab1530c2eff94","amp;dn":"Game+of+Thrones+S02E10+%282012%29DivX+nl+subs+NLtoppers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e3ffe966b79ff5f64918b055dbab1530c2eff94","infoHashBuffer":{"type":"Buffer","data":[62,63,254,150,107,121,255,95,100,145,139,5,93,186,177,83,12,46,255,148]},"announce":[],"urlList":[]}}