{"title":"Kali Linux i386, [Iso - MultiLang] [TNTVillage]","uid":13352716,"size":2999844933,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:3f57ce434edce3f093b32a8e5d8a20367f4db630&amp;dn=Kali+Linux+i386%2C+%5BIso+-+MultiLang%5D+%5BTNTVillage%5D+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":4,"uploader":"mykons","files":2,"time":1454099516,"description":"Kali Linux i386, [Iso - MultiLang] [TNTVillage] \r\n\r\nRelease originale: [url]http://forum.tntvillage.scambioetico.org/index.php?showtopic=477010[/url]\r\n\r\n-.-.-.-.-.-.-.-.-.-.\r\n..:Dettagli:..\r\n\r\nNome: Kali Linux\r\nVersione: Rolling 2016.1\r\nGenere: Sistema Operativo GNU/Linux - 32 bit\r\nData di uscita: 2016\r\n \nhttps://www.kali.org/news/kali-linux-rolling-edition-2016-1/\r\n\r\nKali Linux is a Debian-based Linux distribution aimed at advanced Penetration Testing and Security Auditing. Kali contains several hundred tools aimed at various information security tasks, such as  Penetration Testing, Forensics and Reverse Engineering. Kali Linux is developed, funded and maintained by Offensive Security, a leading information security training company.\r\n\r\nKali Linux was released on the 13th March, 2013 as a complete, top-to-bottom rebuild of BackTrack Linux, adhering completely to Debian development standards.\r\n\r\n    More than 600 penetration testing tools included: After reviewing every tool that was included in BackTrack, we eliminated a great number of tools that either simply did not work or which duplicated other tools that provided the same or similar functionality. Details on what’s included are on the Kali Tools site.\r\n    Free (as in beer) and always will be: Kali Linux, like BackTrack, is completely free of charge and always will be. You will never, ever have to pay for Kali Linux.\r\n    Open source Git tree: We are committed to the open source development model and our development tree is available for all to see. All of the source code which goes into Kali Linux is available for anyone who wants to tweak or rebuild packages to suit their specific needs.\r\n    FHS compliant: Kali adheres to the Filesystem Hierarchy Standard, allowing Linux users to easily locate binaries, support files, libraries, etc.\r\n    Wide-ranging wireless device support: A regular sticking point with Linux distributions has been supported for wireless interfaces. We have built Kali Linux to support as many wireless devices as we possibly can, allowing it to run properly on a wide variety of hardware and making it compatible with numerous USB and other wireless devices.\r\n    Custom kernel, patched for injection: As penetration testers, the development team often needs to do wireless assessments, so our kernel has the latest injection patches included.\r\n    Developed in a secure environment: The Kali Linux team is made up of a small group of individuals who are the only ones trusted to commit packages and interact with the repositories, all of which is done using multiple secure protocols.\r\n    GPG signed packages and repositories: Every package in Kali Linux is signed by each individual developer who built and committed it, and the repositories subsequently sign the packages as well.\r\n    Multi-language support: Although penetration tools tend to be written in English, we have ensured that Kali includes true multilingual support, allowing more users to operate in their native language and locate the tools they need for the job.\r\n    Completely customizable: We thoroughly understand that not everyone will agree with our design decisions, so we have made it as easy as possible for our more adventurous users to customize Kali Linux to their liking, all the way down to the kernel.\r\n    ARMEL and ARMHF support: Since ARM-based single-board systems like the Raspberry Pi and BeagleBone Black, among others, are becoming more and more prevalent and inexpensive, we knew that Kali’s ARM support would need to be as robust as we could manage, with fully working installations for both ARMEL and ARMHF systems. Kali Linux is available on a wide range of ARM devices and has ARM repositories integrated with the mainline distribution so tools for ARM are updated in conjunction with the rest of the distribution.\r\n\r\n\r\n\r\n[img]https://www.kali.org/wp-content/uploads/2016/01/kali-rolling-screenshot.png[/img]","torrent":{"xt":"urn:btih:3f57ce434edce3f093b32a8e5d8a20367f4db630","amp;dn":"Kali+Linux+i386%2C+%5BIso+-+MultiLang%5D+%5BTNTVillage%5D+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f57ce434edce3f093b32a8e5d8a20367f4db630","infoHashBuffer":{"type":"Buffer","data":[63,87,206,67,78,220,227,240,147,179,42,142,93,138,32,54,127,77,182,48]},"announce":[],"urlList":[]}}