{"title":"The Lloyd and Hill Crime and Mystery Collection","uid":11844771,"size":1292794661,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3f5ed2d0dd0223665be820224a42226e102c6541&amp;dn=The+Lloyd+and+Hill+Crime+and+Mystery+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"davieboy1966","files":105,"time":1429916913,"description":"Audio Books : Mystery and Suspense : Other quality : English\n\n\nAll of the seven titles here are unabridged. Three are from CDs and four are from cassette tapes. All were patiently ripped by peterg23.\nMost of these rare titles are recorded at 32 kbps / 22 kHz Mono CBR Fraunhofer except for the last which is 48 kbps / 44 kHz Mono CBR.\nFour of the seven titles here are narrated by Gordon Griffin.\nAs far as I'm aware, these last 7 titles in the 13 part Lloyd and Hill series are the only ones to be released as audio books.\n\n\n\nAnyone who likes Colin Dexter's Inspector Morse books or Ruth Rendell's Inspector Wexford novels will appreciate McGown's work. Her series characters, Lloyd and Hill, are British police officers who work together.\nThey are also a couple. They are brilliantly drawn, flawed but likeable and entirely plausible... (SH)\n\nA Shred of Evidence [1995], Read by Kenneth Knowles - Cassettes\nConstant gossip, endless secrets, nonstop rumors-these everyday elements of high-school life prove nearly impenetrable obstacles for Detective Chief Inspector Lloyd and Inspector Judy Hill of the Stansfield Police as they try solve the murder of a teenaged girl in this leisurely but compelling story. Natalie Ouspensky is a precocious 15-year-old with a host of gregarious friends, a fine school record and, apparently, a secret life. When her strangled corpse is discovered near a public park, Lloyd and Hill join hands to demonstrate once again why their professional (and romantic) collaboration creates tension, ignites sparks and ultimately, in McGown's skilled telling, comprises superior mystery fiction.\n\nVerdict Unsafe [1997], Read by Kenneth Knowles - Cassettes\nIn an English Midlands town, Colin Drummond, known as &quot;the stealth bomber,&quot; is in prison for rape. Forty-year-old Detective Inspector Judy Hill took his confession. Now, after three years in prison, Drummond has been released to be tried again. He harasses Hill with phone calls and threats, and she fears that he will add to his total of four rapes. Judy's lover, Detective Chief Inspector Lloyd, is also involved in the case. Twists and turns and subplots put Drummond's guilt and Hill's career (and romance) in doubt.\n\nPicture of Innocence [1998], Read by Gordon Griffin - CD\nThe death of East Midlands farmer and landowner Bernard Bailey from booze, drugs and a dull knife leaves an excess of suspects in this meticulously detailed and lushly atmospheric addition to McGown's series starring British coppers DCI Lloyd and DC Judy Hill. The list includes Bailey's routinely battered second wife, Rachel, who so far had failed to produce the male heir that would bring Bailey the proceeds of a significant inheritance, and Bailey's grown daughter, Nicola, the local vet who had also felt her father's wrath. A wealthy builder, Mike McQueen, has made a handsome offer for Bailey's land and has an eye for Rachel's charms. Rachel, however, is sleeping with Curtis Law, a local TV journalist who is working on a number of stories and has an active role in a drug sting operation.\n\nPlots and Errors [1999] , Read by Gordon Griffin - CD\nWhen Andrew Cope and his ex-policewoman wife Kathy, proprietors of an unsuccessful detective agency, up to their necks in debt and on the verge of losing their home, are found dead in their fume-filled car, there are few who doubt that they have simply taken the easy way out. But DCI Lloyd knew Kathy Cope, and doesn't believe she was a quitter. Besides, where did she get all the state-of-the-art office equipment? Why was her shopping put away in all the wrong places? Even her last case is a puzzle. Just why would a member of the super-wealthy Esterbrook family have employed her? When DI Judy Hill is called out to the murder of matriarch Angela Esterbrook, Lloyd's doubts appears to be vindicated; and the Copes' apparent suicide turns out to be just the curtain-raiser on a tragedy of Shakespearean proportions . . .\n\nPerhaps the most complex plot I have ever encountered!\n\nScene of Crime [2001], Read by Gordon Griffin - Cassettes\nJudy Hill, a bit cranky in her eighth month of pregnancy and uncertain about Lloyd's willingness to be a father again, ropes her reluctant partner in life and crime into joining her at a rehearsal for a local dramatic society's production of Cinderella. When Lloyd is called from there to the scene of a suspicious death involving the wife of one of the players, the curtain rises on a fascinating domestic drama...\n\nBirths, Deaths and Marriages [2002], Read by Julia Franklin - Cassettes\nFor Lloyd and Hill, a kidnapping soon becomes a murder investigation...In an isolated cottage a woman has been bludgeoned to death; outside, a man has been crushed by a car. That, and a row overheard earlier that morning, is all Detective Chief Inspector Lloyd has to go on. Who is the dead woman? Where's her handbag? If it was a burglary, why the extreme violence? If it was a domestic. why is the handbag missing? Questions without answers, And Lloyd doesn't yet know how deeply involved in the enquiry Judy Hill has become - nor how profoundly it will affect her...\n\nUnlucky for Some [2004], Read by Gordon Griffin - CD\nFebruary 13th: what seemed like Wilma Fenton's lucky night, when she scooped her biggest-ever win at bingo, turned out to be the night she died at the hands of someone lurking in the dimly-lit alleyway leading to her flat. And what seems to be a lucky break - there was an eyewitness to the whole incident - turns out to be a complication, for the man who saw the murder committed is Tony Baker, a well-known journalist and TV personality who, almost twenty years ago, single-highhandedly tracked down a serial killer who had eluded the police. Did Baker see more than he claims? Does he want to beat the police to the punch again? What seems like a minor complication turns out to be the trigger for a deadly chain of events, as the man the media will come to call the Anonymous Assassin publicly announces he will kill again, and challenges Baker to catch him before he does. In the full glare of the national media, Bartonshire police are to mount a dangerous, force-wide hunt for the killer, with Detective Chief Inspectors Lloyd and Hill and their hastily constituted team spearheading the investigation...\n\nJill McGown, best known as the author of a series of thirteen British police procedurals starring Chief Inspector Lloyd and Sergeant Judy Hill (later also Chief Inspector, and Lloyd's wife) died in April 2007, after a long illness. She was 59 at the time of her death. Her detective stories bridge the gap between the meticulously plotted stories of the 1930s and 1940s Golden Age of mysteries, and the psychological crime stories of the 1950s, suggests one source. Not only do Ms. McGown's series characters, Lloyd and Judy Hill solve the most deviously twisted crimes together, but they're also lovers, their slow-moving romance part of the reason readers kept returning for the next installment. (TK)\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:3f5ed2d0dd0223665be820224a42226e102c6541","amp;dn":"The+Lloyd+and+Hill+Crime+and+Mystery+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f5ed2d0dd0223665be820224a42226e102c6541","infoHashBuffer":{"type":"Buffer","data":[63,94,210,208,221,2,35,102,91,232,32,34,74,66,34,110,16,44,101,65]},"announce":[],"urlList":[]}}