{"title":"Alcohol 120% 2.0.3.6890 Final Retail [ATOM]","uid":11187896,"size":8232780,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3f62cc720de2d17adc75462f0eb4b91011b5d253&amp;dn=Alcohol+120%25+2.0.3.6890+Final+Retail+%5BATOM%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"AtomTPB","files":-1,"time":1412953208,"description":"Description:\nAlcohol 120% is the CD &amp; DVD emulation and recording program that will allow users to easily copy a visible and an invisible disc. \nAlcohol 120% enables users to create 31 virtual CD &amp; DVD-ROM to play discs without needing a physical disc, it also enables users to copy CD &amp; DVD to CD-R / CD-RW / DVD-R / DVD-RW / DVD-RAM / DVD+RW. Alcohol 120% combines all functions of Alcohol 52% (CD &amp; DVD emulation software).\n\nAlcohol brings a new meaning to the word multimedia! It is without a doubt a leader in its class, bringing the ability to emulate and record CDs and DVDs together into one amazingly easy to use software program.\nUsing the latest technology the program is constantly being developed and improved to add new features, allowing it to maintain it's position as a leading software package.\n\n\nFeatures:\n-Make perfect 1:1 back-ups of CDs, Alcohol 120% is really the ultimate DVD / CD emulation and burning software.\n-Store your most used or important CDs as images on your computer and run them at 200x speed from up to 31 virtual CD or DVD drives!\n-Burn more than one CD or DVD at the same time, even from from different sources, using the latest multiple burners technology.\n-Highest drive compatibility - Alcohol is compatible with more than 99% of drives available and if it doesn't work with your drive we can improve it so let us know!\n-Bypass the latest &quot;unbreakable&quot; protections using Alcohol Software's state of the art burning and emulation process!\n-Supports the highest number of possible image file types including - MDS, CCD, -BIN, CUE, ISO, CDI, BWT, BWI, BWS, BWA &amp; many more...\n-Ultra-responsive industry leading support from our team of software experts\n\n\nWhat's New in version 2.0.3.6890:\n(October 10th, 2014)\n\n-NEW 'Verify disc' feature in image burning wizard\n-UPDATE More burners supported\n-UPDATE Languages updated\n-FIX minor bugs","torrent":{"xt":"urn:btih:3f62cc720de2d17adc75462f0eb4b91011b5d253","amp;dn":"Alcohol+120%25+2.0.3.6890+Final+Retail+%5BATOM%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f62cc720de2d17adc75462f0eb4b91011b5d253","infoHashBuffer":{"type":"Buffer","data":[63,98,204,114,13,226,209,122,220,117,70,47,14,180,185,16,17,181,210,83]},"announce":[],"urlList":[]}}