{"title":"Digital Power Electronics and Applications by Fang Lin Luo, Hong","uid":10822533,"size":4911835,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3fa1dd2bea613c07e1565ec309d59c1cfceba61f&amp;dn=Digital+Power+Electronics+and+Applications+by+Fang+Lin+Luo%2C+Hong&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"thilanga123","files":1,"time":1408550577,"description":"Digital Power Electronics and Applications\n\n- Academic Press, Jul 20, 2010\n- Technology &amp; Engineering\n- 464 pages\n\nBook Description\nA milestone in the development of Power Electronics and Energy systems!\n\nFrom the Back Cover\nThe purpose of this book is to describe the theory of Digital Power Electronics and its applications. The authors apply digital control theory to power electronics in a manner thoroughly different from the traditional, analog control scheme. In order to apply digital control theory to power electronics, the authors define a number of new parameters, including the energy factor, pumping energy, stored energy, time constant, and damping time constant. These parameters differ from traditional parameters such as the power factor, power transfer efficiency, ripple factor, and total harmonic distortion. These new parameters result in the definition of new mathematical modeling:\n\n. A zero-order-hold (ZOH) is used to simulate all AC/DC rectifiers.\n. A first-order-hold (FOH) is used to simulate all DC/AC inverters.\n. A second-order-hold (SOH) is used to simulate all DC/DC converters.\n. A first-order-hold (FOH) is used to simulate all AC/AC (AC/DC/AC) converters.\n\nFeatures\n. Presents most up-to-date methods of analysis and control algorithms for developing\npower electronic converters and power switching circuits;\n. Provides an invaluable reference for engineers designing power converters, commercial\npower supplies, control systems for motor drives, active filters, etc.;\n. Presents methods of analysis not available in other books. ","torrent":{"xt":"urn:btih:3fa1dd2bea613c07e1565ec309d59c1cfceba61f","amp;dn":"Digital+Power+Electronics+and+Applications+by+Fang+Lin+Luo%2C+Hong","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3fa1dd2bea613c07e1565ec309d59c1cfceba61f","infoHashBuffer":{"type":"Buffer","data":[63,161,221,43,234,97,60,7,225,86,94,195,9,213,156,28,252,235,166,31]},"announce":[],"urlList":[]}}