{"title":"Herta Muller - Nobel Prize in Literature, 2009 (9 books)","uid":15067033,"size":15182029,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3fe7927f7a25a4b6806cfc6ebdf41263c33ca380&amp;dn=Herta+Muller+-+Nobel+Prize+in+Literature%2C+2009+%289+books%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"workerbee","files":22,"time":1466786076,"description":"\nHERTA MÜLLER (b. 1953) is a German-Romanian novelist, poet, and essayist who won the 2009 Nobel Prize in Literature for her works revealing the harshness of life in Romania under the dictatorship of Nicolae Ceausescu.  The award cited Müller for depicting &quot;the landscape of the dispossessed&quot; with &quot;the concentration of poetry and the frankness of prose.&quot;\r\n\r\nMüller is noted for her works depicting the effects of violence, cruelty and terror, usually in the setting of Communist Romania under the repressive Nicolae Ceausescu regime which she has experienced herself.  Her style has been described as &quot;lively, poetic, [and] corrosive.&quot;\r\n\r\nHer first book, a collection of short stories titled NADIRS (1982), was censored by the Romanian government, but she won a following in Germany when the complete version of the book was smuggled out of the country.  Told from the perspective of a young girl, with all her fantasies and fears, the book depicts the confinement, corruption, intolerance, and oppression of a Swabian village in the Banat.  THE PASSPORT (1986) is a beautiful, haunting novel whose subject is a German village in Romania caught between the stifling hopelessness of Ceausescu's dictatorship and the glittering temptations of the West.\r\n\r\nWhen Müller openly criticized the communist dictatorship in the German media, she was prohibited from publishing and repeatedly summoned by the Securitate for interrogations, where she was confronted with absurd accusations, reviled as a prostitute, charged with black marketeering, and threatened with death.  She emigrated to Germany in 1987 and has lived in Berlin since.\r\n\r\nAlthough her circumstances had changed, her work continued to present and examine the formative experiences of her life: themes such as totalitarianism and exile pervade her work.  In TRAVELING ON ONE LEG (1989), she portrayed the difficulties of finding a foothold in strange surroundings.  Other novels followed about daily life in a dictatorship, difficult friendships, and the long arm of the secret police reaching into the private sphere, including THE FOX WAS EVER THE HUNTER (1992), a haunting depiction of surveillance, paranoia, and the corruption of the soul under totalitarianism; THE LAND OF GREEN PLUMS (1994), set in Romania at the height of Ceauescu's reign of terror, which received the 1998 International IMPAC Dublin Literary Award; and THE APPOINTMENT (1997), a fierce novel about a young Romanian woman's discovery of betrayal in the most intimate reaches of her life.\r\n\r\nHer much acclaimed novel THE HUNGER ANGEL (2009) portrays the deportation of Romania's German minority to gulags during the Soviet occupation of Romania for use as German forced labor.\r\n\r\n\r\nThe following books are in ePUB/Mobi and/or PDF format as indicated:\r\n\r\n* Appointment, The (Picador, 2002).  Translated by Michael Hulse and Philip Boehm. -- PDF + ePUB/Mobi\r\n\r\n* Art of Fiction, no. 225 (Paris Review, Fall 2014).  Interview by Philip Boehm. -- PDF\r\n\r\n* Fox Was Ever the Hunter, The (Metropolitan, 2016).  Translated by Philip Boehm. -- ePUB/Mobi\r\n\r\n* Hunger Angel, The (Metropolitan, 2012).  Translated by Philip Boehm. -- ePUB/Mobi\r\n\r\n* Land of Green Plums, The (Northwestern UP, 1998).  Translated by Michael Hofmann. -- PDF\r\n\r\n* Nadirs (Nebraska UP, 1999).  Translated with an Afterword by Sieglinde Lug. -- PDF\r\n\r\n* Nobel Lecture: Every Word Knows Something of a Vicious Circle (excerpted from Bettina Brandt and Valentina Glajar, eds., Herta Müller: Politics and Aesthetics [Nebraska UP, 2013]). -- PDF\r\n\r\n* Passport, The (Serpent's Tail, 2015).  Translated by Martin Chalmers, with a new Foreword by Paul Bailey. -- ePUB/Mobi\r\n\r\n* Traveling on One Leg (Northwestern UP, 1998).  Translated by Valentina Glajar and André Lefevere. -- PDF\r\n\r\n_____________________________________________________________________________\r\n\r\n\r\nCONTACT ME: You can reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\r\n                               \nhttps://pirates-forum.org/User-workerbee  \r\n\r\nPLEASE HELP TO SEED!  If you like these books and want others to have access to them, please help to seed for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:3fe7927f7a25a4b6806cfc6ebdf41263c33ca380","amp;dn":"Herta+Muller+-+Nobel+Prize+in+Literature%2C+2009+%289+books%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3fe7927f7a25a4b6806cfc6ebdf41263c33ca380","infoHashBuffer":{"type":"Buffer","data":[63,231,146,127,122,37,164,182,128,108,252,110,189,244,18,99,195,60,163,128]},"announce":[],"urlList":[]}}