{"title":"Four Year Strong - Enemy Of The World (2010)","uid":5859978,"size":125659050,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3ff64919aa0fa67937ac9f23e7b5cdd91b15810e&amp;dn=Four+Year+Strong+-+Enemy+Of+The+World+%282010%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"SirBarmy","files":11,"time":1285931056,"description":"This torrent brought to you by:\n  ___                            ___\n ||  |   ___         ___        ||  |\n || _|__/  _\\_______/  _\\_______|| _|\n ||(___(  (________(  (_________||((_)\n ||  |  \\___/       \\___/       ||  |\n ||  |         ___              ||  |\n || _|________/  _\\_____________|| _|\n ||(_________(  (_______________||((_)\n ||  |        \\___/             ||  |\n ||  |                          ||  |\n ||  |                          ||  | \n ||  |    &lt;~SirBarmy~&gt;          ||  |\n\n\n[Legal Notice]\n\nThis torrent is not for public use. It is for private use only by those the creator allows. The creator of this torrent is not responsible for your actions or misuse of this torrent if you should somehow acquire or decide to use this torrent in any form. Nor does the creator condone or suggest use of torrents to acquire copyrighted material in any form unless for private use by the creator.\n\nIf you should however choose to acquire this torrent by means that the creator does not suggest or can control, you yourself automatically agree that by using this torrent you do not hold the creator responsible for your actions and hereby are legally responsible for all your actions from here on out. By opening this file, or choosing to ignore this completely, and allowing this specific torrent to start you automatically agree to these terms.\n\nLegally the creator of this torrent, holding the original hard copy of this material, can create as many reproductions of that one and only specific item. The creator may not distribute it openly to the public, however may create a form of backup for the original material in case something should happen to the original hard copy.\n\nAgain, this torrent is for PRIVATE USE ONLY. Anyone who chooses to proceed is hereby cautioned and made aware that the creator is not responsible for your actions and you are legally bound by consent to adhere to this.\n\n[END]","torrent":{"xt":"urn:btih:3ff64919aa0fa67937ac9f23e7b5cdd91b15810e","amp;dn":"Four+Year+Strong+-+Enemy+Of+The+World+%282010%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ff64919aa0fa67937ac9f23e7b5cdd91b15810e","infoHashBuffer":{"type":"Buffer","data":[63,246,73,25,170,15,166,121,55,172,159,35,231,181,205,217,27,21,129,14]},"announce":[],"urlList":[]}}