{"title":"The Man With a Movie Camera (Dziga Vertov, 1929)","uid":3397904,"size":750257019,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:40041ff2ef1414654e8fcbbbe7288ab98f6d8aec&amp;dn=The+Man+With+a+Movie+Camera+%28Dziga+Vertov%2C+1929%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":3,"uploader":"IggyPop","files":8,"time":1129565331,"description":"AMG Review :\n    Soviet director Dziga Vertov's experimental film grew out of his belief, shared by his editor, Elizaveta Svilova (who was also his wife), and his cinematographer, Mikhail Kaufman (also his brother), that the true goal of cinema should be to present life as it is lived. To that end, the filmmakers offer a day-in-the-life portrait of a city from dawn until dusk, though they actually shot their footage in several cities, including Moscow, Kiev, and Odessa. After an opening statement, there are no words in the film (neither voice-over nor titles), but the dazzling imagery, kinetically edited, is eloquent enough. This is a celebration of the modern city that concentrates on its buildings and machinery more than its citizens, and it's possible to read its upbeat tone as a vindication of Soviet state progress, though much of the film's ultimate impact is universal. The Image Entertainment DVD edition of the film offers a musical score composed from notes left by the director, which adds greatly to the impact of the film.\n    As a document of &quot;pure&quot; cinema that favors the visual over the aural, The Man With a Movie Camera is a tremendously exciting work that soars over its limitations as a product of the Soviet state system. Director Dziga Vertov's claim that narrative cinema was inadequate to present real life is certainly arguable. But the assertion that this film is an unmediated presentation of daily life is undercut by the film's optical tricks and, more importantly, by its stinting of any portrayal of poverty, crime, and other social ills ? not surprising given the heavy hand of the party censors. Nevertheless, The Man With a Movie Camera is so energetically conceived and executed, with dozens of memorable images flying by almost more quickly than you can absorb them, that it's easy to cast aside the political limitations imposed on the project and enjoy it as one of the great film odes to 20th century urban life. The Image Entertainment DVD edition of the film is highly recommended; it contains a musical score that seems to anticipate Philip Glass, as well as astute commentary by scholar Yuri Tsivian on an alternate audio track. - Tom Wiener\n  \n***********************************************************************************\n\nwww.freakyflicks.tk\n\nSEED AS LEAST AS MUCH AS YOU HAVE DOWNLOADED...PLEASE!\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE'\n\n... simply search for 'freakyflicks' \n*************************************** \n************** FREAKYFLICKS ************* \n***************************************","torrent":{"xt":"urn:btih:40041ff2ef1414654e8fcbbbe7288ab98f6d8aec","amp;dn":"The+Man+With+a+Movie+Camera+%28Dziga+Vertov%2C+1929%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40041ff2ef1414654e8fcbbbe7288ab98f6d8aec","infoHashBuffer":{"type":"Buffer","data":[64,4,31,242,239,20,20,101,78,143,203,187,231,40,138,185,143,109,138,236]},"announce":[],"urlList":[]}}