{"title":"Dr. Dolittle(1998)DVDRip.AC3(ENG)-DROCK","uid":6240504,"size":733191365,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:400d5a7726954e8f8101db3cc46d0074edb487e9&amp;dn=Dr.+Dolittle%281998%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":1,"uploader":"drock232","files":-1,"time":1300045914,"description":"Betty Thomas directed this adaptation of the classic children\\'s stories by Hugh Lofting (1886-1947), updating the original concepts into the present day. When noted surgeon Dr. John Dolittle (Eddie Murphy) swerves his car to avoid hitting a dog, he hits his head on the windshield, triggering his long-dormant gift for holding conversations with animals. Friends, associates and his wife Lisa (Kristen Wilson), all express concern, but Dr. Dolittle is happy as he takes on new animal clients. Soon Dolittle\\'s clinic becomes a haven for talking rats, birds, and other assorted members of the animal kingdom, and Dolittle\\'s new four-legged and furry friends, in turn, teach him a few things about being human. The effects seamlessly combine Jim Henson Creature Shop animatronics, computer graphics, and real animals, but some viewers might yearn for a return of the Great Pink Sea Snail and Lofting\\'s other imaginative creatures. The 1967 20th Century Fox musical Dr. Dolittle starred Rex Harrison in a strange storyline that began with Dolittle escaping from a lunatic asylum and leaving the Victorian village Puddleby-by-the-Marsh, England, to search the South Seas for the Great Pink Sea Snail. Along the way, he gathered diverse Dolittle denizens and animal anomalies, including the Giant Moon Moth and the famed, two-headed Pushmi-Pullyu. The earlier film spawned the Oscar-winning popular song success, \\&quot;Talk To The Animals,\\&quot; along with numerous now-forgotten toys, books, and collectibles.\n\nRipped with Handbrake.\n\nLength: 1 Hour 25 Minutes\n\nFile Type:","torrent":{"xt":"urn:btih:400d5a7726954e8f8101db3cc46d0074edb487e9","amp;dn":"Dr.+Dolittle%281998%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"400d5a7726954e8f8101db3cc46d0074edb487e9","infoHashBuffer":{"type":"Buffer","data":[64,13,90,119,38,149,78,143,129,1,219,60,196,109,0,116,237,180,135,233]},"announce":[],"urlList":[]}}