{"title":"Girl in a Band: A Memoir[MyebookShelf]","uid":11720048,"size":1597782,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:407782982221153054e93f4fcff39ea608dcc81b&amp;dn=Girl+in+a+Band%3A+A+Memoir%5BMyebookShelf%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"MyeBookShelf","files":3,"time":1424777976,"description":"Girl in a Band: A Memoir[MyebookShelf]\n[img]http://s12.postimg.org/y3efn40x5/Girl_in_a_Band_A_Memoir.jpg[/img]\nISBN: 0062295896 | 2015 | EPUB | 288 pages | 2 MB\n\nFor many, Kim Gordon, vocalist, bassist and founding member of Sonic Youth, has always been the epitome of cool.\n\nSonic Youth is one of the most influential and successful bands to emerge from the post-punk New York scene, and their legacy continues to loom large over the landscape of indie rock and American pop culture. Almost as celebrated as the band's defiantly dissonant sound was the marriage between Gordon and her husband, fellow Sonic Youth founder and lead guitarist Thurston Moore. So when Matador Records released a statement in the fall of 2011 announcing that-after twenty-seven years-the two were splitting, fans were devastated. In the middle of a crazy world, they'd seemed so solid.\nWhat did this mean? What comes next? What came before?\n\nIn Girl in a Band, the famously reserved superstar speaks candidly about her past and the future. From her childhood in the sunbaked suburbs of Southern California, growing up with a mentally ill sibling who often sapped her family of emotional capital, to New York's downtown art and music scene in the eighties and nineties and the birth of a band that would pave the way for acts like Nirvana, as well as help inspire the Riot Grrl generation, here is an edgy and evocative portrait of a life in art.\nExploring the artists, musicians, and writers who influenced Gordon, and the relationship that defined her life for so long, Girl in a Band is filled with the sights and sounds of a pre-Internet world and is a deeply personal portrait of a woman who has become an icon","torrent":{"xt":"urn:btih:407782982221153054e93f4fcff39ea608dcc81b","amp;dn":"Girl+in+a+Band%3A+A+Memoir%5BMyebookShelf%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"407782982221153054e93f4fcff39ea608dcc81b","infoHashBuffer":{"type":"Buffer","data":[64,119,130,152,34,33,21,48,84,233,63,79,207,243,158,166,8,220,200,27]},"announce":[],"urlList":[]}}