{"title":"Human Trafficking (2005.DVDRip.XviD)","uid":3943793,"size":1478384282,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4079adcaa72aaf27e077ba4d9f52dca7d1ee0d0d&amp;dn=Human+Trafficking+%282005.DVDRip.XviD%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":2,"uploader":"VeganFreak","files":-1,"time":1198330678,"description":"Title.............: Human Trafficking\nSource............: DVD retail\nAir Date..........: 2005/10/24\nDVD Release Date..: 2006/05/02\nRelease Date......: 2006/04/22\n\nIMDb..............: http://www.imdb.com/title/tt0461872\nIMDb Rating.......: 7.7/10 (247 votes)\nVideo Codec.......: XviD\nVideo Bitrate.....: 986 kb/s\nVideo Framerate...: 23.976\nResolution........: 576x320 (1.80:1)\n\nAudio Codec.......: MP3 VBR\nAudio Bitrate.....: 116 kb/s\n\nDirected.by.......: Christian Duguay\nLanguage..........: English\nGenre.............: Crime / Drama\nRuntime...........: 177 mins\nSize..............: Click on &quot;Files: 4&quot;\nSubs..............: None\n\nSummary:\n\nHundreds of thousands of young women have vanished from their everyday lives-forced by violence into a hellish existence of brutality and prostitution. They're a profitable commodity in the multi-billion-dollar industry of modern slavery. The underworld calls them human traffic...  Written by Echo Bridge Home Entertainment\n\nIn Prague, Czech Republic, the single mother Helena is seduced by a successful handsome man and travels with him to spend a weekend in Vienna, Austria; in Kiev, Ukraine, the sixteen-year-old Nadia is selected by a model agency and travels to the United States with the other selected candidates; in Manila, Philippines, the twelve-year-old American tourist Annie Gray is abducted in front of her parents. In common, the girls become victims of a powerful international network of sex traffickers leaded by the powerful Sergei Karpovich. In New York, after the third death of young Eastern European prostitutes, the obstinate Russian-American NYPD agent Kate Morozov convinces the Immigration and Customs Enforcement Chief Bill Meehan to hire her, promising him that she would fight against this type of crime and that he would not regret. Written by Claudio Carvalho, Rio de Janeiro, Brazil\n\nWhen a sixteen-year-old girl from the Ukraine, a single mother from Russia, an orphaned seventeen-year-old girl from Romania, and a twelve-year-old American tourist become the victims of international sex slave traffickers, a specialized team of Immigration and Customs Enforcement (ICE) struggles to expose the worldwide network that has enslaved them. ICE agent Kate Morozov knows the horror of sexual exploitation first-hand and is dedicated to dismantling the network and bringing the ring's kingpin to justice. From a torture chamber in Queens to the flesh-peddlers of Russia, the hunt is on as the fates of relentless ICE agents, the ruthless traffickers and their defenseless victims collide in a powder keg conspiracy of global proportions.","torrent":{"xt":"urn:btih:4079adcaa72aaf27e077ba4d9f52dca7d1ee0d0d","amp;dn":"Human+Trafficking+%282005.DVDRip.XviD%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4079adcaa72aaf27e077ba4d9f52dca7d1ee0d0d","infoHashBuffer":{"type":"Buffer","data":[64,121,173,202,167,42,175,39,224,119,186,77,159,82,220,167,209,238,13,13]},"announce":[],"urlList":[]}}