{"title":"Martyrs and Murderers: The Guise Family and the Making of Europe","uid":15751578,"size":1738292,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:409ac1baa5bc67974427793d8b6ad2172c63f003&amp;dn=Martyrs+and+Murderers%3A+The+Guise+Family+and+the+Making+of+Europe&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"marty14","files":1,"time":1473035141,"description":"Martyrs &amp; Murderers: The Guise Family and the Making of Europe - Stuart Carroll [epub]\r\n\r\nMartyrs and Murderers tells the story of three generations of treacherous, bloodthirsty power-brokers. One of the richest and most powerful families in sixteenth-century France, the House of Guise played a pivotal role in the history of Europe. Among the staunchest opponents of the Reformation, they whipped up religious bigotry throughout France. They overthrew the king, ruled Scotland for nearly 20 years through Mary Queen of Scots, plotted to invade England and overthrow Elizabeth I, and ended the century by unleashing the bloody Wars of Religion, before succumbing in a counter-revolution that made them martyrs for the Catholic cause.\r\n\r\nThe history of the Guise family is sensational but true. Though parts of the story are familiar - such as their crucial role in the murder of 4,000 Protestants in the infamous Massacre of Saint Bartholomew - the full scope of their influence has never before been told. Stuart Carroll unravels the legends about this cultivated, charismatic, and violent dynasty, and challenges traditional assumptions about one of Europe's most turbulent eras","torrent":{"xt":"urn:btih:409ac1baa5bc67974427793d8b6ad2172c63f003","amp;dn":"Martyrs+and+Murderers%3A+The+Guise+Family+and+the+Making+of+Europe","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"409ac1baa5bc67974427793d8b6ad2172c63f003","infoHashBuffer":{"type":"Buffer","data":[64,154,193,186,165,188,103,151,68,39,121,61,139,106,210,23,44,99,240,3]},"announce":[],"urlList":[]}}