{"title":"russian Martial Arts - Systema - Holds Releases And Attacks","uid":5613505,"size":837900288,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:40cfdf34070d742e6f4349ccba66d2c4dd3a811f&amp;dn=russian+Martial+Arts+-+Systema+-+Holds+Releases+And+Attacks&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"billya181","files":-1,"time":1275980094,"description":"Vladimir shows you a ton of ways the Russian &quot;Spec Op&quot; agents get out of holds - all of them very unique. Even veteran martial artists from other styles &quot;ooh&quot; and &quot;aah&quot; when they see these moves!\n\nLike when someone grabs you from behind and puts the deadly and highly-feared &quot;Figure 4&quot; choke hold around your neck. Vladimir shows you how to &quot;pop&quot; out of it with on simple move that none of the Oriental martial artists have ever shown you before! You just do this one thing that your opponent doesn't expect -  And it Automatically Breaks His Grip On You!\n\nOr, instead of breaking his grip, you can make one other super-simple move that drops him to the ground!\n\nA continuation of this move nails him in the face and guarantees that he's down for the count! You'll also learn:\n\n    * Whip-like motions that maximize the power in your natural &quot;body mechanics&quot; much better than regular punches could ever hope to do.\n    * Nearly a dozen really nasty, painful, and lightning fast takedowns that start the moment your opponent makes the stupid mistake of gripping your arm!\n    * If your opponent grabs both of your wrists, Vladimir shows you a wide variety of ways to nail him and drop him like a sack of potatoes! \n\nWith one of the moves he shows you, it's so devastating, you can actually break your attacker's pelvis - and he'll be instantly paralyzed! Other moves break the elbow, dislocate the shoulder, and (in general) put your opponent in an incredible amount of excruciating pain!\n\nSometimes on the street, your attacker will grab you by the hair on the top of your head. Vladimir shows you where to grab your opponent's hair in the precise spot on his head that's the most painful of all!\n\nVladimir also shows you simple &quot;pressure points&quot; that instantly force your opponent to release his hold on you the moment you apply pressure to the right spot! You can defeat even a bigger, stronger opponent with practically - No Effort On Your Part!\n\nVladimir also shows you:\n\n    * Where to hit an attacker on this back to cause debilitating pain.\n    * Nasty things you can do to his ear.\n    * Very easy &quot;kill&quot; moves to employ on his neck (when you absolutely have to kill).\n    * How to &quot;preempt&quot; you opponent's actions, especially when he's grabbed you by the shirt and he's ready to punch you in the face!\n    * Surprising kicks that no one expects, but which will put any attacker down in a heartbeat!\n    * Fascinating, clever and &quot;dirty&quot; little tricks that enable you to escape the &quot;guard&quot; position when fighting on the ground. You've never seen these seen these on any other training video, because only the Russian &quot;Systema&quot; is ruthless enough to use them!\n    * Several ways to get out of various types of arms locks. One of them is a &quot;chain reaction&quot; move that knocks your opponent in the head, even though you have &quot;no room&quot; to move! (If you like &quot;dirty&quot; tricks, you'll really like this one!)\n    * And much, much more. ","torrent":{"xt":"urn:btih:40cfdf34070d742e6f4349ccba66d2c4dd3a811f","amp;dn":"russian+Martial+Arts+-+Systema+-+Holds+Releases+And+Attacks","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40cfdf34070d742e6f4349ccba66d2c4dd3a811f","infoHashBuffer":{"type":"Buffer","data":[64,207,223,52,7,13,116,46,111,67,73,204,186,102,210,196,221,58,129,31]},"announce":[],"urlList":[]}}