{"title":"Vampire Weekend - Studio Discography 2008-2013 [FLAC]","uid":8517703,"size":892684861,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:40cfd383e45d0a7ad85773fdb84a73d2cebc27f9&amp;dn=Vampire+Weekend+-+Studio+Discography+2008-2013+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":2,"uploader":"rudown78","files":90,"time":1369802534,"description":"Vampire Weekend - Studio Discography 2008-2013 [FLAC]\n\n\nDescribing their sound as &quot;Upper West Side Soweto,&quot; New York City's Vampire Weekend mix preppy, well-read indie rock with joyful, Afro-pop-inspired melodies and rhythms. Ezra Koenig, Chris Baio, Rostam Batmanglij, and Chris Tomson formed the band early in 2006, when they were finishing up their studies at Columbia University. Taking their name from a movie Koenig made during his freshman year, the band started out by playing gigs at the university's literary societies and at parties. Word spread about Vampire Weekend's unique sound and lyrics (&quot;Oxford Comma,&quot; one of the band's earliest songs, referred to comma use in a list of three items), buoyed by the band's self-released EPs, which they recorded in locations spanning from their Columbia dorm rooms to a family barn. The buzz around Vampire Weekend reached a peak in 2007: that summer, the band embarked on its biggest tour yet, made several appearances at that year's CMJ Music Marathon, and signed with XL Records that fall. The Mansard Roof EP was Vampire Weekend's debut release for the label, followed by their self-titled first album early in 2008. Debuting within the Top 20 of both the American and U.K. album charts, the eponymous record proved to be one of the year's most popular indie releases. Vampire Weekend celebrated its success by hitting the road for the better part of two years, and keyboardist Rostam Batmanglij gathered additional accolades by releasing an album with Discovery, his electro side project with Ra Ra Riot's Wes Miles. Amidst this flurry of activity, Vampire Weekend found time to return to the studio for the creation of Contra, which arrived in early 2010. Late in 2011, the band returned to the studio to work on its third album. As sessions progressed, the group worked with Ariel Rechtshaid in his home studio; he co-produced the album with Batmanglij. Early in 2013, Vampire Weekend played a couple of songs from the album, &quot;Diane Young&quot; and &quot;Ya Hey,&quot; at that year's SXSW festival. Modern Vampires of the City was released that May.\n\n\n2008 - Vampire Weekend\n2010 - Contra\n2013 - Modern Vampires of the City\n\n\nAlbum artwork and audiochecker logs are included. Enjoy!!!!!!!!!!!!!!!!!","torrent":{"xt":"urn:btih:40cfd383e45d0a7ad85773fdb84a73d2cebc27f9","amp;dn":"Vampire+Weekend+-+Studio+Discography+2008-2013+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40cfd383e45d0a7ad85773fdb84a73d2cebc27f9","infoHashBuffer":{"type":"Buffer","data":[64,207,211,131,228,93,10,122,216,87,115,253,184,74,115,210,206,188,39,249]},"announce":[],"urlList":[]}}