{"title":"The.Chronicles.of.Riddick.Assault.on.Dark.Athena.Repack-R.G.Mech","uid":10665757,"size":4567550416,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4116d80f4935f69f10f4c18f4d7a735a1070338b&amp;dn=The.Chronicles.of.Riddick.Assault.on.Dark.Athena.Repack-R.G.Mech&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"Taker009","files":-1,"time":1406790968,"description":"The.Chronicles.of.Riddick.Assault.on.Dark.Athena.Repack-R.G.Mechanics\n\n\n\n\n\nRelease Info:\n\nYear: 2009\nGenre: Action (Shooter) / 3D / 1st Person / 3rd Person / Stealth\nDeveloper: Starbreeze Studios and Tigon Studios\nPublisher: Atari\nPublication Type: RePack\nGame Language: Eng |Rus\nVoiceLanguage: Eng |Rus\nCrack: Not required\n\n\n\n\nSystem Requirements:\n\nOperating system: Windows XP, Windows Vista, Windows 7\nProcessor: Intel Pentium D 805 or AMD Athlon X2 3800+\nMemory: 1 GB (XP) / 2 GB (Vista)\nVideo: Ati Radeon HD 2600 XT or Nvidia Geforce 6800 Ultra\nSound Card: Sound device compatible with DirectXÂ® 9.0\nFree hard drive space: 9 GB\n\n\nGame information:\n\nThe collection contains both the original Â«The Chronicles of Riddick:\nEscape From Butcher BayÂ», and the continuation of this amazing stealth\naction Â«Chronicles of Riddick: Assault on Dark AthenaÂ»! In the Â«Escape\nFrom Butcher BayÂ» you are in prison maximum security &quot;Butcher BayÂ»\n(Butcher Bay), located on a remote penal colony for extraterrestrial.\nNo prisoner had never been able to escape from there. Institution\nconsists of several wings to the rising level of protection, and\nunderground mine development inhabit dangerous aggressive creatures.\n\nThe main hero of the game is Richard B. Riddick, &quot;played&quot; and announced\nthat a key character of both films, which ushered in the franchise - Vin\nDiesel. Riddick caught a bounty hunter William J.. Jones, is a psychopath\nkiller, who was recently transferred to Butcher Bay, and who intends to\nuse all means available to it for a long time not to linger. To do this\nhe will have to pass three circles of hell that terrible institution\n(zone single-max, double-max, and finally triple-max, in which prisoners\nwere placed in cryogenic sleep and wake up every day just two minutes to\nperform the necessary procedures), as well as to meet with the sinister\ninhabitants of the sewers and mines.\n\nThe plot Â«Assault on Dark AthenaÂ» begins immediately after the events of\nthe first part. It so happened that Jones, who brought the original\nRiddick in &quot;Butcher Bay&quot;, and helped him escape from there. On his ship,\nin a state of suspended animation, they are tightened to &quot;Dark AthenaÂ»\n(Dark Athena) - a giant ship of mercenaries controlled Gale Revas and\nher Deputy Skinner. Riddick avoids capture, then he will try to free\nthe captives, including former captain of the &quot;Dark Athena&quot;, and also\nhelp the little girl Lynne, hiding in ventilation shafts. And when Riddick\nafter the ordeal finally able to leave the evacuation shuttle scored the\neyeballs automated soulless drone ship, fate once again causing him a\nheavy blow ... Does he have to go back to &quot;Dark Athena&quot;?\n\n\nGame Features:\n\nYou have to go more than 30 gaming scenes of varying complexity in three\nareas of the prison Butcher Bay and the ship Dark Athena.\nChoose your own path to freedom: wade in dark corridors and narrow tunnels,\nclimb stairs, or enter a fierce exchange of fire in open spaces.\nRiddick withstand more than 20 types of enemies that will appear as the\ngame progresses. Will have to fight not only to guard the prison,\nbut prisoners, robots.\nEscape to freedom hero help 15 weapons - from the Â«originalÂ» knives,\nhooks up to assault rifles, shotguns and explosives.\n\nRepack Features:\n\nThe Chronicles of Riddick: Assault on Dark Athena\nVersion of the game - 1.01\nDo not cut / recoded\nAmateur crack from ENPY Studio v1.05","torrent":{"xt":"urn:btih:4116d80f4935f69f10f4c18f4d7a735a1070338b","amp;dn":"The.Chronicles.of.Riddick.Assault.on.Dark.Athena.Repack-R.G.Mech","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4116d80f4935f69f10f4c18f4d7a735a1070338b","infoHashBuffer":{"type":"Buffer","data":[65,22,216,15,73,53,246,159,16,244,193,143,77,122,115,90,16,112,51,139]},"announce":[],"urlList":[]}}