{"title":"The Pineapple Thief - Magnolia  mp3  256k   2014","uid":11023696,"size":102099120,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4199792ac080bf7d8664d528de0840eab48a9c02&amp;dn=The+Pineapple+Thief+-+Magnolia++mp3++256k+++2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"analogkid6103","files":13,"time":1410636539,"description":"The Pineapple Thief - Magnolia  mp3  256k   2014 What we got...The Pineapple Thief Magnolia 2014 (Size: 97.37 MB)\n  \t\t\nDescription\n\nThe Pineapple Thief is a progressive/indie rock band, the musical vision of Bruce Soord.Founder Bruce Soord (formerly with Vulgar Unicorn) started The Pineapple Thief (TPT) as an outlet for his music back in 1999. Bruce released the debut Abducting the Unicorn on Cyclops records - this created enough interest to convince Bruce that perhaps TPT was here to stay, quickly establishing a small but fanatical fan base. Bolstered by critical plaudits and support from fans, Bruce returned to the Dining Room studios to work on the second, and to many, the break through TPT album 137.\n\nThe Pineapple Thief live at the Half Moon, London.During this time, several major labels started to take an interest, causing a delay in the release which arrived over two years after the debut. However it was probably the third album, Variations on a Dream that gave TPT the boost they needed, reaching out to yet more people all over the world, by which point TPT were consistently the top sellers on their label, Cyclops.\n\nAfter this release in the spring of 2002 Bruce decided to form a band to take his music to the fans. The band consisted of his close musical friends - former university band mate Jon Sykes on bass, Wayne Higgins on guitars, Matt O'Leary on keyboards and Keith Harrison on drums. Matt has since left but Steve Kitch (who co-produced and mixed 10 Stories Down) has since joined to play the keyboards on stage.\n\nThe band were signed to Kscope, a division of Snapper Music in late 2007.Wayne Higgins left the band in March 2008, but the group continues as a four piece live act.\n\nNew album Tightly Unwound was released on 19 May, 2008 and was marked by launch shows at Witchwood in Manchester on 17 May, 2008 and at the Water Rats Theatre in London on 22 May, 2008. The same day of the album's release, a mini-documentary filmed at The Half Moon, London, was released through the band's website, featuring interviews and two exclusive live tracks.\n\nSince their debut album, the band has sold more than 35,000 records.Their latest album Someone Here Is Missing was launched at their show at Bush Hall, London on May 19th 2010.\n\nThe band entered the studio in January 2012 to record their ninth album, which included (for the first time) a 22 piece orchestra and choir. &quot;All the Wars&quot; was released in September 2012 and followed by a UK tour.\n\nOn 8 February 2014 the band announced that Dan Osborne had replaced Keith Harrison on drums, the band's first lineup change in nearly 10 years.\n\nThe Pineapple Thief's tenth studio album, titled 'Magnolia' is due to be released on 15 September 2014.\n1. Simple As That\n2. Alone at Sea\n3. Don't Tell Me\n4. Magnolia\n5. Seasons Past\n6. Coming Home\n7. The One You Left to Die\n8. Breathe\n9. From Me\n10. Sense of Fear\n11. A Loneliness\n12. Bond\nGenre: Progressive\nSubgenre: Progressive Rock\nBitrate: 256 k","torrent":{"xt":"urn:btih:4199792ac080bf7d8664d528de0840eab48a9c02","amp;dn":"The+Pineapple+Thief+-+Magnolia++mp3++256k+++2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4199792ac080bf7d8664d528de0840eab48a9c02","infoHashBuffer":{"type":"Buffer","data":[65,153,121,42,192,128,191,125,134,100,213,40,222,8,64,234,180,138,156,2]},"announce":[],"urlList":[]}}