{"title":"Girl Genius (Web Comic) - Complete through 2014 {WebComixFan}","uid":11892992,"size":400988823,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:41b9849e9a5bb01969480d46195d067a4170d40e&amp;dn=Girl+Genius+%28Web+Comic%29+-+Complete+through+2014+%7BWebComixFan%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"WebComixFan","files":23,"time":1431050854,"description":"&quot;GIRL GENIUS&quot; Web Comic\n\n&quot;Girl Genius&quot; (girlgeniusonline.com) by Phil and Kaja Foglio features a female lead character, Agatha Heterodyne, in an alternate-history Victorian-style steampunk setting.  (In deference to the fact that some of its more fantastic elements don't fit with what's typically thought of as steampunk, Kaja coined the term &quot;gaslamp fantasy&quot; to describe the series.)  The comic has won five WCCA awards, including the 2008 award for Outstanding Comic, and has thrice won the Hugo Award for Best Graphic Story.  The comic's tagline is, &quot;Adventure, Romance, MAD SCIENCE!&quot;\n\nThis torrent collects &quot;Girl Genius&quot; comics from the strip's beginning in 2002 through the end of &quot;Act 2, Volume 1&quot; at the end of 2014.  Though the comics are grouped by volume in the CBR files, just as they are in the published collections of the comic, the CBRs are NOT scans of the books; all the comics in this torrent were downloaded directly from the girlgeniusonline.com Web site.  Some editing has been done.  Where an oversized &quot;two-page&quot; image appears in the online archive as two separate single-page images, for example, the halves have been recombined into a single image.  Pages which are simple advertisements, as for a Kickstarter promotion, have been removed; other &quot;filler&quot; content, including side stories, &quot;pinup&quot; pages and paper doll pages, has been moved to the end of the appropriate volume, to avoid disruption of the main story flow.\n\nAlso included in this torrent are epub versions of the three novelizations thus far published of the &quot;Girl Genius&quot; comic's storyline.  They were not created by me, but were obtained from a torrent originally uploaded by &quot;nhubi.&quot;","torrent":{"xt":"urn:btih:41b9849e9a5bb01969480d46195d067a4170d40e","amp;dn":"Girl+Genius+%28Web+Comic%29+-+Complete+through+2014+%7BWebComixFan%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41b9849e9a5bb01969480d46195d067a4170d40e","infoHashBuffer":{"type":"Buffer","data":[65,185,132,158,154,91,176,25,105,72,13,70,25,93,6,122,65,112,212,14]},"announce":[],"urlList":[]}}