{"title":"Teach Yourself Danish Complete Course","uid":5229749,"size":138678718,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:41c6cf2c1a2145bf09b2e79e953df3c4d47937b7&amp;dn=Teach+Yourself+Danish+Complete+Course&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"123dutch","files":1,"time":1261277798,"description":"Teach Yourself Danish Complete Course\nAuthor: Bente Elsworth\nPublisher: Hodder and Stoughton Edu.\nPublication date: 1994/2004\n\nFormat / Quality: pdf,mp3-&gt;rar / VBR mono\nSize: 33.8MB (Book) + 102MB (CD version)\n\nTeach Yourself Danish is the course for anyone who wants to progress quickly from the basics to understanding, speaking and writing Danish with confidence. Although aimed at those with no previous knowledge, it is equally suitable for anyone wishing to brush up existing knowledge for a holiday or business trip. Key structures and vocabulary are introduced in 18 thematic units progressing from introducing yourself and dealing with everyday situations to talking about work and shopping for presents. Teach Yourself Danish follows the journey of George Wilson, a businessman, who travels to Denmark to establish a market there for his products. He has been invited to stay with his friends who live in Copenhagen. The emphasis is on communication throughout with important language structures introduced through dialogues on the accompanying recording. There are plenty of exercises to practise the language as it is introduced and tips throughout to help with grammar. Cultural information sections give useful advice and information for anyone planning a trip to Denmark.\n\nThe new edition has been updated and is now accompanied by a double CD with extra audio material. Popular features of the previous edition have been retained:\nEnglish-Danish vocabulary\nglossary of grammatical terms\na 'taking it further' section to direct learners to further sources of real Danish\nBente Elsworth was born in Randers, Demark. She has lived in England since 1968 and has a degree in Russian from the University of London. She has many years of experience in teaching Danish at the University of East Anglia and this has made her aware of the particular problems that English speakers face when learning Danish. This knowledge forms the basis of the approach adopted in Teach Yourself Danish.","torrent":{"xt":"urn:btih:41c6cf2c1a2145bf09b2e79e953df3c4d47937b7","amp;dn":"Teach+Yourself+Danish+Complete+Course","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41c6cf2c1a2145bf09b2e79e953df3c4d47937b7","infoHashBuffer":{"type":"Buffer","data":[65,198,207,44,26,33,69,191,9,178,231,158,149,61,243,196,212,121,55,183]},"announce":[],"urlList":[]}}