{"title":"Netter's Advanced Head and Neck Flash Cards, Updated [PDF] [Stor","uid":11144470,"size":306049944,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:41d7fb565e793c82fd21c0276421fb94a84bfdee&amp;dn=Netter%27s+Advanced+Head+and+Neck+Flash+Cards%2C+Updated+%5BPDF%5D+%5BStor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"0xmovva","files":2,"time":1412227592,"description":"Author: Neil S. Norton PhD \nSeries: Netter Basic Science\nCards: 264 pages\nPublisher: Saunders; Flc Crds U edition (May 15, 2012)\nLanguage: English\nISBN-10: 1455745235\nISBN-13: 978-1455745234\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.Don't hesitate to PM me if you have any questions or problem with the download,as comments on torrents are easy to miss. Please allow a couple seconds forthe seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n________________________________________________________________________________\n\n\nWith its many complex structures, the anatomy of the head and neck is one of the most challenging areas of human anatomy to study and master. These 248 flash cards are the perfect streamlined review to help you learn head and neck anatomy as well as common diseases and disorders of this region easily, efficiently, and at your own rate of study. Netter's Advanced Head and Neck Anatomy Flash Cards is your perfect quick resource for a fast and fun review at any stage of your healthcare career.\nTest and teach yourself at your own pace.\nLearn visually using many of Netter's famous anatomy and pathology illustrations of the head, neck, and special senses.\nGet clinically relevant knowledge with additional diagnostic images and advanced accompanying text and tables.\nPre-punched holes make it easy to carry selected groups of cards with you.","torrent":{"xt":"urn:btih:41d7fb565e793c82fd21c0276421fb94a84bfdee","amp;dn":"Netter%27s+Advanced+Head+and+Neck+Flash+Cards%2C+Updated+%5BPDF%5D+%5BStor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41d7fb565e793c82fd21c0276421fb94a84bfdee","infoHashBuffer":{"type":"Buffer","data":[65,215,251,86,94,121,60,130,253,33,192,39,100,33,251,148,168,75,253,238]},"announce":[],"urlList":[]}}