{"title":"Trivial Pursuit Genus Edition Deluxe","uid":6484858,"size":10872192,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:42ce4ae5eaf9d5d63b05956c6f5f77756be2f4ae&amp;dn=Trivial+Pursuit+Genus+Edition+Deluxe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"gatasalvaje","files":-1,"time":1308669246,"description":"Ã‚Â¿CuÃƒÂ¡l es el juego de preguntas favorito en todo el mundo? Sin duda alguna, Trivial Pursuit, que, por cierto, no fue ningÃƒÂºn asunto trivial para sus creadores, Scott Abbott y Chris Haney. Una discusiÃƒÂ³n amistosa entablada en 1979 sobre quiÃƒÂ©n era el mejor jugador les llevÃƒÂ³ a crearlo. TardÃƒÂ³ cuatro aÃƒÂ±os en &quot;causar sensaciÃƒÂ³n&quot; y, a lo largo de los aÃƒÂ±os, han ido apareciendo numerosas versiones de esta &quot;fiesta metida en una caja&quot;. La ÃƒÂºltima de ellas es Trivial Pursuit Genus Edition Deluxe. Si has jugado alguna vez a Trivial Pursuit en cualquiera de sus formatos (tablero, DVD o videojuego para ordenador), Trivial Pursuit Genus Edition Deluxe te resultarÃƒÂ¡ familiar ya que se aplica la misma fÃƒÂ³rmula bÃƒÂ¡sica. El progreso viene determinado por tu capacidad para contestar correctamente preguntas sobre cultura y conocimientos generales, y eso que hay unas cuantas para contestar... 2.000 para ser exactos. El juego ofrece tres modos diferentes: Solitario, Contrarreloj y de 1 a 4 jugadores. En Solitario, tu objetivo consiste en terminar el juego contestando el menor nÃƒÂºmero posible de preguntas. En Contrarreloj, el mejor modo si se prefieren rondas mÃƒÂ¡s cortas de juego, tienes que contestar las preguntas lo mÃƒÂ¡s rÃƒÂ¡pido posible. Por ÃƒÂºltimo, en el modo con entre 1 y 4 jugadores, que es una partida personalizada, tÃƒÂº seleccionas el nÃƒÂºmero de jugadores que participa y estableces las normas para cada ronda. Como en el caso del Trivial Pursuit original, el juego tiene lugar en un tablero en forma de rueda compuesto por un anillo exterior con seis radios unidos a una casilla central. Las casillas a lo largo de estos caminos tienen un cÃƒÂ³digo de colores segÃƒÂºn las distintas categorÃƒÂ­as: GeografÃƒÂ­a (azul), EspectÃƒÂ¡culos (rosa), Historia (amarillo), Arte y Literatura (marrÃƒÂ³n), Ciencia y Naturaleza (verde) y Deportes y Pasatiempos (naranja). Se lanza el dado para moverse por el tablero y se muestran los posibles movimientos. Luego, basta con hacer clic en el destino preferido. En el extremo exterior de los radios se encuentran las casillas de los quesitos, uno por categorÃƒÂ­a. Tu objetivo consiste en rellenar los seis huecos para quesitos de tu ficha de puntuaciÃƒÂ³n con quesitos de diferentes colores contestando la pregunta apropiada. Cuando lo hayas conseguido, vuelve a la casilla central para contestar la pregunta final y ganar. Ã‚Â¿QuÃƒÂ© tipo de preguntas se formulan? AquÃƒÂ­ van dos ejemplos: Pregunta: &quot;Ã‚Â¿QuiÃƒÂ©n lanzaba cachorros hasta matarlos desde los muros del Kremlin?&quot; Respuestas posibles: &quot;IvÃƒÂ¡n el Terrible&quot;, &quot;BrÃƒÂ©zhnev&quot; o &quot;Jrushchov&quot; Respuesta correcta: &quot;IvÃƒÂ¡n el Terrible&quot; O... Pregunta: &quot;Ã‚Â¿En quÃƒÂ© deporte se disputa la Stanley Cup?&quot; Respuestas posibles: &quot;Hockey sobre hielo&quot;, &quot;Croquet&quot; o &quot;Curling&quot; Respuesta correcta: &quot;Hockey sobre hielo&quot; En todos los casos se ofrecen tres respuestas posibles. Elige la correcta para ganar puntos. Si respondes bien varias respuestas consecutivas, recibes una bonificaciÃƒÂ³n. En lo que respecta a conseguir quesitos, funciona de manera diferente en cada modo. En Solitario, tienes que seÃƒÂ±alar la respuesta correcta cuando estÃƒÂ©s en una casilla de quesito para conseguir el quesito de ese color. Las respuestas correctas en el resto de casillas aÃƒÂ±aden puntos a tu total pero no proporcionan quesitos. En Contrarreloj, que cuenta con dos niveles de dificultad, hay un tiempo lÃƒÂ­mite y se aplica una penalizaciÃƒÂ³n. El juego comienza con cinco corazones (vidas) y un tiempo lÃƒÂ­mite. Si contestas incorrectamente o se te acaba el tiempo, pierdes un corazÃƒÂ³n; si pierdes los cinco antes de conseguir todos tus quesitos, se acaba la partida; si indicas la respuesta correcta, ganas puntos. Cuanto mÃƒÂ¡s rÃƒÂ¡pido contestes, mÃƒÂ¡s puntos ganas. Como en el modo Solitario, ganas una bonificaciÃƒÂ³n extra por respuestas correctas consecutivas pero, al contrario que en ÃƒÂ©ste, los quesitos se pueden conseguir en cualquier casilla. AdemÃƒÂ¡s, al llegar a la casilla central, recibes un montÃƒÂ³n de puntos de bonificaciÃƒÂ³n, eso sÃƒÂ­, si respondes de manera correcta cinco preguntas consecutivas. En una partida personalizada para entre 1 y 4 jugadores, hay que establecer las normas al principio. Selecciona el nÃƒÂºmero de quesitos necesarios, si hace falta o no sacar el nÃƒÂºmero exacto en el dado para llegar al centro y si se pueden ganar quesitos en cualquier casilla o sÃƒÂ³lo en las casillas de quesitos. Puedes jugar en solitario o hasta con tres jugadores mÃƒÂ¡s si compartÃƒÂ­s el ordenador y el ratÃƒÂ³n. Por desgracia, no estÃƒÂ¡ disponible el juego bÃƒÂ¡sico en lÃƒÂ­nea que se ofrecÃƒÂ­a en Flip Words 2. Ã‚Â¿En quÃƒÂ© se parece al juego en tablero? Bueno, es divertido, incluso adictivo, pero no tan divertido como jugar en una habitaciÃƒÂ³n llena de amigos. Se echan de menos las bromas y la camaraderÃƒÂ­a que surgen con el juego de mesa. Eso sÃƒÂ­, se puede jugar en varios idiomas, lo cual estÃƒÂ¡ muy bien. Trivial Pursuit Genus Edition Deluxe supone una festiva diversiÃƒÂ³n si te apetece estrujarte el cerebro y comprobar lo &quot;sabiondo&quot; que puedes llegar a ser.\n\n\nSistema operativo: Win98/98SE/Me/2000/XP\nProcesador: 1,2 GHz\nMemoria: 256 MB\nVÃƒÂ­deo: 128 MB\nDirectX 9.0c","torrent":{"xt":"urn:btih:42ce4ae5eaf9d5d63b05956c6f5f77756be2f4ae","amp;dn":"Trivial+Pursuit+Genus+Edition+Deluxe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42ce4ae5eaf9d5d63b05956c6f5f77756be2f4ae","infoHashBuffer":{"type":"Buffer","data":[66,206,74,229,234,249,213,214,59,5,149,108,111,95,119,117,107,226,244,174]},"announce":[],"urlList":[]}}