{"title":"Tesla - The Best Of Tesla (2001) 320 vtwin88cube","uid":6169246,"size":157148354,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4330011d5a20f26b4d4b5f1250325c995e1776fe&amp;dn=Tesla+-+The+Best+Of+Tesla+%282001%29+320+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"vtwin88cube","files":-1,"time":1297504872,"description":"Tesla\n20th Century Masters\nThe Best Of Tesla (2001)\n\nAlthough Tesla emerged during the glory days of hair metal, the band's music was equally indebted to contemporary blues and '70s-style hard rock, a fusion that helped differentiate albums like The Great Radio Controversy from its contemporaries. Despite the refreshing lack of posturing, Tesla was hit just as hard as the rest of the pop-metal world when grunge arrived in the early 1990s. They did produce one of the era's more respectable bodies of work, however, including three consecutive platinum-selling albums.\n\nAlthough Tesla took shape in 1985 in Sacramento, CA, the musicians (vocalist Jeff Keith, the underrated guitar tandem of Frank Hannon and Tommy Skeoch, bassist Brian Wheat, and drummer Troy Luccketta) had logged several years together under the name City Kidd. At their management's suggestion, the bandmates renamed their group after the eccentric inventor Nikola Tesla, who pioneered the radio but was given only belated credit for doing so. After playing several showcases in Los Angeles, Tesla quickly scored a deal with Geffen and released the debut album Mechanical Resonance in 1986. It produced a minor hard rock hit in &quot;Modern Day Cowboy,&quot; reached the Top 40 on the album charts, and eventually went platinum. However, it was the 1989 follow-up effort, The Great Radio Controversy, that truly broke the band. The first single, &quot;Heaven's Trail (No Way Out),&quot; was another hit with hard rock audiences and set the stage for the second single, a warm, comforting ballad named &quot;Love Song&quot; that substituted a dash of hippie utopianism for the usual power ballad histrionics. &quot;Love Song&quot; hit the pop Top Ten and pushed The Great Radio Controversy into the Top 20. Double-platinum sales figures followed as another single, &quot;The Way It Is,&quot; also enjoyed some degree of airplay.\n\nChannels:\t\t2 (Stereo)\nSample Rate:\t\t44.1 KHz\nSample Size:\t\t16 bit\nBit Rate:\t\t320 kbps\n\nAudio Quality:\t\tVery High (Lossy)\nEncoder:\t\tLAME 3.98r\nEncoder Settings:\tConstant Bit Rate 320 kbps (Insane)\nContains:\t\tAlbum Art, ID Tag [ID3v2.3 (ANSI) &amp; ID3v1.1]\n\nFormat:\t\t\tMp3\nSource:\t\t\tWeb\t\t\nGenre:\t\t\tRock\t\t\t\nM3U Playlist:\t\tYes\n\n01.Modern Day Cowboy\n02.Hang Tough\n03.Heaven's Trail (No Way Out)\n04.Love Song\n05.The Way It Is\n06.Signs\n07.Edison's Medicine\n08.What You Give\n09.Call It What You Want\n10.Song And Emotion\n11.Try So Hard\n12.Mama's Fool\n","torrent":{"xt":"urn:btih:4330011d5a20f26b4d4b5f1250325c995e1776fe","amp;dn":"Tesla+-+The+Best+Of+Tesla+%282001%29+320+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4330011d5a20f26b4d4b5f1250325c995e1776fe","infoHashBuffer":{"type":"Buffer","data":[67,48,1,29,90,32,242,107,77,75,95,18,80,50,92,153,94,23,118,254]},"announce":[],"urlList":[]}}