{"title":"Daily Life in the Roman City - Rome, Pompeii, and Ostia (History","uid":9531423,"size":24188949,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:439f2619a0a95821d4292798f8101f6c2ab0aeef&amp;dn=Daily+Life+in+the+Roman+City+-+Rome%2C+Pompeii%2C+and+Ostia+%28History&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"STBGD","files":-1,"time":1390851314,"description":"Gregory S. Aldrete, &quot;Daily Life in the Roman City: Rome, Pompeii, and Ostia&quot; \n2005 | ISBN-10: 031333174X | 265 pages | PDF | 23 MB\n\nAn in-depth study of life in ancient Roman cities Although the majority of ancient Rome's population lived in the countryside, Rome's heart - its cultural, political, and spiritual centre - lay in the city. In the most distant corners of the Empire, Rome's metropolitan existence was reflected in provincial cities whose architecture, infrastructure, language and laws echoed their model and parent: Rome. In Greg Aldrete's comprehensive account, readers will have the opportunity to peer into the inner workings and outer forms of life in Rome's cities, and also gain a new insight into the nature and history of urban existence. The book includes sections on Rome's history, infrastructure, government, and people, as well as chapters on living and dying; dangers of living; pleasures of living; entertainment; religion; the emperors; the economy; Ostia: an industrial port city; and Pompeli. This volume is ideal for school and college students, as well as anyone interested in examining the realities of life in Rome and the ancient Roman cities. A chronology of the time period, maps, illustrations, a bibliography, and an index are also included. Part of The Greenwood Press &quot;Daily Life Through History&quot; Series Provides a fascinating insight into urban life in ancient Rome","torrent":{"xt":"urn:btih:439f2619a0a95821d4292798f8101f6c2ab0aeef","amp;dn":"Daily+Life+in+the+Roman+City+-+Rome%2C+Pompeii%2C+and+Ostia+%28History","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"439f2619a0a95821d4292798f8101f6c2ab0aeef","infoHashBuffer":{"type":"Buffer","data":[67,159,38,25,160,169,88,33,212,41,39,152,248,16,31,108,42,176,174,239]},"announce":[],"urlList":[]}}