{"title":"The Deliberate Stranger - The Ted Bundy Story (1986) Mark Harmon","uid":7506261,"size":1638294263,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:43b1c63f24100c0f3252e5a28f1c4a65616e959f&amp;dn=The+Deliberate+Stranger+-+The+Ted+Bundy+Story+%281986%29+Mark+Harmon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"rambam1776","files":-1,"time":1344183701,"description":"The Deliberate Stranger 01\n\nFormat                                   : Matroska\nFormat version                           : Version 2\nFile size                                : 788 MiB\nDuration                                 : 1h 34mn\nNominal bit rate                         : 1 000 Kbps\nWidth                                    : 720 pixels\nHeight                                   : 480 pixels\nDisplay aspect ratio                     : 4:3\nFrame rate                               : 23.976 fps\nBits/(Pixel*Frame)                       : 0.121\nWriting library                          : x264 core 120\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0090925/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0090925/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Deliberate_Stranger&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Deliberate_Stranger&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bayimg.com/faaKIAAEN&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/faaKIAAEN&lt;/a&gt;\n\nBundy: The Deliberate Stranger was written by a Seattle Times reporter named Richard W. Larsen and published in 1980. Larsen covered politics for the Times and had interviewed Bundy in 1972, years before he became a murder suspect, when Bundy worked as a volunteer for the re-election campaign of Gov. Daniel J. Evans and had been seen trailing the campaign of Evans' Democratic opponent with a video camera. Larsen would go on to cover the &quot;Ted&quot; murders in 1974 and then cover the Ted Bundy story up until Bundy's execution in 1989. Bundy: The Deliberate Stranger was published in paperback in editions as late as 1990 but has since gone out of print.\n\nThe Deliberate Stranger was adapted into a two-part TV movie originally broadcast on NBC in May 1986. The film, based on Larsen's book, starred Mark Harmon as Bundy. The film omits Bundy's childhood, early life, and first five known murders, picking up the story with the murder of Georgeann Hawkins and following Bundy's further crimes in Washington, Utah, Colorado and Florida. Frederic Forrest starred as Seattle detective Robert D. Keppel, and George Grizzard played reporter Larsen.\n\nBundy's lawyer Polly Nelson, in her book Defending the Devil, characterized the film as &quot;stunningly accurate&quot; and said it did not portray anything that was not proven fact. She singled out for praise Harmon's portrayal of Bundy, noting how Harmon reproduced Bundy's rigid posture and typically suspicious expression. According to Nelson, her client, still on death row when the program aired, showed no interest in seeing the film. Ann Rule, who had known Bundy before the murders when they worked together on a suicide crisis hotline, felt that Harmon's portrayal missed the insecurities that lurked under Bundy's confident facade. Harmon was nominated for a Golden Globe for his portrayal of Bundy.\n\nWhile the film is accurate in its portrayal of events, the names of all the victims (as well as Bundy's girlfriend) have been changed, with the sole exceptions of victim Denise Naslund and her mother Eleanor Rose.","torrent":{"xt":"urn:btih:43b1c63f24100c0f3252e5a28f1c4a65616e959f","amp;dn":"The+Deliberate+Stranger+-+The+Ted+Bundy+Story+%281986%29+Mark+Harmon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43b1c63f24100c0f3252e5a28f1c4a65616e959f","infoHashBuffer":{"type":"Buffer","data":[67,177,198,63,36,16,12,15,50,82,229,162,143,28,74,101,97,110,149,159]},"announce":[],"urlList":[]}}