{"title":"Korora 21 (Darla) Cinnamon x86_64 live DVD","uid":11689266,"size":1838153728,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:43c0cd878040b414f8829d0df90226f90f10c135&amp;dn=Korora+21+%28Darla%29+Cinnamon+x86_64+live+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"narrenpost","files":1,"time":1423450356,"description":"Korora 21 (Darla) Cinnamon x86_64 live DVD iso\n\nOS Type: Linux\nBased on: Fedora\nOrigin: Australia\nArchitecture: x86_64\nDesktop: Cinnamon\nCategory: Beginners, Desktop, Live Medium\n\nIt has taken a few weeks longer than we had hoped, but we're finally happy to announce that the final release of version 21 (codename &quot;Darla&quot;) is now available for download (we strongly recommend using BitTorrent).\n\nThe 21 beta was quite successful and we were able to make some minor changes to help improve the overall experience. Users who are currently on the beta need not re-install, updates are provided via the package manager. Users who are on 20 may consider upgrading, however this is not necessary as version 20 is supported for another 6 months or so.\n\nThanks to our continued support from core contributors Maik Adamietz (DarkEra) and Jim Dean (ozjd) we have been able to retain our Xfce and Cinnamon editions for another cycle. Unfortunately, due to the lack of any active maintainers we have decided to drop the MATE edition.\n\nIt has been almost a year since our last release and we have spent a lot of time developing some new core technologies which lay the groundwork for some exciting features in the future. Korora 21 sees the debut of &quot;Lens&quot; which we have introduced in a news post recently.\nFeatures\nCinnamon 2.4\n\nThis new release of Cinnamon targets a smoother experience, improved settings and updates to the file manager, nemo. Refer to the Cinnamon Release Announcement for more details.\n\nBut wait, there's more ...\n\nDerived from Fedora 211, Korora benefits from Fedora's long tradition of bringing the latest technologies to open source software users.\n\nA complete list with details of each new inherited feature is available at the Fedora 21 Change Set page.\n\n- Ruby 2.1 Language changes to Ruby 2.1 include the default values of keyword arguments can now be omitted, suffixes for integer and float literals, and def-expr now returns the symbol of its name. To Ruby 2.1's core are new methods, the RGenGC generational garbage collector, new environment variables, bignum performance improvements, standard library updates, and plenty of other changes.\n\n- OpenCL support has been added through enabling the OpenCL/Clover state tracker within Mesa by default, shipping POCL for OpenCL support on CPUs, and packaging other OpenCL-related open-source Linux codes.\n\n- Terminal has a set of additional features, including: support for transparent backgrounds, automatic title updates to help you identify different terminals and a simple toggle for disabling shortcuts in the Terminal","torrent":{"xt":"urn:btih:43c0cd878040b414f8829d0df90226f90f10c135","amp;dn":"Korora+21+%28Darla%29+Cinnamon+x86_64+live+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43c0cd878040b414f8829d0df90226f90f10c135","infoHashBuffer":{"type":"Buffer","data":[67,192,205,135,128,64,180,20,248,130,157,13,249,2,38,249,15,16,193,53]},"announce":[],"urlList":[]}}