{"title":"FormatFactory 3.0.1 last version","uid":7759420,"size":53466540,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4485b08ccaedffee140bc6310bf53573e3426d8d&amp;dn=FormatFactory+3.0.1+last+version&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"hayda08","files":1,"time":1351186459,"description":"FormatFactory 3.0.1 last version\n\n\n\n\nFormat Factory is a free, fully-featured, converter   that enables you to convert audio, video, and even images, between the most popular formats.\n\nFormat Factory's supported formats include WMV, AVI, MPG, MP3, WMA, AAC, JPG, PNG, GIF, and many more. Better still, Format Factory supports media formats used by most major portable devices, including PSP and iPhone.\n\nThe app is very easy to use, although it does have a slightly unintuitive interface. Format Factory's file browser doesn't appear until you select the target format, which is a bit weird, but as long as you know this it's no problem. You can select individual files to convert, or complete folders, and also tweak some basic conversion settings.\n\nFormat Factory isn't particularly original but what makes it really useful is that it handles images as well as audio and video. Most converters like this only handle audio and video, so adding images to the mix gives it an edge, especially considering it's free. We also like the Audio Joiner in Format Factory, which allows you to take two separate clips, join them together and then convert them. It would've been nice to have preset profiles for mobile conversions, but you can't always have it all in a free app!","torrent":{"xt":"urn:btih:4485b08ccaedffee140bc6310bf53573e3426d8d","amp;dn":"FormatFactory+3.0.1+last+version","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4485b08ccaedffee140bc6310bf53573e3426d8d","infoHashBuffer":{"type":"Buffer","data":[68,133,176,140,202,237,255,238,20,11,198,49,11,245,53,115,227,66,109,141]},"announce":[],"urlList":[]}}