{"title":"Harry Turtledove Books (27) Mobi, KK","uid":6930052,"size":32559641,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4497fab238866dbe79ac36cc13bc88b60b6d7bf6&amp;dn=Harry+Turtledove+Books+%2827%29+Mobi%2C+KK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"karaokeking123","files":-1,"time":1325630064,"description":"Harry Turtledove Books (27) Mobi, KK\n\n\nHarry Norman Turtledove was born in Los Angeles, CA on 14 June 1949. After failing out of his freshman year at Caltech, he attended UCLA, where he received a Ph.D. in Byzantine history in 1977. His dissertation was on The Immediate Successors of Justinian: A Study of the Persian Problem and of Continuity and Change in Internal Secular Affairs in the Later Roman Empire During the Reigns of Justin II and Tiberius II Constantine (A.D. 565-582). \nIn 1979, Turtledove published his first two novels, Wereblood and Werenight, under the pseudonym &quot;Eric G. Iverson&quot;. Turtledove later explained that his editor at Belmont Towers did not think people would believe the author's real name was &quot;Turtledove&quot; and suggested that he come up with something more Nordic. He continued to use the &quot;Iverson&quot; name until 1985 when he published his &quot;Herbig-Haro&quot; and &quot;And So to Bed&quot; under his real name.  \nThroughout the later '70's and early '80's, In the 1980's, Turtledove worked as a technical writer for the Los Angeles County Office of Education. In 1991, he left the LACOE and turned to writing full time. From 1986-1987, he served as the Treasurer for the Science Fiction Writers of America. \nHe is married to mystery writer Laura Frankos. They have three daughters: Alison, Rachel, and Rebecca. His brother-in-law is fantasy author Steven Frankos. Turtledove won the HOMer Award for Short Story in 1990 for &quot;Designated Hitter&quot;, John Esthen Cook Award for Southern Fiction in 1993 for Guns of the South, the Hugo Award for Novella in 1994 for Down in the Bottomlands. &quot;Must and Shall&quot; was nominated for the 1996 Hugo Award for Best Novelette, the 1996 Nebula Award for Best Novelette and received an honorable mention for the 1995 Sidewise Award for Alternate History. The Two Georges also received an honorable mention for the 1995 Sidewise Award for Alternate History. The Worldwar series received a Sidewise Award for Alternate History Honorable Mention in 1996. On August 1, 1998, Turtledove was named honorary Kentucky Colonel while Guest of Honor at Rivercon XXIII in Louisville, KY. \n &lt;a href=&quot;\nhttp://www.sfsite.com/~silverag/about.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sfsite.com/~silverag/about.html&lt;/a&gt;\n\n\nEnjoy!","torrent":{"xt":"urn:btih:4497fab238866dbe79ac36cc13bc88b60b6d7bf6","amp;dn":"Harry+Turtledove+Books+%2827%29+Mobi%2C+KK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4497fab238866dbe79ac36cc13bc88b60b6d7bf6","infoHashBuffer":{"type":"Buffer","data":[68,151,250,178,56,134,109,190,121,172,54,204,19,188,136,182,11,109,123,246]},"announce":[],"urlList":[]}}