{"title":"WINRAR 3.9","uid":5120900,"size":3125945,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:44b7f3179edf0fe5e2044c4884cc41238e9c79ac&amp;dn=WINRAR+3.9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"VICTOR_CADIZ","files":4,"time":1255345361,"description":"WinRAR es un potente programa compresor y descompresor de datos multi-funciÃƒÂ³n, una herramienta indispensable para ahorrar espacio de almacenamiento y tiempo de transmisiÃƒÂ³n al enviar y recibir archivos a travÃƒÂ©s de Internet o al realizar copias de seguridad.\n\nWinRAR no se centra en un ÃƒÂºnico formato, ni se estanca en los que ya tuviese, sino que aÃƒÂ±ade nuevos formatos versiÃƒÂ³n tras versiÃƒÂ³n. Entre las novedades que se han aÃƒÂ±adido a WinRAR destaca que aprovecha los nuevos procesadores de doble nÃƒÂºcleo durante los cÃƒÂ¡lculos de compresiÃƒÂ³n y descompresiÃƒÂ³n.\n\nWinRAR crea y descomprime archivos en los formatos mÃƒÂ¡s populares (ZIP y RAR) y tambiÃƒÂ©n es capaz de descomprimir archivos creados en otros formatos, con lo que si tienes WinRAR instalado no necesitarÃƒÂ¡s ningÃƒÂºn otro descompresor.\n\nPara tu comodidad, WinRAR se integra perfectamente en el Explorador de Windows. En ÃƒÂ©l aparecerÃƒÂ¡n hasta once opciones, puedes elegir cuÃƒÂ¡les, como por ejemplo: Abrir con WinRAR, o Extraer en. Definitivamente, por velocidad, flexibilidad, y efectividad, WinRAR es un firme candidato para convertirse en el compresor de archivos imprescindible.\n\nCaracterÃƒÂ­sticas:\n\n* WinRAR hace archivos mÃƒÂ¡s pequeÃƒÂ±os que la competencia, se ahorra espacio en disco y los costos de transmisiÃƒÂ³n.\n* WinRAR brinda soporte completo para archivos RAR y ZIP y es capaz de descomprimir archivos CAB, ARJ, LZH, TAR, GZ, ACE, UUE, bz2, JAR, ISO, 7z, Z.\n* WinRAR ofrece una interfaz grÃƒÂ¡fica interactiva.\n* WinRAR es mÃƒÂ¡s fÃƒÂ¡cil de utilizar que muchos otros programas con la inclusiÃƒÂ³n del Modo Asistente que permite el acceso instantÃƒÂ¡neo a las funciones bÃƒÂ¡sicas de archivos.\n* WinRAR te ofrece encriptaciÃƒÂ³n de archivos usando el algoritmo AES (Advanced Encryption Standard) con una clave de 128 bits.\n* WinRAR soporta archivos y archivos de hasta 8589 millones de gigabytes de tamaÃƒÂ±o.\n* WinRAR ofrece la posibilidad de crear Archivos autoextraibles y archivos multivolÃƒÂºmenes.\n* RecuperaciÃƒÂ³n de registro y recuperaciÃƒÂ³n de volÃƒÂºmenes para permitir reconstruir incluso fÃƒÂ­sicamente archivos daÃƒÂ±ados.\n* Todo esto y mÃƒÂ¡s con Winrar.\n\nCambios recientes en la versiÃƒÂ³n 3.90 : historial\n\nDatos del programa:\n\n* Compatible con: Win95/98/98SE/Me/2000/NT/XP/Vista/ Win7 (32/64 bit)\n* Idioma: EspaÃƒÂ±ol Oficial\n\n\n\nDesinstala cualquier versiÃƒÂ³n anterior de WinRAR\nDescarga e instala WinRAR 3.90 (32bit o 64bit), eso es todo.\nViene Registrado y en EspaÃƒÂ±ol Oficial\n","torrent":{"xt":"urn:btih:44b7f3179edf0fe5e2044c4884cc41238e9c79ac","amp;dn":"WINRAR+3.9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44b7f3179edf0fe5e2044c4884cc41238e9c79ac","infoHashBuffer":{"type":"Buffer","data":[68,183,243,23,158,223,15,229,226,4,76,72,132,204,65,35,142,156,121,172]},"announce":[],"urlList":[]}}