{"title":"Alcohol 120% Retail v2.0.1.2033 Final [Multilingual]","uid":6747312,"size":12480512,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:44e8ec729ede3d9849b7a25ff37d1f2f3cf1c5d8&amp;dn=Alcohol+120%25+Retail+v2.0.1.2033+Final+%5BMultilingual%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"webchella","files":1,"time":1318757484,"description":"Alcohol 120% Retail v2.0.1.2033 Final [Multilingual]\n\nEnglish:\n---------\nCompatible with: Windows XP Pro (32/64 bit) / Vista (32/64 bit) and Win7 (32/64 bit)\nMultilingual: English, Spanish, Italian, French, Japanese, German, Portugues, etc\n\nAlcohol brings new meaning to the word multimedia! It is without a doubt a leader in its class, bringing the ability to emulate and record CDs and DVDs together into one amazingly easy to use software program. Now includes Alcohol Xtra. A unique Pre-Mastering function.\n\nUsing the latest technology the program is constantly being developed and improved to add new features, allowing it to maintain it's position as a leading software package.\n\nImagine being able to store your most used CDs as images on your computer and just call them up at the click of a button! And then run them at 200x the speed of some CD drives and without requiring the CD itself! How about being able to make a backup of that CD onto another CD either using the CD itself or just using the image you have created? This is what Alcohol allows you to do and much more.\n\nFeatures:\n\n* Alcohol 120% enables you to make a duplicate back-up to recordable media of nearly all your expensive Game/Software/DVD titles, and/or an image that can be mounted and run from any one of Alcohol's virtual drives.\n* No other software available enables you to create up to a staggering 31 virtual drives, allowing you to run your game images at over 200x faster than from a conventional CD-ROM. Alcohol 120% is a powerful utility that uses a unique combination of options to ensure a perfect back-up every time.\n* All you need is a PC combined with a CD or a DVD burner. No more replacing your expensive original discs due to loss, theft, scratches, or other media imperfections. Your duplicate works just like the original; your entire collection can be archived and your investment protected.\n* In the home: Have you had experiences with the common conditions of CDs/DVDs? They can easily get scratched, damaged, broken, lost or even stolen. Alcohol provides you with peace of mind and protects your investment.\n* Your original games/program discs can be safely stored away. Alcohol-created images mean that you always have your expensive media stored safely on your hard drive for instant retrieval at the click of a button. No more searching for the correct game disc or software application install disc, everything is at your fingertips.\n* You can now, for instance, simultaneously play your favourite game and bring up your route planner without having to eject and reload any physical discs, The 31 virtual drive ability of Alcohol means you can have the equivalent of a staggering 31 CD-ROM drives in your Home PC, all instantly accessible. You can simply and quickly run your Disc image at around 200 times faster than that of a conventional CD-ROM drive. If you need a program or CD it is immediately there - always ready to use!\n* At the office: Program discs and many other applications generally require the original disc to be in the computer's CD-ROM drive. This restricts the amount of people in your office who can have access to the same software at the same time without the cost of additional discs. Alcohol's virtual drives resolve that problem for you. No more hunting around the offices for that elusive disc you need to run your application, everything you require is just a click away.\n* With Alcohol you can store your CD images on your office server, your colleagues and employees at their respective networked workstations will never need to come asking for a CD again, they will not even require an expensive CD-ROM drive installed in their workstation PC! A simple click is all that is required for them to have full access to any disc image they require for their day to day work. Your valuable CDs can be safely kept under lock and key.\n\nWhat's new in Alcohol 120% v2.0.1.2033:\n\n- New! Save XML Image File List\n- New! SPTD virtual-drive kernel\n- Update Drive support updated.\n- Update Language Files\n- Update SPTD 1.74\n- Fix minor bugs fixed.\n- Fix Invalid Image Size error\n- Fix Xtra Wizard Window Opening Problem.\n\nEspaÃƒÂ±ol:\n--------\nCompatible con: Windows XP Pro (32/64 bit) / Vista (32/64 bits) y Win7 (32/64 bit)\nMultilingÃƒÂ¼e: Portugues InglÃƒÂ©s, espaÃƒÂ±ol, italiano, francÃƒÂ©s, japonÃƒÂ©s, alemÃƒÂ¡n, etc\n\nEl alcohol trae un nuevo significado a la palabra multimedia! Es sin duda un lÃƒÂ­der en su clase, lo que la capacidad de emular y grabar CDs y DVDs junto al increÃƒÂ­blemente fÃƒÂ¡cil de usar programa de software. Ahora incluye Alcohol Xtra. Un ÃƒÂºnico Pre-Mastering funciÃƒÂ³n.\n\nUtilizando la ÃƒÂºltima tecnologÃƒÂ­a el programa estÃƒÂ¡ siendo constantemente desarrollado y mejorado para agregar nuevas caracterÃƒÂ­sticas, lo que le permite mantener su posiciÃƒÂ³n como un paquete de software.\n\nImagina ser capaz de almacenar sus CDs mÃƒÂ¡s utilizados como imÃƒÂ¡genes en su ordenador y sÃƒÂ³lo los llaman en el tecleo de un botÃƒÂ³n! Y luego correr a 200 veces la velocidad de algunas unidades de CD y sin requerir el CD sÃƒÂ­ mismo! Ã‚Â¿QuÃƒÂ© hay de poder hacer una copia de seguridad de ese CD en otro CD, ya sea usando el propio CD o simplemente usando la imagen que han creado? Esto es lo que el alcohol le permite hacer y mucho mÃƒÂ¡s.\n\nCaracterÃƒÂ­sticas:\n\n* Alcohol 120% le permite hacer un duplicado de respaldo a los medios de comunicaciÃƒÂ³n grabable de casi todas sus caras Juego / Software / DVD tÃƒÂ­tulos, y / o una imagen que se puede montar y ejecutar desde cualquiera de las unidades virtuales de Alcohol.\n* NingÃƒÂºn otro software disponible le permite crear hasta un sorprendente 31 unidades virtuales, lo que le permite ejecutar su juego de imÃƒÂ¡genes en mÃƒÂ¡s de 200x mÃƒÂ¡s rÃƒÂ¡pido que el de una convencional CD-ROM. Alcohol 120% es una potente utilidad que utiliza una combinaciÃƒÂ³n ÃƒÂºnica de opciones para garantizar una perfecta copia de seguridad cada vez.\n* Todo lo que necesitas es un PC combinado con un CD o un DVD. No mÃƒÂ¡s caro reemplazar su discos originales debido a la pÃƒÂ©rdida, robo, araÃƒÂ±azos, imperfecciones u otros medios de comunicaciÃƒÂ³n. Sus obras duplicado al igual que el original; toda su colecciÃƒÂ³n pueden ser archivados y su inversiÃƒÂ³n protegida.\n* En el hogar: Ã‚Â¿Ha tenido experiencias con las condiciones comunes de CD / DVD? Se puede conseguir fÃƒÂ¡cilmente rayado, daÃƒÂ±ado, roto, perdido o incluso robados. El alcohol le proporciona la paz de la mente y protege su inversiÃƒÂ³n.\n* Su original de los juegos / programa discos pueden almacenar de forma segura lejos. Creada con el alcohol imÃƒÂ¡genes significa que usted siempre tiene su cara medios almacenados con seguridad en su disco duro para la recuperaciÃƒÂ³n instantÃƒÂ¡nea en el tecleo de un botÃƒÂ³n. No mÃƒÂ¡s bÃƒÂºsqueda de el disco del juego correcto o el disco de instalaciÃƒÂ³n de software de aplicaciÃƒÂ³n, todo estÃƒÂ¡ al alcance de su mano.\n* Ahora puede, por ejemplo, al mismo tiempo desempeÃƒÂ±ar su juego favorito y criar a su planificador de rutas sin tener que expulsar y recargar cualquier fÃƒÂ­sica discos, la capacidad de 31 unidades virtuales de disco de alcohol significa que usted puede tener el equivalente de un asombroso 31 CD-ROM Inicio en su PC, todos accesibles al instante. Usted puede fÃƒÂ¡cil y rÃƒÂ¡pidamente ejecutar la imagen de disco en alrededor de 200 veces mÃƒÂ¡s rÃƒÂ¡pido que el de una convencional CD-ROM. Si usted necesita un programa o un CD es inmediatamente allÃƒÂ­ - siempre listo para usar!\n* En la oficina: Programa de discos y muchas otras aplicaciones suelen exigir el disco original estar en CD-ROM del ordenador. Esto limita la cantidad de personas en su oficina puede tener acceso a los mismos programas, al mismo tiempo sin el coste adicional de los discos. Unidades virtuales del alcohol resuelven ese problema para usted. No mÃƒÂ¡s caza alrededor de las oficinas para que esquiva disco lo que necesita para ejecutar su aplicaciÃƒÂ³n, todo lo que requiere es tan sÃƒÂ³lo un clic de distancia.\n* Con el alcohol puede almacenar sus imÃƒÂ¡genes de CD en el servidor de la oficina, sus colegas y empleados en su trabajo conectadas en red nunca necesitarÃƒÂ¡n venir pidiendo un CD nuevo, que ni siquiera requieren una costosa unidad de CD-ROM instalada en su PC estaciÃƒÂ³n de trabajo ! Un simple clic es todo lo que se requiere para que tengan pleno acceso a cualquier imagen de disco que necesitan para su trabajo del dÃƒÂ­a a dÃƒÂ­a. Su valiosa CDs puede ser guardado de manera segura bajo llave.\n\nÃ‚Â¿QuÃƒÂ© hay de nuevo en Alcohol 120% v2.0.1.2033:\n\n- Ã‚Â¡Nuevo! Guardar lista XML de archivo de imagen\n- Ã‚Â¡Nuevo! SPTD virtual de la unidad de disco del nÃƒÂºcleo\n- ActualizaciÃƒÂ³n de la unidad de apoyo actualizado.\n- ActualizaciÃƒÂ³n de archivos de otros idiomas\n- ActualizaciÃƒÂ³n SPTD 1,74\n- Corregir errores menores.\n- Corregido error no vÃƒÂ¡lido TamaÃƒÂ±o de la imagen\n- Fijar Yahoo! ventana del asistente de problemas de apertura.","torrent":{"xt":"urn:btih:44e8ec729ede3d9849b7a25ff37d1f2f3cf1c5d8","amp;dn":"Alcohol+120%25+Retail+v2.0.1.2033+Final+%5BMultilingual%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44e8ec729ede3d9849b7a25ff37d1f2f3cf1c5d8","infoHashBuffer":{"type":"Buffer","data":[68,232,236,114,158,222,61,152,73,183,162,95,243,125,31,47,60,241,197,216]},"announce":[],"urlList":[]}}