{"title":"Massive Acapella Collection - PROPERLY labeled, Nylons, Rockapel","uid":4216118,"size":1447416149,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:44ef0ae5632d5cdfa1b731c86a19eff295ef64a8&amp;dn=Massive+Acapella+Collection+-+PROPERLY+labeled%2C+Nylons%2C+Rockapel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":2,"uploader":"rambam1776","files":296,"time":1212348513,"description":"With the possible exception of stupid parody songs that have been wrongly attributed to Weird Al Yankovic, I have never found a type of file more likely to be mislabeled than acapella music. Almost everything is misapplied to the group Rockapella, whereas I have found most of it is done by college acapella troupes. What I have done is to label everything I could identify, leave the unknown stuff labeled as unknown, and to include the discography of the Nylons and Rockapella to the extent I could find their stuff. I am hoping this collection will spread far and wide and encourage people to eliminate from peer sharing the incredible amount of mislabeled garbage out there. Just for laughs, I have also included the newsradio episode where they make fun of acapella singing. If anyone reading this happens to have commercial copies of the Nylons, please torrent them up, they are hard to find. Keep in mind, this collection is NOT complete. It is just a repair to the extent possible.","torrent":{"xt":"urn:btih:44ef0ae5632d5cdfa1b731c86a19eff295ef64a8","amp;dn":"Massive+Acapella+Collection+-+PROPERLY+labeled%2C+Nylons%2C+Rockapel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44ef0ae5632d5cdfa1b731c86a19eff295ef64a8","infoHashBuffer":{"type":"Buffer","data":[68,239,10,229,99,45,92,223,161,183,49,200,106,25,239,242,149,239,100,168]},"announce":[],"urlList":[]}}