{"title":"Incubus - Flac Discography","uid":9613299,"size":3746991009,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:453e3ba2f87765e5085e787751828da162345ea1&amp;dn=Incubus+-+Flac+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":6,"uploader":"jmwreck","files":138,"time":1392366193,"description":"Incubus is an American rock band from Calabasas, California. The band was formed in 1991 by vocalist Brandon Boyd, lead guitarist Mike Einziger, and drummer Jose Pasillas while enrolled in Calabasas High School and later expanded to include bassist Alex &quot;Dirk Lance&quot; Katunich, and Gavin &quot;DJ Lyfe&quot; Koppell; both of whom were eventually replaced by bassist Ben Kenney and DJ Kilmore respectively.\n\nIncubus has received both critical acclaim and commercial success, reaching multi-platinum sales, as well as releasing several successful singles. The band earned mainstream recognition with the release of their 1999 album Make Yourself. In 2001, Incubus became even more successful with the single &quot;Drive&quot; and their follow-up album Morning View. Their sixth studio album, Light Grenades, debuted at No. 1 in 2006 and has received Gold certification in the U.S. Incubus released their first greatest hits album Monuments and Melodies in June 2009, accompanied by a tour of the United States, Japan and Canada. The band's most recent album, If Not Now, When?, was released on July 12, 2011.\n\nWIKI","torrent":{"xt":"urn:btih:453e3ba2f87765e5085e787751828da162345ea1","amp;dn":"Incubus+-+Flac+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"453e3ba2f87765e5085e787751828da162345ea1","infoHashBuffer":{"type":"Buffer","data":[69,62,59,162,248,119,101,229,8,94,120,119,81,130,141,161,98,52,94,161]},"announce":[],"urlList":[]}}