{"title":"Pratical Programming an Introduction to Computer Science using P","uid":9195316,"size":18214179,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:454e73a74a5ba60b5674fcde4dbfd6e67a427d65&amp;dn=Pratical+Programming+an+Introduction+to+Computer+Science+using+P&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":2,"uploader":"d347hBy73","files":-1,"time":1384481355,"description":"Practical Programming: An Introduction to Computer Science Using Python 3\n\nBook Details:\n\nSeries: Pragmatic Programmers\nPages: 350 \nPublisher: Pragmatic Bookshelf; 2nd Edition (October 2013)\nLanguage: English\nISBN-10: 1937785459\nISBN-13: 978-1937785451\nFormat: PDF, EPUB\n\nBook Description:\n\nYou don not need any programming experience to get started. First, you will get a detailed introduction to Python and to programming. You will find out exactly what happens when your programs are executed. Through real-world examples, you will learn how to work with numbers, text, big data sets, and files. Then you will see how to create and use your own data types.\n\nThe incremental examples show you the steps and missteps that happen while developing programs, so you know what to expect when you tackle a problem on your own. Inspired by How to Design Programs (HtDP), you will learn a six-step recipe for designing functions, which helps you as you start to learn the concepts and becomes an integral part of writing programs by the end.\n\nAs you learn to use the fundamental programming tools in the first half of the book, you will see how to document and organize your code so that you and other programmers can more easily read and understand it. Beyond the basics, you will learn how to ensure that your programs are reliable, and how to work with databases, download data from the web automatically, and build user interfaces. Most importantly, you will learn how to think like a professional programmer.\n\nWhat you need:\n\nYou will need to download Python 3, available from python.org. With that download comes IDLE, the editor we use for writing and running Python programs. (If you use Linux, you may need to install Python 3 and IDLE separately.)\n\nReviews:\n\nI wish I could go back in time and give this book to my 10-year-old self when I first learned programming! It is so much more engaging, practical, and accessible than the dry introductory programming books that I tried (and often failed) to comprehend as a kid. I love the authors hands-on approach of mixing explanations with code snippets that students can type into the Python prompt.\n- Philip Guo, Creator of Online Python Tutor and Assistant Professor, Department of Computer Science, University of Rochester\n\nPractical Programming delivers just what it promises: a clear, readable, usable introduction to programming for beginners. This isn nont just a guide to hacking together programs. The book provides foundations to lifelong programming skills: a crisp, consistent, and visual model of memory and execution and a design recipe that will help readers produce quality software.\n- Steven Wolfman Senior Instructor, Department of Computer Science, University of British Columbia\n\nThe second edition of this excellent text reflects the authors many years of experience teaching Python to beginning students. Topics are presented so that each leads naturally to the next, and common novice errors and misconceptions are explicitly addressed. The exercises at the end of each chapter invite interested students to explore computer science and programming language topics.\n- Kathleen Freeman, Director of Undergraduate Studies, Department of Computer and Information Science, University of Oregon\n\nTable of Contents:\n\nChapter 1. What is Programming?\nChapter 2. Hello, Python\nChapter 3. Designing and Using Functions\nChapter 4. Working with Text\nChapter 5. Making Choices\nChapter 6. A Modular Approach to Program Organization\nChapter 7. Using Methods\nChapter 8. Storing Collections of Data Using Lists\nChapter 9. Repeating Code Using Loops\nChapter 10. Reading and Writing Files\nChapter 11. Storing Data Using Other Collection Types\nChapter 12. Designing Algorithms\nChapter 13. Searching and Sorting\nChapter 14. Object-Oriented Programming\nChapter 15. Testing and Debugging\nChapter 16. Creating Graphical User Interfaces\nChapter 17. Databases\n","torrent":{"xt":"urn:btih:454e73a74a5ba60b5674fcde4dbfd6e67a427d65","amp;dn":"Pratical+Programming+an+Introduction+to+Computer+Science+using+P","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"454e73a74a5ba60b5674fcde4dbfd6e67a427d65","infoHashBuffer":{"type":"Buffer","data":[69,78,115,167,74,91,166,11,86,116,252,222,77,191,214,230,122,66,125,101]},"announce":[],"urlList":[]}}