{"title":"Courageous (Christian Movie)","uid":8946289,"size":740693548,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:46345d228402119db83f9a914427693e2e86d256&amp;dn=Courageous+%28Christian+Movie%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"IndianChristian","files":3,"time":1379787034,"description":"Courageous (Christian Movie)\n\n\nFour men, one calling: To serve and protect. As law enforcement officers, Adam Mitchell, Nathan Hayes, David Thomson, and Shane Fuller are confident and focused. Yet at the end of the day, they face a challenge that none of them are truly prepared to tackle: fatherhood.\n\nWhile they consistently give their best on the job, good enough seems to be all they can muster as dads. But they're quickly discovering that their standard is missing the mark.\n\nWhen tragedy hits home, these men are left wrestling with their hopes, their fears, their faith, and their fathering. Can a newfound urgency help these dads draw closer to God ... and to their children?\n\nFilled with action-packed police drama, COURAGEOUS is the fourth film from Sherwood Pictures (after &quot;Flywheel&quot;, &quot;Facing the Giants&quot;, and &quot;Fireproof&quot;), the moviemaking ministry of Sherwood Baptist Church in Albany, Georgia. Riveted moviegoers will once again find themselves laughing, crying, and cheering as they are challenged and inspired by everyday heroes who long to be the kinds of dads that make a lifelong impact on their children.\n\nProtecting the streets is second nature to these men. Raising their children in a God-honoring way? That's courageous.\n\nAlex Kendrick stars in the movie as well as directs. He plays Adam Mitchell, a law enforcement officer who is close to two other officers, David Thomson and Shane Fuller. He then becomes good friends with the new man on the block, Officer Nathan Hayes. The film's opening sequence features a muscle-bound hoodlum attempting to steal Nathan's truck. Nathan runs and leaps up and grabs ahold of the thief through the open driver's window and refuses to let go. It is not just because he loves his truck. I won't give the opening away but the viewer will soon learn why he is so determined to stop the would-be thief.\n\nThis film projects themes of forgiveness, stepping up to fill the proper role of being a dad (and parent) and a faith in God which cannot be shaken. In one nicely orchestrated scene, a certain character is out of work and desperate. While he is praying he walks right into a miracle. You will have to see it to appreciate it. This movie gives us great lines to ponder like, &quot;God doesn't promise us an explanation, but to walk with us through the pain.&quot; and &quot;I want to marry you to a person who will love god more than he will love you. Then only will he really be able to love you and treasure you.&quot;\n \nRuntime: 130 mins\nLanguage: English\nYear: 2011\nQuality: 10/10\nFormat: avi format \n\nSee reviews here,  &lt;a href=&quot;\nhttp://www.amazon.co.uk/Courageous-DVD-Alex-Kendrick/dp/B005FLARMA&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.co.uk/Courageous-DVD-Alex-Kendrick/dp/B005FLARMA&lt;/a&gt;\n\nI would ask every Christian to do 2 things.\n\n1. If possible please buy this movie. Do you know that there are 2.2 billion Christians on earth today. But only a privileged few, around 12% have the means and the accessibility to buy Christian films. Many Christians are too poor to buy movies or live in places where Christian films are not available. \nThat's not all. Out of the 12% who have the means and accessibility to buy Christian media, only around 0.5% ever buys a Christian movie. In other words only 1 out of 200 Christians ever buys a Christian movie. Pathetic isn't it?\nPlease buy the movies to keep Christian films in business. And please do pray for the Christian movie makers and their families.\n\n2. Please seed the movies for as long as possible. If possible make copies and distribute to your poor neighbors. And please do pray for the movie makers and their families. Remember the Kingdom of Heaven is in you and so is the choice of Heaven/Hell. \n\nPS: If you need any specific Christian movie or have something to say then kindly send a mail to &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;1871767c7179767b706a716b6c7179762a282821586179707777367b77367176&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\nKindly mention the subject as Christian Movies or something similar. \n\n&quot;Don't ask me what Christ can do for you! He has done all he could. Tell me what you can do for Christ?&quot;\n\nUploaded by Indian Christian\n","torrent":{"xt":"urn:btih:46345d228402119db83f9a914427693e2e86d256","amp;dn":"Courageous+%28Christian+Movie%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46345d228402119db83f9a914427693e2e86d256","infoHashBuffer":{"type":"Buffer","data":[70,52,93,34,132,2,17,157,184,63,154,145,68,39,105,62,46,134,210,86]},"announce":[],"urlList":[]}}