{"title":"Arthur Koestler - Darkness at Noon","uid":10896689,"size":10882730,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4690532c86c65e48aa47fa74ba5a9a45c96905ab&amp;dn=Arthur+Koestler+-+Darkness+at+Noon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"workerbee","files":-1,"time":1409159867,"description":"\n* Arthur Koestler - DARKNESS AT NOON (Bantam, 1968).  Translated by Daphne Hardy.  224 pages.  PDF\n\n\nOriginally published in 1940, Arthur Koestler's modern masterpiece is a powerful and haunting portrait of a Communist revolutionary caught in the vicious fray of the Moscow show trials of the late 1930s.  The Modern Library ranked the novel at number eight on its list of the 100 best English-language novels of the 20th century.\n\nDuring Stalin's purges, Nicholas Rubashov, an aging revolutionary, is imprisoned and psychologically tortured by the party to which he has devoted his life.  Under mounting pressure to confess to crimes he did not commit, Rubashov relives a career that embodies the ironies and betrayals of a revolutionary dictatorship that believes it is an instrument of liberation.\n\nA seminal work of twentieth-century literature, DARKNESS AT NOON powerfully expresses Koestler's disillusionment with the Soviet Union and offers a penetrating exploration of the moral danger inherent in a system that is willing to enforce its beliefs by any means necessary.\n\nThis PDF is an improved and smaller version of an older scan in which the page images have been completely reprocessed with contents in bookmarks and accurate pagination.\n\nSee also: THE GOD THAT FAILED (Harper &amp; Row, 1963) &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/10890720/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/10890720/&lt;/a&gt;  \n\n\nReviews\n\n&quot;This is the sort of novel that transcends ordinary limitations, written with such dramatic power, with such warmth of feeling, and with such persuasive simplicity that it is as absorbing as melodrama.&quot; -- New York Times Book Review\n\n&quot;A rare and beautifully executed novel.&quot; -- New York Herald Tribune\n\n&quot;A remarkable book.  A grimly fascinating interpretation of the logic of the Russian revolution, indeed of all revolutionary dictatorships, and at the same time a tense and subtly intellectualized drama.&quot; -- Times Literary Supplement\n\n&quot;One of the few books written in this epoch which will survive it.&quot; -- New Statesman\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                               &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n","torrent":{"xt":"urn:btih:4690532c86c65e48aa47fa74ba5a9a45c96905ab","amp;dn":"Arthur+Koestler+-+Darkness+at+Noon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4690532c86c65e48aa47fa74ba5a9a45c96905ab","infoHashBuffer":{"type":"Buffer","data":[70,144,83,44,134,198,94,72,170,71,250,116,186,90,154,69,201,105,5,171]},"announce":[],"urlList":[]}}