{"title":"That Mitchell And Webb Sound - S01 to 05 - MP3 - Slimoo","uid":10109320,"size":776480065,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:46b13568ab63440f8edf1d57e63f357aef392e44&amp;dn=That+Mitchell+And+Webb+Sound+-+S01+to+05+-+MP3+-+Slimoo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":3,"uploader":"_Slimoo_","files":29,"time":1399498075,"description":"That Mitchell and Webb Sound - Series 01 to 05 - Audio Comedy - BBC Radio 4\n 24 x 30 Minute Episodes - 128Kbps - Mp3 - Slimoo\n\n\n That Mitchell and Webb Sound is a comedy sketch show on BBC Radio 4 which started on 28 August 2003. \n\n The series became adapted for television as That Mitchell and Webb Look in 2006. \n\n The series stars David Mitchell and Robert Webb who also write a fair amount of the material. \n\n\n Apart from Mitchell and Webb, a fair proportion of the sketches are written by the other cast members and other writers. \n These include Jesse Armstrong and Sam Bain (the writers of Peep Show, in which Mitchell and Webb star), Mark Evans, David Quantick, Jonathan Dryden Taylor, Toby Davies and John Finnemore.\n\n Unlike other recent comedy sketch shows commissioned by Radio 4 such as Little Britain, the series does not tend to rely on exaggerated characterisations. Some sketches make use of the personas Mitchell and Webb use in the series Peep Show - Webb's character enthusiastic but prone to sarcasm and Mitchell occupying a more world weary and long suffering role - but the programme showcases the pair's considerable versatility.\n\n\n Cast: \n David Mitchell \n Robert Webb \n Olivia Colman \n James Bachman \n\n\n\n\n That Mitchell And Webb Sound - S01 - E01\n That Mitchell And Webb Sound - S01 - E02\n That Mitchell And Webb Sound - S01 - E03\n That Mitchell And Webb Sound - S01 - E04\n That Mitchell And Webb Sound - S01 - E05\n That Mitchell And Webb Sound - S01 - E06\n\n That Mitchell And Webb Sound - S02 - E01\n That Mitchell And Webb Sound - S02 - E02\n That Mitchell And Webb Sound - S02 - E03\n That Mitchell And Webb Sound - S02 - E04\n That Mitchell And Webb Sound - S02 - E05\n That Mitchell And Webb Sound - S02 - E06\n\n That Mitchell And Webb Sound - S03 - E01\n That Mitchell And Webb Sound - S03 - E02\n That Mitchell And Webb Sound - S03 - E03\n That Mitchell And Webb Sound - S03 - E04\n That Mitchell And Webb Sound - S03 - E05\n That Mitchell And Webb Sound - S03 - E06\n\n That Mitchell And Webb Sound - S04 - E01\n That Mitchell And Webb Sound - S04 - E02\n That Mitchell And Webb Sound - S04 - E03\n That Mitchell And Webb Sound - S04 - E04\n That Mitchell And Webb Sound - S04 - E05\n That Mitchell And Webb Sound - S04 - E06\n\n That Mitchell And Webb Sound - S05 - E01\n That Mitchell And Webb Sound - S05 - E02\n That Mitchell And Webb Sound - S05 - E03\n That Mitchell And Webb Sound - S05 - E04\n That Mitchell And Webb Sound - S05 - E05\n\n .\n\n Audio Format : MP3\n Duration : 28mn 1s\n Bit rate mode : Constant\n Bit rate : 128 Kbps\n Channel(s) : 2 channels\n Sampling rate : 44.1 KHz\n Resolution : 16 bits","torrent":{"xt":"urn:btih:46b13568ab63440f8edf1d57e63f357aef392e44","amp;dn":"That+Mitchell+And+Webb+Sound+-+S01+to+05+-+MP3+-+Slimoo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46b13568ab63440f8edf1d57e63f357aef392e44","infoHashBuffer":{"type":"Buffer","data":[70,177,53,104,171,99,68,15,142,223,29,87,230,63,53,122,239,57,46,68]},"announce":[],"urlList":[]}}