{"title":"Spectaculator v8.0 with Key [TorDigger]","uid":8051250,"size":4634244,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:46bc9a1b4b9fc6ee2fed852637e862d5ff5adaf4&amp;dn=Spectaculator+v8.0+with+Key+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"TorDigger","files":10,"time":1358864122,"description":"Spectaculator\n\nSpectaculator is the world's premier Sinclair ZX Spectrum emulator for PCs running Microsoft Windows 8, 7, XP &amp; Vista. Spectaculator emulates the 16K/48K/128/+2/+2A/+3 Spectrums, the Russian Pentagon 128 and Scorpion ZS256 clones, and lots of additional hardware.\n\nHighlights\n\n- Play your favourite Sinclair ZX Spectrum games on your PC.\n- Play full screen or in a window, complete with TV-style picture on your monitor.\n- High fidelity 48K ZX Spectrum sound. Will even play the multi-channel music on games such as Fairlight and Arkanoid correctly.\n- Choose Kempston, Cursor, Fuller, or Sinclair Interface II joysticks and use your PC game pads to play (up to two players simultaneously). Any supported joystick can be emulated through the PC keyboard's arrow, tab and right alt keys.\n- Kempston and AMX mouse emulation.\n- Recording and playback of action replays (.rzx files)\n- Supports SNA and Z80 snapshot formats (loading and saving).\n- Support for virtual audio cassettes (TAP and TZX files):\n- Both TAP and TZX files can be fast loaded in a few seconds or less.\n- Save your game progress or other programs and data.\n- Listen to the infamous loading noise when loading from these types of file.\n- Use the virtual cassette recorder for complete control when loading multi-load games.\n- Emulates the ZX Interface 1 and up to eight Microdrives. Even generates the sound of the Microdrive motor (with and without a cartridge inserted)\n- Emulates up to 2 disk drives (the maximum the +3 can take).\n- Automatically switches the drive emulation between a +3 3&quot; (CF2) drive and a standard 3&quot; DSDD drive depending on the type of disk image inserted.\n- Accurate emulation to load all those disks with copy protection schemes such as Speedlock +3, Alkatraz +3, Three Inch Loader, Hexagon etc.\n- Fast disk access mode. Significantly reduces load and save times. Spectrum to automatically reset and start loading from the disk. Hold down Shift to override. \n\nSupported OS:\n\nMicrosoft Windows 8, 7, XP &amp; Vista\nHomepage: http://www.spectaculator.com/\n\nInstallation Instructions:\n\n- Install program.\n- Register application with given name and key.\n- Done, enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:46bc9a1b4b9fc6ee2fed852637e862d5ff5adaf4","amp;dn":"Spectaculator+v8.0+with+Key+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46bc9a1b4b9fc6ee2fed852637e862d5ff5adaf4","infoHashBuffer":{"type":"Buffer","data":[70,188,154,27,75,159,198,238,47,237,133,38,55,232,98,213,255,90,218,244]},"announce":[],"urlList":[]}}