{"title":"William Faulkner - Nobel Prize in Literature, 1949 (35 books)","uid":11740357,"size":72158726,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:47204acaaba157aca35f35cb966260a1734bc401&amp;dn=William+Faulkner+-+Nobel+Prize+in+Literature%2C+1949+%2835+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":3,"uploader":"workerbee","files":66,"time":1425767441,"description":"\n            * * This is a revised and enlarged version of an earlier torrent * * \n\n\nWILLIAM FAULKNER (1897-1962) was an American writer who was awarded the Pulitzer Prize (twice) and the 1949 Nobel Prize for Literature &quot;for his powerful and artistically unique contribution to the modern American novel.&quot;  He is primarily known and acclaimed for his novels and short stories, many of which are set in the fictional Yoknapatawpha County, a setting Faulkner created based on Lafayette County, Mississippi, where he spent most of his life, and Holly Springs/Marshall County.\n\nFaulkner began writing poems when he was a schoolboy, and in 1924 he published a poetry collection, THE MARBLE FAUN, at his own expense. His literary aspirations were fueled by his close friendship with Sherwood Anderson, whom he met during a stay in New Orleans.  Faulkner's first novel, SOLDIER'S PAY, was published in 1926, followed a year later by MOSQUITOES, a literary satire.  His next book, FLAGS IN THE DUST, was heavily cut and rearranged at the publisher's insistence and appeared finally as SARTORIS in 1929. In the meantime he had completed THE SOUND AND THE FURY, and when it appeared at the end of 1929 he had finished SANCTUARY and was ready to begin writing AS I LAY DYING.\n\nAlthough Faulkner gained literary acclaim from these and subsequent novels -- LIGHT IN AUGUST (1932), PYLON (1935), ABSALOM, ABSALOM! (1936), THE UNVANQUISHED (1938), THE WILD PALMS (1939), THE HAMLET (1940), and GO DOWN, MOSES (1942) -- and continued to publish stories regularly in magazines, he was unable to support himself solely by writing fiction.  He worked as a screenwriter for MGM, Twentieth Century-Fox, and Warner Brothers, forming a close relationship with director Howard Hawks, with whom he worked on a number of films. In 1944 all but one of Faulkner's novels were out of print, and his personal life was at low ebb due in part to his chronic heavy drinking. During the war he had been discovered by Sartre and Camus and others in the French literary world. In the postwar period his reputation rebounded, as Malcolm Cowley's anthology THE PORTABLE FAULKNER (1946) brought him fresh attention in America, and the immense esteem in which he was held in Europe consolidated his worldwide stature.\n\nFaulkner wrote seventeen books set in the mythical Yoknapatawpha County, home of the Compson family in THE SOUND AND THE FURY. &quot;No land in all fiction lives more vividly in its physical presence than this county of Faulkner's imagination,&quot; Robert Penn Warren wrote in an essay on Cowley's anthology. &quot;The descendants of the old families, the descendants of bushwhackers and carpetbaggers, the swamp rats, the Negro cooks and farm hands, the bootleggers and gangsters, tenant farmers, college boys, county-seat lawyers, country storekeepers, peddlers -- all are here in their fullness of life and their complicated interrelations.&quot;\n\nIn later books -- INTRUDER IN THE DUST (1948), REQUIEM FOR A NUN (1951), A FABLE (1954), THE TOWN (1957), THE MANSION (1959), and THE REIVERS (1962) -- he continued to explore what he had called &quot;the problems of the human heart in conflict with itself,&quot; but did so in the context of Yoknapatawpha's increasing connection with the modern world.\n\n\nThe following books are in ePUB format unless otherwise indicated:\n\n* ABSALOM, ABSALOM! (Vintage, 1990)\n\n* AS I LAY DYING (Vintage, 1990)\n\n* BIG WOODS: THE HUNTING STORIES (Vintage, 1994)\n\n* COLLECTED STORIES (Vintage, 1995)\n\n* COUNTRY LAWYER &amp; OTHER STORIES FOR THE SCREEN (University Press of Mississippi, 1987).  Edited by Louis Daniel Brodsky and Robert W. Hamblin. -- PDF\n\n* EARLY PROSE AND POETRY (Little Brown, 1962).  Edited by Carvel Collins. -- PDF\n\n* ESSAYS, SPEECHES &amp; PUBLIC LETTERS: Updated, with Material Never Before Collected in One Volume (Modern Library, 2004).  Edited by James B. Meriwether.\n\n* THE ESSENTIAL FAULKNER (Modern Library, 2012).  Edited with an Introduction and Notes by Malcolm Cowley.\n\n* A FABLE (Vintage, 2011)\n\n* FLAGS IN THE DUST (Vintage, 2012)\n\n* GO DOWN, MOSES (Vintage, 1990)\n\n* INTRUDER IN THE DUST (Vintage, 1991)\n\n* KNIGHT'S GAMBIT: Six Mystery Stories (Vintage, 2011)\n\n* LIGHT IN AUGUST (Vintage, 1990)\n\n* THE MANSION (Random House, 1959)\n\n* THE MARBLE FAUN &amp; A GREEN BOUGH (Random House, 2011)\n\n* MOSQUITOES (HarperPerennial Classics, 2013).\n\n* NEW ORLEANS SKETCHES (University Press of Mississippi, 2002).  Edited by Carvel Collins. -- PDF\n\n* THE PORTABLE FAULKNER (Viking, 1951).  Edited by Malcolm Cowley. -- PDF\n\n* PYLON: The Corrected Text (Vintage, 2011)\n\n* THE REIVERS (Vintage, 1992)\n\n* REQUIEM FOR A NUN (HarperPerennial Classics, 2012).\n\n* SANCTUARY (Vintage, 1993)\n\n* SELECTED SHORT STORIES (Modern Library, 1961) -- PDF\n\n* SNOPES: The Hamlet / The Town / The Mansion (Modern Library, 1994)\n\n* SOLDIERS' PAY (HarperCollins, 2013)\n\n* THE SOUND AND THE FURY (Vintage, 1990)\n\n* THESE 13: Stories (Random House, 2012).\n\n* THREE FAMOUS SHORT NOVELS: Spotted Horses / Old Man / The Bear (Vintage, 2011)\n\n* UNCOLLECTED STORIES (Vintage, 1997)\n\n* THE UNVANQUISHED: The Corrected Text (Vintage, 1991)\n\n* WILD PALMS [If I Forget Thee, Jerusalem] (Vintage, 1990)\n\n* THE WISHING TREE (Random House, 2012).  Illustrated by Don Bolognese.\n\n_____________________________________________________________________________\n\n\n&gt;&gt; CONTACT ME\nYou may reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\n   &lt;a href=&quot;\nhttps://pirates-forum.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://pirates-forum.org/User-workerbee&lt;/a&gt;  \n\n&gt;&gt; PLEASE HELP TO SEED!\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:47204acaaba157aca35f35cb966260a1734bc401","amp;dn":"William+Faulkner+-+Nobel+Prize+in+Literature%2C+1949+%2835+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47204acaaba157aca35f35cb966260a1734bc401","infoHashBuffer":{"type":"Buffer","data":[71,32,74,202,171,161,87,172,163,95,53,203,150,98,96,161,115,75,196,1]},"announce":[],"urlList":[]}}