{"title":"A Todo Gas 3 (Spanish) BluRay RIP Xvid-Ac3 5.1","uid":4827928,"size":1488752640,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:47455a7559194c46c38ad73a8b99cec3a14b6e5e&amp;dn=A+Todo+Gas+3+%28Spanish%29+BluRay+RIP+Xvid-Ac3+5.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"mdq1","files":-1,"time":1238978133,"description":"DirecciÃƒÂ³n: Justin Lin.\nPaÃƒÂ­s: USA.\nAÃƒÂ±o: 2006.\nDuraciÃƒÂ³n: 104 min.\nGÃƒÂ©nero: AcciÃƒÂ³n.\nInterpretaciÃƒÂ³n: Lucas Black (Sean Boswell), Bow Wow (Twinkie), Nathalie Kelley (Neela), Brian Tee (D.K.), Sung Kang (Han), Leonardo Nam (Morimoto), Brian Goodman (Sr. Boswell), Sonny Chiba (TÃƒÂ­o Kamata).\nGuiÃƒÂ³n: Chris Morgan.\nProducciÃƒÂ³n: Neal H. Moritz.\nMÃƒÂºsica: Brian Tyler.\nFotografÃƒÂ­a: Stephen Windon.\nMontaje: Fred Raskin y Kelly Matsumoto.\nDiseÃƒÂ±o de producciÃƒÂ³n: Ida Random.\nVestuario: Sanja Milkovic Hays.\nEstreno en USA: 16 Junio 2006.\nEstreno en EspaÃƒÂ±a: 21 Julio 2006.\n\nSINOPSIS\n\nPara Sean Boswell (Lucas Black), las carreras callejeras suponen una vÃƒÂ­a de escape de un hogar infeliz y un entorno superficial. Pero su conducciÃƒÂ³n temeraria le ha vuelto muy impopular con las autoridades locales. Tras sufrir un nuevo accidente, y para no acabar en la cÃƒÂ¡rcel, se aviene a marcharse a vivir con su padre, con el que ya no tenÃƒÂ­a apenas relaciÃƒÂ³n, en su destino militar en Tokio. Sean se siente muy aislado en un paÃƒÂ­s con costumbres y cÃƒÂ³digos de honor extraÃƒÂ±os para ÃƒÂ©l. Su amigo americano Twinkie (Bow Wow) le introduce en el mundo de las carreras drift: un vertiginoso equilibrio entre la velocidad y saber manejarse a travÃƒÂ©s de un peligroso circuito lleno de giros y cambios de sentido imposibles. Sean vuelve a engancharse y vuelve a meterse en lÃƒÂ­os. En su primer dÃƒÂ­a de carreras Sean reta a D.K. (Brian Tee), el &quot;rey del drift&quot;, un campeÃƒÂ³n local conectado con los yakuzas, el sindicato japonÃƒÂ©s del crimen. Tras perder, Sean se ve obligado a pagar su deuda trabajando a las ÃƒÂ³rdenes de Han (Sung Kang), que pronto le admite en su familia de proscritos y le enseÃƒÂ±a el autÃƒÂ©ntico mundo del drifting, en donde la carrera se convierte en una forma artÃƒÂ­stica. Cuando Sean se enamora de la novia de D.K., Neela (Nathalie Kelley), se desata una explosiva serie de acontecimientos que culmina con un enfrentamiento final con su rival. El honor estÃƒÂ¡ en juego y el talento de un piloto se pone a prueba hasta el lÃƒÂ­mite... sÃƒÂ³lo hay lugar para un campeÃƒÂ³n.\n\n\nwww.CentralDivx.com\n\nwww.Central-Torrent.com\n\nwww.Estrenos-Sub.com","torrent":{"xt":"urn:btih:47455a7559194c46c38ad73a8b99cec3a14b6e5e","amp;dn":"A+Todo+Gas+3+%28Spanish%29+BluRay+RIP+Xvid-Ac3+5.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47455a7559194c46c38ad73a8b99cec3a14b6e5e","infoHashBuffer":{"type":"Buffer","data":[71,69,90,117,89,25,76,70,195,138,215,58,139,153,206,195,161,75,110,94]},"announce":[],"urlList":[]}}