{"title":"The Root of all Evil - Richard Dawkins  (2006)","uid":5066986,"size":889292847,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:47e617d0347395b1dd4778d33f312a0514e3cbd4&amp;dn=The+Root+of+all+Evil+-+Richard+Dawkins++%282006%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"eddie1969","files":-1,"time":1251061678,"description":"TV : Documentary : DVD quality : English\n\n\n\n&quot;The Root of All Evil?&quot; is a television documentary, written and presented by Richard Dawkins, in which he argues that the world would be better off without religion. The documentary was first broadcast in January 2006, in the form of two 45 minute episodes (excluding advertisement breaks), on Channel 4 in the UK. Dawkins said that the title &quot;The Root of All Evil?&quot; was not his prefered choice, but that Channel 4 had insisted on it to create controversy. The documentary is in two parts:\n\nPart 1: The God Delusion\n\nThe God Delusion explores the unproven traditions that are treated as fact by religious faiths, and the extremes to which some followers have taken them. Dawkins opens the programme by describing the &quot;would-be murderers . . . who want to kill you and me, and themselves, because they're motivated by what they think is the highest ideal.&quot; Dawkins argues that &quot;the process of non-thinking called faith&quot; is not a way of understanding the world, but instead lies in fundamental opposition to modern science and the scientific method.\n\nPart 2: The Virus of Faith\n\nIn The Virus of Faith, Dawkins makes a more emotional appeal. He examines the moral framework that religions are often cited as providing, and argues against the religious indoctrination of children. The title of this episode comes from his prize-winning books, &quot;The Selfish Gene&quot;, in which Dawkins first introduced the concept of the meme, a self-replicating unit of cultural evolution, of which he would say religions are largely composed.\n\n\nQuotes from the film:\n\n* 'The time has come for people of reason to say: enough is enough. Religious faith discourages independent thought, it's divisive, and it's dangerous.'\n\n* 'For many people, part of growing up is killing off the virus of faith with a good strong dose of rational thinking. But if an individual doesn't succeed in shaking it off, his mind is stuck in a permanent state of infancy, and there is a real danger that he will infect the next generation.'\n\n* 'The god of the Old Testament has got to be the most unpleasant character in all fiction: jealous and proud of it, petty, vindictive, unjust, unforgiving, racist, an ethnic-cleanser urging his people on to acts of genocide.'\n\n* 'Fundamentalist Christianity is on the rise among the electorate of the world's only super power, right up to and including the President. If you believe the surveys, 45 percent of Americans, that's about 135 million people, believe the universe is less than ten thousand years old'.\n\n* 'We are going to die, and that makes us the lucky ones. Most people are never going to die, because they are never going to be born. We are privileged to be alive, and we should make the most of our time on this world.'\n\n* 'We are all atheists about most of the gods that societies have ever believed in. Some of us just go one god further.'\n\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:47e617d0347395b1dd4778d33f312a0514e3cbd4","amp;dn":"The+Root+of+all+Evil+-+Richard+Dawkins++%282006%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47e617d0347395b1dd4778d33f312a0514e3cbd4","infoHashBuffer":{"type":"Buffer","data":[71,230,23,208,52,115,149,177,221,71,120,211,63,49,42,5,20,227,203,212]},"announce":[],"urlList":[]}}