{"title":"Code Monkeys - Seasons 1-2 + Extras (Complete)","uid":4466970,"size":4909773801,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:48808354a2d20223fb2824cba466633c2509851d&amp;dn=Code+Monkeys+-+Seasons+1-2+%2B+Extras+%28Complete%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":4,"uploader":"BloodLogic","files":43,"time":1224957283,"description":"Code Monkeys - Seasons 1-2 + Extras (Complete)\n[G4TV, Cartoon/Game Comedy]\n\nSeason 1 Rips by Sys and W4F\nSeason 2 Rips by MoonSong and Sys\nExtras Ripped by BloodLogic\nSeason 2 Delivered to the MySpleen.Net network by ChonLee\nDelivered to the Public by BloodLogic\n\nDescription: The plot of Code Monkeys revolves around the fictitious video game company GameaVision (a play on companies like ActiVision and ColecoVision) and its eccentric employees, mainly the slacker Dave and his high-strung friend Jerry. The entire series takes place in the city of Sunnyvale, California, one of the major cities that comprises the Silicon Valley. The humor in Code Monkeys is mostly grounded in toilet humor and black comedy. Some of the show's jokes stem from its numerous references to video games, past and present, but mostly those from the 8-bit era including Castlevania, Mega Man, Contra, Ikari Warriors, Mike Tyson's Punch-Out!!, and Super Mario Bros. This also extends to cameos from well known video game developers, who appear in the show pitching their ideas to GameaVision for the games that would later make them famous, usually to be rejected, insulted, and sometimes injured or killed off.\n\nWIKI: http://en.wikipedia.org/wiki/Code_Monkeys\nIMDB: http://www.imdb.com/title/tt1068683/\n\nCreator: Adam De La PeÃƒÂ±a.\nWriter: Adam De La PeÃƒÂ±a\nDirector: Adam De La PeÃƒÂ±a.\nStarring: Adam De La PeÃƒÂ±a, Andrew Sipes, Matt Mariska, Gretchen McNeil, Tony Strickland, Lionel Tubbins, Suzanne Keilly, Carmine Decenzo, Tommy Busby, Dana Snyder (from ATHF/Aqua Teen Hunger Force), James Tiberius, Jessica Meyerson, Ted Raimi, Marisa Wahl, Keith Lal, Matt Lawton, David Dameshek, Julia Rose, B.J. McCrory, Sandra Lawrence, Kirsten Roeters, Adam Diosdado, Paul Raff, Billy Acquaviva Jr., Isao, Blake Kushi, Matthew Lawton, Jaime Richter, Donovan Santiago, Rachael Sipes, Christine Connor, Ariz de la Pena.\n\nVLC Player Compatible (verson # 0.8.6f): {Tested and Confirmed}\n\nSeason 1...\n\nS01E01 - The Woz\nS01E02 - ET\nS01E03 - Stonervision\nS01E04 - Super Prison Breakout\nS01E05 - Just One Of The Gamers\nS01E06 - The Take Over\nS01E07 - Larritys' Got Back\nS01E08 - IPO\nS01E09 - Todd Loses His Mind\nS01E10 - Third Reich's the Charm\nS01E11 - Wrassle Mania\nS01E12 - Vegas, Baby!\nS01E13 - The Revenge of Matsui\n\nSeason 2...\n\nS02E01 - The Story of 420\nS02E02 - Psychological Problems\nS02E03 - My Pal Jodie\nS02E04 - Dave Gets Boobs\nS02E05 - Valley of the Silicon Dolls\nS02E06 - The Kid is Mine\nS02E07 - Dean In Charge\nS02E08 - Drunken Office Party\nS02E09 - Trouble in the Middle East\nS02E10 - Benny's Birthday\nS02E11 - The Great Recession\nS02E12 - Dave's Day Off\nS02E13 - Car Robber Sunnyvale\n\nExtras...\n\nExtras - Recording With Adam de la Pena\nGameavision Trailers - Bar Fight\nGameavision Trailers - Cross Walk\nGameavision Trailers - Floating Space Rocks (Gameplay)\nGameavision Trailers - Sir Eats-A-Lot (Gameplay)\nInterview - G4 with Steve Wozniak and Adam de la Pena\nInterview - Geekscape with Adam de la Pena\nPromos - Critic's Spot\nPromos - Evolution of Black Steve\nPromos - Meet Dave and Jerry\nPromos - Prank of the Day #1\nPromos - Prank of the Day #2\nPromos - Season 1 Promo\nPromos - Thanks For Wiping My Ass\n&quot;Code Monkeys&quot; Theme Song by Jonathan Coulton (Video by Mike Spiff Booth)\n\n[Episode Guide Included.]\n\n[BLX Note: I uploaded the &quot;Code Monkeys, Season 1 Complete&quot; torrent over a year ago back in Operation Massive Information Leak, Wave One, and now it's time to release seasons 1 and 2 with the extras.  The season 1 torrent has thus been removed to make room for this torrent.]\n\n[BLX Note(2): I love the ads for this television show. They quote a bunch of critics who like it, and then &quot;And even the New York Times says 'It's like an arcade game with potty mouth!'&quot; with the words flashing acrossing the screen very fast. Ummmmm, I don't know what G4 is trying to pull, but that definitely is not a compliment. Even BloodLogic says, &quot;Two thirds of the jokes should be replaced with a soundtrack of Gary Numan's greatest hits!&quot; Yeah, even *I* say that, meaning... wait, that wasn't a compliment. You're goddamned right it wasn't. But if you're a multi-millionaire moron and you run a television network, that's a classy way to put spin on something that was meant as an insult. So, seriously, if you want to play an arcade game with potty mouth, just google &quot;flash game&quot; or &quot;shockwave games.&quot; And if those are equal to this, then ouch. Screw G4, anyway, because this is their only good show, and they're pimping it to the max. Everything else they do is literally like a nerd-convention with fans of the movies the Matrix and Hackers. Which is why you haven't seen anything else they've done, like X-Play or Attack of the Show. Oh, well. At least some of the humor is intelligent and dark enough, plus you get to see Dana Snyder, the voice of Master Shake, playing an oedipal-complex, D&amp;D nerd. But, that's about it -- and yes, watch the interview with de la Pena, because all he really knows how to do is drop that name. &quot;Aqua Teen Hunger Force,&quot; &quot;Master Shake,&quot; &quot;Aqua Teen Hunger Force,&quot; &quot;Master Shake,&quot; &quot;...and Code Monkeys.&quot; -- &quot;Dana Snyder is my personal friend,&quot; like it's some preteen girl talking about Tom Cruise. Okay, buddy, we believe you have friends. Yes, squeaze every last bit of juice out of that name so perhaps people will make a false association, because Aqua Teen Hunger Force rips this show to shreds in its sleep. Other than that, I love the constant use of Marijuana by the characters, and would like for all television shows to start humanizing my culture.]\n\nThis torrent is a part of Operation: Massive Information Leak, Wave Two.\nBloodLogic","torrent":{"xt":"urn:btih:48808354a2d20223fb2824cba466633c2509851d","amp;dn":"Code+Monkeys+-+Seasons+1-2+%2B+Extras+%28Complete%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48808354a2d20223fb2824cba466633c2509851d","infoHashBuffer":{"type":"Buffer","data":[72,128,131,84,162,210,2,35,251,40,36,203,164,102,99,60,37,9,133,29]},"announce":[],"urlList":[]}}