{"title":"A.Doctors.Guide.to.Alternative.Medicine.What.Works.What.Doesnt.a","uid":11598528,"size":9964260,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4925df8131f82487711c5d3bdb8b2d57efec5e48&amp;dn=A.Doctors.Guide.to.Alternative.Medicine.What.Works.What.Doesnt.a&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"wildturkey00","files":2,"time":1417313513,"description":"Format: PDF\nGenre: Alternative Medicine/tutorial\nPublished: 2014\n\nAS USUAL IF YOU ARE HAVING TROUBLE OPENING UP MY EBOOK FILES USE CALIBRE, IT IS FREE, AND OPENS ANY FORMAT... IF YOU CANT OPEN IT WITH CALBIRE, IT WILL CONVERT THE EBBOK TO WHATEVER FORMAT YOU WANT (example: EPUBtoPDF, PDFtoMOBI....ect) ALSO, i DO NOT HAVE THE TIME TO OPEN/CHECK EVERY FILE THAT i DOWNLOAD, IF IT IS TAGGED AS SOMEONE ELSES PLEASE SEND ME A PM SO THAT I CAN DELETE IT....I DONT KNOW ABOUT YOU BUT I HAVE TO WORK TWO SHITTY JOBS AND DO SCHOOL/HOMEWORK AND DONT HAVE THE TIME TO DO SO. FINAL NOTE: IF THE TORRENT WILL NOT DOWNLOAD OR FULLY DOWNLOAD PLEASE SEND ME A PM SO THAT I CAN FIX THE PROBLEM. THANKS IN ADVANCE :)\n\nBook Description: In the United States alone, than 38 percent of people use Alternative Medicine to treat and prevent medical issues and than 50 percent of people have tried Alternative Medicine at some point in their life. But because some people don't feel their doctors see those methods as legitimate, patients often turn to unreliable sources such as the internet, celebrities, etc. for guidance. With so much misinformation out there, how does anyone know which advice to follow and what actually works?\nIn this book, Dr. Mel Borins answers these questions using the latest scientific research and double-blind studies to educate patients and physicians alike on which alternative treatments work, which don't, and why. And importantly, it teaches them how to safely use these alternative treatments, as a reputable source of information to supplement their conventional medicine treatments. Written in clear, accessible language for the layperson while providing citations to full studies for the medical professional, the book covers traditional healing and herbal remedies, physical therapies, psychological therapies, and natural health products--making it perfect for alternative medicine skeptics looking for hard evidence, doctors of conventional medicine seeking to understand why alternative therapies work, and for those open to alternative medicine but who want to understand the benefits and dangers; these include America's 78 million Baby Boomers who purchase 77 percent of all prescriptions drugs and are seeking ways to treat their health issues without causing of them","torrent":{"xt":"urn:btih:4925df8131f82487711c5d3bdb8b2d57efec5e48","amp;dn":"A.Doctors.Guide.to.Alternative.Medicine.What.Works.What.Doesnt.a","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4925df8131f82487711c5d3bdb8b2d57efec5e48","infoHashBuffer":{"type":"Buffer","data":[73,37,223,129,49,248,36,135,113,28,93,59,219,139,45,87,239,236,94,72]},"announce":[],"urlList":[]}}