{"title":"Introductory Econometrics for Finance, 3rd Edition","uid":10262134,"size":11668351,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:495b75959c4294dd0fedde12e30c9d78f8d30202&amp;dn=Introductory+Econometrics+for+Finance%2C+3rd+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"moneymakestheworldgoround","files":-1,"time":1401476845,"description":"ABOUT THIS BOOK\nThis bestselling and thoroughly classroom-tested textbook is a complete resource for finance students. A comprehensive and illustrated discussion of the most common empirical approaches in finance prepares students for using econometrics in practice, while detailed case studies help them understand how the techniques are used in relevant financial contexts. Worked examples from the latest version of the popular statistical software EViews guide students to implement their own models and interpret results. Learning outcomes, key concepts and end-of-chapter review questions (with full solutions online) highlight the main chapter takeaways and allow students to self-assess their understanding. Building on the successful data- and problem-driven approach of previous editions, this third edition has been updated with new data, extensive examples and additional introductory material on mathematics, making the book more accessible to students encountering econometrics for the first time. A companion website, with numerous student and instructor resources, completes the learning package.\n\n-A complete package for finance students - assumes no background in econometrics\n-Includes full web support for students and instructors, with data sets, additional -chapter questions (with answers provided), lecture slides, support for popular statistical software packages and links to sources of financial data and articles\n-Incorporates data, tutorials and screenshots from the latest version of the statistical software EViews\n-Includes worked examples on how to conduct events studies and the Fama-MacBeth method, two of the most common empirical approaches in finance, ensuring that students are well-prepared for econometrics in practice\n\n\nTABLE OF CONTENTS\nPreface to the third edition\nAcknowledgements\n1. Introduction\n2. Mathematical and statistical foundations\n3. A brief overview of the classical linear regression model\n4. Further development and analysis of the classical linear regression model\n5. Classical linear regression model assumptions and diagnostic tests\n6. Univariate time series modelling and forecasting\n7. Multivariate models\n8. Modelling long-run relationships in finance\n9. Modelling volatility and correlation\n10. Switching models\n11. Panel data\n12. Limited dependent variable models\n13. Simulation methods\n14. Conducting empirical research or doing a project or dissertation in finance\nAppendix 1. Sources of data used in this book\nAppendix 2. Tables of statistical distributions\nGlossary\nReferences\nIndex.\n\n\nABOUT THE AUTHOR\nChris Brooks, University of Reading\nChris Brooks is Professor of Finance and Director of Research at the ICMA Centre, Henley Business School, University of Reading, where he also obtained his PhD. He has diverse research interests and has published over a hundred articles in leading academic and practitioner journals, and six books. He is Associate Editor of several journals, including the Journal of Business Finance and Accounting, the International Journal of Forecasting and the British Accounting Review. He acts as consultant and advisor for various banks, corporations and professional bodies in the fields of finance, real estate, and econometrics.","torrent":{"xt":"urn:btih:495b75959c4294dd0fedde12e30c9d78f8d30202","amp;dn":"Introductory+Econometrics+for+Finance%2C+3rd+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"495b75959c4294dd0fedde12e30c9d78f8d30202","infoHashBuffer":{"type":"Buffer","data":[73,91,117,149,156,66,148,221,15,237,222,18,227,12,157,120,248,211,2,2]},"announce":[],"urlList":[]}}