{"title":"Susanna Clarke - Jonathan Strange &amp; Mr Norrell","uid":12303455,"size":956963321,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:49e3a9a2262f0122989fbc4cffa1068b19671d67&amp;dn=Susanna+Clarke+-+Jonathan+Strange+%26amp%3B+Mr+Norrell&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"Cybotage","files":625,"time":1440755988,"description":"The drawing room social comedies of early 19th-century Britain are infused with the powerful forces of English folklore and fantasy in this extraordinary novel of two magicians who attempt to restore English magic in the age of Napoleon. In Clarke's world, gentlemen scholars pore over the magical history of England, which is dominated by the Raven King, a human who mastered magic from the lands of faerie. The study is purely theoretical until Mr. Norrell, a reclusive, mistrustful bookworm, reveals that he is capable of producing magic and becomes the toast of London society, while an impetuous young aristocrat named Jonathan Strange tumbles into the practice, too, and finds himself quickly mastering it. Though irritated by the reticent Norrell, Strange becomes the magician's first pupil, and the British government is soon using their skills. Mr. Strange serves under Wellington in the Napoleonic Wars (in a series of wonderful historical scenes), but afterward the younger magician finds himself unable to accept Norrell's restrictive views of magic's proper place and sets out to create a new age of magic by himself. Clarke manages to portray magic as both a believably complex and tedious labor, and an eerie world of signs and wonders where every object may have secret meaning. London politics and talking stones are portrayed with equal realism and seem indisputably part of the same England, as signs indicate that the Raven King may return. The chock-full, old-fashioned narrative (supplemented with deft footnotes to fill in the ignorant reader on incidents in magical history) may seem a bit stiff and mannered at first, but immersion in the mesmerizing story reveals its intimacy, humor and insight, and will enchant readers of fantasy and literary fiction alike.\n\n\nread by Simon Prebble\n64Kbps","torrent":{"xt":"urn:btih:49e3a9a2262f0122989fbc4cffa1068b19671d67","amp;dn":"Susanna+Clarke+-+Jonathan+Strange+%26amp%3B+Mr+Norrell","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49e3a9a2262f0122989fbc4cffa1068b19671d67","infoHashBuffer":{"type":"Buffer","data":[73,227,169,162,38,47,1,34,152,159,188,76,255,161,6,139,25,103,29,103]},"announce":[],"urlList":[]}}