{"title":"Origami Paper Airplanes","uid":8352833,"size":93366875,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4a27bcf63070f414154a6456766c5229f8b9bab7&amp;dn=Origami+Paper+Airplanes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":2,"uploader":"mdusanjay","files":-1,"time":1365392930,"description":"Didier Boursin - Origami Paper Airplanes\nFirefly Books | 2001 | ISBN: 1552096165, 1552096262 | English | 66 pages | PDF | 89.04 MB\n\nOrigami is an ancient art, yet modern paper folders can still invent fascinating new folds. Origami Paper Airplanes is filled with new and outstanding folds that will delight, amuse, and inspire paper folders of all ages. They offer a wide variety of designs that are rated according to skill level. Everyone, from beginners to experienced folders, will find something here to delight the hand and eye.\nEach book opens with four pages of instructions in basic folding techniques, the symbols used in the book and a discussion of the various papers you work with. Then come the specific folds - Origami Paper Airplanes offers 28 different designs of aircraft that include traditional planes, new creations, and other flying objects such as windmills and frisbees. Extremely detailed technical drawings, in color, accompany the reader every step of the way from the very first crease through to the remarkable finished creation.\nWith their elegant and fascinating folds, these are among the most innovative origami books available. They are suited for folders of all ages and skill levels. Thoroughly tested and carefully designed instructions make it possible for anyone to achieve results on the first try.","torrent":{"xt":"urn:btih:4a27bcf63070f414154a6456766c5229f8b9bab7","amp;dn":"Origami+Paper+Airplanes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a27bcf63070f414154a6456766c5229f8b9bab7","infoHashBuffer":{"type":"Buffer","data":[74,39,188,246,48,112,244,20,21,74,100,86,118,108,82,41,248,185,186,183]},"announce":[],"urlList":[]}}