{"title":"David Brooks The Social Animal 2011 Retail EPUB eBook-BitBook","uid":8192079,"size":572693,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4a307ce5fb072bbeb80a364a25ecad56949ad107&amp;dn=David+Brooks+The+Social+Animal+2011+Retail+EPUB+eBook-BitBook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"BlackTar","files":3,"time":1361848548,"description":" |                           The Social Animal                                |\n |                                                                            |\n |                                                                            |\n |                                                                            |\n |                                                                            |\n | DATE: 2012-07-07  SIZE: 543,58KB DISKS: 01_______4,77MB      PAGES:        |\n |                                                                            |\n | PUBLISHER: Random House Publishing Group     GENRE: Social Science         |\n |                                                                            |\n | AUTHOR: David Brooks                                                       |\n |                                                                            |\n | FORMAT: EPUB   PROTECTION: DRM     EDITION:                                |\n |                                                                            |\n | URL: http://is_gd/hGgWKR                                                   |\n |                                                                            |\n | LANGUAGE: English   ISBN: 9780679603931                                    |\n :                                                                            :\n : With unequaled insight and brio, New York Times columnist David Brooks     :\n : hasons of success and looks toward a culture based on trust and humility.  :\n : The Social Animal is a moving intellectual adventure, a story of           :\n : achievement and a defense of progress. It is an essential book for our     :\n : time--one that will have broad social impact and will change the way we see:\n : ourselves and the world. long explored and explained the way we live. Now  :\n : Brooks turns to the building blocks of human flourishing in a multilayered,:\n : profoundly illuminating work grounded in everyday life. This is the story  :\n : of how success happens, told through the lives of one composite American   :\n : couple, Harold and Erica. Drawing on a wealth of current research from     :\n : numerous disciplines, Brooks takes Harold and Erica from infancy to old    :\n : age, illustrating a fundamental new understanding of human nature along the:\n : way: The unconscious mind, it turns out, is not a dark, vestigial place,   :\n : but a creative one, where most of the brain's work gets done. This is the  :\n : realm where character is formed and where our most important life decisions:\n : are made--the natural habitat of The Social Animal. Brooks reveals the     :\n : deeply social aspect of our minds and exposes the bias in modern culture   :\n : that overemphasizes rationalism, individualism, and IQ. He demolishes      :\n : conventional definitions of success and looks toward a culture based on    :\n : trust and humility. The Social Animal is a moving intellectual adventure, a:\n : story of achievement and a defense of progress. It is an essential book for:\n : our time--one that will have broad social impact and will change the way we:\n : see ourselves and the world.                                               :","torrent":{"xt":"urn:btih:4a307ce5fb072bbeb80a364a25ecad56949ad107","amp;dn":"David+Brooks+The+Social+Animal+2011+Retail+EPUB+eBook-BitBook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a307ce5fb072bbeb80a364a25ecad56949ad107","infoHashBuffer":{"type":"Buffer","data":[74,48,124,229,251,7,43,190,184,10,54,74,37,236,173,86,148,154,209,7]},"announce":[],"urlList":[]}}