{"title":"daz3d - STO Romulan Battlecruiser Bundel","uid":15990177,"size":11202515,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:4ac66a675aac5c6b7aef73cd62d0693cecb7d89a&amp;dn=daz3d+-+STO+Romulan+Battlecruiser+Bundel&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"soeperman","files":2,"time":1476006568,"description":"daz3d - STO Romulan Battlecruiser Bundel:\r\n\r\nUnfortunally i uploaded one as it was called vastam battlecruiser, however i noticed later that there was an problem with the model.\r\n\r\nso here is a new one with the corrected model and its now a set of three models both has iray and 3delight.\r\n\r\nPs, if you had downloaded the first one, let these files overwrite them so that they are replaced with the new one.\r\n\r\nwhat is included:\r\n\r\nVastam Class:\r\n\r\nThe Command Warbirds share a similar design to other Republic ships, with a large primary hull and wings unfurling from either side. The Vastam class has a sleeker design than the other Command Warbirds with a narrower hull and its wings swept back. Its primary and secondary nacelles extend back from the tips of the wings, and the ship's tertiary nacelles fit between the wings and the main hull. \r\n\r\nBaratan Class:\r\n\r\nThe Baratan class is the largest of the Command Warbirds. With its forward hull resembling a hooked beak and its massive wings sweeping forwards, the ship is an impressive sight. Like the other Command Warbirds it has primary and secondary nacelles built into its wing-tips, and tertiary nacelles extending up from the main hull. \r\n\r\nDeihu Class:\r\n\r\nWith a bulky main hull the Deihu class's wings curve forwards smoothly with jagged rear edges, ending in the primary and secondary nacelles. As with the other Command Warbirds, the ship has tertiary nacelles attached to the rear of the main hull. \r\n\r\nThey are for sale in STO for 6.000 zen (or something).. here they are free","torrent":{"xt":"urn:btih:4ac66a675aac5c6b7aef73cd62d0693cecb7d89a","amp;dn":"daz3d+-+STO+Romulan+Battlecruiser+Bundel","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ac66a675aac5c6b7aef73cd62d0693cecb7d89a","infoHashBuffer":{"type":"Buffer","data":[74,198,106,103,90,172,92,107,122,239,115,205,98,208,105,60,236,183,216,154]},"announce":[],"urlList":[]}}