{"title":"Star Trek Elite Force II (2) PC With Key (no fixed EXE needed)","uid":4467994,"size":1147037761,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4b8b71bc3cea6fe27d66e9f7d76eb6eca4b1eff7&amp;dn=Star+Trek+Elite+Force+II+%282%29+PC+With+Key+%28no+fixed+EXE+needed%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"riaros","files":1,"time":1224992687,"description":"Star Trek Elite Force II for PC. This torrent includes both the CD ISO's packed into one .rar file. \n\nExtraction:\n\nPlease only use 7-zip to extract the rar file since it is the only program that lets you bypass extracting errors which you will encounter at the end of extraction, but don't worry because the ISO's are fully intact as i've tested them myself. The game works on both XP and Vista.\n\nHow to install and use:\n\nDownload and install daemon tools. Mount CD1/ISO1 in daemon tools and run the installer. Mount CD2/ISO2 in the same virtual drive when asked for CD2 and so on. Alternativly you could burn the iso's to two CD's but i haven't tested that method so do so at your own risk!\n\nPatches and maps:\n\nThis game has a vast amount of mods and maps available for use. Go to www.effiles.com to download them. Please ensure you download the 1.1 patch in order to play online. \n\nAll mods/maps/skins (excluding self installing ones) must be unzipped and placed in the Elite force II base folder in order to work, the files should be in .pk3 form in order to work. \n\nCracks/CD Keys:\nNo fixed EXE is needed. The cd key is: HJJJ-FXX7-WHTX-W4AK-9702. This key will work for everyone all the time no matter how many people are using it online.\n\nENJOY\n\n------------Update for those who intend to play online------------\n\nThe original master server for Elite Force II no longer exists, this means that anyone who attemps to play online will not be able to get a server list in the multiplayer menu, even patched versions of Elite Force II. \n\nHowever, a solution to this problem now exists and the patch can be downloaded from http://defiantsquadron.net/files/ef2_client-side_master-server_patch.zip\n\nThis patch fixes the server list issue and also allows anyone to host a dedicated internet server from within EF2 without any modification.\n\nNOTE: It seems the original master server is back online, for now. However the patch will still be available incase the master goes down again.","torrent":{"xt":"urn:btih:4b8b71bc3cea6fe27d66e9f7d76eb6eca4b1eff7","amp;dn":"Star+Trek+Elite+Force+II+%282%29+PC+With+Key+%28no+fixed+EXE+needed%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b8b71bc3cea6fe27d66e9f7d76eb6eca4b1eff7","infoHashBuffer":{"type":"Buffer","data":[75,139,113,188,60,234,111,226,125,102,233,247,215,110,182,236,164,177,239,247]},"announce":[],"urlList":[]}}