{"title":"Medical Microbiology, 18E [Epub]~StormRG~","uid":9644444,"size":11464553,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4bc0a98aa422206307fbbd59987a08bf9e859bce&amp;dn=Medical+Microbiology%2C+18E+%5BEpub%5D%7EStormRG%7E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"0xmovva","files":-1,"time":1392969808,"description":"Author: David Greenwood, Richard C. B. Slack, Michael R. Barer, Will L Irving \nSeries: Greenwood,Medical Microbiology\nPaperback: 794 pages\nPublisher: Churchill Livingstone; 18 edition (August 6, 2012)\nLanguage: English\nISBN-10: 0702040894\nISBN-13: 978-0702040894\nFormat: Retail Epub\nReader Required: Adobe Digital Editions, Calibre, MoonReader for Android\n\nNOTE: no PDF available, if you want it to scroll like a PDF just read it in Calibre.\nThis is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n\nMedical microbiology concerns the nature, distribution and activities of microbes and how they impact on health and wellbeing, most particularly as agents of infection. Infections remain a major global cause of mortality and in most hospitals around one in ten of those admitted will suffer from an infection acquired during their stay. The evolution of microbes presents a massive challenge to modern medicine and public health. The constant changes in viruses such as influenza, HIV, tuberculosis, malaria and SARS demand vigilance and insight into the underlying process.\n\nBuilding on the huge success of previous editions, Medical Microbiology 18/e will inform and inspire a new generation of readers. Now fully revised and updated, initial sections cover the basic biology of microbes, infection and immunity and are followed by a systematic review of infective agents, their associated diseases and their control. A final integrating section addresses the essential principles of diagnosis, treatment and management. An unrivalled collection of international contributors continues to ensure the relevance of the book worldwide and complementary access to the complete online version on Student Consult further enhances the learning experience.\n\nMedical Microbiology is explicitly geared to clinical practice and is an ideal textbook for medical and biomedical students and specialist trainees. It will also prove invaluable to medical laboratory scientists and all other busy professionals who require a clear, current and most trusted guide to this fascinating field.\n","torrent":{"xt":"urn:btih:4bc0a98aa422206307fbbd59987a08bf9e859bce","amp;dn":"Medical+Microbiology%2C+18E+%5BEpub%5D%7EStormRG%7E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4bc0a98aa422206307fbbd59987a08bf9e859bce","infoHashBuffer":{"type":"Buffer","data":[75,192,169,138,164,34,32,99,7,251,189,89,152,122,8,191,158,133,155,206]},"announce":[],"urlList":[]}}