{"title":"SECRET AVENGERS Volume 1 01-37 (2010-2013) (Marvel) COMPLETE","uid":8625050,"size":1275322251,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:4befb13dfd4ed4a288e014efc8f7752acb0f9c89&amp;dn=SECRET+AVENGERS+Volume+1+01-37+%282010-2013%29+%28Marvel%29+COMPLETE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"STFmaryville","files":-1,"time":1372477948,"description":"Secret Avengers was launched as a new monthly series in 2010, written by Ed Brubaker and drawn by Mike Deodato. Steve Rogers (whose identity as Captain America had passed to Bucky Barnes) was now the head of United States national security following the downfall of Norman Osborn. Rogers gathered a strike team of superheroes to act as his covert operatives, similar to the &quot;Mission: Impossible&quot; concept.\n\nBrubaker's first story arc features Rogers, Sharon Carter, the Beast, Black Widow, Moon Knight, Valkyrie, War Machine, the 3rd Ant-Man, and -- revealed as the story progressed -- Nova.\n\nBeast, Black Widow, Valkyrie and Rogers/Captain America are the core of the team, while Hawkeye and Captain Britain join and play large roles in Rick Remender's run. Remender's arcs include &quot;Avengers Vs. X-Men&quot; crossovers interrupting his epic introduction of &quot;Descendents&quot;, which led to the death of a team member and eventually closed out the volume.\n\nBetween Brubaker and Remender, there are arcs by Nick Spencer (tie-ins with the Fear Itself crossover) and Warren Ellis. The series had 2 &quot;jump-on&quot; .1 special issues, which are included in the torrent, making 39 total issues. (2012 saw Marvel adopt double-shipping schedules for popular titles, and this one shipped 16 issues.)\n\nThe title has been relaunched this spring with a new #1 issue as a Marvel NOW title, once again written by Spencer.\n\nEnjoy and please seed!  --STF","torrent":{"xt":"urn:btih:4befb13dfd4ed4a288e014efc8f7752acb0f9c89","amp;dn":"SECRET+AVENGERS+Volume+1+01-37+%282010-2013%29+%28Marvel%29+COMPLETE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4befb13dfd4ed4a288e014efc8f7752acb0f9c89","infoHashBuffer":{"type":"Buffer","data":[75,239,177,61,253,78,212,162,136,224,20,239,200,247,117,42,203,15,156,137]},"announce":[],"urlList":[]}}