{"title":"Java EE 7 The Big Picture - Dr. Danny Coward","uid":11732925,"size":9797462,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4c0d784a3b858f6a7bf986162b6af84d1f13d23e&amp;dn=Java+EE+7+The+Big+Picture+-+Dr.+Danny+Coward&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1425456381,"description":"Java EE 7: The Big Picture uniquely explores the entire Java EE 7 platform in an all-encompassing style while examining each tier of the platform in enough detail so that you can select the right technologies for specific project needs. In this authoritative guide, Java expert Danny Coward walks you through the code, applications, and frameworks that power the platform. Take full advantage of the robust capabilities of Java EE 7, increase your productivity, and meet enterprise demands with help from this Oracle Press resource.\n\nExplore the features of the Java servlet model and Java servlet API\nCreate dynamic web content with JavaServer Pages and JavaServer Faces\nBuild websites for nonbrowser clients with JAX-RS\nPush data to web clients using Java WebSockets\nSecure web applications\nWork with web component APIs\nMaximize enterprise beans for multithreading, asynchronous processes, transactions, and more\nAccess relational databases with the Java Database Connectivity APIs and the Java Persistence API\nUnderstand the packaging and deployment mechanisms of Java EE applications\nWork with Java EE Contexts and Dependency Injection\nSecure enterprise beans in a Java EE application\nEnable parallel processing with Java EE concurrency APIs","torrent":{"xt":"urn:btih:4c0d784a3b858f6a7bf986162b6af84d1f13d23e","amp;dn":"Java+EE+7+The+Big+Picture+-+Dr.+Danny+Coward","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c0d784a3b858f6a7bf986162b6af84d1f13d23e","infoHashBuffer":{"type":"Buffer","data":[76,13,120,74,59,133,143,106,123,249,134,22,43,106,248,77,31,19,210,62]},"announce":[],"urlList":[]}}