{"title":"Evanescence - Fallen (2003) WMA320","uid":6331225,"size":121148116,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4c65e09f956191a5d0224f5feca94726efcedc76&amp;dn=Evanescence+-+Fallen+%282003%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":2,"uploader":"MARCELODRGZ","files":-1,"time":1303293074,"description":"While I'll admit that I have one of the most eclectic CD collections of anyone I know (Live, Dave Matthews and Enya all live happily next to each other in one section of the rack), I've always steered clear of the stuff that usually gets lumped together with the &quot;goth&quot; stamp on it. So you'd think that a group like Evanescence wouldn't have much of a chance of getting into the collection. However, what I've found here is nothing short of the most addicting sound I've run across in a long time. I expected a Linkin Park-style album with a bunch of tracks like &quot;Bring Me To Life&quot; - the catchy, albeit overplayed first single. What I found, though, was an album with more depth, emotion, and haunting sound than has hit rock in a long time. The first 3 tracks were as advertized: heavy, minor-chord, guitar-riff driven anthems with Amy Lee's powerful voice soaring over the top of them. When I got to &quot;My Immortal,&quot; however, I had to pull the car over. I don't know when the last time was that a song made YOU tear, but the unbelievably haunting and angelic sound of Amy and those strings struck a chord in me that I didn't even know was there. Needless to say, I was hooked, and Fallen has been the shower music of choice every morning since. Ok ok, so the group is basically Moody, Lee, and a bunch of hired-gun studio musicians. And yes, the themes explored are dark, painful and at times almost disturbing. But prepackaged teen-angst it is not. What it IS, is an enchanting melodic ride through the more painful parts of life, centered around a voice that could sing the &quot;Hokey Pokey&quot; and give me chills. Or maybe I'm just a goth in a yuppie's body after all... \n\nby ColoradoBoy\n\nTRACKLIST:\n\n01 - Going Under.wma                                        \n02 - Bring Me To Life.wma                                   \n03 - Everybody's Fool.wma                                   \n04 - My Immortal.wma                                        \n05 - Haunted.wma                                            \n06 - Tourniquet.wma                                         \n07 - Imaginary.wma                                          \n08 - Taking Over Me.wma                                     \n09 - Hello.wma                                              \n10 - My Last Breath.wma                                     \n11 - Whisper.wma                                            \n12 - My Immortal (Band Version).wma    \n\nWMA 320Kbps 44100Hz STEREO\n\nFOLLOW ME ON FACEBOOK PAGES: MARCELODRGZTPB\n\nATTENTION: I will read comments on all the material shared only on my Facebook page (MARCELODRGZTPB). If you have thanks, if you want to report any torrent, if you want some special request or want to be part of the community, we ask you to please do it through Facebook (MARCELODRGZTPB). In this way I can answer a lot faster and have more interaction between us. See you on MARCELODRGZTPB! THANK SO MUCH!!!      ","torrent":{"xt":"urn:btih:4c65e09f956191a5d0224f5feca94726efcedc76","amp;dn":"Evanescence+-+Fallen+%282003%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c65e09f956191a5d0224f5feca94726efcedc76","infoHashBuffer":{"type":"Buffer","data":[76,101,224,159,149,97,145,165,208,34,79,95,236,169,71,38,239,206,220,118]},"announce":[],"urlList":[]}}