{"title":"Emotional Structure: A Guide for Screenwriters - Peter Dunne","uid":9943308,"size":2077673,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4c6aa11cb77505ac3dc93f809f7acf5de30c30dc&amp;dn=Emotional+Structure%3A+A+Guide+for+Screenwriters+-+Peter+Dunne&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1397281185,"description":"The leap from concept to final draft is great, and the task is filled with hard work and horrors. It is here that most writers struggle to get the plot right at the expense of the story's real power. The result is a script that is logical in every way, yet\nunmoving. &quot;&quot;Emotional Structure,&quot;&quot; by Emmy- and Peabody-Award winning producer, writer, and teacher, Peter Dunne, is for these times, when the plot fits nicely into place like pieces in a puzzle, yet an elemental, terribly important something remains missing.\n\nCustomer Review\nI've read numerous books on screenwriting and this one is at the top of my must-have list. This book gives you the tools to analyze scripts/movies/your own writing from a point of view that is rarely taught or understood. It takes you beyond 3-Act structure and gives you the tools to write not just a clever plot, but a great STORY - one that moves the reader and makes the reader care.\n\nLearning the principles in this book has been an awakening for me as a writer. I feel I have gained the insight I needed to tell the stories I want to tell in a way that connects with and moves my reader on an emotional level. If you are writing lots of cool stuff that &quot;happens&quot; but it doesn't feel like it holds together as a script, this book will teach you how to bring together the plot and the story into a cohesive script and hopefully a cohesive movie.\n\nThis is a great book for the beginner or the advanced screenwriter and applies to any genre. A great reference to have on your desk while you're writing. Highly recommend!","torrent":{"xt":"urn:btih:4c6aa11cb77505ac3dc93f809f7acf5de30c30dc","amp;dn":"Emotional+Structure%3A+A+Guide+for+Screenwriters+-+Peter+Dunne","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c6aa11cb77505ac3dc93f809f7acf5de30c30dc","infoHashBuffer":{"type":"Buffer","data":[76,106,161,28,183,117,5,172,61,201,63,128,159,122,207,93,227,12,48,220]},"announce":[],"urlList":[]}}