{"title":"The Numbers Game Why Everything You Know About Football Is Wrong","uid":9548964,"size":5739030,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4c9d47fa460176feb5c8a29159927763788d273c&amp;dn=The+Numbers+Game+Why+Everything+You+Know+About+Football+Is+Wrong&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"GoonerTPB","files":3,"time":1391193207,"description":"The Numbers Game by Chris Anderson and David Sally reveals football's astonishing hidden rules\n\n\nFootball has always been a numbers game: 4-4-2, the big number 9 and 3 points for a win. But what if up until now we've been focusing on the wrong numbers? What if the numbers that really matter, the ones that hold the key to winning matches, are actually 2.66, 53.4, 50/50, and 0 &gt; 1? What if managers only make a 15% difference? What if Chelsea should have bought Darren Bent?\n\nIn this incisive, myth-busting book, Chris Anderson, former goalkeeper turned football statistics guru, and David Sally, former baseball pitcher turned behavioural economist, show that every shred of knowledge we can gather can help us to love football and understand it even more. You'll discover why stopping a goal is more valuable than scoring one, why corners should be taken short, and why it is better to improve your worst player than to buy a superstar.\n\nYou'll never play, or watch, a game of football in quite the same way again.\n\nThe Numbers Game is essential reading for football fans everywhere and will also appeal to readers who loved Moneyball and Freakonomics.\n\nAt 17, Chris Anderson found himself playing in goal for a fourth division club in West Germany; today, he's a professor in the Ivy League at Cornell University in Ithaca, New York. An award winning social scientist and football analytics pioneer, Anderson consults with leading clubs about how best to play the numbers game.\n\nDavid Sally is a former baseball pitcher and a professor at the Tuck School of Business at Dartmouth College in the US, where he analyses the strategies and tactics people use when they play, compete, negotiate, and make decisions. He is an adviser to clubs and other organizations in the global football industry.","torrent":{"xt":"urn:btih:4c9d47fa460176feb5c8a29159927763788d273c","amp;dn":"The+Numbers+Game+Why+Everything+You+Know+About+Football+Is+Wrong","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c9d47fa460176feb5c8a29159927763788d273c","infoHashBuffer":{"type":"Buffer","data":[76,157,71,250,70,1,118,254,181,200,162,145,89,146,119,99,120,141,39,60]},"announce":[],"urlList":[]}}