{"title":"The Paleo Dessert Bible","uid":11568464,"size":45068080,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4ce997db97eb73446b6f9b90902bdf5390c509fd&amp;dn=The+Paleo+Dessert+Bible&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"wildturkey00","files":2,"time":1416980202,"description":"Format: Epub\nGenre: Paleo/Dessert/tutorial\nPublished: 2014\n\nAS USUAL IF YOU ARE HAVING TROUBLE OPENING UP MY EBOOK FILES USE CALIBRE, IT IS FREE, AND OPENS ANY FORMAT... IF YOU CANT OPEN IT WITH CALBIRE, IT WILL CONVERT THE EBBOK TO WHATEVER FORMAT YOU WANT (example: EPUBtoPDF, PDFtoMOBI....ect) ALSO, i DO NOT HAVE THE TIME TO OPEN/CHECK EVERY FILE THAT i DOWNLOAD, IF IT IS TAGGED AS SOMEONE ELSES PLEASE SEND ME A PM SO THAT I CAN DELETE IT....I DONT KNOW ABOUT YOU BUT I HAVE TO WORK TWO SHITTY JOBS AND DO SCHOOL/HOMEWORK AND DONT HAVE THE TIME TO DO SO. FINAL NOTE: IF THE TORRENT WILL NOT DOWNLOAD OR FULLY DOWNLOAD PLEASE SEND ME A PM SO THAT I CAN FIX THE PROBLEM. THANKS IN ADVANCE :)\n\nBook Description: By now we all know that the paleo diet yields amazing results for weight loss and overall well-being. But even the most health-conscious among us want to treat ourselves once in a while to something sweet and indulgent. What if we could indulge without cheating on the diet?\nIn this book, readers will find more than 100 recipes for amazing desserts that will leave you feeling satisfied, energized, and healthy.\n\nWhen Chef and caterer Anna Conrad was asked to provide paleo recipes for a fitness group's 28-day paleo challenge, she was a little skeptical. Could an athlete-or even an average person-really maintain a balanced body without any grains or dairy? Before agreeing to the job, she decided to follow the diet for two weeks to see how she felt. In that short amount of time, she lost eight pounds without feeling hungry or deprived, and her blood pressure, heart rate, and cholesterol all stayed within healthy limits. She gladly provided the recipes and now offers a paleo menu as a regular part of her catering business. In this book, she offers delicious dessert recipes, including:\n\nAlmond Butter Cookies\nBread Pudding\nChewy Chocolate Cookies\nChocolate Fudge Cake\nLemon Squares\nPecan Bars\nAnd More!","torrent":{"xt":"urn:btih:4ce997db97eb73446b6f9b90902bdf5390c509fd","amp;dn":"The+Paleo+Dessert+Bible","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ce997db97eb73446b6f9b90902bdf5390c509fd","infoHashBuffer":{"type":"Buffer","data":[76,233,151,219,151,235,115,68,107,111,155,144,144,43,223,83,144,197,9,253]},"announce":[],"urlList":[]}}