{"title":"The Never Ending Story","uid":4834386,"size":1542806900,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4cfe607ed1e9f985be8e4d1ff7ae976eb0efa95a&amp;dn=The+Never+Ending+Story&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"DethMunky","files":-1,"time":1239260542,"description":"This is a movie you'll enjoy no matter how old you are; it's not just for kids. It's got a message to keep fantasy alive, for good reasons, that every watcher will agree with! Bastian (Barett Oliver) is having a hard time getting over his mother's death &amp; spends most of his time in dreamland. His teachers &amp; father want him to get serious, &amp; he's a constant target for bullies. Hiding out from them 1 morning in an old bookshop, he meets Coreander (Thomas Hill), the reclusive owner who piques his curiosity about the book he's reading, but warns it's not &quot;safe&quot;. Since Bastian loves reading, he &quot;borrows&quot; the book, The Neverending Story. Reading it in hiding, he glimpses Fantasia, an incredible world of rock-biters, night hobs, gnomes, a Child-like Empress who's dying of a mysterious illness. The quest to find a cure is appointed to Atreyu (Noah Hathaway), a young warrior who goes through amazing journeys. Bastian becomes more wrapped up in this book than any other he's read, sharing Atreyu's sadness &amp; horror. What he doesn't realize is that he himself is in the plot of the book - he must choose a new name for the Empress. As Bastian tries to follow the characters' adventures &amp; to choose whether he can do his task, you'll become entranced w/the characters and touching plot. The movie shows fantasy is a big part of reality, &amp; it's important! Watch for yourself, &amp; BELIEVE! ","torrent":{"xt":"urn:btih:4cfe607ed1e9f985be8e4d1ff7ae976eb0efa95a","amp;dn":"The+Never+Ending+Story","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4cfe607ed1e9f985be8e4d1ff7ae976eb0efa95a","infoHashBuffer":{"type":"Buffer","data":[76,254,96,126,209,233,249,133,190,142,77,31,247,174,151,110,176,239,169,90]},"announce":[],"urlList":[]}}