{"title":"[Clips4Sale / MissaX] Miss Missa X (Call Girl Experiment) 480p [","uid":15641259,"size":239982089,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:4d4c280ae6f3cbbfb7d3da3caa2cb5909a5b5f0d&amp;dn=%5BClips4Sale+%2F+MissaX%5D+Miss+Missa+X+%28Call+Girl+Experiment%29+480p+%5B&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":3,"uploader":"LucasCar","files":1,"time":1472012948,"description":"[Clips4Sale / MissaX] Miss Missa X (Call Girl Experiment) 480p [Roleplay]\r\n\r\nI'm Missa, I'm a high end escort. I get called to meet with a guy in a dorm. How unusual! I usually meet business men in hotels. He is standing there with a sly grin on his face, looks me over, he seems disappointed. &quot;Are you even 18?&quot; He asks me! I explain to him as a matter of fact, I am 21.\r\n\r\nI am ready to get down to business, but he holds out a strange looking rayg.u.n. &quot;What the hel..? **ZAAAAAAPPPPP** I am stunned. He tells me to do a few simple tasks, which I perform mindlessly. He pauses, rubs his chin, and says &quot;Age 15 years.&quot;\r\n\r\nI feel myself start to sweat, to breathe heavy, I can't control my actions, but I feel as if I am growing. My clothing starts to feel so tight around my growing bust. My breasts bulge from my camisole, and my nipples ache. Oh it is frightening, but also feels good. I start to lactate.\r\n\r\nHe looks satisfied. I am pleased that my flat chest is now at least a D cup, and the pleasure of my new breasts is amazing! My clothes are so tight against my body, so uncomfortable, and then he says &quot;grow out of your clothes.&quot;\r\n\r\nI grow taller and taller and my shorts rip off of me, my camisole tears, my buttons pop, and my silk gauze shirt rips to pieces. I bend over, worried my head will hit the ceiling if I grow any larger, I take a knee and brush off the remnants of clothing from my body. I am naked, horny, eager to please him.\r\n\r\n&quot;Give me the best blow job in the world,&quot; he demands. I start to systematically perform the blow job that I have done for countless Johns, and then I start to feel myself get a bit more aggressive with him. Faster and faster, I manipulate him in a way that no human woman could. He cums and says &quot;I am going to make a lot of money.&quot;\r\n\r\n&quot;Oh.. you think so?&quot; He raises his gun and zaps me again! I fall asleep, mindless, horny, eager to catch my breath to please him, in whatever way he wises to use me again. \nhttp://screenimage.net/img-57bd068aa9144.html\r\n\r\n\r\n★ ★ ★  For more Exclusive Porn please visit ★ ★ ★\r\n \nhttps://thepiratebay.org/user/LucasCar","torrent":{"xt":"urn:btih:4d4c280ae6f3cbbfb7d3da3caa2cb5909a5b5f0d","amp;dn":"%5BClips4Sale+%2F+MissaX%5D+Miss+Missa+X+%28Call+Girl+Experiment%29+480p+%5B","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d4c280ae6f3cbbfb7d3da3caa2cb5909a5b5f0d","infoHashBuffer":{"type":"Buffer","data":[77,76,40,10,230,243,203,191,183,211,218,60,170,44,181,144,154,91,95,13]},"announce":[],"urlList":[]}}