{"title":"The Complete Diaries of Adrian Mole by Sue Townsend.rar","uid":7042618,"size":5066947,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4dd64ddb85f3a3dd46a52292cbac8853482208be&amp;dn=The+Complete+Diaries+of+Adrian+Mole+by+Sue+Townsend.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"Deryl33","files":1,"time":1329607706,"description":"Hi People\n\nBasically I wish to point out that this is my first torrent (so if there are any errors/mistakes, etc. please bear with me and offer advice. You can flame me provided it's funny and makes me laugh) and that the reason I created it was cos finding the complete collection of these books was next to impossible and pissed me off to no end.\n\nLong story short, I finally managed to get all the books up to date (1982- 2009) and decided that since it was such a mission to get these books and there are no torrents available for them, I would compile them and create a torrent for the books myself so everyone can enjoy the misadventures of our favouriteguzzling, pimple popping, pretentious pomm without having to scour the vast realm that is the interwebs, looking for them like i did.\n\n\nAll right, you've endured my long winded ramblings long enough so heres the important stuff:\n\nAll 10 books are compiled into a single zip file (unzip with winzip, winrar, 7zip or similar program)\n\nAll these books are in .pdf format so you can only view them with a pdf viewer such as Adobe Reader/Acrobat, Foxit Reader or Zobpage Reader (again, whatever works best for you)\n\nAll the files are password protected\n\nPassword: Deryl33\n\nWell I guess thats about it and I dont think I've left anything out soooooo, any questions can be asked in the comments section and I'll do my best to respond and help out in any way I can.\n\nDeryl","torrent":{"xt":"urn:btih:4dd64ddb85f3a3dd46a52292cbac8853482208be","amp;dn":"The+Complete+Diaries+of+Adrian+Mole+by+Sue+Townsend.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4dd64ddb85f3a3dd46a52292cbac8853482208be","infoHashBuffer":{"type":"Buffer","data":[77,214,77,219,133,243,163,221,70,165,34,146,203,172,136,83,72,34,8,190]},"announce":[],"urlList":[]}}