{"title":"Object-Oriented JavaScript (2013)","uid":9244136,"size":4905581,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4ded7973663427bba9fa979087019143563804ea&amp;dn=Object-Oriented+JavaScript+%282013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"d347hBy73","files":-1,"time":1385343822,"description":"Object-Oriented JavaScript, 2nd Edition\n\nBook Details:\n\nPages: 382\nPublisher: Packt Publishing; 2nd Edition (July 2013)\nLanguage: English\nISBN-10: 1849693129\nISBN-13: 978-184969312\nFormat: PDF, EPUB\n\nBook Description:\n\nJavaScript is the behavior, the third pillar in todays paradigm that looks at web pages as something that consists of clearly distinguishable parts: content (HTML), presentation (CSS) and behavior (JavaScript). Using JavaScript, you can create not only web pages but also desktop widgets, browser and application extensions, and other pieces of software. It is a pretty good deal: you learn one language and then code all kinds of different applications. While there is one chapter specifically dedicated to the web browser environment including DOM, Events and AJAX tutorials, the rest is applicable to the other environments\n\nMany web developers have tried coding or adopting some bits of JavaScript, but it is time to man up and learn the language properly because it is the language of the browser and is, virtually, everywhere. This book starts from zero, not assuming any prior JavaScript programming knowledge and takes you through all the in-depth and exciting futures hidden behind the facade.\n\nOnce listed in the nice to have sections of job postings, these days the knowledge of JavaScript is a deciding factor when it comes to hiring web developers. After reading this book you will be prepared to ace your JavaScript job interview and even impress with some bits that the interviewer maybe did not know. You should read this book if you want to be able to take your JavaScript skills to a new level of sophistication.\n\nWhat you will learn from this book:\n\nThe basics of object-oriented programming, and how to apply it in the JavaScript environment\nHow to set up and use your training environment (Firebug)\nIn depth discussion of data types, operators, and flow control statements in JavaScript\nIn depth discussion of functions, function usage patterns, and variable scope\nUnderstand how prototypes work\nReuse code with common patterns for inheritance\nMake your programs cleaner, faster and compatible with other programs and libraries\nUse object-oriented JavaScript for improving script performance\nAchieve missing object-oriented features in JavaScript\n\nApproach:\n\nYou will first be introduced to object-oriented programming, then to the basics of objects in JavaScript. This book takes a do-it-yourself approach when it comes to writing code, because the best way to really learn a programming language is by writing code. You are encouraged to type code into Firebugs console, see how it works and then tweak it and play around with it. There are practice questions at the end of each chapter to help you review what you have learned.\n\nWho this book is written for:\n\nFor new to intermediate JavaScript developer who wants to prepare themselves for web development problems solved by smart JavaScript!\n","torrent":{"xt":"urn:btih:4ded7973663427bba9fa979087019143563804ea","amp;dn":"Object-Oriented+JavaScript+%282013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ded7973663427bba9fa979087019143563804ea","infoHashBuffer":{"type":"Buffer","data":[77,237,121,115,102,52,39,187,169,250,151,144,135,1,145,67,86,56,4,234]},"announce":[],"urlList":[]}}