{"title":"The Phantom Of The Opera At The Royal Albert Hall [V2]","uid":7846409,"size":201534175,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4e151b0af2a4d892e7e0daaedbab04e3a9b90bbe&amp;dn=The+Phantom+Of+The+Opera+At+The+Royal+Albert+Hall+%5BV2%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"rambam1776","files":-1,"time":1353485403,"description":"The Phantom of the Opera at the Royal Albert Hall - Andrew Lloyd Webber\n  &lt;a href=&quot;\nhttp://www.barnesandnoble.com/w/the-phantom-of-the-opera-at-the-royal-albert-hall-a-l-webber/22820639&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.barnesandnoble.com/w/the-phantom-of-the-opera-at-the-royal-albert-hall-a-l-webber/22820639&lt;/a&gt;\n\nEditorial Reviews\nAll Music Guide - Jon O'Brien\nTo describe Andrew Lloyd Webber's production of The Phantom of the Opera, the tale of a disfigured musical genius' obsession with a young soprano based on Gaston Leroux's early 20th century novel, as a phenomenon would be something of an understatement. Since its West End premiere in 1986, it has been seen by around 130 million people, earned both Tony and Olivier awards for Best Musical, and amassed a staggering five billion dollars worldwide at the box office. Celebrating its momentous achievement, this unique recording of its 25th anniversary show at London's Royal Albert Hall shows exactly why it's become such an institution, from the horror movie organs and haunting synths of the iconic &quot;Overture,&quot; to the glass-shattering vocals and dramatic melodies of the anthemic title number, to the emotive balladry of &quot;The Music of the Night.&quot; Featuring all 22 songs from the 2011 Cameron Mackintosh-produced show, which starred Ramin Karimloo as the Phantom, Sierra Boggess as Christine, and Hadley Fraser as Raoul, the first official West End cast recording since 2000 is certainly comprehensive. But while the passages of dialogue on &quot;Think of Me&quot; and &quot;Poor Fool, He Makes Me Laugh&quot; may transmit well to its accompanying DVD, they feel slightly redundant here, and the constant applause, particularly the four-minute standing ovation that ends &quot;Down Once More/Track Down This Murderer,&quot; suggests more extensive use of an editor would have been appreciated. Fans who were lucky enough to see the show in person may also be disappointed that the star turn from its most renowned leading lady, Sarah Brightman, on the &quot;Grand Finale&quot; has been strangely omitted, even though the lengthy congratulatory speech from Lloyd Webber himself remains fully intact. An accomplished and impressively performed tribute it may be, then, but those wanting to relive its most glorious moments may find themselves pressing the fast-forward button far more often than was necessary.\n\nProduct Details\nRelease Date: 2/7/2012\nUPC: 602527844916\nLabel: Decca U.S.\nCatalog Number: 001643802","torrent":{"xt":"urn:btih:4e151b0af2a4d892e7e0daaedbab04e3a9b90bbe","amp;dn":"The+Phantom+Of+The+Opera+At+The+Royal+Albert+Hall+%5BV2%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e151b0af2a4d892e7e0daaedbab04e3a9b90bbe","infoHashBuffer":{"type":"Buffer","data":[78,21,27,10,242,164,216,146,231,224,218,174,219,171,4,227,169,185,11,190]},"announce":[],"urlList":[]}}