{"title":"Xavier Rudd - Dark Shades Of Blue [2008][EAC/FLAC]","uid":10388773,"size":365009860,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4e1a38ed6e87239044718a022f3e526f239c0f6f&amp;dn=Xavier+Rudd+-+Dark+Shades+Of+Blue+%5B2008%5D%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"dickspic","files":-1,"time":1403171343,"description":"FLAC / Lossless / Log 100%/ Cue\nLabel/Cat#: Anti #269752\nCountry: AUS\nYear: August 18, 2008\nGenre: world,folk\nFormat: CD,Album\n\n\n\n\n\n01. Blackwater 3:31\n02. Dark Shades of Blue 4:05\n03. Secrets 6:46\n04. GUKU 4:14\n05. Edge of the Moon 5:10\n06. This World As We Know It 4:06\n07. Shiver 7:31\n08. Uncle 7:51\n09. Up In Flames 3:39\n10. Hope That You'll Stay 4:10\n11. Home 5:52\n\n\n\n\nBy 2008, Australian singer/songwriter and multi-instrumentalist Xavier Rudd established himself as a world-touring itinerant musician who broke most of the rules of the music biz and got away with it. Traveling the world with his multitude of instruments (including three different didgeridoos, bass, banjo, stompbox, percussion instruments, and an assortment of Weissenborn guitars), Rudd was a one-man band who happened to be a rather gifted surfer and a fine songwriter. He played a self-composed amalgam of Aussie folk, blues, and reggae, and, as on his last two recordings on Anti, his themes evolved from being introspective personal observations to decidedly non-pedantic reflections on the global environmental crisis, racism, personal responsibility, and the benefits of community. Dark Shades of Blue is special, and unique to Rudd's catalog. First off, it's an electric record, full of barely contained squalling guitars, percussion, and a more textural approach to recording. That said, it's hardly a sellout; in fact, given how comfortably he inhabits this terrain, this may be the record Rudd has desired to make for a long time. He still plays Weissenborn guitars, though they're amplified, as is a six-string resonator. His didgeridoos are still present (known here by their aboriginal term, yirdaki), as well as the drums of Dave Tolley, and sometimes a small chorus of backing vocalists. His songwriting is more expansive; he relies on the blues a bit more, though reggae and Aussie folk styles are everywhere. The Weissenborn lends itself to amplification beautifully, offering long distorted and sustained tones that transcend mere &quot;rock.&quot;\nThe opening two cuts, the long droning &quot;Black Water&quot; and the title track it seamlessly morphs into, are marvelous examples of the new kind of restless expression Rudd employs here. The former, with its single opening note of controlled feedback, almost sounds like Jimi Hendrix's intro to &quot;Foxey Lady,&quot; giving way to a swirling bluesy wail accompanied by droning didgeridoos and Tolley's monstrous tom-toms. Since it's an instrumental, it will make an unsuspecting fan do a double take and check the label. The title track, with its snarling slide, uses textured feedback and effects pedals to introduce Rudd's vocals, which offer an emotionally honest personal reflection. Reggae makes its entrance on &quot;Secrets,&quot; but for all its space, the heavy guitar cuts in and out almost dubwise. &quot;Guku,&quot; with its fingerpicked electric Weissenborn, re-introduces something familiar and more traditionally Rudd in the song structure -- with great brush work by Tolley. &quot;The World as We Know It&quot; and the squalling &quot;Up in Flames&quot; -- with its psychedelic didgeridoo -- are politically scathing rockers, with Rudd's poetic look at the world around him standing in contrast to the wonderfully chaotic guitar work. The record winds down as the softer Rudd re-emerges (though electricity is not completely absent) on &quot;Shiver,&quot; &quot;Hope You'll Stay,&quot; and the closer, &quot;Home!&quot; Dark Shades of Blue is a brave move; Rudd has followed his heart's aesthetic path at the risk of alienating an audience he built from the ground up, who may not accept change so gracefully (let's hope they do because this set smokes). There isn't anything remotely &quot;commercial&quot; about this music, but it is moodier and more involved, sophisticated, and passionate; it reflects the wild turbulence of the current era better than anything he's recorded before. If anything, Dark Shades of Blue is a recording that might actually open some new ears to Rudd's uncompromising -- and even singular -- vision.","torrent":{"xt":"urn:btih:4e1a38ed6e87239044718a022f3e526f239c0f6f","amp;dn":"Xavier+Rudd+-+Dark+Shades+Of+Blue+%5B2008%5D%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e1a38ed6e87239044718a022f3e526f239c0f6f","infoHashBuffer":{"type":"Buffer","data":[78,26,56,237,110,135,35,144,68,113,138,2,47,62,82,111,35,156,15,111]},"announce":[],"urlList":[]}}