{"title":"Creating with Concrete and Mosaic: Fun and Decorative Ideas","uid":12155325,"size":23377177,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4e9a902b1b96a6871ac235f81cec79b6375c991a&amp;dn=Creating+with+Concrete+and+Mosaic%3A+Fun+and+Decorative+Ideas&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"mdusanjay","files":1,"time":1437769610,"description":" Sania Hedengren, Susanna Zacke, &quot;Creating with Concrete and Mosaic: Fun and Decorative Ideas for Your Home and Garden&quot;\n\n2015 | ISBN-10: 1632203669 | 96 pages | EPUB | 22 MB\n\nCasting in concrete is an exciting project that is both enjoyable and practical. You can create all sorts of decorations and furniture for your home that are sure to be the envy of all your neighbors. But the fun doesn't have to stop there! Concrete lends itself to many unique and exquisite projects, and decorating these pieces with beautiful mosaic patterns makes them all the more impressive. Here, interior decorating journalists and stylists Sania and Susanna show you how to do that. Decorating with mosaic and pouring concrete are both addictive; once you start, you won't want to stop. With step-by-step photos and instructions, Sania and Susanna show you how to create more than twenty different decorations and ornate trinkets. Whether you're someone looking to create a new decoration for your home or a fledgling concrete caster, this book has a little something for everyone. The sky is the limit! Let your imagination run wild, and be inspired!","torrent":{"xt":"urn:btih:4e9a902b1b96a6871ac235f81cec79b6375c991a","amp;dn":"Creating+with+Concrete+and+Mosaic%3A+Fun+and+Decorative+Ideas","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e9a902b1b96a6871ac235f81cec79b6375c991a","infoHashBuffer":{"type":"Buffer","data":[78,154,144,43,27,150,166,135,26,194,53,248,28,236,121,182,55,92,153,26]},"announce":[],"urlList":[]}}