{"title":"The Templar Meridians: The Secret Mapping of the New World","uid":15770720,"size":4691755,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4edd268be397f4607758f455b8cb472e3b7b8f05&amp;dn=The+Templar+Meridians%3A+The+Secret+Mapping+of+the+New+World&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"marty14","files":1,"time":1473201379,"description":"The Templar Meridians: The Secret Mapping of the New World - William F. Mann [epub]\r\n\r\nThe most enduring mystery surrounding the Templars concerns the nature and whereabouts of their great treasure. Whereas many believe this lost treasure contains knowledge of the bloodline of Christ, William F. Mann shows that it actually consists of an ancient science developed before the Great Flood--knowledge discovered by the Templars in the Holy Land during the Crusades and still extant today in Templar/Masonic ritual. Among other things, this knowledge enabled the Order to establish accurate latitudinal and longitudinal positions long before the foundations of the current science were laid in the seventeenth century. This allowed them to cross the Atlantic to reach the New World, where they established secret settlements and mining operations that gave them a limitless supply of precious metals and a military edge over their opponents.\r\n\r\nPursued farther into the interior of the North American continent by their adversaries from the Old World, the Templars left artifacts, relics, and information caches at key sites, confident that future initiates could use their understanding of the science of meridians and ley lines to locate them. The author points out that not only did future masons such as Jefferson and Washington use this science as the basis of their designs for Monticello and Washington, D.C., but the true motive of the expedition of Lewis and Clark was to identify the meridians mapped by the Templars and to search for the final resting place of Prince Henry Sinclair--where the great Templar treasure could also be found","torrent":{"xt":"urn:btih:4edd268be397f4607758f455b8cb472e3b7b8f05","amp;dn":"The+Templar+Meridians%3A+The+Secret+Mapping+of+the+New+World","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4edd268be397f4607758f455b8cb472e3b7b8f05","infoHashBuffer":{"type":"Buffer","data":[78,221,38,139,227,151,244,96,119,88,244,85,184,203,71,46,59,123,143,5]},"announce":[],"urlList":[]}}