{"title":"Mega Combat/Weaponry/Tactics Torrent","uid":4372796,"size":81127102950,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4ef359ff55471890f60624f4854e9ebb62f92723&amp;dn=Mega+Combat%2FWeaponry%2FTactics+Torrent&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":6,"uploader":"x_DontTreadOnMe_x","files":54,"time":1220248323,"description":"Interested in combat?  Want to invade a small country?  Simply want to be prepared in case anything goes wrong?  Well this is the perfect torrent for you.\n\nThis will most likely be the largest torrent ever coming from me.  This is of a FTP I downloaded a few weeks ago, and I am passing it on to all of you.  Imagine all of my torrents times 10, combined into a single download.\n\nHere is a peak at the information contained in here:\n-Ammunition -Boobytraps -Chemistry -Explosives -Various Tactics -Militia Guides -Survival -Hunting/Trapping -NBC Preparation -Robotics -Tracking and Evasion -Psychological Warfare -Forensics -Lockpicking -Law Enforcement -Spy Technologies -Physics -Philosophy - Military Reference and History -Sniping -Marksmanship -Medical -Countless DYI Guides -Investigation -Engineering -Logistics -Drugs -Camouflage -Electronics -Computers -Hacking -Rocketry -Law Enforcement -Interrogation -Hand To Hand Combat -Martial Arts -MUCH MUCH More\n\n\nDue to the massive size of this torrent, I had to put each folder into an .rar folder.  So simply give a folder a higher priority while downloading, so you can access it first.  Much of this is fully organized, but there is one folder where uploaders could have put their stuff.  Don't get me wrong, it is very much worth downloading (the upload folder).  It is probably one of the best folders to download, actually.\n\nThis torrent is sure to infuriate your self-proclaimed handlers, so be sure to spread it wide and far.  It might be a good idea to copy this on a few internal/external drives, and store them or give them away.....hell, I would be happy if someone sold these to people.  This is the only torrent of its kind that I know of; I don't say this to brag, I say this to emphasize the importance of it, and the content it holds.\n\nAny questions, ask on the comment section, or otherwise, you know where to reach me on Rogue Science....","torrent":{"xt":"urn:btih:4ef359ff55471890f60624f4854e9ebb62f92723","amp;dn":"Mega+Combat%2FWeaponry%2FTactics+Torrent","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ef359ff55471890f60624f4854e9ebb62f92723","infoHashBuffer":{"type":"Buffer","data":[78,243,89,255,85,71,24,144,246,6,36,244,133,78,158,187,98,249,39,35]},"announce":[],"urlList":[]}}