{"title":"Celine Dion - Discography (English) 320kbps","uid":6445611,"size":1510696366,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4f285c1a5d9889dced2469b0bf7d68183ac83537&amp;dn=Celine+Dion+-+Discography+%28English%29+320kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"piratetorrent1989","files":146,"time":1307280284,"description":"Born to a large family from Charlemagne, Quebec, Dion emerged as a teen star in the French-speaking world after her manager and future husband RenÃƒÂ© AngÃƒÂ©lil mortgaged his home to finance her first record. In 1990, she released the English-language album Unison, establishing herself as a viable pop artist in North America and other English-speaking areas of the world.\n\nDion had first gained international recognition in the 1980s by winning both the 1982 Yamaha World Popular Song Festival and the 1988 Eurovision Song Contest. Following a series of French albums in the early 1980s, she signed on to CBS Records Canada in 1986. During the 1990s, with the help of AngÃƒÂ©lil, she achieved worldwide fame after signing with Epic Records and releasing several English albums along with additional French albums, becoming one of the most successful artists in pop music history. However, in 1999 at the height of her success, Dion announced a hiatus from entertainment in order to start a family and spend time with her husband, who had been diagnosed with cancer. She returned to the top of pop music in 2002 and signed a three-year (later extended to almost five years) contract to perform nightly in a five-star theatrical show at the Colosseum at Caesars Palace, Las Vegas.\n\nDion's music has been influenced by genres ranging from rock and R&amp;B to gospel and classical. While her releases have often received mixed critical reception, she is renowned for her technically skilled and powerful vocals. Dion is the best-selling Canadian artist of all time, is the second best-selling female artist in the United States of America during the Nielsen SoundScan era, and is the only female artist to have two singles that have sold more than a million copies in the United Kingdom. In addition, her 1995 album D'eux, is the best-selling French-language album of all time. In 2004, after surpassing 175 million in album sales worldwide, she was presented with the Chopard Diamond Award at the World Music Awards for becoming the best-selling female artist of all time. According to Sony Music Entertainment, Dion has sold over 200 million albums worldwide.\n\nThis torrent includes the following albums\n\n1990: Unison\n1992: Celine Dion\n1993: The Colour of My Love\n1996: Falling into You\n1997: Let's Talk About Love\n1998: These Are Special Times\n2002: A New Day Has Come\n2003: One Heart\n2004: Miracle\n2007: Taking Chances \n","torrent":{"xt":"urn:btih:4f285c1a5d9889dced2469b0bf7d68183ac83537","amp;dn":"Celine+Dion+-+Discography+%28English%29+320kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f285c1a5d9889dced2469b0bf7d68183ac83537","infoHashBuffer":{"type":"Buffer","data":[79,40,92,26,93,152,137,220,237,36,105,176,191,125,104,24,58,200,53,55]},"announce":[],"urlList":[]}}