{"title":"Wishing Chair series ebooks Enid Blyton epub mobi","uid":10833772,"size":31018133,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4f3937d3069ec316bbdcbe9cb1aa90432344f713&amp;dn=Wishing+Chair+series+ebooks+Enid+Blyton+epub+mobi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"KiwiSue49","files":-1,"time":1408651594,"description":"\nHEADS UP 1: Pictures display bigger in portrait with both Kindle and Moon+ Reader for Android. Contents includes a link to all the original illustrations.\n\nHEADS UP 2: There is an Enid Blyton society website for those of you who might be interested:\n &lt;a href=&quot;\nhttp://www.enidblytonsociety.co.uk/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.enidblytonsociety.co.uk/&lt;/a&gt;\n\n\n(below descriptions courtesy of wiki: &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Wishing-Chair_%28series%29#Adventures_of_the_Wishing-Chair&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Wishing-Chair_%28series%29#Adventures_of_the_Wishing-Chair&lt;/a&gt; )\n\n\n==============================\n\n\nTitle:\n\nADVENTURES OF THE WISHING-CHAIR (1937) by Enid Blyton\n\n\nDescription:\n\nMollie and Peter, searching for a birthday present for their mother, find a mysterious antiques shop which appears to be run by fairy folk. There, they find a magic wishing chair with the power to grow wings and fly. After the chair rescues them from the shop, and gets them home, they decide to keep the chair in their playhouse. On their first flight, they rescue a pixie called Chinky from a giant. The pixie comes to live in their playroom, and the remainder of the book concerns the adventures of the children, as the chair takes them, and Chinky to various magical places. They also get into trouble due to some invisible paint, and a boy who makes faces, and cannot unmake them. But they also have some good adventures like going to Greatheart, the magician's party or going to Grabbit Gnomes. The children have a most pleasant time with the chair, with some near misses!\n\n\n==========\n\n\nTitle:\n\nTHE WISHING-CHAIR AGAIN (1950) by Enid Blyton\n\n\nDescription:\n\nThe Wishing-Chair gets captured by a giant called Twisty, and Mollie, Peter and Chinky the pixie have to get it back. The chair has its wings cut off by the Slipperies, and the children and Chinky take it to Chinky's Great Aunt Quick Fingers who can make the wings grow back. The next rainy day, Peter and Mollie use the &quot;Wing-growing&quot; ointment on some of their toys, and unfortunately Mollie accidentally makes Chinky's wand fly too by touching it with ointment-covered fingers. The chair takes them to Mr Grim's school, a rather horrible school where the teacher asks all sorts of ridiculous, impossible questions that even he doesn't know the answer to. They befriend and rescue a naughty brownie called Winks, who gets them into all sorts of trouble and who is sent back to Mr. Grim.\n\n\n==========\n\n\nTitle:\n\nMORE WISHING-CHAIR STORIES (2000) by Enid Blyton\n\n\nDescription:\n\nIn this final sequel, a compilation of stories about the Wishing Chair from other books (The Adventures of the Wishing Chair, Enid Blyton's Omnibus and the Enid Blyton Annuals), More Wishing Chair Stories Mollie and Peter are home for the half-term holiday and Chinky and the Wishing-Chair are ready to fly away with them to magical lands. They visit the Land of Wishes and the Land of Chatterboxes, but perhaps the best adventure of all is helping Santa Claus deliver presents on Christmas Eve.\n\n\n==========\n\n\nABOUT THE AUTHOR (inside of opf file in ebook)\n\nAuthor Enid Blyton is one of the most-loved authors in children's publishing. With over 700 titles published, Enid Blyton's stories remain timeless classics, adored throughout the world. As a young woman Enid was faced with many choices: her father had planned a career in music for her, while she felt drawn to writing. In the end, she became a teacher. In 1922, a collection of poems by Enid was published, it was her first step towards her dream of becoming an author.\n\nAged 27, Enid married Hugh Pollock and moved to London. Enid had two children with Hugh, and soon after wrote her first novel, The Adventures of the Wishing-Chair. Enid divorced Hugh after almost 20 years of marriage, and married Kenneth Waters in 1943. Throughout the 40s and 50s, Enid wrote books at a colossal pace: adventure stories, mysteries, magical stories, farming stories, stories for younger children, best-selling series like The Famous Five and Noddy.\n\nEnid fell ill with Alzheimer's disease and she died in 1963. Her spirit lives on in her books and she is remembered as one of the most-loved and celebrated children's authors.\n\n\n\nNote: Tested out the first ebook with Moon+Reader, Kindle and Aldiko on Samsung Note 10.1 (2012 model), and Calibre and Kindle for PC.\n\nEnjoy.\n","torrent":{"xt":"urn:btih:4f3937d3069ec316bbdcbe9cb1aa90432344f713","amp;dn":"Wishing+Chair+series+ebooks+Enid+Blyton+epub+mobi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f3937d3069ec316bbdcbe9cb1aa90432344f713","infoHashBuffer":{"type":"Buffer","data":[79,57,55,211,6,158,195,22,187,220,190,156,177,170,144,67,35,68,247,19]},"announce":[],"urlList":[]}}