{"title":"[FSX/P3D] RAZBAM Metroliner III SA227-BC v1.1","uid":10705417,"size":479984202,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4f78dc1d643357e0ee4b53a1ec61bcf173e7ac96&amp;dn=%5BFSX%2FP3D%5D+RAZBAM+Metroliner+III+SA227-BC+v1.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"leopard87","files":-1,"time":1407281498,"description":"I found RAZBAM Metroliner III v1.1 FSX-P3D V2 Bundle somewhere over the internet and converted it into a convenient installer for you pirates.\n\nIn addition to FSX and P3D v2 packages, the installer also contains an experimental P3D v1 mod, though it is not guaranteed to work.\n\nBefore installing this package, you need to uninstall other versions of RAZBAM Metroliner III installed on your computer. There is also one more step you NEED to do manually after the installation is complete. Please carefully read the information page and the document I included for you in the installer.\n\nA user at RAZBAM forums says he has created a gauge which generates a trimming sound as in the real-life Metroliner when you trim the aircraft while hand flying. I tested this gauge in FSX and it seems to work without any problems, so I integrated it into all versions of this aircraft and it is enabled by default now. If, for any reason, you want to disable/reenable this trimming sound, you can quickly do it by using the utility I created for you.\n\nThis is NOT an aircraft that I'm interested in. I'm merely sharing it for those who requested it. As such, I don't want to seed this aircraft forever. Please SEED if you like this package.\n\nSeed and enjoy!","torrent":{"xt":"urn:btih:4f78dc1d643357e0ee4b53a1ec61bcf173e7ac96","amp;dn":"%5BFSX%2FP3D%5D+RAZBAM+Metroliner+III+SA227-BC+v1.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f78dc1d643357e0ee4b53a1ec61bcf173e7ac96","infoHashBuffer":{"type":"Buffer","data":[79,120,220,29,100,51,87,224,238,75,83,161,236,97,188,241,115,231,172,150]},"announce":[],"urlList":[]}}