{"title":"Rising Stars","uid":4985644,"size":563149528,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:4f795b5146ce0d11fd695e1638b184f54ea5733f&amp;dn=Rising+Stars&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"brodahisou","files":-1,"time":1246661528,"description":"Rising Stars is about 113 people called &quot;Specials&quot;, as they are born with special abilities following a mysterious light in the sky. The comic explores how a society may react to the introduction of superpowers, and how those Specials may react towards society and each other.\n\nWritten by J. Michael Straczynski, Pencilled by Keu Cha, Ken Lashley and Christian Zanier and published by Top Cow.\n\nThe comic was published in August 1999, monthly at first by Top Cow/Image Comics, and then under the Joe's Comics imprint. Within a few months, however, there were unscheduled artist changes and unexplained delays by Top Cow in shipping the comics - sometimes lasting months.\n\nThe comic itself came to an unexpected halt after issue 21 due to internal arguments between Straczynski and Top Cow. Straczynski claimed he was cut out of the loop on the potential Rising Stars movie. After communication broke down between them, he held back the scripts for the last three issues, and the entire comic was put on hold. In addition to an apology for the way Straczynski was treated in regard to the possible film, Top Cow relented by giving him the full rights to an anthology comic he had written for them, Dream Police (later published by Marvel Comics), as well as the rights to the name and logo for the Joe's Comics imprint.\n\nThe last issue of Rising Stars was published in March 2005.\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:4f795b5146ce0d11fd695e1638b184f54ea5733f","amp;dn":"Rising+Stars","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f795b5146ce0d11fd695e1638b184f54ea5733f","infoHashBuffer":{"type":"Buffer","data":[79,121,91,81,70,206,13,17,253,105,94,22,56,177,132,245,78,165,115,63]},"announce":[],"urlList":[]}}