{"title":"DANTE'S INFERNO - PS3","uid":6554641,"size":5555962368,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:506ce5f4ab3a81c035eb73e53de13fef051934b0&amp;dn=DANTE%5C%27S+INFERNO+-+PS3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":8,"uploader":"boobsman","files":56,"time":1311236686,"description":"Dante's Inferno will take gamers to the western world's most definitive view of the afterlife as created in the 13th Century by the Italian poet Dante Alighieri in part one of his epic classic, &quot;The Divine Comedy.&quot; Dante's Inferno tells an adapted story that focuses on delivering a blockbuster third-person action game experience while bringing Alighieri's depiction of Hell to the medium.\n\nPlayers assume the role of Dante, who descends into Hell after returning home to find his beloved Beatrice murdered, with Lucifer seducing her soul into the underworld. Dante sets out on a rescue mission to save Beatrice, but he soon realises he is also in Hell to face his own demons and ultimately to redeem himself. Players will take Dante through nine unique circles of Hell as mapped out and described by Alighieri: limbo, lust, gluttony, greed, anger, heresy, violence, fraud and treachery.\n\nAn Epic Adaptation of a Classic: Based on part one of Dante Alighieri's classic poem &quot;The Divine Comedy,&quot; Dante's Inferno is a third-person action adventure game that takes Dante on an epic journey through Hell as he seeks to rescue the soul of his beloved Beatrice.\n\nThe Nine Circles of Hell: Just like the poem, players will descend through Dante's unique nine circles of Hell: limbo, lust, gluttony, greed, anger, heresy, violence, fraud and treachery. Each circle features distinct environments, enemies and story elements befitting the sins committed by their inhabitants.\n\nControl the Beasts of Hell: Dante's Inferno features large scale beasts and bosses, some of which Dante will be able to fully tame, utilising them to throw back Hell's wrath to its minions.\n\nFast, Addictive, Responsive Combat: Dante fights through the nine circles armed with Death's Scythe and Beatrice's Holy Cross, with magic powers and a deep, customisable upgrade system helping the player take full advantage of a fast and fluid gameplay experience that will never run at lower than 60 frames per second.","torrent":{"xt":"urn:btih:506ce5f4ab3a81c035eb73e53de13fef051934b0","amp;dn":"DANTE%5C%27S+INFERNO+-+PS3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"506ce5f4ab3a81c035eb73e53de13fef051934b0","infoHashBuffer":{"type":"Buffer","data":[80,108,229,244,171,58,129,192,53,235,115,229,61,225,63,239,5,25,52,176]},"announce":[],"urlList":[]}}