{"title":"Concepts of Genetics 9th ed. - W. Klug, et. al., (Pearson, 2009)","uid":8933582,"size":63894449,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:50acb63420bd2edf87dfd8f3c8ef1babd0972804&amp;dn=Concepts+of+Genetics+9th+ed.+-+W.+Klug%2C+et.+al.%2C+%28Pearson%2C+2009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"Kisa_Feline","files":-1,"time":1379510539,"description":"Concepts of Genetics (9th Edition) \nWilliam S. Klug (Author), Michael R. Cummings (Author), Charlotte A. Spencer (Author), Michael A. Palladino (Author)\n\nPublication Date: February 16, 2008 | \nISBN-10: 0321524047 | \nISBN-13: 978-0321524041 | \nEdition: 9\n\n\n\nKnown for its focus on concepts and problem-solving, this best-selling book has been extensively updated with new coverage of genomics, bioinformatics, proteomics and more. Concepts of Genetics, 9/e is written in a clear and accessible style for readers. \n\n\n  \nIntroduction to Genetics, Mitosis and Meiosis, Mendelian Genetics, Extensions of Mendelian Ratios, Chromosome Mapping in Eukaryotes, Genetic Analysis and Mapping in Bacteria and Bacteriophages, Sex Determination and Sex Chromosomes, Chromosome Mutations: Variation in Chromosome Number and Arrangement, Extranuclear Inheritance, DNA Structure and Analysis, DNA Replication and Recombination, DNA Organization in Chromosomes,  Recombinant DNATechnology and Gene Cloning, The Genetic Code and Transcription, Translation and Proteins, Gene Mutation and DNA Repair, Regulation of Gene Expression in Prokaryotes, Regulation of Gene Expression in Eukaryotes, Developmental Genetics of Model Organisms, Cancer and Regulation of the Cell Cycle,  Genomics, Proteomics, and Bioinformatics,  Genome Dynamics: Transposons, Immunogenetics, and Eukaryotic Viruses, Genomic Analysis--Dissection of Gene Function,  Applications and Ethics of Genetic Engineering and Biotechnology,  Quantitative Genetics and Multifactorial Traits, Genetics and Behavior, Population Genetics, Evolutionary Genetics, Conservation Genetics. Intended for those interested in learning the \nbasics of genetics\n\n---------------------------------------------------------------------------\nThis book was extremely difficult to find, so this is my first upload, hoping to make it easier for other people to find. So please help me seed it!","torrent":{"xt":"urn:btih:50acb63420bd2edf87dfd8f3c8ef1babd0972804","amp;dn":"Concepts+of+Genetics+9th+ed.+-+W.+Klug%2C+et.+al.%2C+%28Pearson%2C+2009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50acb63420bd2edf87dfd8f3c8ef1babd0972804","infoHashBuffer":{"type":"Buffer","data":[80,172,182,52,32,189,46,223,135,223,216,243,200,239,27,171,208,151,40,4]},"announce":[],"urlList":[]}}