{"title":"Derek Walcott - Nobel Prize in Literature, 1992 (12 books)","uid":11935563,"size":19518593,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:50c97891a1b64d3b134ca54210477d685a4c64dd&amp;dn=Derek+Walcott+-+Nobel+Prize+in+Literature%2C+1992+%2812+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"workerbee","files":34,"time":1431892700,"description":"\nDEREK WALCOTT (b. 1930) is a Saint Lucian poet and playwright who received the 1992 Nobel Prize in Literature for &quot;a poetic oeuvre of great luminosity, sustained by a historical vision, the outcome of a multicultural commitment.&quot;  His work has received praise from major poets including Robert Graves, who wrote that Walcott &quot;handles English with a closer understanding of its inner magic than most, if not any, of his contemporaries&quot;, and Joseph Brodsky, who praised Walcott's work, writing: &quot;For almost forty years his throbbing and relentless lines kept arriving in the English language like tidal waves, coagulating into an archipelago of poems without which the map of modern literature would effectively match wallpaper.&quot;\n\nMethodism and spirituality play a significant role from the beginning in Walcott's work.  He commented, &quot;I have never separated the writing of poetry from prayer. I have grown up believing it is a vocation, a religious vocation.&quot;  Walcott identifies as &quot;absolutely a Caribbean writer&quot;, a pioneer, helping to make sense of the legacy of deep colonial damage.  In such poems as &quot;The Castaway&quot; (1965) and in the play PANTOMIME (1978), he uses the metaphors of shipwreck and Crusoe to describe the culture and what is required of artists after colonialism and slavery: both the freedom and the challenge to begin again, salvage the best of other cultures and make something new.\n\nANOTHER LIFE (1973) is a narrative poem of over four thousand lines that J. D. McClatchy, writing in The New Republic, praised as &quot;one of the best long autobiographical poems in English, with the narrative sweep, the lavish layering of details, and the mythic resonance of a certain classic.&quot;  The epic book-length poem OMEROS (1990) was published to critical acclaim and is considered by many to be Walcott's major achievement.  The poem very loosely echoes and references Homer and some of the major characters from The Iliad.\n\nTwo excellent anthologies -- COLLECTED POEMS (1986), selected by Walcott himself, and THE POETRY OF DEREK WALCOTT (2014), edited by Glyn Maxwell -- present a comprehensive selection of the poet's work from every stage of his career.  Across sixty-five years, Walcott grapples with the themes that have defined his work as they have defined his life: the unsolvable riddle of identity; the painful legacy of colonialism on his native Caribbean island of St. Lucia; the mysteries of faith and love and the natural world; the Western canon, celebrated and problematic; the trauma of growing old, of losing friends, family, one's own memory.\n\nDREAM ON MONKEY MOUNTAIN (1970) contains four plays, including the title play (awarded the 1971 Obie Award for best foreign play and called &quot;a masterpiece&quot; by Edith Oliver in The New Yorker) and three of Walcott's most popular shorter plays: &quot;Ti-Jean and His Brothers&quot;, &quot;Malcochon, or The Six in the Rain&quot;, and &quot;The Sea at Dauphin&quot;.  In the history plays that comprise THE HAITIAN TRILOGY (2002) -- &quot;Henri Christophe&quot;, &quot;Drums and Colours&quot; and &quot;The Haytian Earth&quot; -- Walcott uses verse to tell the story of his native West Indies as a four-hundred-year cycle of war, conquest and rebellion.  With its vast sweep and richly figurative language, Walcott's stage version of THE ODYSSEY (1993) intersperses episodes of the story of Odysseus' protracted wanderings with a commentary by the blind singer Billy Blue.\n\nWHAT THE TWILIGHT SAYS (1998) collects a number of Walcott's essays to form a volume of remarkable elegance, concision, and brilliance.  It includes Walcott's moving and insightful examinations of the paradoxes of Caribbean culture, his Nobel lecture, and his reckoning of the work and significance of such poets as Robert Lowell, Joseph Brodsky, Robert Frost, Les Murray, and Ted Hughes, and of prose writers such as V. S. Naipaul and Patrick Chamoiseau.\n\n\nThe following books are in PDF and/or ePUB/MOBI format as indicated:\n\n\n                                   == Poetry ==\n\n* ANOTHER LIFE (FSG, 1973) -- PDF\n\n* COLLECTED POEMS, 1948-1984 (FSG, 1986) -- PDF\n\n* MIDSUMMER (FSG / Faber &amp; Faber, 1984) -- PDF + ePUB/MOBI\n\n* OMEROS (FSG, 1990) -- PDF + ePUB/MOBI\n\n* THE POETRY OF DEREK WALCOTT, 1948-2013 (FSG, 2014).  Selected by Glyn Maxwell -- ePUB/MOBI\n\n* THE STAR-APPLE KINGDOM (FSG, 1979) -- PDF\n\n\n                                   == Plays ==\n\n* DREAM ON MONKEY MOUNTAIN &amp; OTHER PLAYS (FSG, 1970) -- PDF\n\n* THE HAITIAN TRILOGY: Henri Christophe / Drums and Colours / The Haytian Earth (FSG, 2002) -- ePUB/MOBI\n\n* THE ODYSSEY: A Stage Version (FSG, 1993) -- ePUB/MOBI\n\n* REMEMBRANCE &amp; PANTOMIME (FSG, 1980) -- ePUB/MOBI\n\n* THREE PLAYS: The Last Carnival / Beef, No Chicken / A Branch of the Blue Nile (FSG, 1986) -- ePUB/MOBI\n\n\n                                == Nonfiction ==\n\n* WHAT THE TWILIGHT SAYS: Essays (FSG, 1998) -- PDF\n\n_____________________________________________________________________________\n\n\n&gt;&gt; CONTACT ME\nYou may reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\n               &lt;a href=&quot;\nhttps://pirates-forum.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://pirates-forum.org/User-workerbee&lt;/a&gt;  \n\n&gt;&gt; PLEASE HELP TO SEED!\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:50c97891a1b64d3b134ca54210477d685a4c64dd","amp;dn":"Derek+Walcott+-+Nobel+Prize+in+Literature%2C+1992+%2812+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50c97891a1b64d3b134ca54210477d685a4c64dd","infoHashBuffer":{"type":"Buffer","data":[80,201,120,145,161,182,77,59,19,76,165,66,16,71,125,104,90,76,100,221]},"announce":[],"urlList":[]}}