{"title":"Mastering NGINX","uid":8849907,"size":4022154,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:519fcd5b6a7494018968336640181ac8bce835f8&amp;dn=Mastering+NGINX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"d347hBy73","files":-1,"time":1377495252,"description":"Mastering Nginx\n\nBook Details:\n\nPages: 322 \nPublisher: Packt Publishing (March 2013)\nLanguage: English\nISBN-10: 1849517444\nISBN-13: 978-1849517447\nFormat: PDF, EPUB\n\nBook Description:\n\nNGINX is a high-performance HTTP server and mail proxy designed to use very few system resources. With the many tutorials and example configurations floating around the Web, it is difficult to know how to properly configure NGINX to meet your expectations.\n\nMastering Nginx will serve to clarify the murky waters of NGINX configuration, helping you learn how to tune NGINX for various situations, what some of the more obscure configuration directives do, and how to design a decent configuration to match your needs.\n\nBeginning with an overview of compiling NGINX and describing its basic configuration file format, this guide next takes you on a tour of NGINXs modules.\n\nFrom the unique mail module to the upstream module, this book explores the various possibilities of using NGINX as a reverse proxy. The multiple HTTP modules are explained, and the book rounds off the tour with a discussion of troubleshooting.\n\nMastering Nginx will explain all aspects of configuring NGINX to help solve your hosting problems.\n\nWhat you will learn from this book:\n\nCompile the right third party module to meet your needs\nWrite an authentication server to use with the mail proxy module\nCreate your own SSL certificates to encrypt connections\nUse try_files to solve your file-existence check problems\nCache and compress responses for speedier user-interaction\nIntegrate popular PHP frameworks with the FastCGI module\nConstruct useful logging configurations\nTroubleshoot configuration problems as they arise\n\nApproach:\n\nThis book is a practical step-by-step tutorial with well-explained code snippets, best-practice tips, and reference tables.\n\nWho this book is for:\n\nIf you are an experienced systems administrator or systems engineer, familiar with installing and configuring servers to meet specific needs and want to master NGINX, then this book is for you. You do not need to have experience using NGINX already.\n","torrent":{"xt":"urn:btih:519fcd5b6a7494018968336640181ac8bce835f8","amp;dn":"Mastering+NGINX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"519fcd5b6a7494018968336640181ac8bce835f8","infoHashBuffer":{"type":"Buffer","data":[81,159,205,91,106,116,148,1,137,104,51,102,64,24,26,200,188,232,53,248]},"announce":[],"urlList":[]}}