{"title":"Hot Water Music [Studio Discography]","uid":6292371,"size":549716792,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:523be22ad6b09a8ff70f0cd860c385923e898fe0&amp;dn=Hot+Water+Music+%5BStudio+Discography%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":3,"uploader":"Mikux","files":128,"time":1301866371,"description":"Hot Water Music is a punk rock band from Gainesville, Florida. The members of the band are Chuck Ragan, Chris Wollard, Jason Black, and George Rebelo. HWM first formed in 1993. In 1996, after releasing two EPs and a full-length album, the band briefly disbanded, but soon reformed, announcing their continuation as Hot Water Music at the concert recorded for Live at the Hardback. In late 2005, Hot Water Music stated they were going on a hiatus following Chuck Ragan\\'s departure to care for his family. On May 13, 2006 however, the hiatus became permanent and Hot Water Music officially disbanded. The three remaining members have started a new project, The Draft, whose first album, In a Million Pieces, was released on September 12, 2006. Chuck Ragan also continues with a more low-key music career, releasing material through No Idea Records and Side One Dummy Records. He is currently signed to the latter.\n\nHot Water Music\\'s sound is characterized by the dual vocalists, improvised guitar playing and an extremely tight and complex rhythm section. The rhythm section drives the music in a rather spritzy manner that is influenced by, yet not necessarily congruous with, the spritzy rock and roll of the 90\\'s Tampa, Florida music scene. Hot Water Music\\'s unique semi-spritzy, or perhaps \\&quot;tonic,\\&quot; style was developed by bassist Jason Black and drummer George Rebelo throughout their youth, when they grew up playing jazz together in Sarasota, Florida. In the band\\'s early records, Chuck would sing the majority of the songs with Chris doing backing vocals, and sometimes lead vocals. Later, the vocalists would perform in a duet fashion, which some would argue is their best work, whereas on the later records, Chris Wollard would handle most of the vocals, with Chuck doing backups and a share of his own songs. Ragan\\'s voice is a deeper and raspier voice, whereas Wollard\\'s is more high pitched and melodic, though both vocalists are very dynamic and can sing softer.\n\nA collection of Hot Water Music work on No Idea records has been released, titled Till the Wheels Fall Off .[1] It was released on CD and on LP. According to Jason Black in an interview with Alternative Press, the compilation will feature \\&quot;a song [called \\&quot;Home\\&quot;] that hasn\\'t come out anywhere...it was one of two that didn\\'t make it [onto The New What Next].\\&quot;\n\nThe band\\'s name was taken from the book by Charles Bukowski of the same name.\n\nThe band members have also participated in many side projects. The four most popular of these are Blacktop Cadence, Cro(w)s, Unitas and Rumbleseat.\n\nIncluded are the following:\n\n1996: Finding The Rhythms \n1997: Forever And Counting \n1998: Fuel For The Hate Game \n1999: No Division \n2001: A Flight And A Crash \n2002: Caution \n2004: The New What Next \n\nRequests? @ArchMikux on Twitter\n","torrent":{"xt":"urn:btih:523be22ad6b09a8ff70f0cd860c385923e898fe0","amp;dn":"Hot+Water+Music+%5BStudio+Discography%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"523be22ad6b09a8ff70f0cd860c385923e898fe0","infoHashBuffer":{"type":"Buffer","data":[82,59,226,42,214,176,154,143,247,15,12,216,96,195,133,146,62,137,143,224]},"announce":[],"urlList":[]}}