{"title":"PostgreSQL Developer's Guide (148)","uid":11788679,"size":1995878,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:52f2e3aa25f68439a061dc7da11776d0a9b4ada1&amp;dn=PostgreSQL+Developer%27s+Guide+%28148%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"steelballz","files":2,"time":1427848008,"description":"\nDescription\nPostgreSQL Developer's Guide\nAuthor:Ibrar Ahmed, Asif Fayyaz, Amjad Shahzad\nPublisher and Published Date: Packt Publishing (Feb. 27 2015)\nASIN: B00U64KR44\nFormat: Retail PDF\n\nPM IF YOU NEED HELP WITH THE TORRENT :)\n\nimage\n\n\nDESCRIPTION\n\n\n\nPostgreSQL is an enterprise-level database that competes among proprietary database vendors, owing to its remarkable feature set and reliability without the expensive licensing overhead.\n\nThis book is a comprehensive and pragmatic guide to developing databases in PostgreSQL. Beginning with a refresher of basic SQL skills, you will gradually be exposed to advanced concepts, such as learning how to program in native PostgreSQL procedural languages, implementing triggers, custom functions, and views. You will learn database optimization techniques such as query optimization and indexing while exploring extensive code examples. Lastly, you will explore foreign data wrappers, implementing extensibility, and improving maintainability.\nAbout the Author\nIbrar Ahmed has over 15 years of experience in software development. He is currently working as a software architect for a PostgreSQL-based company. He is an open source evangelist. He has contributed features such as pg_migrator (now called pg_upgrade) and Index Only Scans to PostgreSQL and has contributed to Google Chromium projects such as platform-independent FTP implementations of the Google Chrome browser, Chromium test framework enhancements, and porting of listen_socket and telnet_server to Linux. He has a lot of experience in implementing network protocols and writing Linux kernel modules. Apart from his professional life, he delivers lectures at universities and reads books. Asif Fayyaz is an open source technology lover and practitioner. He is currently working as a senior software quality assurance engineer at a leading PostgreSQL based company. He has been learning and using PostgreSQL for the last 7 years. His areas of interest are exploring PostgreSQL replication solutions and software test automation solutions for desktop, web, and mobile applications. His future endeavors include joining a sports channel for set-top box automation in Python. Apart from his professional activities, he, along with his dedicated friends, is keen to find ways that can make life easier for those who are facing the worst living conditions. His other passions include, but are not limited to, traveling to different places, trying different cuisines, and reading books if somehow permitted by his loving family. Amjad Shahzad has been working in the open source software industry for the last 10 years. He is currently working as a senior quality assurance engineer at a leading PostgreSQL-based company, which is the only worldwide provider of enterprise-class products and services based on PostgreSQL. Amjad's core expertise lies in the areas of pg_upgrade, slony and streaming replication, Cloud database, and database partitioning. His future endeavors include exploring PostgreSQL replication solutions. Apart from his professional activities, he is also involved in doing social activities that involve helping people stand on their feet. In his free time, he likes to explore nature by doing outdoor activities, including hiking, trekking, and nature photography.\n\nProudly sourced and uploaded by [StormRG]","torrent":{"xt":"urn:btih:52f2e3aa25f68439a061dc7da11776d0a9b4ada1","amp;dn":"PostgreSQL+Developer%27s+Guide+%28148%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52f2e3aa25f68439a061dc7da11776d0a9b4ada1","infoHashBuffer":{"type":"Buffer","data":[82,242,227,170,37,246,132,57,160,97,220,125,161,23,118,208,169,180,173,161]},"announce":[],"urlList":[]}}