{"title":"Pluralsight - Entity Framework 6 Ninja Edition What's New in EF6","uid":11446831,"size":1731962631,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:531622abf42bc24fe01d960c6877894cddc5adcb&amp;dn=Pluralsight+-+Entity+Framework+6+Ninja+Edition+What%27s+New+in+EF6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"NepsterJay","files":135,"time":1415850358,"description":"Gain deep insight into all of the new features in Entity Framework 6 so that you can take your data access code to the Ninja level!\n\nEntity Framework 6 brings major improvements to EF that allow developers to align their data access with advanced software practices. The biggest news for EF6 is that it is open-source and has gained a lot from developer community input. Features with broad appeal such as stored procedure mapping in code first, support for the Async/Await pattern when executing queries and commands, simpler patterns for unit testing, and built-in database logging capabilities have gotten a lot of visibility. EF6 is now very extensible with custom Migrations, custom mapping conventions, and the introduction of Dependency Injection patterns to open up low-level DbContext configuration. There are new methods and properties that allow simpler and smarter coding patterns. Rather than present a high level list of the new features, this course dives into each new feature in EF6, ensures that you understand not only what it is for, but how it works, scenarios where you can benefit from it, and gotchas you should watch out for. This course provides a comprehensive look at what EF6 adds to Entity Framework, and it will leave you with the ability to truly benefit from all of the Ninja power that's been added to this version of EF","torrent":{"xt":"urn:btih:531622abf42bc24fe01d960c6877894cddc5adcb","amp;dn":"Pluralsight+-+Entity+Framework+6+Ninja+Edition+What%27s+New+in+EF6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"531622abf42bc24fe01d960c6877894cddc5adcb","infoHashBuffer":{"type":"Buffer","data":[83,22,34,171,244,43,194,79,224,29,150,12,104,119,137,76,221,197,173,203]},"announce":[],"urlList":[]}}