{"title":"The Art of Time Travel: Historians and Their Craft","uid":15789325,"size":1457774,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:545f5c77a8d7211ebe27ee55e6ead48ea67e42a6&amp;dn=The+Art+of+Time+Travel%3A+Historians+and+Their+Craft&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"marty14","files":1,"time":1473370957,"description":"The Art of Time Travel: Historians and Their Craft - Tom Griffiths [epub]\r\n\r\nNo matter how practised we are at history, it always humbles us. No matter how often we visit the past, it always surprises us. The art of time travel is to maintain critical poise and grace in this dizzy space.\r\n\r\nIn this landmark book, eminent historian and award-winning author Tom Griffiths explores the craft of discipline and imagination that is history.\r\n\r\nThrough portraits of fourteen historians, including Inga Clendinnen, Judith Wright, Geoffrey Blainey and Henry Reynolds, he traces how a body of work is formed out of a life-long dialogue between past evidence and present experience. With meticulous research and glowing prose, he shows how our understanding of the past has evolved, and what this changing history reveals about us.\r\n\r\nPassionate and elegant, The Art of Time Travel conjures fresh insights into the history of Australia and renews our sense of the historian's craft.\r\n\r\nTom Griffiths is the W K Hancock Professor of History at the Australian National University His books and essays have won prizes in literature, history, science, politics and journalism, including the Prime Minister's Prize for Australian History, the Alfred Deakin Prize for an Essay Advancing Public Debate, and the Douglas Stewart and Nettie Palmer Prizes for Non-Fiction","torrent":{"xt":"urn:btih:545f5c77a8d7211ebe27ee55e6ead48ea67e42a6","amp;dn":"The+Art+of+Time+Travel%3A+Historians+and+Their+Craft","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"545f5c77a8d7211ebe27ee55e6ead48ea67e42a6","infoHashBuffer":{"type":"Buffer","data":[84,95,92,119,168,215,33,30,190,39,238,85,230,234,212,142,166,126,66,166]},"announce":[],"urlList":[]}}