{"title":"An Engineer's Guide to Mathematica® - Edward B. Magrab","uid":12163743,"size":7111821,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:54741d29f913395dba5a3c31b7afc96ea34bbf95&amp;dn=An+Engineer%27s+Guide+to+Mathematica%26reg%3B+-+Edward+B.+Magrab&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"clouderone","files":1,"time":1437981886,"description":"An Engineer's Guide to MathematicaÂ® - Edward B. Magrab (Wiley, 2014).pdf\n\nISBN 9781118821268\n\nAn Engineer's Guide to Mathematica enables the reader to attain the skills to create Mathematica 9 programs that solve a wide range of engineering problems and that display the results with annotated graphics. This book can be used to learn Mathematica, as a companion to engineering texts, and also as a reference for obtaining numerical and symbolic solutions to a wide range of engineering topics. The material is presented in an engineering context and the creation of interactive graphics is emphasized.\nThe first part of the book introduces Mathematica's syntax and commands useful in solving engineering problems. Tables are used extensively to illustrate families of commands and the effects that different options have on their output. From these tables, one can easily determine which options will satisfy one's current needs. The order of the material is introduced so that the engineering applicability of the examples increases as one progresses through the chapters. The second part of the book obtains solutions to representative classes of problems in a wide range of engineering specialties. Here, the majority of the solutions are presented as interactive graphics so that the results can be explored parametrically.\n\nKey features:\n\nMaterial is based on Mathematica 9\nPresents over 85 examples on a wide range of engineering topics, including vibrations, controls, fluids, heat transfer, structures, statistics, engineering mathematics, and optimization\nEach chapter contains a summary table of the Mathematica commands used for ease of reference\nIncludes a table of applications summarizing all of the engineering examples presented.\nAccompanied by a website containing Mathematica notebooks of all the numbered examples\nAn Engineer's Guide to Mathematica is a must-have reference for practitioners, and graduate and undergraduate students who want to learn how to solve engineering problems with Mathematica","torrent":{"xt":"urn:btih:54741d29f913395dba5a3c31b7afc96ea34bbf95","amp;dn":"An+Engineer%27s+Guide+to+Mathematica%26reg%3B+-+Edward+B.+Magrab","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54741d29f913395dba5a3c31b7afc96ea34bbf95","infoHashBuffer":{"type":"Buffer","data":[84,116,29,41,249,19,57,93,186,90,60,49,183,175,201,110,163,75,191,149]},"announce":[],"urlList":[]}}