{"title":"Starbound (v2.4.0.6) [GOG]","uid":15507816,"size":1468682552,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:547b7633090a898fdcf469e1f5e597751c25080c&amp;dn=Starbound+%28v2.4.0.6%29+%5BGOG%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"ojusko","files":1,"time":1470611662,"description":"Install instruction:\r\n- Run &quot;setup_starbound_2.4.0.6.exe&quot;\r\n- Play\r\n\r\nChangelog for Patch 1.0.4 / GOG-6 (Windows) (added 03 August 2016):\r\n- fix OSX crash when performing certain GUI actions \r\n- fix a graphical bug when fuel tank contains more than its maximum fuel capacity \r\n- fix bug preventing Dreadwing's visible damage state from changing \r\n- fix arm images in Nuru's portrait in teleport confirmation dialog \r\n- fix Blink Dash dropping through platforms \r\n- fix booster flame positions on T7 floran ship \r\n- fix some problems resolving facing direction while dual wielding e.g. fist weapons \r\n- fix some typographical errors \r\n- fix hover state in MM upgrade interface while an upgrade is selected \r\n- fix bug causing wand/staff projectiles to not track properly on win32 \r\n- adjust a few item prices \r\n- adjust nutrition value of Toast and Potato Grids \r\n- better sound effect for Violium Broadsword special ability \r\n- better sound effect for Wooden Hatch \r\n- disable monster touch damage when they are in special invulnerable states (Spookit, Orbide, Peblit and Trictus) \r\n- increase chat bubble duration \r\n- revert a previous fix for players beaming into terrain; needs a more complex solution \r\n\r\n\r\nGenre: Action - Adventure - Sandbox\r\nWorks on: Windows (XP, Vista, 7, 8, 10), Mac OS X (10.9.0+) and Linux (Ubuntu 14.04, Ubuntu 16.04)\r\nLanguages: Audio and text: English\r\nFeatures: single-player - multi-player - co-op\r\nReleased: July 22, 2016\r\nSize: 1.4 GB\r\nCompany: Chucklefish / Chucklefish\r\nStore page: https://www.gog.com/game/starbound\r\n\r\nAbout: \r\nYou’ve fled your home, only to find yourself lost in space with a damaged ship. Your only option is to beam down to the planet below and gather the resources you need to repair your ship and set off to explore the vast, infinite universe…\r\n\r\nIn Starbound, you create your own story - there’s no wrong way to play! You may choose to save the universe from the forces that destroyed your home, uncovering greater galactic mysteries in the process, or you may wish to forego a heroic journey entirely in favor of colonizing uncharted planets.\r\n\r\nSettle down and farm the land, become an intergalactic landlord, hop from planet to planet collecting rare creatures, or delve into dangerous dungeons and lay claim to extraordinary treasures.\r\n\r\nDiscover ancient temples and modern metropolises, trees with eyes and mischievous penguins. Make use of hundreds of materials and over two thousand objects to build a sleepy secluded cabin in the woods, a medieval castle, or an underwater arcade.\r\n\r\nStarbound has been built from the ground up to be multiplayer and easily moddable. You have the tools to make the universe your own and modify the game to suit your play style - add new races, biomes, dungeons, and quests - the possibilities are limitless.\r\n\r\nChoose from one of 7 playable races and customize your character\r\nSave the universe in a story campaign featuring unique characters, bosses, dungeons and quests!\r\nYou're the captain of your very own starship! Decorate it, expand it and use it to explore a procedurally generated universe\r\nColonize uncharted planets and collect gifts from your tenants - if they like you, they may even ask to join your ship crew!\r\nThree game modes - Casual (no need to eat), Survival (eat to survive/drop items on death) and Hardcore (permadeath)\r\nCraft thousands of objects - building materials, armor, weapons, furniture and more\r\nCapture unique monsters to fight alongside you\r\nAll content is available in online drop-in/drop-out co-op\r\nBuilt from the ground up to be easily moddable. You have the tools to make the universe your own - add new races, biomes, dungeons, and quests","torrent":{"xt":"urn:btih:547b7633090a898fdcf469e1f5e597751c25080c","amp;dn":"Starbound+%28v2.4.0.6%29+%5BGOG%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"547b7633090a898fdcf469e1f5e597751c25080c","infoHashBuffer":{"type":"Buffer","data":[84,123,118,51,9,10,137,143,220,244,105,225,245,229,151,117,28,37,8,12]},"announce":[],"urlList":[]}}