{"title":"The Presidents of the United States of America 320cbr 1995","uid":9485239,"size":93064687,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:54a9673c6212f9c8e40d1bc21cd9b5476411acc1&amp;dn=The+Presidents+of+the+United+States+of+America+320cbr+1995&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":4,"uploader":"Big-Papi","files":-1,"time":1389832853,"description":"Source: 1995 CD\n\n\nThe Presidents of the United States of America 320cbr (Big Papi) 1995\n\n\n\nBy Anthony G Pizza VINE VOICE\n\n1990s new rock needed levity after Kurt Cobain's death, Scott Weiland's addictions and dark grunge records like Soundgarden's &quot;Superunknown.&quot; The Presidents of the USA wouldn't see the new millennium, but provided an unforgettable debut mixing hard rock with a touch of goofiness and cornpone humor.\n\nMake no mistake, this trio could rock as its cover of MC5's &quot;Kick Out The Jams&quot; attests. They also reference ZZTop, Lynyrd Skynyrd and the Beatles musically and lyrically. The topics were fun (&quot;Kitty,&quot; &quot;Lump,&quot; &quot;Dune Buggy&quot;) and the group had a way with a guitar hook. Moreover, like that fun 60s rock, the Presidents made their points quickly and got out (most songs struggled to make it to three minutes.) This is the album the infamous Shaggs wish they could have made.\n\nBut it wouldn't last. Green Day took the same approach, added a whinier voice, slacker world view and a touch of schmaltz to bring LPs like &quot;Dookie&quot; and songs like &quot;Time Of Your Life&quot; to the charts, while the Presidents recorded another year, cut a movie theme, then split. A shame, really, we could have used tunes like &quot;We're Not Going To Make It,&quot; and &quot;Peaches&quot; one of these every couple of years, to remember that rock and roll needn't be angry to be enjoyable - or good. Recommended.","torrent":{"xt":"urn:btih:54a9673c6212f9c8e40d1bc21cd9b5476411acc1","amp;dn":"The+Presidents+of+the+United+States+of+America+320cbr+1995","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54a9673c6212f9c8e40d1bc21cd9b5476411acc1","infoHashBuffer":{"type":"Buffer","data":[84,169,103,60,98,18,249,200,228,13,27,194,28,217,181,71,100,17,172,193]},"announce":[],"urlList":[]}}