{"title":"Microsoft Flight Simulator X Gold","uid":13128892,"size":11759106048,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:54b825e9a21217f7be9ac3292d979bc035097dfb&amp;dn=Microsoft+Flight+Simulator+X+Gold&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":3,"uploader":"dudeman69","files":3,"time":1451816903,"description":"Flight Simulator X marks the tenth version of the popular line of flight simulators. It was officially released to the US market on October 17, 2006. According to Microsoft's Web site for the game, a standard edition features everything from navaids to GPS and airways. It also includes 18 planes, 28 detailed cities, and over 24,000 airports with a deluxe version featuring 24 aircraft, and 38 cities. The player can fly anything from single-engine aircraft to jumbo jets. The game features an immersive air traffic control system and dynamic real-world condition weather. The geography matches the part of the world that the player is flying in. Jetways and ground equipment are also included in the game.\r\n\r\nFlight Simulator X was officially unveiled at the 2006 International Consumer Electronics Show (CES) as a gaming showcase for Microsoft Windows Vista and is now also compatible with Windows 7, and with Windows 8 via Steam. Microsoft released screenshots as well as a list of frequently asked questions as a press release on Microsoft Flight Simulator Insider,[3] and numerous flight simulator communities. This also included mission-based gameplay with mission specific aircraft as well as an upgraded rendering engine capable of increased detail. Following the Electronic Entertainment Expo (E3) in May 2006, Microsoft published new screenshots, videos and an official trailer. The overall reaction by the community was quite positive,[citation needed] and the graphical quality of the simulator has greatly increased","torrent":{"xt":"urn:btih:54b825e9a21217f7be9ac3292d979bc035097dfb","amp;dn":"Microsoft+Flight+Simulator+X+Gold","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54b825e9a21217f7be9ac3292d979bc035097dfb","infoHashBuffer":{"type":"Buffer","data":[84,184,37,233,162,18,23,247,190,154,195,41,45,151,155,192,53,9,125,251]},"announce":[],"urlList":[]}}