{"title":"Preservation Hall Jazz Band - 2013 - That's It! FLAC","uid":9420383,"size":247159070,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:552d36d1d6ff5208452632caf4ec2babb4cbcc1e&amp;dn=Preservation+Hall+Jazz+Band+-+2013+-+That%27s+It%21+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"eika256","files":-1,"time":1388573886,"description":"Preservation Hall Jazz Band - 2013 - That's It!\n\nPreservation Hall Jazz Band's 2013 album, That's It!, is the first album of all-original material in their 50-year career. Certainly, the storied ensemble has performed original songs by its various members over the years, but the group has never released an album made up solely of new compositions. In that sense, the album fits in with Preservation Hall Jazz Band's recent creative direction that found them collaborating with artists from other genres, including 2010's Preservation: An Album to Benefit Preservation Hall &amp; the Preservation Hall Music Outreach Program and 2011's jazz-meets-bluegrass experiment American Legacies, featuring the Del McCoury Band. Some of this newfound creativity is surely due in large part to bassist and tuba player Ben Jaffe having taken over as Preservation Hall's director, a legacy passed down to him by his parents, who co-founded the institution. Under his creative direction, Preservation Hall has flourished as a vital part of New Orleans culture. Produced by Jaffe along with My Morning Jacket's Jim James, That's It! celebrates this culture with a batch of brand-new songs that, while hewing closely to the swinging blues and gospel-oriented traditions of New Orleans jazz, never feel stodgy or revivalist. These are freewheeling, organic productions that make the most of the group's mix of older and younger musicians. Along with new songs by Jaffe, clarinetist/vocalist Charlie Gabriel, pianist Rickie Monie, and saxophonist/vocalist Clint Maedgen, the album also features songs co-written by several pop artists, including the legendary Paul Williams and Semisonic's Dan Wilson. All of which helps to make That's It! a vibrant, engaging work and one of Preservation Hall's best albums. (AllMusic)\n\nTrack list:\n01 - That's It!\n02 - Dear Lord (Give Me The Strength)\n03 - Come with Me\n04 - Sugar Plum\n05 - Rattlin' Bones\n06 - I Think I Love You\n07 - August Nights\n08 - Halfway Right, Halfway Wrong\n09 - Yellow Moon\n10 - The Darker it Gets\n11 - Emmalena's Lullaby\n\nNo .log or .cue files.\nEnjoy and share!","torrent":{"xt":"urn:btih:552d36d1d6ff5208452632caf4ec2babb4cbcc1e","amp;dn":"Preservation+Hall+Jazz+Band+-+2013+-+That%27s+It%21+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"552d36d1d6ff5208452632caf4ec2babb4cbcc1e","infoHashBuffer":{"type":"Buffer","data":[85,45,54,209,214,255,82,8,69,38,50,202,244,236,43,171,180,203,204,30]},"announce":[],"urlList":[]}}