{"title":"Rush Hour 3(2007)DVDRip.AC3(ENG)-DROCK","uid":6659573,"size":733407082,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5538153a0ba89bfc39d5ea36629a7f4b2a0a6264&amp;dn=Rush+Hour+3%282007%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"drock232","files":-1,"time":1315467140,"description":"In this third installment of the popular action comedy franchise, LAPD Detective James Carter (Chris Tucker) and Chief Inspector Lee (Jackie Chan) book a flight for Europe and prepare to clean up the streets of Paris after discovering that Chinese triads have extended their criminal influence to the City of Lights. Chinese Ambassador Han (Tzi Ma) is in Los Angeles and about to reveal the details of a clandestine triad conspiracy to the World Criminal Court when an assassin takes aim and pulls the trigger. Though Carter has been demoted to directing traffic at the time of the shooting, Lee is acting as a bodyguard to Han when the bullets begin to fly. Lee quickly gives chase, but hesitates when he realizes that the gunman is Kenji (Hiroyuki Sanada), his old friend from the orphanage. When triads steal an envelope containing vital information regarding the conspiracy from Soo Yung's (Zhang Jingchu) Chinatown kung fu studio, Carter and Chief Inspector Lee race to reach Genevieve (NoÃƒÂ©mie Lenoir), an underground entertainer who could prove the key to bagging the bad guys. During the course of their investigation, however, triads clash with the French police, threatening to turn the romance capitol of Europe into an explosive hotbed of crime and violence. \n\nRipped with Handbrake.\n\nLength: 1 Hour 30 Minutes\n\nFile Type: MP4\n\nFrame Width: 720\n\nFrame Height: 400\n\nFrame Rate: 23fps\n\nAudio\n\nBit Rate: 159kbps","torrent":{"xt":"urn:btih:5538153a0ba89bfc39d5ea36629a7f4b2a0a6264","amp;dn":"Rush+Hour+3%282007%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5538153a0ba89bfc39d5ea36629a7f4b2a0a6264","infoHashBuffer":{"type":"Buffer","data":[85,56,21,58,11,168,155,252,57,213,234,54,98,154,127,75,42,10,98,100]},"announce":[],"urlList":[]}}