{"title":"Chromeo - Business Casual [2010] [V2] HoTT","uid":5809006,"size":58620537,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5542ed6448be064eea69581d34258adffc3ce0ca&amp;dn=Chromeo+-+Business+Casual+%5B2010%5D+%5BV2%5D+HoTT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"XaioSheen","files":-1,"time":1283551878,"description":"This summer, the party-starting, festival-happy Montreal plastic-funk duo Chromeo returns. On August 17 September 14, they'll release Business Casual, their third album and the follow-up to the 2007 breakthrough Fancy Footwork, via Atlantic. The band is still finalizing the order of the songs, but we've got the titles of all the songs on the album below. It seems pretty incredible that Chromeo hadn't already released a track called &quot;Hot Mess&quot;.\n\nSome fun facts about Business Casual: Solange Knowles lends her voice to &quot;When the Night Falls&quot;; Cassius member and Phoenix producer Philipe Zdar, a longtime Chromeo collaborator, mixed the disc; and, as with Fancy Footwork, Surface 2 Air did the artwork.\n\nBefore the album drops, they'll also play a couple of big festivals. The duo has dates lined up at Lollapalooza and Bonnaroo. And at the 'Roo, they'll fulfill their destiny by sharing a stage with 80s pop legend Daryl Hall.\n\nTracklist:\n01. Hot Mess 03:40\n02. I'm Not Contagious 03:39\n03. Night By Night 03:47\n04. Don't Turn The Lights On 04:33\n05. You Make It Rough 07:19\n06. When The Night Falls 03:45\n07. Don't Walk Away 03:31\n08. J'ai Claque La Porte 02:26\n09. The Right Type 03:55\n10. Grow Up 03:03\n\nChromeo is an electrofunk duo based in Montreal and New York City. The duo is Pee Thugg, on keyboards, synthesizers, and talk box, and Dave 1 (David Macklovitch) on guitar and lead vocals. The two were best friends since childhood and they describe themselves as the only successful Arab (Pee)/Jewish (Dave) collaboration since the beginning of time.\n\nDavid Macklovitch is currently earning his Ph.D in French Literature from Columbia University, where he also teaches undergraduate French classes.\nHighlights of their 2004 debut album She's in Control include club tracks Needy Girl, Mercury Tears, Rage!, and Destination: Overdrive. In 2005, Chromeo released a mix cd of funky dance tracks on Eskimo Belgium records entitled Un Joli Mix Pour Toi (A Pretty Mix For You). During early 2007 Chromeo supported indie rock group Bloc Party on their British tour.\n\nTheir second album &quot;Fancy Footwork&quot;, produced by Chromeo themselves with the help of Tiga and mixed by Philippe Zdar from Cassius, was released on June 26th, 2007.\n\nTrivia:\nGuitarist and lead singer David Macklovitch is the older brother of A-Trak (Alain Macklovitch), who in 1997 was the youngest-ever winner of the DMC World DJ Championship and is currently Kanye West's tour DJ.\n\n","torrent":{"xt":"urn:btih:5542ed6448be064eea69581d34258adffc3ce0ca","amp;dn":"Chromeo+-+Business+Casual+%5B2010%5D+%5BV2%5D+HoTT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5542ed6448be064eea69581d34258adffc3ce0ca","infoHashBuffer":{"type":"Buffer","data":[85,66,237,100,72,190,6,78,234,105,88,29,52,37,138,223,252,60,224,202]},"announce":[],"urlList":[]}}