{"title":"Handbook of Dialysis, 5E Daugirdas [PDF][StormRG]","uid":11890329,"size":13235085,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:555c6fe34644049e73b55c65d88d87a107a7a676&amp;dn=Handbook+of+Dialysis%2C+5E+Daugirdas+%5BPDF%5D%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"0xmovva","files":2,"time":1430978535,"description":"TITLE/EDITION Handbook of Dialysis\nBy: John T. Daugirdas MD (Author), Peter G. Blake MB FRCPC FRCPI (Author), Todd S. Ing MB FRCP (Author)\nSeries: Handbook of Dialysis\nPaperback: 900 pages\nPublisher: LWW; Fifth edition (November 14, 2014)\nLanguage: English\nISBN-10: 1451144296\nISBN-13: 978-1451144291\nNOTE: This is the standalone ebook and may not include access codes that come packaged with the bound book\n\n\n\n\nThe updated 5th edition of the Handbook of Dialysis is full of evidence-based, practical information on all aspects of dialysis training and therapy. Authored by international nephrology experts, each chapter addresses a different area of the clinical realities of patient management. Topics include screening, diagnosis and management of dialysis patients, including diagnostic work-ups, patient safety, and patient monitoring issues in acute dialysis and hemodialysis cases. This is the essential dialysis manual, filled with up-to-date dialysis information, including preparation, procedures, surgery, problems and side-effects.\n\nFeatures:\nNEW expanded coverage of vascular access placement and management\nNEW discussion of urgent start peritoneal dialysis\nNEW chapter on practical implementation of sorbent dialysis\nNEW updated section on home and intensive hemodialysis therapies\nCoverage of topics including: peritoneal dialysis, acute dialysis, hemodiafiltration, home and intensive dialysis, blood-based therapies, the physiology of peritoneal dialysis, diabetes, hypertension, optimal management of anemia, infections, nutrition, mineral bone disorder, and much more!\nQuick-reference outline format\nContent illustrated with tables, diagrams and charts","torrent":{"xt":"urn:btih:555c6fe34644049e73b55c65d88d87a107a7a676","amp;dn":"Handbook+of+Dialysis%2C+5E+Daugirdas+%5BPDF%5D%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"555c6fe34644049e73b55c65d88d87a107a7a676","infoHashBuffer":{"type":"Buffer","data":[85,92,111,227,70,68,4,158,115,181,92,101,216,141,135,161,7,167,166,118]},"announce":[],"urlList":[]}}