{"title":"Cisco AnyConnect Secure Mobility VPN v3","uid":8797238,"size":3583488,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:55c8ff4239de35ca5be11ed8f648e09198b59432&amp;dn=Cisco+AnyConnect+Secure+Mobility+VPN+v3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"Subject0","files":1,"time":1376102357,"description":"OS: WINDOWS\n\n-------------------\n\nThe Cisco AnyConnect Secure Mobility Solution provides a comprehensive, highly secure enterprise mobility solution. It combines industry-leading Cisco web security with next-generation remote access technology to help organizations easily manage the security risks of borderless networks.\n\nNow, the Cisco AnyConnect Secure Mobility Solution continues to lead with next-generation security and encryption, including support for the Suite B set of cryptographic algorithms, and support for IPv6 networks.\n\nWith this mobile security solution, workers can globally access the network with their device of choice, including laptops, tablets, and smartphones. They can then easily and more securely use the applications and information they need to do their jobs.\n\nThe Cisco AnyConnect Secure Mobility Solution offers:\n\nSecurity policy enforcement that is context-aware, comprehensive, and preemptive\nConnectivity that is intelligent, simple, and always on\nHighly secure mobility across the rapidly increasing number of managed and unmanaged mobile devices\nThe following components make up the Cisco AnyConnect Secure Mobility solution:\n\nCisco AnyConnect Secure Mobility Client for highly secure connectivity\nCisco Web Security for security policy enforcement\nCisco ASA Series as the firewall and security gateway","torrent":{"xt":"urn:btih:55c8ff4239de35ca5be11ed8f648e09198b59432","amp;dn":"Cisco+AnyConnect+Secure+Mobility+VPN+v3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55c8ff4239de35ca5be11ed8f648e09198b59432","infoHashBuffer":{"type":"Buffer","data":[85,200,255,66,57,222,53,202,91,225,30,216,246,72,224,145,152,181,148,50]},"announce":[],"urlList":[]}}