{"title":"Octavia E. Butler - Xenogenesis Trilogy","uid":11461735,"size":793520067,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5690c15e6a3c9f05e8f1f3f2638807546c3bf1f2&amp;dn=Octavia+E.+Butler+-+Xenogenesis+Trilogy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"Cybotage","files":4,"time":1415996469,"description":"\nWritten by Octavia E. Butler\nRead by Aldrich Barrett\nFormat: M4B\nBitrate: 64 Kbps\n\nDawn: Xenogenesis, Book 1\nLENGTH\n9 hrs and 20 mins\n\nIn a world devastated by nuclear war with humanity on the edge of extinction, aliens finally make contact. They rescue those humans they can, keeping most survivors in suspended animation while the aliens begin the slow process of rehabilitating the planet. When Lilith Iyapo is &quot;awakened&quot;, she finds that she has been chosen to revive her fellow humans in small groups by first preparing them to meet the utterly terrifying aliens, then training them to survive on the wilderness that the planet has become. But the aliens cannot help humanity without altering it forever.\nBonded to the aliens in ways no human has ever known, Lilith tries to fight them even as her own species comes to fear and loathe her. A stunning story of invasion and alien contact by one of science fiction's finest writers.\n\nAdulthood Rites: Xenogenesis, Book 2\nLength 12 hrs and 12 mins\n\nIn this sequel to Dawn, Lilith Iyapo has given birth to what looks like a normal human boy named Akin. But Akin actually has five parents: a male and female human, a male and female Oankali, and a sexless Ooloi. The Oankali and Ooloi are part of an alien race that rescued humanity from a devastating nuclear war, but the price they exact is a high one the aliens are compelled to genetically merge their species with other races, drastically altering both in the process. On a rehabilitated Earth, this &quot;new&quot; race is emerging through human/Oankali/Ooloi mating, but there are also &quot;pure&quot; humans who choose to resist the aliens and the salvation they offer. These resisters are sterilized by the Ooloi so that they cannot reproduce the genetic defect that drives humanity to destroy itself, but otherwise they are left alone (unless they become violent). When the resisters kidnap young Akin, the Oankali choose to leave the child with his captors, for he the most &quot;human&quot; of the Oankali children will decide whether the resisters should be given back their fertility and freedom, even though they will only destroy themselves again.\n\nImago\nLength 8 hrs and 18 mins\n\nChild of two species, but part of neither, a new being must find his way.\nHuman and Oankali have been mating since the aliens first came to Earth to rescue the few survivors of an annihilating nuclear war. The Oankali began a massive breeding project, guided by the ooloi, a sexless subspecies capable of manipulating DNA, in the hope of eventually creating a perfect starfaring race. Jodahs is supposed to be just another hybrid of human and Oankali, but as he begins his transformation to adulthood he finds himself becoming ooloi - the first ever born to a human mother.\nAs his body changes, Jodahs develops the ability to shapeshift, manipulate matter, and cure or create disease at will. If this frightened young man is able to master his new identity, Jodahs could prove the savior of what's left of mankind. Or, if he is not careful, he could become a plague that will destroy this new race once and for all","torrent":{"xt":"urn:btih:5690c15e6a3c9f05e8f1f3f2638807546c3bf1f2","amp;dn":"Octavia+E.+Butler+-+Xenogenesis+Trilogy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5690c15e6a3c9f05e8f1f3f2638807546c3bf1f2","infoHashBuffer":{"type":"Buffer","data":[86,144,193,94,106,60,159,5,232,241,243,242,99,136,7,84,108,59,241,242]},"announce":[],"urlList":[]}}