{"title":"Onora il Padre e la Madre (DvdRip ITA)","uid":5183788,"size":1468334080,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:56c486fa151c840d30a01e128022bafc1478ad72&amp;dn=Onora+il+Padre+e+la+Madre+%28DvdRip+ITA%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"black mamba TNT","files":-1,"time":1259370464,"description":"Titolo originale:         Before the devil knows you're dead\nAnno:                     2007\nGenere:                   Crimine, Drammatico, Thriller\nRegia:  \t          Sidney Lumet\n\n\nInfo:\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0292963/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0292963/&lt;/a&gt;\n\n\n\nTRAMA\n\nCharles e Nanette Hanson hanno cresciuto i loro figli come si deve. Andy, il maggiore ÃƒÂ¨ innamorato della bella moglie Gina, e guadagna un superstipendio come dirigente di una grande azienda. Hank, il piÃƒÂ¹ giovane, adora la figlia e sta cercando la maniera per poterla iscrivere ad un'esclusiva scuola privata. Ma Andy riesce a mantenere uno stile di vita stravagante e il dispendioso vizio della droga solo attingendo alle casse della sua societÃƒÂ  e pur amando la moglie, il suo matrimonio vacilla. La societÃƒÂ  nella quale lavora sta per essere oggetto di un'accurata revisione contabile da parte di un revisore esterno e lui ÃƒÂ¨ il responsabile del settore finanziario. La sua vita sta per andare in fumo e lui ÃƒÂ¨ disperato. Anche Hank ha i suoi piccoli problemi finanziari. E' in ritardo con il pagamento degli alimenti, beve troppo e ha una relazione... con la moglie del fratello. Andy escogita un piano che dovrebbe risolvere tutti i loro problemi, se non altro quelli economici. Hank rapinerÃƒÂ  la gioielleria dei genitori la mattina presto quando in negozio c'ÃƒÂ¨ solo la commessa addetta all'apertura. I genitori intascheranno i soldi dell'assicurazione, loro venderanno i gioielli rubati e alla fine saranno tutti felici e contenti. Spaventato all'idea di commettere il furto da solo, Hank ingaggia un ladro punk, Bobby, un tizio che vede spesso al pub, il quale sarÃƒÂ  l'autore materiale della rapina mentre lui farÃƒÂ  il palo in auto. Purtroppo, durante la rapina qualcosa va storto e Bobby tira fuori la pistola ma quella che si trova davanti non ÃƒÂ¨ la commessa... ma Nanette, l'energica madre di Hank e Andy, che ÃƒÂ¨ comparsa a sorpresa in negozio a quell'ora per lei insolita. Invece di arrendersi subito al rapinatore, la donna reagisce e resta gravemente ferita mentre Bobby cade a terra morto. E poichÃƒÂ© la polizia non sembra fare alcun progresso nelle indagini, Charles inizia a indagare su ciÃƒÂ² che ÃƒÂ¨ successo fino a quando arriverÃƒÂ  a scoprire una devastante veritÃƒÂ . Con la madre morta, la famiglia va in pezzi e i terribili segreti che emergono metteranno i fratelli l'uno contro l'altro e il padre contro i suoi stessi figli\n\n\n\nRECENSIONE\n\n\nI fratelli Andy e Hank Hanson, in grossa crisi economica, decidono di organizzare una rapina ai danni del negozio di famiglia: una gioielleria. Conoscono allarmi, tempi, combinazioni, e incassi. Tutto sembrerebbe far pensare quindi ad un colpo perfetto, dove persino i genitori dei due finirebbero per guadagnarci grazie alle spese coperte dall'assicurazione. Il giorno della rapina arriva, ma qualcosa va inevitabilmente storto...\n\nSoggetto in stile &quot;fratelli Coen&quot; (che ricorda lontanamente &quot;Fargo&quot;), per un film raccontato tutto in flashback, alle volte anche forzandone l'utilizzo narrativo. Diretto da mano esperta da Sidney Lumet, molto abile nel tracciare i profili dei vari personaggi, &quot;Before the devil you knows are dead&quot; ÃƒÂ¨ un noir dall'animo esistenzialista. Il film di Lumet infatti, non si limita a raccontare una storia di rapine e tradimenti, ma indaga nelle coscienze dei personaggi finendo per inscenare una vera e propria tragedia di tipo &quot;shakesperiano&quot;, in cui alla fine nessuno ne esce vincitore. Il tema del film ÃƒÂ¨ quindi la mancata realizzazione dell'essere umano, proiettata da tutta la famiglia Hanson, che tra droghe, sessi, armi e tranelli, finisce per perdersi in un finale &quot;forte&quot;, lasciato volutamente sospeso e crepuscolare.\n\nBravissimi gli attori, tutti particolarmente coinvolti per motivi di amicizia nel progetto finale.\n\n\n\n\nDATI TECNICI\n\nDimensione: 1400 Mb (2CD)\nDurata: 1h 52m\nRisoluzione: 672 x 368\nCodec: XVID\nBitrate: 1282 kbps\nQf: 0.207\nFramerate: 25 fps\n\nAudio Codec: AC3\nBitrate: 448 kbps 6 channels CBR\nFrequenza: 48000 Hz\n\n\n\n\nSCREENSHOTS\n &lt;a href=&quot;\nhttp://i531.photobucket.com/albums/dd358/ShivaShanti75/1-44.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i531.photobucket.com/albums/dd358/ShivaShanti75/1-44.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i531.photobucket.com/albums/dd358/ShivaShanti75/2-45.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i531.photobucket.com/albums/dd358/ShivaShanti75/2-45.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i531.photobucket.com/albums/dd358/ShivaShanti75/3-41.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i531.photobucket.com/albums/dd358/ShivaShanti75/3-41.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i531.photobucket.com/albums/dd358/ShivaShanti75/4-37.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i531.photobucket.com/albums/dd358/ShivaShanti75/4-37.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:56c486fa151c840d30a01e128022bafc1478ad72","amp;dn":"Onora+il+Padre+e+la+Madre+%28DvdRip+ITA%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56c486fa151c840d30a01e128022bafc1478ad72","infoHashBuffer":{"type":"Buffer","data":[86,196,134,250,21,28,132,13,48,160,30,18,128,34,186,252,20,120,173,114]},"announce":[],"urlList":[]}}