{"title":"Feed Your Brain, Lose Your Belly: A Brain Surgeon Reveals the We","uid":8297408,"size":2431218,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:57782e50ffb007acc92177f9c967226376e642e4&amp;dn=Feed+Your+Brain%2C+Lose+Your+Belly%3A+A+Brain+Surgeon+Reveals+the+We&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"MANTESH","files":1,"time":1364177002,"description":"\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/41LWd0w84yL.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/41LWd0w84yL.jpg&lt;/a&gt;\n\n\nFeed Your Brain, Lose Your Belly: A Brain Surgeon Reveals the Weight-Loss Secrets of the Brain-Belly Connection \n\nPublisher: Greenleaf Book Group LLC\nLarry McCleary\n2011\nLanguage: English\nISBN-10: 1608321010\nISBN-13: 978-1608321018  \nPDF\n240 pages \n2.31 MB\n\n Stay slim and mentally sharp by choosing foods that keep your waistline trim and your brain well fed.\n While researching nutrition as a method for speeding up his patients recovery after brain injuries, renowned American neurosurgeon Larry McCleary, M. D., noticed a paradox: rising national rates of obesity and Alzheimer s. Could a nutritional deficiency be the explanation behind both epidemics? \n\nDr. McCleary s research led him to a surprising conclusion: most of the calories you consume are bypassing your brain (causing ''brain starvation'') and being stored in your belly. These ''sticky fat cells'' hold onto calories instead of releasing them for fuel, and in the process send mixed messages to your brain. The result is persistent hunger and cravings for the wrong foods which can cause you to gain weight.\n\nIn Feed Your Brain Lose Your Belly, Dr. McCleary demonstrates why staying slim is not necessarily about how much you eat, but rather about what you eat or more specifically, what you're not eating. He reveals how you can reset your ''brain-belly connection'' and boost your memory and brain health by bringing a critical, missing ingredient back into your diet. He then explains the science behind why the foods you re choosing now are programming your body to hold onto excess fat.\n\nWorksheets, a 7-day meal plan and recipes, all backed by rigorous clinical testing, will show you how to jumpstart your metabolism so that you can have more energy, feel more satisfied between meals, and avoid the persistent hunger, self-sabotage, brain fog and weight-loss plateaus you may have experienced on low-calorie crash diets.\n\nIn Feed Your Brain Lose Your Belly, Dr. McCleary shows you how to work with, not against, your innate metabolic machinery, providing you a road map to reasonable, safe and lasting weight loss.\n\n","torrent":{"xt":"urn:btih:57782e50ffb007acc92177f9c967226376e642e4","amp;dn":"Feed+Your+Brain%2C+Lose+Your+Belly%3A+A+Brain+Surgeon+Reveals+the+We","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57782e50ffb007acc92177f9c967226376e642e4","infoHashBuffer":{"type":"Buffer","data":[87,120,46,80,255,176,7,172,201,33,119,249,201,103,34,99,118,230,66,228]},"announce":[],"urlList":[]}}