{"title":"Bienvenidos Al Norte DVDRip Spanish 2009","uid":4865370,"size":1464212401,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:583a36c9d80a7fe8a1f306ef68991dd9d8b545c8&amp;dn=Bienvenidos+Al+Norte+DVDRip+Spanish+2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":null,"files":7,"time":1240485463,"description":"Philippe Abrams (Kad Merad) es el encargado de una oficina de correos en la preciosa cuidad de Salon-de-Provence, al sur de Francia. Julie (ZoÃƒÂ© FÃƒÂ©lix), su mujer, padece episodios depresivos que convierten la vida de Philippe en un verdadero infierno. En un intento de animarla, Philippe hace trampas para que le trasladen a la Riviera francesa, pero le cogen y le envÃƒÂ­an a una pequeÃƒÂ±a ciudad en el norte de Francia llamada Bergues. Los Abrams son el arquetipo de la gente del sur que siente horror por el norte del paÃƒÂ­s, un lugar inhÃƒÂ³spito donde siempre hace frÃƒÂ­o y con un dialecto enrevesado e incomprensible. AsÃƒÂ­ que Philippe irÃƒÂ¡ solo a su destino. Pero para su sorpresa, el lugar es absolutamente encantador y la gente con la que trabaja es cariÃƒÂ±osa, amable y acogedora. Se hace amigo de Antoine (Dany Boon), el cartero del pueblo. Cuando Philippe regresa a Salon-de-Provence, Julie no se cree que le guste vivir en el norte. De hecho, estÃƒÂ¡ convencida de que le miente para no perderla. Para complacerla y hacerle la vida mÃƒÂ¡s fÃƒÂ¡cil, Philippe le hace creer que lo pasa fatal en Bergues. A partir de ese momento se sumerge mÃƒÂ¡s y mÃƒÂ¡s en una mentira piadosa. Todo va a las mil maravillas hasta que Julie decide irse con Philippe a Bergues para ayudarle a superar lo que ella cree una experiencia traumÃƒÂ¡tica.","torrent":{"xt":"urn:btih:583a36c9d80a7fe8a1f306ef68991dd9d8b545c8","amp;dn":"Bienvenidos+Al+Norte+DVDRip+Spanish+2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"583a36c9d80a7fe8a1f306ef68991dd9d8b545c8","infoHashBuffer":{"type":"Buffer","data":[88,58,54,201,216,10,127,232,161,243,6,239,104,153,29,217,216,181,69,200]},"announce":[],"urlList":[]}}