{"title":"CCNP SWITCH Lab Manual (Lab Companion)","uid":7891850,"size":1990415,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5866605d0eac83488157af6ee01afe7bd1f3e82e&amp;dn=CCNP+SWITCH+Lab+Manual+%28Lab+Companion%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"IT_DOCsForFree","files":1,"time":1354742091,"description":"Publication Date: November 26, 2010 | ISBN-10: 1587133040 | ISBN-13: 978-1587133046 | Edition: 1\n \nThe only authorized Lab Manual for Cisco Networking Academy's new course CCNP SWITCH: Implementing IP Switched Networks, V.6 (Exam 642-813)\n \nA portable, bound copy of all 19 CCNP V 6.x SWITCH Labs: convenient lightweight and friendly\nAllows students to review or walk through hands-on labs without a huge textbook or live Web connection\nContains additional pages between labs for in-class note-taking\nSeparate answer key available at Cisco Academy Connection and the PearsonHighered.com Instructor Resource site\n \nThis hands-on switching Lab Manual is the perfect companion for all Cisco Networking Academy students who are taking the new course CCNP SWITCH: Implementing IP Switched Networks (V. 6) as part of their CCNP preparation. It offers a portable, bound copy of all 19 CCNP V 6.x SWITCH network switching labs in a convenient, lightweight format that allows students to walk through key procedures and easily take notes without a large textbook or a live Internet connection. Working with these conveniently-formatted labs, students will gain practical experience and skills for planning, configuring, and verifying the implementation of complex enterprise switching solutions using Cisco's Campus Enterprise Architecture; and for securely integrating VLANs, WLANs, voice, and video into campus networks.","torrent":{"xt":"urn:btih:5866605d0eac83488157af6ee01afe7bd1f3e82e","amp;dn":"CCNP+SWITCH+Lab+Manual+%28Lab+Companion%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5866605d0eac83488157af6ee01afe7bd1f3e82e","infoHashBuffer":{"type":"Buffer","data":[88,102,96,93,14,172,131,72,129,87,175,110,224,26,254,123,209,243,232,46]},"announce":[],"urlList":[]}}