{"title":"THE KORGIS - Original Discography 1979-1983 [320 kbps]","uid":5102428,"size":441896691,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5879740f03f7c5c89a7efedcb921c7d19ad0d97a&amp;dn=THE+KORGIS+-+Original+Discography+1979-1983+%5B320+kbps%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"musicalibera","files":81,"time":1254090488,"description":"THE KORGIS - Original Discography (1979-1983)\n\nCodec: mp3.\nDescription: MPEG-1 Audio Layer 3.\nBit rate: 320 kbps.\nSample rate: 44100 Hz joint stereo.\nTags: ID3V1 &amp; ID3V2.\nSource format: CD; 'Dumb Waiters' &amp; 'Sticky George' digitally remastered, 'The Korgis' (debut album) &amp; &quot;Don't Look Back&quot;/&quot;Xenophobia&quot; AAD.\nNumber of tracks: 49.\nOriginal label: Rialto Records, &quot;Don't Look Back&quot;/&quot;Xenophobia&quot; London Records.\nCD releases: 'The Korgis' (debut album), 'Dumb Waiters' &amp; 'Sticky George': Edsel Records 1999 (out of print), &quot;Don't Look Back&quot;/&quot;Xenophobia&quot;: compilation 'Don't Look Back - The Very Best of The Korgis' Castle/Sanctuary Music 2003.\n\n\nAllmusic.com bio:\nBritish pop outfit the Korgis reunited singer/bassist James Warren and singer/drummer Andy Davis, who previously teamed in cult favorites Stackridge, a highly entertaining underground group whose amusing antics and music were once memorably compared to a &quot;pantomime hippie horse.&quot; Eighteen months after Stackridge's demise in late 1976, Warren got back in touch with his former bandmate, Davis, traveled down to Bath, and the pair immediately began co-writing songs. The Korgis' debut album, recorded in producer David Lord's Bath apartment, emerged in 1979, along with their first hit single, &quot;If I Had You,&quot; that pushed into the Top 15.  Guitarist Stuart Gordon and keyboardist Phil Harrison completed the original lineup, and in 1980, the group scored their biggest chart smash with &quot;Everybody's Got to Learn Sometime,&quot; the lead single from their sophomore album 'Dumb Waiters'. Although the record also launched the minor hit &quot;If It's Alright with You Baby,&quot; subsequent outings like &quot;Rovers Return,&quot; &quot;That Was My Big Mistake&quot; and &quot;All the Love in the World&quot; failed to generate much excitement, and in the wake of their third album, 1981's 'Sticky George', the Korgis, were dropped by their label Rialto.  &quot;Don't Look Back&quot;, a non-album single produced by Trevor Horn, was released on London Records in 1982 but failed to chart. The band soon dissolved, and in 1986 Warren issued a solo LP, 'Burning Questions'; four years later, he and Davis reformed the Korgis to re-record &quot;Everybody's Got to Learn Sometime&quot; for a charity album in support of the International Hostage Release Foundation (the band themselves don't own the rights to their Rialto Records back catalogue), followed in 1992 by a new Korgis album, 'This World's for Everyone'. The group again parted ways soon after, but has since re-united for album/DVD 'Kollection' (2005), album/DVD 'Unplugged' (2006), single &quot;Something About The Beatles&quot; (2007) and album/DVD compilation 'Something About The Korgis' (2009).&quot;\n\n\nWikipedia bio:\n&quot;The Korgis are a British pop band, originally composed of singer / bassist James Warren (born 25 August 1951, Bristol) and singer / drummer Andy Davis (born Andrew Cresswell-Davis 10 August 1949), both former members of 1970s band Stackridge, along with unofficial members guitarist Stuart Gordon and keyboardist Phil Harrison.\n\nCareer\nThe Korgis released their first single &quot;Young 'n' Russian&quot; in early March 1979 on the label Rialto Records, owned by their managers Nick and Tim Heath. Their next single &quot;If I Had You,&quot; was released soon after, and moved up to Number 13 on the UK Singles Chart, prompting the release of an eponymous debut album, 'The Korgis', in July 1979.\n\nTheir next single, &quot;Everybody's Got to Learn Sometime&quot; (1980), from their second album 'Dumb Waiters', was a worldwide success, hitting #1 in France and Spain, #3 in the Netherlands and West Germany, #5 in the UK, #6 in Switzerland, #11 in Australia, #12 in New Zealand and #18 in the United States. The Dumb Waiters album reached Number 40 in the UK in 1980 and was followed by singles &quot;If It's Alright With You Baby&quot; and &quot;Rovers Return&quot;. The band was alternately marketed as a duo, a trio and a quartet around this time. The commercial breakthrough was however not enough to keep them together, and after a third album, 'Sticky George' - and with lead single &quot;That Was My Big Mistake&quot; being released as 'James Warren &amp; The Korgis' marking the fact that the group had now more or less evolved into a one man band - Davis and Warren went their separate ways. The single &quot;Don't Look Back&quot;, originally a demo from the Sticky George sessions, was however remixed by Trevor Horn (at the time best known for his work with The Buggles, Dollar and Yes) and issued by London Records in the summer of 1982. A follow-up single with Horn, &quot;Endangered Species&quot;, was planned but never materialised.\n\nWarren would go on to issue a solo LP entitled 'Burning Questions' in 1986 (digitally remastered and re-issued on CD in 2007), while some of the singles during this era were still released as 'The Korgis' and co-produced by Andy Davis. The band got back together proper in 1990 to re-record &quot;Everybody's Got to Learn Sometime&quot;. The re-formed group consisting of Warren, Davis and new member John Baker released the album 'This World's For Everyone' in 1992 (digitally remastered and re-released in 2008), having some success in Continental Europe and Japan (Top 20 in The Kiss Chart), before breaking up again. 1999 saw the three original Korgis albums being re-issued by Edsel Records in the UK and this was followed by the two disc anthology 'Don't Look Back - The Very Best Of The Korgis' in 2003, issued worldwide by Sanctuary Records/Castle Music. In 2004 Warren, Davis and Baker reunited again for a film shoot for DVD/compilation album 'Kollection' and recorded the fourteen-track album 'Unplugged', which was released on independent record label Angel Air the following year. In 2006 they released their first single in thirteen years, &quot;Something About The Beatles&quot;, followed by CD/DVD combo 'Something About The Korgis' in 2009.\n\nCover versions\nIn September 2004 Zucchero and Vanessa Carlton entered the French charts with their cover version of &quot;Everybody's Got to Learn Sometime&quot;. That same year, Beck also covered the song for the Michel Gondry film, 'Eternal Sunshine of the Spotless Mind'. In 2003 it was included on Erasure's cover album 'Other People's Songs'. Other cover versions of &quot;Everybody's Got to Learn Sometime&quot; also took the song back into the UK Singles Chart over the years, most notably those by The Dream Academy (1987), Yazz (1991), Baby D. (1995), Army Of Lovers (1995) and German techno duo Marc et Claude (2000). Other artists who have covered the song include Ginger of UK band The Wildhearts, Gregorian, Canadian Jaimie Vernon, Dutch bands Krezip and Laidback Luke, Scottish band Glasvegas and Swedish techno act The Field. In 1997 British a cappella group The King's Singers recorded the track with lead vocals by composer James Warren himself. In 2009 The Korgis' original version of &quot;Everybody's Gotta Learn Sometime&quot; was featured in BBC TV series 'Ashes to Ashes', set in the early 1980s.\n\nTracey Ullman (on 1984 album 'You Caught Me Out') and Rod Stewart (on 'Human', 2001) have also covered &quot;If I Had You&quot;. &quot;\n\nUncut.co.uk bio:\n&quot;Named after the Korg synthesizer, The Korgis first came to national attention in 1979 with the single &quot;If I Had You&quot;, which spent 12 weeks in the charts, peaking at Number 13 that June. A mid-tempo ballad, it opened with the sound of mandolins being plucked and delicately touched keyboards, before a male voice, multi-tracked on the single version for choral effect, sang a tale of woe over an aching chord progression. The whole thing seemed to have been produced with a soft-focus, and was in keeping with modern pop music then being made with synthesizers by groups with names like Buggles, New Musik and M. \n\nIt soon transpired that the musicians behind &quot;If I Had You&quot; had actually been making records for nearly a decade, albeit in a different guise. Bassist/vocalist James Warren and keyboardist/vocalist Andy Davis, a prototype synth duo a la Tears For Fears, Blancmange and Soft Cell, were originally in Stackridge, an unclassifiable Bristol combo with a fluctuating membership that made a series of albums in the early 1970s, latterly with Beatles producer George Martin. Davis and Warren were the principal songwriters in Stackridge, and so it was inevitable that, after the band split, the pair would re-emerge to ply their wares once more.\n\nIn terms of their image, The Korgis, all skinny ties, blazers and modernist shades, were positioned somewhere between New Wave (Squeeze, XTC et al) and power pop (The Yachts, The Pleasers), while at least some of their music had the angular shape of the postpunk vanguard. Their self-titled debut LP, also released in 1979, ran the gamut of contemporary styles, while the melodies drew as much from '60 pop as it did from the '70s. For example, &quot;If I Had You&quot;, the debut single with its 1950's pastiche sleeve design, featured a guitar sound straight out of the 'White Album'-era Beatles (courtesy of George Harrison-aping Andy Davis) while the overall sound was up to date.\n\n&quot;Young 'N' Russian&quot;, the follow-up single, opened the album but it was quite different to its predecessor. The deep, gruff vocal that told a tale of espionage at this, the height of the Cold War, gave the song a sinister yet comic edge, while the tinny Farfisa-like organ was in the mould of Elvis Costello &amp; The Attractions circa the subversive pop of &quot;Armed Forces&quot; (also '79). Perhaps it was just too different to &quot;If I Had You&quot;, confusing radio and public alike - &quot;Young 'N' Russian&quot; failed to chart. Track two on the album, &quot;I Just Can't Help It&quot;, was another beautiful paean to an idealised paramour with a layered sound, but that, too was a miss on its release as a single in January 1980. The re-recorded single version featured Warren on both lead and backing vocals instead of Davis, most likely in an attempt to build on the winning formula of &quot;If I Had You&quot;.\n\nOn the original double-sided vinyl version of the LP, Andy Davis' compositions occupied most of side one (including his original version of &quot;I Just Can't Help It&quot; and with &quot;Young ' N' Russian&quot; and &quot;Boots and Shoes&quot; the sole joint ventures), while James Warren's tunes appeared on side two. &quot;Chinese Girl&quot; and &quot;Art School Annexe&quot; were experiments that fell between the art-pop of 10cc and Sparks, and the quirky, jerky punk-pop of XTC and Talking Heads. &quot;Dirty Postcards&quot; looked back further for inspiration, to the jaunty Music Hall style favoured by Paul McCartney on occasion (&quot;I thought it was a joke when you called me up and said that you needed ironing/there were creases in your facial lining&quot;). &quot;O Maxine&quot; could have been a cover version of a song from the original rock 'n roll era and had a by-now typical Korgis lyric dealing with unrequited love, while &quot;Mount Everest Sings the Blues&quot; (&quot;I've proposed to mount Fujiyama/but could she ever take my weight?&quot;)and &quot;Cold Tea&quot; tested the listener's patience with their idiosyncratic song-structures.\n\nRecorded with a variety of session musicians (including four percussionists, four keyboardists, three drummers, two backing vocalists - on subsequent releases dubbed The Korgettes - a violinist and a mandolin player) in the same studio (David Lord's Crescent Studios, Bath) in which the likes of XTC and Peter Gabriel would later work - where, indeed, The Korgis themselves would record their second and third albums - 'The Korgis' was a promising affair whose very eclectism may have been its undoing; the album made no impact on the Top 40 whatsoever.\n\nHowever, the second Korgis album, 'Dumb Waiters', which came out in 1980, did chart, reaching Number 40 in July of that year. It was a surprisingly low entry for a longplayer that included a Top 5 hit: &quot;Everybody's Gotta Learn Sometime&quot;.\n\nBack a bit. Sessions for 'Dumb Waiters' began in Bath the previous October, with David Lord once again at the controls. The list of credits on the sleeve gave some indication of the sound you could expect, especially the section where all the keyboards were name-checked. Fans of early '80s synthpop would immediately be familiar with such expensive state-of-the-art gadgetry as the Fairlight CMI, as used by bespectacled sound wizard Trevor Horn on all those epic ABC and Art Of Noise records, or with the Yamaha CSYI, a distant cousin of the instrument used by The Human League on their seminal 'Dare!' album. Clearly, 'Dumb Waiters' was going to be a thoroughly modern pop LP.\n\nThe album's first track was &quot;Silent Running&quot; (its title and lyrical premise borrowed from a '70s science fiction movie), the opening drum beat reminiscent of glam rockers Hello, the two-note keyboard motif redolent of &quot;7 Teen&quot; by The Regents, a Number 11 hit in 1979. James Warren sang through a Roland Vocoder, giving his voice the same sort of android effect achieved by Trevor Horn on Buggles' &quot;Video Killed The Radio Star&quot;. &quot;Love Ain't Too Far Away&quot; was another typical Andy Davis composition that cast the male as the weaker, more romantic sex waiting for the nod from the cool, aloof female. &quot;Perfect Hostess&quot; recalled &quot;Living By Numbers&quot;, a Number 11 hit in January '80 for New Musik. \n\nIt would be convenient to call The Korgis &quot;influential&quot;, but certainly, either by default or by design, &quot;Drawn and Quartered&quot; anticipated the anthemic synth-surge of A-ha's &quot;The Sun Always Shines On TV&quot; by a good half-decade. &quot;Intimate&quot; and &quot;It's No Good Unless You Love Me&quot; were intriguing genre exercises. &quot;Rover's Return&quot; evoked early '60s instrumentals like &quot;Telstar&quot;. As songs with food metaphors go, &quot;Dumb Waiters&quot; was hardly &quot;Life Is A Minestrone&quot;, but it was entertaining enough.\n\nThat left the two singles, both James Warren-compositions; the sumptuously produced &quot;If It's Alright With you Baby&quot; which inexplicably stalled at Number 55 in August '80, and the heartstoppingly sad &quot;Everybody's Gotta Learn Sometime&quot;, which fared rather better, and had a considerable longer shelf life. In fact, the latter, which also reached Number 10 in the States and subsequently re-charted over the years via cover versions by Yazz and Baby D., has become something of a modern classic, a song so strong it has withstood conversion into techno and drum &amp; bass forms.\n\nThe Korgis had by now proved their mastery of everything from the whimsical to the wistful, but for a variety of reasons, among them undoubtedly their failure to capitalise on the success of  &quot;Everybody's Gotta Learn Sometime&quot;, Andy Davis was conspicuous by his relative absence on The Korgis' third album 'Sticky George', issued in 1981. 'Sticky George', with a cover painting by Jeffrey Edwards, who was responsible for the pop art sleeve to 'Dumb Waiters', did feature Andy Davis in the writing credits (he apparently co-wrote three of the tracks), but he was not listed as an instrumentalist, nor did his face appear in the sleeve photograph alongside James Warren (in fact, Davis' place in the photo was taken by keyboardist Phil Harrison and guitarist-cum-vocalist-cum-banjo player Stuart Gordon).\n\nNot that 'Sticky George' was a weak effort. Far from it. Indeed, it is arguably the strongest Korgis LP, with highlights including the apocalyptic scenario of &quot;Nowhere To Run&quot;, the complex, tricksy &quot;Domestic Bliss&quot; and the jaunty &quot;Contraband&quot;. The record also contained some of the group's best ever ballads; &quot;That Was My Big Mistake&quot; and &quot;Can't We Be Friends Now&quot; came out in February 1981 as a single, with the latter as the B-side, the record credited to James Warren And The Korgis. Despite the trademark lush production and exquisite melodies, the songs failed to capture the imagination of the record-buying public, as did the The Korgis' last release on the Rialto label, &quot;Don't Say That It's Over&quot;, the penultimate track on the album. The LP closer &quot;Living on the Rocks&quot; was so seductive a tale of a failed relationship it almost gave divorce a good name. Best of all, and probably the most sublime piece of music in the Korgis canon, was &quot;All The Love In The World&quot;. \n\nJames Warren would release more records as The Korgis over the next few years, one of them with Trevor Horn (1982's &quot;Don't Look Back&quot;, originally an out-take from the 'Sticky George' sessions) and Stackridge would eventually re-form in the '90s, and &quot;Don't Look Back&quot; is probably as good a piece as any to close this chapter in the story of Andy Davis and James Warren, the unacknowledged masters of heartbreak pop. \n\n~Paul Lester, Associate Editor, Uncut.&quot;\n\nFootnote: the Rialto Records back catalogue is after a series of company mergers and acquisitions between the late 1980s and the early 2000s (Rialto Records-Trojan Records-Castle Communications-Sanctuary Records-PolyGram-Universal Music) since 2007 controlled by Universal Music Group/Vivendi. \n\n\nTRACK LIST\n\nThe Korgis (1979 debut album, AAD)\n===================================\n01. Young 'n' Russian (Davis, Ridlington, Warren)\n02. I Just Can't Help It (Davis)\n03. Chinese Girl (Davis)\n04. Art School Annexe (Davis)\n05. Boots and Shoes (Davis, Warren)\n06. Dirty Postcards (Warren) \n07. O Maxine (Warren)\n08. Mount Everest Sings the Blues (Warren)\n09. Cold Tea (Warren)\n10. If I Had You (Davis, Rachmaninoff)\n\nThe Korgis: Andy Davis &amp; James Warren\nTrack 10: 1977, tracks 1-4, 7-8: 1978, track 5, 6 &amp; 9: 1979.\n\nDumb Waiters (1980)\n======================\n01. Silent Running (Warren)\n02. Love Ain't Too Far Away  (Davis)\n03. Perfect Hostess (Davis)\n04. Drawn and Quartered (Warren)\n05. Everybody's Gotta Learn Sometime (Warren)\n06. Intimate (Davis)\n07. It's No Good Unless You Love Me (Warren)\n08. Dumb Waiters (Warren)\n09. If It's Alright With You Baby (Warren)\n10. Rover's Return (Davis)\n+\n11. Everybody's Gotta Learn Sometime (Alternate Version) (This demo version, with different lyrics in the second verse, was apparently used by mistake on Edsel Records' CD release of 'Dumb Waiters' in 1999 and has since re-appeared on numerous hits compilations, including EMI/Music Club's 'Klassics - The Best of The Korgis'.)\n\nThe Korgis: James Warren, Stuart Gordon &amp; Phil Harrison.\nRecorded Oct 1979 - March 1980 at Crescent Studios in Bath, England.\n\nSticky George (1981)\n======================\n01. Sticky George (Harrison, Warren)\n02. Can't We Be Friends Now (Warren)\n03. Foolishness of Love (Harrison)\n04. Domestic Bliss (Gordon, Harrison, Warren)\n05. That Was My Big Mistake (Davis, Warren)\n06. Nowhere To Run (Davis, Warren)\n07. Contraband (Warren)\n08. All the Love in the World (Davis, Warren)\n09. Don't Say That It's Over (Warren)\n10. Living on the Rocks (Warren)\n+\n11. Nowhere To Run (Alternate Version) (This unedited demo version was again first used by mistake on Edsel Records' CD release and is a decade later still frequently featured on greatest hits albums, such as Sanctuary/Castle Communications 'Don't Look Back - The Very Best of The Korgis', instead of the original recording.)\n\nThe Korgis: James Warren (Stuart Gordon &amp; Phil Harrison)\nRecorded Dec 1980 - Feb 1981 at Crescent Studios in Bath, England. \n\nDon't Look Back (Non-album single, 1982, AAD)\n===============================================\n01. Don't Look Back (Warren)\n02. Xenophobia (Warren)\n\nThe Korgis: James Warren\n\nThe Best of The Korgis (1983)\n=============================\nSlow Side:\n01. Everybody's Gotta Learn Sometime\n02. If I Had You (Single Version)\n03. All the Love in the World (Single Edit)\n04. I Just Can't Help It (Single Version)\n05. If It's Alright With You Baby (Single Edit)\n06. That Was My Big Mistake (Single Edit)\nFast Side:\n07. Young 'n' Russian\n08. Domestic Bliss\n09. O Maxine\n10. Don't Say That It's Over\n11. Drawn and Quartered\n12. It's No Good Unless You Love Me\n13. Rover's Return\n\nAll tracks produced by The Korgis &amp; David Lord except &quot;Don't Look Back&quot;, produced by Trevor Horn.\n\nRecommended listening:\nJames Warren/The Korgis: 'Burning Questions' (1986/2007)\nAndy Davis: 'Clevedon Pier' (1989/2005)\nThe Korgis: 'This World's For Everyone' (1992/2008)\nThe Korgis: 'Kollection' (2004)\nThe Korgis: 'Unplugged' (2005)\nJames Warren: 'Jim's Easy Listening Album' (2006)\nThe Korgis: 'Something About The Korgis - Sound + Vision' (2009)\n &lt;a href=&quot;\nhttp://www.angelair.co.uk/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.angelair.co.uk/&lt;/a&gt;\n\nEnjoy and share.","torrent":{"xt":"urn:btih:5879740f03f7c5c89a7efedcb921c7d19ad0d97a","amp;dn":"THE+KORGIS+-+Original+Discography+1979-1983+%5B320+kbps%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5879740f03f7c5c89a7efedcb921c7d19ad0d97a","infoHashBuffer":{"type":"Buffer","data":[88,121,116,15,3,247,197,200,154,126,254,220,185,33,199,209,154,208,217,122]},"announce":[],"urlList":[]}}