{"title":"Doctorow_Cory-Down_and_Out_in_the_Magic_Kingdom","uid":9230236,"size":165945,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:588f199f69b53a28dea16d4e566ff872ca65af9f&amp;dn=Doctorow_Cory-Down_and_Out_in_the_Magic_Kingdom&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"420weedman","files":3,"time":1385061156,"description":"Jules is a young man barely a century old. He's lived long enough to see the cure for death and the end of scarcity, to learn ten languages and compose three symphonies . . . and to realize his boyhood dream of taking up residence in Disney World. Disney World! The greatest artistic achievement of the long-ago twentieth century, now in the keeping of a network of volunteers who keep the classic rides and attractions running. Now, though, a new group has taken over the Hall of Presidents, and is replacing its audioanimatronics with brain interfaces that give guests the illusion of being Washington, Lincoln, and all the others. For Jules, this is an attack on the artistic purity of Disney World. Worse: this new group has had Jules killed. This upsets him. (It's only his fourth death and revival, after all.) Now it's war for the soul of the Magic Kingdom! Bursting with cutting-edge speculation and warm human insights, Down and Out in the Magic Kingdom reads like Neal Stephenson meets Nick Hornby: a coming-of-age romantic comedy and a kick-butt cybernetic tour de force.\n","torrent":{"xt":"urn:btih:588f199f69b53a28dea16d4e566ff872ca65af9f","amp;dn":"Doctorow_Cory-Down_and_Out_in_the_Magic_Kingdom","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"588f199f69b53a28dea16d4e566ff872ca65af9f","infoHashBuffer":{"type":"Buffer","data":[88,143,25,159,105,181,58,40,222,161,109,78,86,111,248,114,202,101,175,159]},"announce":[],"urlList":[]}}