{"title":"The Confidence Game: The Psychology of the Con (2016) epub","uid":13378438,"size":571912,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:58c0451bf42af31734559c9a7e783dbc72f88e9b&amp;dn=The+Confidence+Game%3A+The+Psychology+of+the+Con+%282016%29+epub&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"bookzilla","files":1,"time":1454242398,"description":"The Confidence Game: The Psychology of the Con and Why We Fall for It Every Time\r\n\r\n\r\n\r\nThink you can’t get conned? Think again. The New York Times bestselling author of Mastermind: How to Think Like Sherlock Holmes explains how to spot the con before they spot you.\r\n\r\nA compelling investigation into the minds, motives, and methods of con artists—and the people who fall for their cons over and over again.\r\n\r\nWhile cheats and swindlers may be a dime a dozen, true conmen—the Bernie Madoffs, the Jim Bakkers, the Lance Armstrongs—are elegant, outsized personalities, artists of persuasion and exploiters of trust. How do they do it? Why are they successful? And what keeps us falling for it, over and over again? These are the questions that journalist and psychologist Maria Konnikova tackles in her mesmerizing new book.\r\n\r\nFrom multimillion-dollar Ponzi schemes to small-time frauds, Konnikova pulls together a selection of fascinating stories to demonstrate what all cons share in common, drawing on scientific, dramatic, and psychological perspectives. Insightful and gripping, the book brings readers into the world of the con, examining the relationship between artist and victim. The Confidence Game asks not only why we believe con artists, but also examines the very act of believing and how our sense of truth can be manipulated by those around us","torrent":{"xt":"urn:btih:58c0451bf42af31734559c9a7e783dbc72f88e9b","amp;dn":"The+Confidence+Game%3A+The+Psychology+of+the+Con+%282016%29+epub","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58c0451bf42af31734559c9a7e783dbc72f88e9b","infoHashBuffer":{"type":"Buffer","data":[88,192,69,27,244,42,243,23,52,85,156,154,126,120,61,188,114,248,142,155]},"announce":[],"urlList":[]}}