{"title":"King Creosote - From Scotland With Love [2014] [WEB/FLAC]","uid":10754170,"size":244047845,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:592d2fec39750dda1aa8a90329057cf93eb8a962&amp;dn=King+Creosote+-+From+Scotland+With+Love+%5B2014%5D+%5BWEB%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"dickspic","files":-1,"time":1407912386,"description":"FLAC / Lossless\nLabel/Cat#: Domino Recording Co / WIG 338D\nCountry: UK\nYear: July 22, 2014\nGenre: indie folk\nFormat: WEB\n\n\n\n\n\n\n1. Something To Believe In (03:14)\n2. Cargill (03:16)\n3. Largs (Long) (03:53)\n4. Miserable Strangers (04:47)\n5. Leaf Piece (Long) (05:32)\n6. For One Night Only (04:09)\n7. Bluebell, Cockleshell, 123 (02:08)\n8. One Floor Down (03:05)\n9. Crystal 8S (02:12)\n10. Pauper's Dough (05:05)\n11. A Prairie Tale (01:36)\n\n\n\n\n\n\nReleased to coincide with the July 2014 Glasgow Commonwealth Games, From Scotland with Love is more than another pet project by prolific Scottish indie folksinger King Creosote (Kenny Anderson). Commissioned by the BBC and arts initiative Creative Scotland, it is a unique collaborative work with filmmaker Virginia Heath where Anderson provides a sort of conceptual soundtrack to Heath's moving documentary comprised entirely of archival footage depicting Scottish history. The film offers no interviews or voice-overs, relying instead on Anderson's poetic songs to tell the story and embellish flickering scenes of political strife, social uprisings, industry, war, and bucolic country life in the early 20th century. A Fife native and veteran of nearly 50 independent albums, Anderson has always radiated a strong localism, making him perfect for the job, though there must have been plenty of pressure in abbreviating vast swaths of his country's history into just 11 songs -- especially considering the broader national audience this collaboration brings him in such an important political year for Scotland, which will vote on their independence from England in September 2014. But, much of the charm of this project and of Anderson's work in general is how it portrays its subjects in small vignettes rather than broad strokes. The minutiae of everyday life and the very human emotions associated with them have always been a King Creosote specialty and he shines here on tracks like &quot;Cargill,&quot; a song describing the daily life of fishermen in the small Perthshire village, and &quot;Leaf Piece,&quot; whose slang title refers to a snack that school children used to keep in their bags. It's this type of depth and detail that brings the images to life, and working within the loose borders of a historical theme has allowed Anderson to produce the most focused and detailed record of his career. There are moments of joy, nostalgia, sorrow, and even frivolity, like on the jazzy, upbeat &quot;Largs,&quot; but the album reaches its emotional peak on the call to action &quot;Pauper's Dough,&quot; whose slow musical build mirrors the sentiment of its ensemble chorus, &quot;You've got to rise above the gutter you are inside.&quot; It's not the Scotland of Walker's shortbread and red-bearded pipers that so often gets shoveled out to tourists, but a moving portrait of strong-willed people enduring in times of change.\n","torrent":{"xt":"urn:btih:592d2fec39750dda1aa8a90329057cf93eb8a962","amp;dn":"King+Creosote+-+From+Scotland+With+Love+%5B2014%5D+%5BWEB%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"592d2fec39750dda1aa8a90329057cf93eb8a962","infoHashBuffer":{"type":"Buffer","data":[89,45,47,236,57,117,13,218,26,168,169,3,41,5,124,249,62,184,169,98]},"announce":[],"urlList":[]}}