{"title":"The Complete Gods and Goddesses of Ancient Egypt","uid":5488220,"size":229399776,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5963475e69d4d80f6a2e0c2bc202d0ae9f5a4382&amp;dn=The+Complete+Gods+and+Goddesses+of+Ancient+Egypt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"artpepper","files":-1,"time":1270844329,"description":"The Complete Gods and Goddesses of Ancient Egypt\n\nBy Richard H. Wilkinson\n\nThames &amp; Hudson | 2003 | ISBN: 0500051208 | 256 pages | PDF | 221 Mb\n\nEgyptologist Wilkinson presents a clear, comprehensive and beautifully illustrated (in color and b&amp;w) guide to the bewildering array of Egyptian deities-a complete catalogue of gods and goddesses supplemented by examinations of the history of Egyptian religion, the rise and fall of the gods, and the ways in which they were worshipped. \n\nAncient Egypt was, Wilkinson writes, the most theocratic of any ancient culture; religion pervaded daily life for comoners as well as the pharaohs. This volume underscores the richness of ancient Egyptian beliefs: literally scores of deities are discussed, grouped by appearance: male anthropomorphic, female anthropomorphic, mammalian, avian, etc. \n\nFor each god or goddess, the author discusses its mythology, iconography and forms of worship. Amun, or Amun-Re, for instance, one of the major male anthropomorphic gods, is discussed as creator god, solar god and fertility god, among other roles; he was originally portrayed with the color red; and he was honored with temples at Karnak and Luxor. \n\nThis is an excellent reference work for budding Egyptologists and anyone fascinated by the culture of ancient Egypt.","torrent":{"xt":"urn:btih:5963475e69d4d80f6a2e0c2bc202d0ae9f5a4382","amp;dn":"The+Complete+Gods+and+Goddesses+of+Ancient+Egypt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5963475e69d4d80f6a2e0c2bc202d0ae9f5a4382","infoHashBuffer":{"type":"Buffer","data":[89,99,71,94,105,212,216,15,106,46,12,43,194,2,208,174,159,90,67,130]},"announce":[],"urlList":[]}}