{"title":"Battle Chess Game of Kings Early Access-TPTB","uid":9797723,"size":1832089487,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:59a19e98fc2d051006089aa24a6bb1926cf30493&amp;dn=Battle+Chess+Game+of+Kings+Early+Access-TPTB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"098765432","files":-1,"time":1395340264,"description":"Battle Chess Game of Kings Early Access-TPTB\n\n\nAbout the Game\nIt took 2,000 years for someone to make chess better!\n\nThe most challenging game on earth comes to life in Battle Chess. An entire medieval world at war is reflected on the checkered field.\n\nEveryone who's ever had a knight take a pawn has seen that capture as more than one piece replacing another on the board. In player's minds, the bold knight, resplendent in his armor of silver or ebon, sallies forth and slays the foul footsoldier. Combat, mortal combat, is the heart and soul of chess, but this aspect of it can only live in the mind's eye... until now!\n\nLots of computer chess games capture the basics of chess. Only Battle Chess brings chess to life by combining a magnificent chess logic system with colorful, humorous, and dramatic three-dimensional animations.\n\nBattle Chess: Game of Kings\n\nA new version of the classic animated chess game for Windows Vista, 7 and 8 is in development! Updated with all new animations and features, this is the ultimate version of Battle Chess.\n\n    Turn-based Multiplayer: Play against the computer with scalable difficulty or against live opponents via the internet.\n    Skill Challenge: Test your Chess skills by completing game play scenario challenges in a certain number of moves.\n    Battleground Training: Control your environment. Place pieces strategically on the chess board to test strategy.\n    Tutorials: Video tutorials explain the rules and basic strategies of chess with a little bit of humor.\n    Animations: Watch your army execute vivid capture moves as they take an opposing piece. Dozens of unique battles, idle and movement animations bring the battleground to life.\n    Achievements: Earn achievements and trophies.\n    Environments: Choose between 3 unique Battlegrounds.\n\nSystem Requirements\n\n    Minimum:\n        OS: Windows XP, 7, 8\n        Processor: 1 Gigahertz or faster\n        Memory: 750 MB RAM\n        Graphics: 3D graphics card compatible with DirectX 9 or better\n        DirectX: Version 9.0c\n        Hard Drive: 3 GB available space\n        Sound Card: Sound Blaster compatible","torrent":{"xt":"urn:btih:59a19e98fc2d051006089aa24a6bb1926cf30493","amp;dn":"Battle+Chess+Game+of+Kings+Early+Access-TPTB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59a19e98fc2d051006089aa24a6bb1926cf30493","infoHashBuffer":{"type":"Buffer","data":[89,161,158,152,252,45,5,16,6,8,154,162,74,107,177,146,108,243,4,147]},"announce":[],"urlList":[]}}