{"title":"PublicAgent - Alexa Tomas (Spanish babe fucks stranger for cash)","uid":12860139,"size":849461271,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:59cb20db0032e8cfc3b723f1f535b7f8766e7c94&amp;dn=PublicAgent+-+Alexa+Tomas+%28Spanish+babe+fucks+stranger+for+cash%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"EndYou","files":1,"time":1448727708,"description":"~~~~~~~~~~~~~\r\n~Screenshots~\r\n~~~~~~~~~~~~~ \nhttp://imgpremium.com/album/gT\r\n\r\n~~~~~~~~~~~~~\r\n~Description~\r\n~~~~~~~~~~~~~\r\nThe name of the actress: Alexa Tomas\r\nName movie: Spanish babe fucks stranger for cash\r\nNumber Online: p1346\r\nNPP site and the site: PublicAgent.com / FakeHub.com\r\n\r\nYear: 2015\r\nGenre: Blowjob, Ball Licking, Cum in Mouth, Facial, Outdoor, Amateur, POV, Hardcore\r\nDuration: 00:38:21\r\n\r\nTaking an evening stroll can be very pleasant, it does get dark quickly though this time of year. I had my camera with me when I saw this hot looking babe, she had long dark hair and what looked like an incredible body under her coat! I start speaking to her and then out of nowhere her boyfriend walks on up! I initially thought I better get out of here! But he seemed very nice and they explained to me that they had just arrived in to the country from Spain and were looking for work. I explained that I worked for a new modelling agency and we were looking for hot new models. I told them bout the pay and they were happy to do a casting there and then. The boyfriend thought he might get some work but I told him we were only interested in female models for the moment. So we went off to this secluded location and I asked the boyfriend to wait outside, initially he was a little suspicious but then bought my argument that we were only gonna be five minutes! We went downstairs and she shows me her body, she was not wearing a bra so I got to see her tits! I was really turned on. I told her I had another wad of money in my pocket and it was hers if we fucked there and then. She was shocked! She told me she could not with her boyfriend outside but I told her she could walk out of here with a months wages! She agreed, took the money, got on her knees and started sucking my cock! She really knew what she was doing, she even started playing with and then sucking my balls! Oh my God it was incredible. She stood up, turned around and pulled her panties down, I thrust my tongue inside her pussy before sliding my dick deep inside her and fucking her from behind! She was loving it! I sat on the chair in the room while she rode me, her tits bouncing up and down as I fucked her. I finished by leaving my load all over her face, all while her boyfriend waited outside!\r\n\r\nVideo Quality: SiteRip\r\nVideo Format: MP4\r\nVideo: MPEG4 Video (H264) 852x480 24fps 2692kbps\r\nAudio: AAC 44100Hz stereo 127kbps","torrent":{"xt":"urn:btih:59cb20db0032e8cfc3b723f1f535b7f8766e7c94","amp;dn":"PublicAgent+-+Alexa+Tomas+%28Spanish+babe+fucks+stranger+for+cash%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59cb20db0032e8cfc3b723f1f535b7f8766e7c94","infoHashBuffer":{"type":"Buffer","data":[89,203,32,219,0,50,232,207,195,183,35,241,245,53,183,248,118,110,124,148]},"announce":[],"urlList":[]}}