{"title":"Gantz Manga Complete English Dubbed Volumes","uid":11689885,"size":2876759087,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:5a1a83a0c2b70092096ab7f19983cc8b11a7e0a0&amp;dn=Gantz+Manga+Complete+English+Dubbed+Volumes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":4,"uploader":"davidk88","files":37,"time":1423482913,"description":"Hi guys, this is a re-upload of the Gantz manga dubbed in English which took me ages to find. Ill like to credit the original uploader ExSavior for uploading it in the first place! Love the series and couldn't find it here on PTB so I thought I would upload it!\n\nSource: http://kickass.dotpirate.me/manga-gantz-complete-t7824176.html\n\nDescription: How long will you stay in the game? The last thing Kei and Masaru remember was being struck dead by a subway train while saving the life of a drunken bum. What a waste! And yet somehow they're still...alive? Or semi-alive? Maybe it's reanimated... by some kind of alien orb with a nasty message... &quot;Your lives are over. What you do with your new lives is up to me!&quot; And what this orb called 'Gantz' intends to do with their lives is make them play games of death, hunting all kinds of odd aliens, along with a bunch of other ordinary citizens who've recently met a tragic semi-end. The missions they embark upon are often dangerous. Many die - and die again! This dark and action-packed manga deals with the moral conflicts of violence, coupled with teenage sexual confusion and angst, and with our fascination with death. Hang onto your gear and keep playing the game, whatever you do; Gantz is unrelenting!\n\nGenre: Action, Sci-Fi, Horror, Thriller\n\nAuthor: Hiroya Oku\n\nPicture: https://upload.wikimedia.org/wikipedia/en/f/fb/Gantzvol1.jpg\n\nSummary: Gantz tells the story of a teenager named Kei Kurono who dies in a train accident and becomes part of a semi-posthumous &quot;game&quot; in which he and several other recently deceased people are forced to hunt down and kill aliens. The missions on which they embark are often dangerous. Many die - again - on each mission, but they are replaced by others in the same manner as Kei Kurono's appearance.\n\nKei Kurono often faces many hard times and difficult experience to choose his own decision to save his life and his friends and hence, through many tasks of many destination in the vast worldwide. The mission made strong and tough relationships between the core member of 'Tokyo' team.\n\nVolumes: 1 to 37 (All)\n\nWatch, Read, Listen, Try, support the artists!! :D\n\nHappy torrenting","torrent":{"xt":"urn:btih:5a1a83a0c2b70092096ab7f19983cc8b11a7e0a0","amp;dn":"Gantz+Manga+Complete+English+Dubbed+Volumes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a1a83a0c2b70092096ab7f19983cc8b11a7e0a0","infoHashBuffer":{"type":"Buffer","data":[90,26,131,160,194,183,0,146,9,106,183,241,153,131,204,139,17,167,224,160]},"announce":[],"urlList":[]}}