{"title":"Simon And Garfunkel - Bookends [MP3 320] TNT Village","uid":9691478,"size":82913268,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5ac390c31f352e8fe5cc576f796ac50106df5376&amp;dn=Simon+And+Garfunkel+-+Bookends+%5BMP3+320%5D+TNT+Village&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"l.diliberto","files":14,"time":1393871469,"description":"Simon And Garfunkel - Bookends [MP3 320] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=387770&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=387770&lt;/a&gt;\n\n.: Dati Album :.\n\nAnno: 3 aprile 1968\nGenere: Folk rock\n\nSimon &amp; Garfunkel quietly slipped Bookends, their fourth album, into the bins with a whisper in March 1968. They are equal collaborators with producer/engineer Roy Halee in a multivalently layered song cycle observing the confusion of those seeking an elusive American Dream, wistfully reflecting on innocence lost forever to the cold winds of change. Bookends opens with an acoustic guitar stating a theme, slowly and plaintively. It erupts into the musical dissonance that introduces &quot;Save the Life of My Child.&quot; Its uneasy rock &amp; roll frames highly metaphorical and ironic lyrics and a nursery rhyme bridge. &quot;America&quot; is a folk song with a lilting soprano saxophone in its refrain as a small pipe organ paints acoustic guitars, framed by the ghostly traces of classic American Songbook pop structures. Two people travel the landscape by bus searching for the track's subject, eventually discovering that everyone else on the freeway is too. Its sophisticated harmonic invention is toppled by its message; &quot;America&quot; becomes an ellipsis, a cipher, an unanswerable question. &quot;Overs,&quot; a study about the end of a relationship, contains Halee's ingenious use of sound: lighting a cigarette and inhaling and exhaling its smoke underscore the story told by the melody and lyrics. In a two-minute field recording of the voices of old people collected from nursing homes by Garfunkel, disembodied voices reveal entire lifetimes in a few seconds. &quot;Old Friends&quot; carries the message deeper. Simon's image of two old men sitting on a park bench sharing memories and their fears of the changes surrounding them is indelible. A horn section threatens to interrupt their reverie, reflecting the chaos they perceive, but is warded off as the gentle melody returns and fades into the album's opening theme. In &quot;Fakin' It,&quot; Simon reveals the falsity inherent in modern life -- it's better to appear to have it together than reflect the struggle of not being able to: &quot;This feeling of fakin' it/I still haven't shaken it/I know I'm fakin' it/I'm not really makin' it.&quot; The album's final three tracks, &quot;Mrs. Robinson&quot; (the iconic theme song from the film The Graduate), &quot;A Hazy Shade of Winter,&quot; and the album's concluding track, &quot;At the Zoo,&quot; offer a tremblingly bleak vision of the future rooted in the lives of everyday people who &quot;fake it,&quot; living an illusory dream publicly while trembling with confusion and fear in private (no matter one's generation), subverting the Madison Avenue notion of the &quot;generation gap&quot; simply and honestly. Bookends' problematic, disillusioned themes, sometimes disguised in wry humor, striking arrangements, and augmented orchestral instrumentation, portray the sounds of people in an American life that they no longer understand, or understands them. Simon &amp; Garfunkel never overstate; instead they observe, almost journalistically, enormous life and cultural questions in the process of them being asked. In just over 29 minutes, Bookends is stunning in its vision of a bewildered America in search of itself. \n\n\n.: Tracklist :.\n\nLato A\n\nBookends Theme\nSave the Life of My Child\nAmerica\nOvers\nVoices of Old People\nOld Friends\nBookends\n\nLato B\n\nFakin' It\nPunky's Dilemma\nMrs. Robinson\nA Hazy Shade of Winter\nAt the Zoo\n\nEXTRA\n\nYou Don't Know Where Your Interest Lies\nOld Friends (Demo)","torrent":{"xt":"urn:btih:5ac390c31f352e8fe5cc576f796ac50106df5376","amp;dn":"Simon+And+Garfunkel+-+Bookends+%5BMP3+320%5D+TNT+Village","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ac390c31f352e8fe5cc576f796ac50106df5376","infoHashBuffer":{"type":"Buffer","data":[90,195,144,195,31,53,46,143,229,204,87,111,121,106,197,1,6,223,83,118]},"announce":[],"urlList":[]}}