{"title":"Shelter 2 - FLT","uid":11744042,"size":684468286,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5b296c95f9720376480018b11edb641911fdd954&amp;dn=Shelter+2+-+FLT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"dauphong","files":2,"time":1425920152,"description":"Game information:\n\nThe beauty of nature goes hand in hand with its unforgiving rawness. That\nis central in Shelter 2, and one of the reasons we chose to make a game\nabout a Lynx. They are in middle of the food chain, and there are far more\nvicious things out on the cold tundra\n\nThe game follows the life of a mother lynx, starting as a pregnant animal\ngiving birth and continuing in to a journey of parenthood where nurturing\nher cubs is paramount for survival. Shelter 2 includes more elaborate\ngameplay features than its predecessor, such as stamina, different types\nof movements, jumps and a variety of prey to kill. Besides hunting there\nare several maternal and hunting features, such as calling the cubs\ncloser, smell for prey, making sure they drink water from rivers and\nlifting and carrying your cubs from harm's way\n\nEnvironments in Shelter 2 are much bigger than it's predecessor and allow\na lot more freedom than ever before, allowing players to find favorite\nspots to return to. This time weather and seasons change, harsh winters\nand bloomy summers awaits you!\n\nThe music is once again presented by Retro Family, awarded for their work\non the Pid Soundtrack, and the visuals have been reinvented by adding\ndense atmosphere and lighting to the patterned graphical art-style\n\nInstallation Information:\n\n* Burn or mount\n* Install\n* Play the game\n\nNOTE: As usual, block the game exe in your firewall","torrent":{"xt":"urn:btih:5b296c95f9720376480018b11edb641911fdd954","amp;dn":"Shelter+2+-+FLT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b296c95f9720376480018b11edb641911fdd954","infoHashBuffer":{"type":"Buffer","data":[91,41,108,149,249,114,3,118,72,0,24,177,30,219,100,25,17,253,217,84]},"announce":[],"urlList":[]}}