{"title":"East West Quantum Leap Stormdrum Kompakt Edition","uid":3892254,"size":3939859528,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5ba815e6884ce53e15ca0f22d67fdbabef4089e0&amp;dn=East+West+Quantum+Leap+Stormdrum+Kompakt+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"Tech-Noir","files":2,"time":1195085499,"description":"EWQL Stormdrum Kompakt Edition ISO. Also includes Keygen.\n\n\nThe Kompakt Edition of Stormdrum contains very nicely multisampled percussive instruments great for filmscoring or such. Also includes several acoustic drumkits of great quality, aswell as several \\&quot;FX\\&quot;-y instrument hits. And the NI Kompakt Sampler interface contains several easy-to-use features for tweaking ADSR-parameters, Effects section with several reverb algorithms (all with \\&quot;size\\&quot; and \\&quot;damping\\&quot; functions) and lots more. Focused on big Taiko drums and the like.\n\nI had a hell of a time tracking this down, it was posted on a recently-downed torrentsite not to be named on here, but it only had one seeder and now seems pretty dead. So I figured I would upload it here if people are interested in something that will definitely be seeded well (I even tracked this down on DC++, so there...). :)\n\n\n\nInstalling: \n\n1. Mount with Daemontools or burn the ISO, run the setup file on the DVD. Use the keygen to generate a serial when installing.\n\n2. Select which components you want to install (Stand-alone, VST, RTAS, etc). It seems best to include the \\&quot;library\\&quot; option, you will get a separate prompt for where you want to install it to, if you want it in a location separate from the application itself.\n\n3. After you\\&amp;#039;ve installed it, go to the start menu-section that is created, and run the \\&quot;Registration Tool\\&quot;. Again use the Keygen to first input your Machine ID, and then press the \\&quot;Copy from clipboard\\&quot; button in the Reg tool to input the code the keygen gives you, followed by the \\&quot;complete\\&quot; button. And you\\&amp;#039;re done. :)\n\n\n\nAny questions, just ask in this torrent\\&amp;#039;s message section.\n\nAnd enjoy great lively percussion.","torrent":{"xt":"urn:btih:5ba815e6884ce53e15ca0f22d67fdbabef4089e0","amp;dn":"East+West+Quantum+Leap+Stormdrum+Kompakt+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ba815e6884ce53e15ca0f22d67fdbabef4089e0","infoHashBuffer":{"type":"Buffer","data":[91,168,21,230,136,76,229,62,21,202,15,34,214,127,219,171,239,64,137,224]},"announce":[],"urlList":[]}}