{"title":"Exploring Arduino- Wiley [PDF] [StormRG]","uid":9715430,"size":25526004,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5bbae1e08059f4f70833be30c2312bf618117cfc&amp;dn=Exploring+Arduino-+Wiley+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":2,"uploader":"F1restorm","files":-1,"time":1394153997,"description":"Exploring Arduino: Tools and Techniques for Engineering Wizardry\nAuthor: Jeremy Blum\nPublished: 2013\nPublisher: Wiley\nISBN: 9781118549360\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n____________________________________________________________________________________\n\nLearn to easily build gadgets, gizmos, robots, and more using Arduino\n\nWritten by Arduino expert Jeremy Blum, this unique book uses the popular Arduino microcontroller platform as an instrument to teach you about topics in electrical engineering, programming, and human-computer interaction. Whether you're a budding hobbyist or an engineer, you'll benefit from the perfectly paced lessons that walk you through useful, artistic, and educational exercises that gradually get more advanced. In addition to specific projects, the book shares best practices in programming and design that you can apply to your own projects. Code snippets and schematics will serve as a useful reference for future projects even after you've mastered all the topics in the book.\n\nIncludes a number of projects that utilize different capabilities of the Arduino, while interfacing with external hardware\nFeatures chapters that build upon each other, tying in concepts from previous chapters to illustrate new ones\nIncludes aspects that are accompanied by video tutorials and other multimedia content \nCovers electrical engineering and programming concepts, interfacing with the world through analog and digital sensors, communicating with a computer and other devices, and internet connectivity\nExplains how to combine smaller topics into more complex projects\nShares downloadable materials and source code for everything covered in the book\nProjects compatible with many official Arduino boards including Arduino Uno; Arduino Leonardo; Arduino Mega 2560; Arduino Due; Arduino Nano; Arduino Mega ADK; LilyPad Arduino and may work with Arduino-compatible boards such as Freeduino and new third party certified boards such as the Intel Galileo","torrent":{"xt":"urn:btih:5bbae1e08059f4f70833be30c2312bf618117cfc","amp;dn":"Exploring+Arduino-+Wiley+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5bbae1e08059f4f70833be30c2312bf618117cfc","infoHashBuffer":{"type":"Buffer","data":[91,186,225,224,128,89,244,247,8,51,190,48,194,49,43,246,24,17,124,252]},"announce":[],"urlList":[]}}