{"title":"Philip K. Dick-Upon the Dull Earth and Other Stories","uid":15756152,"size":124096063,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5bbe6fce6cb7d17e90061ac1943da2506ff0645e&amp;dn=Philip+K.+Dick-Upon+the+Dull+Earth+and+Other+Stories&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"twocows","files":9,"time":1473055263,"description":"Upon the Dull Earth and Other Stories\r\nby Philip K. Dick\r\n\r\n    William Coon\r\n\r\n\r\n\r\nWhen an interviewer asked Phillip K. Dick &quot;What is the most important quality for a writer to have?&quot; he replied &quot;A sense of indignation... A writer writes because it's his response to the world. It's a natural process, like respiration... The capacity for indignation is the most important thing for a creative person. Not the aesthetic capacity but the capacity for indignation... And especially indignation at the treatment afforded other people. To see some of the things that are going on in the world and to feel indignant...That is the basis of the writer.&quot; Whatever it was that stimulated his creative juices, we are the lucky beneficiaries, as demonstrated in this collection of five stories, all first published in 1954. In &quot;Exhibit Piece&quot; a long-suffering museum worker becomes a little too attached to his display of mid-twentieth century lifestyle. In &quot;Upon the Dull Earth&quot; a young man refuses to let go of his soul mate, and he creates a chain reaction that he couldn't have anticipated. In &quot;Progeny&quot; one man's idea of how to raise a child is challenged by new, more scientific techniques. &quot;The Last of the Masters&quot; explores a post-apocalyptic world, where anarchists don't just occupy Wall Street, they occupy the entire planet. Finally, in &quot;Breakfast at Twilight&quot;, a family awakes to find theirs is the only house left on their street, and they are forced to make the most important decision of their lives","torrent":{"xt":"urn:btih:5bbe6fce6cb7d17e90061ac1943da2506ff0645e","amp;dn":"Philip+K.+Dick-Upon+the+Dull+Earth+and+Other+Stories","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5bbe6fce6cb7d17e90061ac1943da2506ff0645e","infoHashBuffer":{"type":"Buffer","data":[91,190,111,206,108,183,209,126,144,6,26,193,148,61,162,80,111,240,100,94]},"announce":[],"urlList":[]}}