{"title":"100 Cases in Psychiatry [PDF] [StormRG]","uid":11131938,"size":1074426,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5c0a3f987e34c3040ab2e90ee8de455bd7842223&amp;dn=100+Cases+in+Psychiatry+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"0xmovva","files":2,"time":1412056974,"description":"Author: Subodh Dave, Nisha Dogra, Barry Wright\nSeries: 100 Cases\nPaperback: 280 pages\nPublisher: CRC Press; 1 edition (February 26, 2010)\nLanguage: English\nISBN-10: 0340986018\nISBN-13: 978-0340986011\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds forthe seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n________________________________________________________________________________\n\n\n100 Cases in Psychiatry presents 100 scenarios commonly seen in the hospital and community setting. The patient's history and examination are described, with questions on the diagnosis and management of each case. The answer includes a detailed discussion on each topic, providing an essential revision aid as well as a practical guide for students and junior doctors.\n\nMaking clinical decisions is one of the most important and difficult parts of training to become a doctor, and the area of mental health presents its own unique challenges. These cases will help students and junior doctors to recognize important medical conditions in psychiatry, and to develop their diagnostic and management skills. It covers common conditions are covered including depression, anxiety, psychosis, alcohol dependence, dementia, autism, mania, self-harm and anorexia.","torrent":{"xt":"urn:btih:5c0a3f987e34c3040ab2e90ee8de455bd7842223","amp;dn":"100+Cases+in+Psychiatry+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c0a3f987e34c3040ab2e90ee8de455bd7842223","infoHashBuffer":{"type":"Buffer","data":[92,10,63,152,126,52,195,4,10,178,233,14,232,222,69,91,215,132,34,35]},"announce":[],"urlList":[]}}