{"title":"The Hummingbird Bakery Cookbook [Epub] [StormRG]","uid":11102182,"size":26158377,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5c12f0ea1c8da78b3cfc8c827bffc7a32c2b01d1&amp;dn=The+Hummingbird+Bakery+Cookbook+%5BEpub%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"krystine","files":-1,"time":1411682282,"description":"The Hummingbird Bakery Cookbook\nAuthor: Tarek Malouf\nPublished: 2014\nPublisher: Ryland Peters &amp; Small\nASIN: B00J75NBZU\nFormat: Retail Epub\nReader Required:\nEpub- Adobe Digital Editions, Calibre, MoonReader for Android\n\n\nTested on the above readers with no problems on laptop and Android tablet. \nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. \nPlease allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nEnjoy! \n\nThe Hummingbird Bakery is the destination bakery for Londoners with a passion for great cakes. In this irresistible book, the chefs from the bakery share their recipes for a delicious range of 60 bakes, from deliciously light cupcakes with pretty buttercream frosting to moist chocolate layer cakes and zesty lemon meringue pie. Hummingbird recipes not only taste great but also look spectacular - without resorting to fussy recipes and hours in the kitchen. The chapters include Cupcakes, Cakes (including loaf, layer, ring and cheesecakes), Pies, Brownies and Bars, Muffins and Cookies.\n\nTarek Malouf grew up in London and attended The American School in London's St John's Wood. It was there that he was introduced to, and grew to love, American desserts and cupcakes. After attending university in London and Los Angeles, he worked for ABC News (American Broadcasting) in their London bureau for several years. In 2002 he decided to leave journalism and started planning The Hummingbird Bakery. The Bakery has branches in Portobello Road in Notting Hill, Old Brompton Road in South Kensington, and Wardour Street in Soho. The Hummingbird Bakery Cookbook is his first book. Visit The Hummingbird Bakery website at www.hummingbirdbakery.com\n\n","torrent":{"xt":"urn:btih:5c12f0ea1c8da78b3cfc8c827bffc7a32c2b01d1","amp;dn":"The+Hummingbird+Bakery+Cookbook+%5BEpub%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c12f0ea1c8da78b3cfc8c827bffc7a32c2b01d1","infoHashBuffer":{"type":"Buffer","data":[92,18,240,234,28,141,167,139,60,252,140,130,123,255,199,163,44,43,1,209]},"announce":[],"urlList":[]}}