{"title":"The Medieval Islamic Civilization - Collection 1 (Contribution t","uid":8262561,"size":184654589,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5c27dae3b0a3aba95e93d75ff357f65b758d9aa5&amp;dn=The+Medieval+Islamic+Civilization+-+Collection+1+%28Contribution+t&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"moman73","files":15,"time":1363414887,"description":"The Medieval Islamic Civilization - Collection 1 (Contribution to Science):\n\nWhile Europe was occupied in the Middle Ages by their infightings, the inquisition, the crusades and the war against heresy, the Muslims were busy establishing the greatest empire in the history of humanity. When Europe was living in the Dark Ages, the Islamic Empire was busy building centers of education (House of Wisdom) and translating the knowledge of the Greeks into Arabic and transferring the technologies of the east (China and India.) The Muslims added their own sciences and technologies; this huge accumulated body of knowledge was later translated into Latin to form the impetus for the evolution of modern science in the West. \n\nThis is the first of several special collections that document the Medieval Islamic Civilization. Four collections are being uploaded at the same time to give a complete picture about the subject. In these collection both writings by Muslim and non-Muslim writers are included. The emphasis in this upload is on the contribution of the Muslims in the medieval age to science.\n\nWe have 15 titles here:\n\nAfnan - Avicenna; His Life and Works (1958)\n\nAl-Hassani (Ed.) - 1001 Inventions; Muslim Heritage in Our World, 2e (2007)\n\nFreely - Aladdin's Lamp; How Greek Science Came to Europe through the Islamic World (2009)\n\nHazmy (Eds.) - Biographies of Muslim Scholars and Scientists\n\nHogendijk &amp; Sabra (Eds.) - The Enterprise of Science in Islam; New Perspective (2003)\n\nHovannisian &amp; Sabagh (Eds.) - Religion &amp; Culture in Medieval Islam (1999)\n\nIqbal - Science and Islam (2007)\n\nJohnstone, Serjeant &amp; Smith (Eds.) - Arabic Literature to the End of the Umayyad Period (1983)\n\nKennedy - The Great Arab Conquests; How the Spread of Islam Changed the World We Live In (2007)\n\nLe Strange - Baghdad During the Abbasid Caliphate (1900)\n\nLyons - The House of Wisdom; How the Arabs Transformed Western Civilization (2009)\n\nMakdisi - The Rise of Colleges; Institutions of Learning in Islam and the West (1981)\n\nMasood - Science and Islam; a History (2009)\n\nMcGinnis - Avicenna; the Physics of the Healing, Books I &amp; II (2009)\n\nMeri (Ed.) - Medieval Islamic Civilization; an Encyclopedia (2006)\n\nRashed - Geometry and Dioptrics in Classical Islam (2005)\n\n","torrent":{"xt":"urn:btih:5c27dae3b0a3aba95e93d75ff357f65b758d9aa5","amp;dn":"The+Medieval+Islamic+Civilization+-+Collection+1+%28Contribution+t","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c27dae3b0a3aba95e93d75ff357f65b758d9aa5","infoHashBuffer":{"type":"Buffer","data":[92,39,218,227,176,163,171,169,94,147,215,95,243,87,246,91,117,141,154,165]},"announce":[],"urlList":[]}}