{"title":"Producing and Directing the Short Film and Video, 4th Ed{BBS}","uid":6699312,"size":27336102,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5c31886b4860ea5ee8c948c2e3ea08605aa1134d&amp;dn=Producing+and+Directing+the+Short+Film+and+Video%2C+4th+Ed%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1316900261,"description":"Producing and Directing the Short Film and Video is the definitive book on the subject for beginning filmmakers and students. The book clearly illustrates all of the steps involved in preproduction, production, postproduction, and distribution. Its unique two-fold approach looks at filmmaking from the perspectives of both producer and director, and explains how their separate energies must combine to create a successful short film or video, from script to final product. This guide offers extensive examples from award-winning shorts and includes insightful quotes from the filmmakers themselves describing the problems they encountered and how they solved them. The companion website contains useful forms and information on grants and financing sources, distributors, film and video festivals, film schools, internet sources for short works, and professional associations.\n\n* Unique approach to filmmaking which looks at the process from the director's and producer's point of view--each chapter is subdivided into sections covering the producer's and director's POV\n* Features case studies from award-winning short films that will inspire you to make your own\n* A companion website contains useful forms, information on grants and financing sources, distributors, film and video festivals, film schools, internet sources for short works, and professional associations\n\nSee all Editorial Reviews\nProduct Details\n\n    * Paperback: 432 pages\n    * Publisher: Focal Press; 4 edition (March 18, 2010)\n    * Language: English\n    * ISBN-10: 0240811747\n    * ISBN-13: 978-0240811741","torrent":{"xt":"urn:btih:5c31886b4860ea5ee8c948c2e3ea08605aa1134d","amp;dn":"Producing+and+Directing+the+Short+Film+and+Video%2C+4th+Ed%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c31886b4860ea5ee8c948c2e3ea08605aa1134d","infoHashBuffer":{"type":"Buffer","data":[92,49,136,107,72,96,234,94,232,201,72,194,227,234,8,96,90,161,19,77]},"announce":[],"urlList":[]}}