{"title":"Plastics Engineering 3rd ed - R. J. Crawford","uid":12427804,"size":30549212,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5cbae167f259176c3d19eec15be61cf383f92c60&amp;dn=Plastics+Engineering+3rd+ed+-+R.+J.+Crawford&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"clouderone","files":1,"time":1442411767,"description":"Plastics Engineering 3rd ed - R. J. Crawford (Elsevier BH, 1998).pdf\n\nISBN 0 7506 3764 1\n\nThis book presents in a single volume the basic essentials of the properties and processing behaviour of plastics and composites. The aim is to give engineers and technologists a sound understanding of basic principles without the introduction of unduly complex levels of mathematics or chemistry and thereby set plastics in their proper context as engineering materials. This textbook pioneered the approach whereby both properties and processing of reinforced and unreinforced plastics are covered in a single volume. It assumes no prior knowledge of plastics, and emphasises the practical aspects of the subject. In this third edition over half the book has been re-written and the remainder has been updated and re-organised. Early chapters give an introduction to the types of plastics which are currently available and describe how a designer goes about the selection of a plastic for a particular application. Later chapters lead the reader into more advanced aspects of mechanical design and analysis of polymer melt flow. All techniques developed are illustrated by numerous worked examples, and problems are given at the end of each chapter - the solutions to which form one of the appendices","torrent":{"xt":"urn:btih:5cbae167f259176c3d19eec15be61cf383f92c60","amp;dn":"Plastics+Engineering+3rd+ed+-+R.+J.+Crawford","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5cbae167f259176c3d19eec15be61cf383f92c60","infoHashBuffer":{"type":"Buffer","data":[92,186,225,103,242,89,23,108,61,25,238,193,91,230,28,243,131,249,44,96]},"announce":[],"urlList":[]}}