{"title":"AskGaryVee: One Entrepreneur's Take on Leadership, Social Media","uid":13859767,"size":874557,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5cff42a0fcb30c5f6f70ac78ca3f422f970e9b64&amp;dn=AskGaryVee%3A+One+Entrepreneur%27s+Take+on+Leadership%2C+Social+Media&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"Dr.Soc","files":1,"time":1458023617,"description":"#AskGaryVee: One Entrepreneur's Take on Leadership, Social Media, and Self-Awareness by Gary Vaynerchuk\r\nMarch 8, 2016 | 384 pages | English | ISBN-10: 0062273124\r\n\r\nThe New York Times bestselling author draws from his popular show #AskGaryVee to offer surprising, often outrageous, and imminently useful and honest answers to everything you’ve ever wanted to know—and more—about navigating the new world.\r\n\r\nGary Vaynerchuk—the inspiring and unconventional entrepreneur who introduced us to the concept of crush it—knows how to get things done, have fun, and be massively successful. A marketing and business genius, Gary had the foresight to go beyond traditional methods and use social media tools such as Twitter,and YouTube to reach an untapped audience that continues to grow.\r\n\r\n#AskGaryVee showcases the most useful and interesting questions Gary has addressed on his popular show. Distilling and expanding on the podcast’s most urgent and evergreen themes, Gary presents practical, timely, and timeless advice on marketing, social media, entrepreneurship, and everything else you’ve been afraid to ask but are dying to know. Gary gives you the insights and information you need on everything from effectively using Twitter to launching a small business, hiring superstars to creating a personal brand, launching products effectively to staying healthy—and even buying wine.\r\n\r\nWhether you’re planning to start your own company, working in digital media, or have landed your first job in a traditional company, #AskGaryVee is your essential guide to making things happen in a big way","torrent":{"xt":"urn:btih:5cff42a0fcb30c5f6f70ac78ca3f422f970e9b64","amp;dn":"AskGaryVee%3A+One+Entrepreneur%27s+Take+on+Leadership%2C+Social+Media","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5cff42a0fcb30c5f6f70ac78ca3f422f970e9b64","infoHashBuffer":{"type":"Buffer","data":[92,255,66,160,252,179,12,95,111,112,172,120,202,63,66,47,151,14,155,100]},"announce":[],"urlList":[]}}