{"title":"Watch Dogs 2 Demo","uid":15723916,"size":183204352,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5dbbedc7ddbf1ac900d671ae219eaf549a1f46a3&amp;dn=Watch+Dogs+2+Demo&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"wc3edit","files":1,"time":1472690399,"description":"Similar to its predecessor, Watch Dogs 2 is an action-adventure game with stealth elements. Played from a third-person perspective, the game features an open world set in a fictionalized version of San Francisco, an area more than twice as large as the setting from Watch Dogs.[3] The city of San Francisco consists of six different areas: the downtown area, Civic, Coast, Oakland, Marin, and Silicon Valley, all of which have different characteristics and aesthetics.[4] Players can navigate the city on-foot or by the various vehicles featured in the game, such as cars, trucks, motorbikes, quad bikes and boats.[5] The driving mechanic was overhauled and was designed to be more accessible.[6] The players can also shoot their weapons while driving.[2] Marcus also has improved acrobatic skills, and has the ability to parkour around the city.[7]\r\n\r\nPlayers can use different methods to approach the game's missions. Players can choose between the aggressive approach, in which they defeat enemies with firearms, which are made with a 3D printer, explosives like mines, or Marcus' own melee weapon, which is a billiard ball attached to a bungee cord also called a thunderball, and the stealth approach, in which they can evade enemies or paralyze them temporarily with Marcus' Taser.[7] When players commit too much crimes in the open world, police officers will become alerted and will attempt to arrest the player.[8] The game upgrades system also returns, with items being divided into three categories: Stealth, Aggressor, and Trickster. Players can choose their upgrades in accordance to their own playstyle.[2]\r\n\r\nMarcus can hack into various electronic devices connected to the ctOS system with his in-game smartphone. For example, Marcus can modify the personal information of non-player characters to have them arrested,[3] hack and manipulate every mobile phone featured in the game, disrupt traffic by hacking cars and traffic lights, hack into monitoring cameras, and carry out &quot;mass hacking&quot;, which hacks the electrical equipment of a large group of people.[9] Players also gain multiple options while hacking the same object. For instance, if the player attempts to hack a car, they can gain direct control over them, or have the car losing control and crashing in a random direction. If the player hacks a junction box, they can choose whether they should deactivate it or turn it into a proximity mine.[10] Unlike Aiden, the protagonist of the first game, Marcus has an arsenal of advanced equipment, including a quadcopter and a remote-controlled car, both of which can be used for remote hacking and scouting.[5] Marcus' apparel can be customized with over 700 articles of clothing, available for purchase in stores that maintain fashion styles unique to what is worn by the denizens in each area.[11] The game features several main story missions, and side-missions known as &quot;operations&quot;. Completing these operations will increase the followers count of Marcus, which will tie back into the narrative and help players to complete their ultimate goal","torrent":{"xt":"urn:btih:5dbbedc7ddbf1ac900d671ae219eaf549a1f46a3","amp;dn":"Watch+Dogs+2+Demo","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5dbbedc7ddbf1ac900d671ae219eaf549a1f46a3","infoHashBuffer":{"type":"Buffer","data":[93,187,237,199,221,191,26,201,0,214,113,174,33,158,175,84,154,31,70,163]},"announce":[],"urlList":[]}}