{"title":"UFOs Angels Spirits Witches and Demons - Mans Biggest Secret","uid":13735888,"size":8563365474,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5dd127ed04fef2a40565d8b51c549534065186e9&amp;dn=UFOs+Angels+Spirits+Witches+and+Demons+-+Mans+Biggest+Secret&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"POtHS11","files":59,"time":1457047465,"description":"Hidden Secrets - Part 114 - UFOs Angels Spirits Witches and Demons - Mans Biggest Secret - The... (Size: 7.98 GB)\r\n\r\n\r\n Mankind's biggest secret - The Clementine conspiracy a.k.a. Project Golden Dragon:\r\nOriginal uploader's description...\r\nUpdated version of Extraterrestrial technology on the Moon a.k.a. &quot;Project Golden Dragon&quot;.  This project is based on a personal &quot;theory&quot; about a major conspiracy by the US Department of Defense, a whistle-blower who left cryptographic clues and finally complete exposure of an obfuscated object found in the Zeeman crater.\r\n\r\n* * * There is no scientific build disclosure (yet). * * *\r\n\r\nThis presentation is the result of 14 years of research; collecting data, analyzing and making enhancements using high-end forensic image enhancement software. I needed a very long time myself to look past the strange shape. Do not expect to see the machine immediately. Your eyes and mind need time to adapt so take your time and try not to think too hard of alien technology. You probably have an expectation what &quot;technology on the Moon&quot; may look like but this machine is unlike anything you have ever seen. In order to see it you must A) be willing to accept the impossible, B) free your mind and C) capable of &quot;out of the box&quot; thinking. Note: I cannot promise that you will see the alien technology. All depends on your willingness to accept that there is life outside Earth atmosphere. Only users who are fully open to extraterrestrial technology and who are able to watch this video without prejudice will have a better chance to comprehend the images","torrent":{"xt":"urn:btih:5dd127ed04fef2a40565d8b51c549534065186e9","amp;dn":"UFOs+Angels+Spirits+Witches+and+Demons+-+Mans+Biggest+Secret","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5dd127ed04fef2a40565d8b51c549534065186e9","infoHashBuffer":{"type":"Buffer","data":[93,209,39,237,4,254,242,164,5,101,216,181,28,84,149,52,6,81,134,233]},"announce":[],"urlList":[]}}