{"title":"David Lagercrantz - Det som inte dödar oss Svensk","uid":13039401,"size":525386149,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5dff37f1613ddb861678b0c28de78ff9a5b17199&amp;dn=David+Lagercrantz+-+Det+som+inte+d%26ouml%3Bdar+oss+Svensk&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"hajsson","files":86,"time":1450523886,"description":"Tidskriften Millennium har fått nya ägare. Elaka tungor hävdar att tiden har sprungit ifrån Mikael Blomkvist och han funderar på om han borde göra något annat.\r\n \r\nLisbeth Salander är rastlös. Hon medverkar i en hackerattack till synes utan någon särskild anledning. Hon tar risker hon vanligtvis är noga med att undvika. Det är inte likt henne.\r\n \r\nEn sen natt ringer professor Frans Balder, en ledande auktoritet inom AI-forskning, till Blomkvist. Balder säger sig sitta på världsavgörande information om amerikanska underrättelsetjänsten. Han har dessutom haft kontakt med en ung kvinnlig superhacker, som bär vissa likheter med en person Blomkvist känner väl.\r\n \r\nMikael Blomkvist börjar hoppas på det scoop som både han och Millennium behöver. Lisbeth Salander har som vanligt sin alldeles egen agenda. I Det som inte dödar oss fortsätter berättelsen. Det har blivit dags för deras vägar att korsas. Ännu en gång.\r\n\r\nDavid Lagercrantz följer Mikael Blomkvist, Lisbeth Salander och flera andra personer vi känner igen från förut i spåren. Han introducerar också nya karaktärer och skapar framför allt en helt ny historia med hjälp av vissa trådar från de tidigare böcker","torrent":{"xt":"urn:btih:5dff37f1613ddb861678b0c28de78ff9a5b17199","amp;dn":"David+Lagercrantz+-+Det+som+inte+d%26ouml%3Bdar+oss+Svensk","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5dff37f1613ddb861678b0c28de78ff9a5b17199","infoHashBuffer":{"type":"Buffer","data":[93,255,55,241,97,61,219,134,22,120,176,194,141,231,143,249,165,177,113,153]},"announce":[],"urlList":[]}}