{"title":"[Jan 2013]Real Influence [EPUB] - Persuade Without Pushing - Mar","uid":8004007,"size":313516,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5ebe2f6b0892918649f5342081b42e1d4f1c76bd&amp;dn=%5BJan+2013%5DReal+Influence+%5BEPUB%5D+-+Persuade+Without+Pushing+-+Mar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"KatQwerty","files":3,"time":1357842526,"description":"\n\nPeople won't put up with being &quot;sold&quot; anymore. If they sense they are being pushed, their guard goes up - and even if they do comply, lingering resentment undermines the relationship...maybe forever. Yet, most books on influence still portray it as something you &quot;do to&quot; someone else to get your way. That out-of-date approach invites resistance or cynicism from those who recognize the techniques. Manipulative tactics might occasionally wear down a colleague's or client's resistance, but they fail to produce the mutual trust that sustains successful relationships. In short, they just won't work in our sophisticated, post-selling world. In this groundbreaking book, authors Mark Goulston and John Ullmen reveal a new model for authentic influence - the kind that creates a strong initial connection and survives long after agreement has been reached. Based on listening, genuine engagement and commitment to win-win outcomes, &quot;Real Influence&quot; provides a powerful four-step method you can use to: examine your priorities; learn about the key players and what they need; earn their attention and motivate them to hear more; and add value with your questions and actions. Complete with examples of the steps in action and insights from real-world &quot;power influencers,&quot; this one-of-a-kind guide shows that being straight with everyone means winning for all.\n \n \n ","torrent":{"xt":"urn:btih:5ebe2f6b0892918649f5342081b42e1d4f1c76bd","amp;dn":"%5BJan+2013%5DReal+Influence+%5BEPUB%5D+-+Persuade+Without+Pushing+-+Mar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ebe2f6b0892918649f5342081b42e1d4f1c76bd","infoHashBuffer":{"type":"Buffer","data":[94,190,47,107,8,146,145,134,73,245,52,32,129,180,46,29,79,28,118,189]},"announce":[],"urlList":[]}}