{"title":"Prezi Hotshot (2014) by Hedwyg van Groenendaal [HxH]","uid":10809449,"size":18374413,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5f18ee736f3b649a9b9183acdf779ae8574e5bf9&amp;dn=Prezi+Hotshot+%282014%29+by+Hedwyg+van+Groenendaal+%5BHxH%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"Sunghabib","files":-1,"time":1408409495,"description":"Book Description:\n\nCreate amazing Prezi presentations through 10 exciting Prezi projects with this book and ebook\n\nOverview\n\nAmaze your audience and keep them engaged during your presentations with Prezi\nCreate interactive presentations from scratch by adding images, animations, and more\nLearn Prezi through ten exciting projects in this step-by-step tutorial\n\nIn Detail\n\nPrezi is a new and marvelous approach to the visualization of information, with over 30 million users across the globe. It's used all over the world for business presentations, pitches, and TED talks. Prezi is different; it is based on mind mapping, and uses an infinite canvas.\n\nThis book will walk you through 10 different and exciting projects to help you get the most out of Prezi. This step-by-step tutorial focuses on specific topics that differ in complexity and technologies used. This book covers the way professionals build their prezis, as well as the way they think during the presentation process. You'll learn a lot of practical details and tips for other tools as well.\n\nWhat you will learn from this book\n\nBuild amazing corporate presentations using the unique seven-step method\nLearn how to present boring stuff in a better way using infographics\nRecognize how to create astonishing animations for your prezis\nLearn how to use Prezi's API for interactivity with Prezi\nPresent yourself with Prezi and create a prezume;\nGet familiar with tips and tricks to create an award-winning prezi\n\nApproach\n\nThis book takes a hands-on, tutorial-style approach that walks you through ten individual projects, each focusing on producing a specific Prezi.\n\nWho this book is written for\n\nIf you have some basic experience of Prezi and want to gain advanced knowledge by building different kinds of Prezi projects, then this book is for you.\n\nProduct Details:\n\nPaperback: 264 pages\nPublisher: Packt Publishing - ebooks Account (April 25, 2014)\nLanguage: English\nISBN-10: 1849699771\nISBN-13: 978-1849699778\n\n\n------------------------------------------------\nSeed - Share - Enjoy - Give me Thumbs Up\n------------------------------------------------","torrent":{"xt":"urn:btih:5f18ee736f3b649a9b9183acdf779ae8574e5bf9","amp;dn":"Prezi+Hotshot+%282014%29+by+Hedwyg+van+Groenendaal+%5BHxH%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f18ee736f3b649a9b9183acdf779ae8574e5bf9","infoHashBuffer":{"type":"Buffer","data":[95,24,238,115,111,59,100,154,155,145,131,172,223,119,154,232,87,78,91,249]},"announce":[],"urlList":[]}}