{"title":"Dylan Tuccillo - A Field Guide to Lucid Dreaming [EPUB]","uid":12128835,"size":3463703,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5f3e55d8141d475971305b3da152eeee0d495b4c&amp;dn=Dylan+Tuccillo+-+A+Field+Guide+to+Lucid+Dreaming+%5BEPUB%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"elessedilgirl","files":1,"time":1436986970,"description":"A Field Guide to Lucid Dreaming, Mastering the Art of Oneironautics - Dylan Tuccillo\n\nOneironautics: from the Greek words oneira, meaning dream, and nautis, meaning sailor. An oneironaut is someone who has learned to travel consciously in the dream world. If you have ever, whilst sleeping, been aware that you were dreaming and, even for a moment, used that awareness to control the course of your dream, then you have experienced lucid dreaming. Until now, books on lucid dreaming have had a distinctly 'woo-woo' slant-emphasising spiritual or supernatural aspects, or concentrating on psychological self-discovery. The writers of A Field Guide to Lucid Dreaming - three award winning writers and filmmakers, who began lucid dreaming in their teens - have searched for the best techniques out there, made some improvements and then boiled them down to their simplest, most practical forms to make this ability available to everyone. With dozens of real life dream accounts by lucid dreamers, and forty beautiful, dreamlike illustrations, this is the book on dreaming for a new generation.\n\nISBN-10: 0761177396\nISBN-13: 978-0761177395","torrent":{"xt":"urn:btih:5f3e55d8141d475971305b3da152eeee0d495b4c","amp;dn":"Dylan+Tuccillo+-+A+Field+Guide+to+Lucid+Dreaming+%5BEPUB%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f3e55d8141d475971305b3da152eeee0d495b4c","infoHashBuffer":{"type":"Buffer","data":[95,62,85,216,20,29,71,89,113,48,91,61,161,82,238,238,13,73,91,76]},"announce":[],"urlList":[]}}