{"title":"Neuropsychoanalysis in Practice: Brain, Self and Objects (2011)","uid":11277912,"size":1580949,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5f44251cdf656f7a96e37c61e30af4ad959ded9e&amp;dn=Neuropsychoanalysis+in+Practice%3A+Brain%2C+Self+and+Objects+%282011%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"Sunghabib","files":-1,"time":1414177991,"description":"Book Description:\n\nIs the Ego nothing but our brain? Are our mental and psychological states nothing but neuronal states of our brain? Though Sigmund Freud rejected a neuroscientific foundation for psychoanalysis, recent knowledge in neuroscience has provided novel insights into the brain and its neuronal mechanisms. This has also shed light on how the brain itself contributes to the differentiation between neuronal and psychological states. \n\nIn Neuropsychoanalysis in Practice , Georg Northoff discusses the various neuronal mechanisms that may enable the transformation of neuronal into psychological states, looking at how these processes are altered in psychiatric disorders like depression and schizophrenia. He focuses specifically on how the brain is organized and how this organization enables the brain to differentiate between neuronal and psychodynamic states, that is, the brain and the psyche. This leads him to discuss not only empirical issues but also conceptual problems, for instance, the concept of the brain. Neuropsychoanalysis in Practice applies these concepts and mechanisms to explain the various symptoms observed in psychiatric disorders such as depression and schizophrenia. In addition to the empirical issues, he also discusses various conceptual and methodological issues that are relevant in linking neuroscience and psychoanalysis, developing a novel transdisciplinary framework for linking neuroscience, psychoanalysis and philosophy. \n\nThis highly original new book will help foster new dialogues between neuroscience, psychoanalysis, and philosophy, and will be fascinating reading for anyone in these disciplines.\n\nProduct Details:\n\nPDF: 386 pages\nPublisher: Oxford University Press; 1 edition (September 1, 2011)\nLanguage: English\nISBN-10: 0199599696\nISBN-13: 978-0199599691\nAmazon Link:\n\n\n------------------------------------------------\nSeed - Share - Enjoy - Give me Thumbs Up","torrent":{"xt":"urn:btih:5f44251cdf656f7a96e37c61e30af4ad959ded9e","amp;dn":"Neuropsychoanalysis+in+Practice%3A+Brain%2C+Self+and+Objects+%282011%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f44251cdf656f7a96e37c61e30af4ad959ded9e","infoHashBuffer":{"type":"Buffer","data":[95,68,37,28,223,101,111,122,150,227,124,97,227,10,244,173,149,157,237,158]},"announce":[],"urlList":[]}}