{"title":"[AnonDCX] Easy PHP Websites with the Zend Framework (incl code s","uid":15752095,"size":3361714,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6021142f4a8a9001b5d34ae8fbd33ab6d725fa65&amp;dn=%5BAnonDCX%5D+Easy+PHP+Websites+with+the+Zend+Framework+%28incl+code+s&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":".AnonDCX.","files":125,"time":1473036568,"description":"In this comprehensive introduction to the powerful Zend Framework, I'll show you how to use all of the features you'll actually want to use within your own websites, including how to effectively manage your configuration data, build rock-solid model-based web forms, take advantage of the powerful Doctrine 2 ORM, send e-mails through your website using Zend_Mail, manage user registrations, logins, and recover forgotten passwords. \r\n\r\nWe'll start right at the beginning, showing you how to use the ZF command-line tool to create your first Zend Framework project, build actions, controllers, and models, and effectively manage your project views and layouts. From there you'll be provided with a comprehensive introduction to all of the framework's most important features (in addition to insight into key best practices such as unit testing and deployment), including: \r\n\r\n- Effectively manage your Zend Framework layouts and views, and create view helpers which can be reused throughout your website \r\n- Integrate Doctrine 2 into your Zend Framework application \r\n- Manage configuration data using the Zend Framework's Zend_Config component \r\n- Build model-driven forms which can easily be tested using PHPUnit and Zend_Test \r\n- Mine theproduct catalog using the Amazon Product Advertising API \r\n- Test your website using PHPUnit and Zend_Test \r\n- Deploy your website quickly and conveniently using Capistrano \r\n- Write PHP-driven CLI scripts which can take advantage of Zend Framework components \r\n\r\nAnd much, much, much more!","torrent":{"xt":"urn:btih:6021142f4a8a9001b5d34ae8fbd33ab6d725fa65","amp;dn":"%5BAnonDCX%5D+Easy+PHP+Websites+with+the+Zend+Framework+%28incl+code+s","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6021142f4a8a9001b5d34ae8fbd33ab6d725fa65","infoHashBuffer":{"type":"Buffer","data":[96,33,20,47,74,138,144,1,181,211,74,232,251,211,58,182,215,37,250,101]},"announce":[],"urlList":[]}}