{"title":"Empire of Things - Frank Trentmann","uid":15617769,"size":14285427,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:602f40be6f0ad5adb5d032f03a6c72f0a67f3b7c&amp;dn=Empire+of+Things+-+Frank+Trentmann&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"mr_mando","files":2,"time":1471848760,"description":"\nWhat we consume has become a central—perhaps the central—feature of modern life. Our economies live or die by spending, we increasingly define ourselves by our possessions, and this ever-richer lifestyle has had an extraordinary impact on our planet. How have we come to live with so much stuff, and how has this changed the course of history?\r\n\r\nIn Empire of Things, Frank Trentmann unfolds the extraordinary story of our modern material world, from Renaissance Italy and late Ming China to today’s global economy. While consumption is often portrayed as a recent American export, this monumental and richly detailed account shows that it is in fact a truly international phenomenon with a much longer and more diverse history. Trentmann traces the influence of trade and empire on tastes, as formerly exotic goods like coffee, tobacco, Indian cotton and Chinese porcelain conquered the world, and explores the growing demand for home furnishings, fashionable clothes and convenience that transformed private and public life. The nineteenth and twentieth centuries brought department stores, credit cards and advertising, but also the rise of the ethical shopper, new generational identities and, eventually, the resurgence of the Asian consumer.\r\n\r\nWith an eye to the present and future, Frank Trentmann provides a long view on the global challenges of our relentless pursuit of more—from waste and debt to stress and inequality. A masterpiece of research and storytelling many years in the making, Empire of Things recounts the epic history of the goods that have seduced, enriched and unsettled our lives over the past six hundred years","torrent":{"xt":"urn:btih:602f40be6f0ad5adb5d032f03a6c72f0a67f3b7c","amp;dn":"Empire+of+Things+-+Frank+Trentmann","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"602f40be6f0ad5adb5d032f03a6c72f0a67f3b7c","infoHashBuffer":{"type":"Buffer","data":[96,47,64,190,111,10,213,173,181,208,50,240,58,108,114,240,166,127,59,124]},"announce":[],"urlList":[]}}