{"title":"Handbook of Heterogeneous Catalytic Hydrogenation for Organic Sy","uid":15920062,"size":4969511,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:608a97c119ab02340012f17102ad3917021cdd8b&amp;dn=Handbook+of+Heterogeneous+Catalytic+Hydrogenation+for+Organic+Sy&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"clouderone","files":1,"time":1475247684,"description":"Handbook of Heterogeneous Catalytic Hydrogenation for Organic Synthesis - Shigeo Nishimura (Wiley, 2001).pdf\r\n\r\nThe most comprehensive reference in the field, Handbook of Heterogeneous Catalytic Hydrogenation for Organic Synthesis provides synthetic chemists and chemical engineers in fine chemicals and pharmaceuticals with detailed experimental guidelines for heterogeneous catalytic hydrogenation. Organized by functional groups for ready reference and featuring detailed examples of hundreds of reactions, this handbook covers hydrogenations of alkenes, alkynes, aldehydes and ketones, nitriles, imines, nitro and nitroso compounds, carboxylic acids and esters, and aromatic and heterocyclic compounds. In addition, coverage includes the preparation of amines by reductive alkylation and the hydrogenolysis of a variety of compounds. Examples of hydrogenation of functional groups and reaction pathways are illustrated with numerous equations and schemes.\r\n\r\nPractitioners will appreciate the plenitude of experimental details given for most of the reactions selected, including amounts of reagents and catalysts, reaction temperatures, hydrogen pressures, and reaction times. They will also find helpful the more than one hundred tables included throughout the book detailing the effects of key factors governing rate and selectivity, such as compound structure, the nature of catalysts and supports, and the nature of solvents. Researchers will benefit from the introductory chapters covering an array of hydrogenation catalysts, including nickel, cobalt, copper, iron, platinum group metals, rhenium, and other oxide and sulfide catalysts, as well as reactors and reaction conditions","torrent":{"xt":"urn:btih:608a97c119ab02340012f17102ad3917021cdd8b","amp;dn":"Handbook+of+Heterogeneous+Catalytic+Hydrogenation+for+Organic+Sy","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"608a97c119ab02340012f17102ad3917021cdd8b","infoHashBuffer":{"type":"Buffer","data":[96,138,151,193,25,171,2,52,0,18,241,113,2,173,57,23,2,28,221,139]},"announce":[],"urlList":[]}}