{"title":"Carach Angren - This Is No Fairytale (2015)ak ","uid":11709551,"size":63838476,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:608ccf5c5ef0aff5b4e7a1e507644ef97e802923&amp;dn=Carach+Angren+-+This+Is+No+Fairytale+%282015%29ak+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"analogkid6103","files":10,"time":1424272124,"description":"\nTracklist:\n\n1.Once upon a Time...\n2.There's No Place like Home\n3.When Crows Tick on Windows\n4.Two Flies Flew into a Black Sugar Cobweb\n5.Dreaming of a Nightmare in Eden\n6.Possessed by a Craft of Witchery\n7.Killed and Served by the Devil\n8.The Witch Perished in Flames\n9.Tragedy Ever After\n\nmp3, 192 Kbps\n\nCarach Angren is a symphonic black metal band from the Netherlands, formed by two members of the now-defunct band Vaultage. They have three steady members with previously frequent guest appearances for the violin parts. Their style is characterized by prominent use of orchestral arrangements. All of their studio albums are concept albums with lyrics based on ghost stories and folk lore, such as Flying Dutchman. They set themselves apart from other symphonic black metal artists in showcasing songs often using multiple languages apart from English, such as French, German and Dutch, though every song does use English as a baseline and certain choruses or sections will make the transition.\n\nThe name means &quot;Iron Jaws&quot; in the Elvish language of Sindarin, and is the name of a fortified pass into North-Western Mordor in J. R. R. Tolkien's The Lord of the Rings.\n\nThe Dutch masters of horror are back! CARACH ANGREN will take you to the hell of war with their mind blowing third full-length &quot;Where The Corpses Sink Forever&quot;. With bold strokes of eerily shimmering and whirring guitars, scratching dashes of fiercely rasping vocals, dabs of precisely rattling drums and a wide palette of grey and black sound hues, the trio creates dark portraits of supernatural landscapes that rival the masterful craftsmanship of Rembrandt, Bruegel and Vermeer in their vivid imagery and depth of detail. What started in the year 2004 with the paranormal cases of demo &quot;The Chase Vault Tragedy&quot; and soon after the &quot;Ethereal Veiled Existence&quot; EP (2005) quickly turned into the full blown local haunting of &quot;Lammendam&quot; (2008), which was followed by a stormy journey onboard a cruel ghost vessel entitled &quot;Death Came Through A Phantom Ship&quot; (2010). Although their music is clearly based on Black Metal, CARACH ANGREN developed a style on their own, more flamboyant and openly theatrical, which perfectly fits the cinematic horror concepts of the Dutch. This originality has been well received by critics and fans alike right from the beginning and CARACH ANGREN also gained a reputation as an excellent live act. Now it is time to open a new and even darker chapter with &quot;Where The Corpses Sink Forever&quot;. Let these ghosts of war drag you under their irresistible spell!\nSharing Widgetonsxa","torrent":{"xt":"urn:btih:608ccf5c5ef0aff5b4e7a1e507644ef97e802923","amp;dn":"Carach+Angren+-+This+Is+No+Fairytale+%282015%29ak+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"608ccf5c5ef0aff5b4e7a1e507644ef97e802923","infoHashBuffer":{"type":"Buffer","data":[96,140,207,92,94,240,175,245,180,231,161,229,7,100,78,249,126,128,41,35]},"announce":[],"urlList":[]}}