{"title":"GirlsWay: Riley Reid, Melissa Moore (Twinning 2 Part Two) 09.08","uid":15789052,"size":541783463,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:60bbd78320ba1cdce94d7a816a208d57042b7f13&amp;dn=GirlsWay%3A+Riley+Reid%2C+Melissa+Moore+%28Twinning+2+Part+Two%29+09.08&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":3,"uploader":"EndYou","files":1,"time":1473366772,"description":"... : More exclusive porn at : ...\r\n    https://thepiratebay.org/user/EndYou\r\n\r\n          ... : Screenshots : ... \nhttp://imgpremium.com/img-57d1aedd592fc.html  \nhttp://imgpremium.com/img-57d1aeddb7a4d.html \r\n\r\nMelissa Moore seems hellbent on stealing her identity, but not only that, her girlfriend Capri Anderson. When Melissa returns home unlocking the door to the bathroom and finally freeing Riley, she gives he back her phone and keys and dress, making up excuses for the whole thing. Riley's on to her tricks, and calls up Capri, finding out that Melissa posed as her and hung out with Capri all day! Riley is furious and comes up with a plan to get back at Melissa. Capri is obviously in on the prank when she calls up Melissa, claiming that she's never been touched like that before, and she knows it wasn't Riley who came over. Melissa is surprised to hear that Capri is more interested in her, but takes the bait, showing up at Capri's to fuck her once again. Only this time Riley is waiting in the sidelines to make the first moves, once Melissa has her eyes closed. Capri directs the whole thing from the foot of the bed, making Melissa feel Riley's ass and kiss her on the mouth. Before long they out themselves and threaten Melissa with some serious ruin. When Melissa begs not to be ruined on the internet she begs for Riley to be sympathetic. Riley tells Melissa that for revenge, Melissa will have to lick her pussy. Riley takes charge taking off Melissa's dress and groping her little tits before licking them with serious hunger for her step sister. Melissa expertly shows Riley what her lesbian hunger can lead to, eating out her wet pussy as Riley sits on her face. After some 69 and some tribbing their wet horny pussies give them some of the most incredible orgasms they've ever had. Besides who doesn't find the thought of having lesbian sex with yourself tantalizing?\r\n\r\nMPEG4 Video (H264) 960x544","torrent":{"xt":"urn:btih:60bbd78320ba1cdce94d7a816a208d57042b7f13","amp;dn":"GirlsWay%3A+Riley+Reid%2C+Melissa+Moore+%28Twinning+2+Part+Two%29+09.08","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60bbd78320ba1cdce94d7a816a208d57042b7f13","infoHashBuffer":{"type":"Buffer","data":[96,187,215,131,32,186,28,220,233,77,122,129,106,32,141,87,4,43,127,19]},"announce":[],"urlList":[]}}