{"title":"[3DS] Metal Gear Solid: Snake Eater 3D EUR - CONTRAST","uid":10793010,"size":3361754961,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:60bc7122b9653d7d3990aba9031c5b2b2fdb2b3e&amp;dn=%5B3DS%5D+Metal+Gear+Solid%3A+Snake+Eater+3D+EUR+-+CONTRAST&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":5,"uploader":"Varnuunas","files":-1,"time":1408272735,"description":"Metal Gear Solid 3D: Snake Eater Description\n\nOctober 16, 1962. The President of the United States received word that the Soviet Union had deployed nuclear missiles in Cuba. The world trembled in fear as the prospect of nuclear war loomed ever closer. After days of tense negotiations, the Soviets finally agreed on the 28th to withdraw their missiles from Cuban soil. With the resolution of this incident, later to be known as the Cuban Missile Crisis, it seemed that humanity had survived yet another threat to its existence. However, there was a secret condition in the deal that put an end to the crisis. Nokolai Stepanovich Sokolov, a Soviet scientist who had defected to the West, was to be sent back to the Soviet Union. The U.S. government agreed to this stipulation, and returned Sokolov back to his native land. Little did they know that Sokolov was to be the designer of a nightmarish weapon. Now, with Sokolov back in their hands, the Soviets are ready to resume its development. If this weapon is completed, it will mark the beginning of a new age of fear. August 1964. Realizing at last the urgency of the situation, the CIA forms a plan to recapture Sokolov. They dispatch the covert FOX unit to Sokolov's research facility, located to the south of the great Soviet fortress of Groznyj Grad. Led by former SAS member Major Zero, FOX is a next-generation special-forces unit that operates both as a specialized combat group and as a covert intelligence outfit. The FOX unit's modus operandi is to send a single agent, backed by radio support from afar, into enemy territory to carry out solo sneaking missions. August 24. A lone soldier swoops down from out of the blue. The man's code name is Naked Snake.\n\nSize 4.12 GB Unpacked.\n\nNot tested. Should work with GATEWAY.","torrent":{"xt":"urn:btih:60bc7122b9653d7d3990aba9031c5b2b2fdb2b3e","amp;dn":"%5B3DS%5D+Metal+Gear+Solid%3A+Snake+Eater+3D+EUR+-+CONTRAST","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60bc7122b9653d7d3990aba9031c5b2b2fdb2b3e","infoHashBuffer":{"type":"Buffer","data":[96,188,113,34,185,101,61,125,57,144,171,169,3,28,91,43,47,219,43,62]},"announce":[],"urlList":[]}}