{"title":"Band of Brothers [2001] BDrip 720p Multi-Subs-Audio [MP4-AAC](oa","uid":9949709,"size":22795906172,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:60ee01bcad4ee8e752c7cb56bf8d365d0d5adf53&amp;dn=Band+of+Brothers+%5B2001%5D+BDrip+720p+Multi-Subs-Audio+%5BMP4-AAC%5D%28oa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":4,"uploader":"oneanight","files":-1,"time":1397378459,"description":"\n\nBand of Brothers [2001] BDrip 720p Multi-Subs-Audio [MP4-AAC](oan)\n &lt;a href=&quot;\nhttp://image.geotorrents.com/images/64963970174834253110.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.geotorrents.com/images/64963970174834253110.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgbox.com/guAyb3d0&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgbox.com/guAyb3d0&lt;/a&gt;\n\nBand of Brothers, a ten-[Part television World War II miniseries based\non the book of the same title written by historian and biographer\nStephen Ambrose, was executive produced by Steven Spielberg and Tom\nHanks after their collaboration on the World War II film Saving\nPrivate Ryan [1998]. The episodes first aired in 2001 on HBO and are\nstill run frequently on various TV networks around the world.\n\nThe narrative centers on the experiences of E Company [&quot;Easy Company&quot;]\nof the 2nd Battalion, 506th Infantry Regiment assigned to the 101st\nAirborne Division of the United States Army. The series covers Easys\nbasic training at Toccoa, Georgia, the American airborne landings in\nNormandy, Operation Market Garden, the Battle of Bastogne and on to\nthe end of the war.\n\nThe events portrayed are based on Ambrose's research and recorded\ninterviews with Easy Company veterans. A large amount of literary\nlicense was taken with the episodes, and other reference books will\nhighlight the differences between recorded history and the film\nversion. All of the characters portrayed are based on actual members\nof Easy Company; some of them can be seen in prerecorded interviews\nas a prelude to each episode [their identities, however, are not\nrevealed until the final episode although throughout the series,\nthe men refer to each other by nicknames or their last names].\nSpielberg and Hanks produced a sequel miniseries called The Pacific\nthat premiered in March 2010\n\n[Part 1]\n\nCurrahee\n\nIn 1942, men from across the USA are in Camp Toccoa, Georgia to\nundergo paratrooper training. For the men of 'E' Easy Company the\ntraining is [Particularly difficult as a result of their demanding\ncommander, Captain Herbert Sobel. He drives them incessantly to excel,\ncanceling their weekend passes on a whim. His favorite chore is to\nhave the men undertake a run up a hill known as Currahee. While the\nmen are fit and ready for battle, thanks to Sobel, he has unfortunately\nshown himself to be a weak tactical commander. Once in England, and\nknowing they will soon be ...\n\n[Part 2]\n\nDay of Days\n\nIn the very early hours of the D-Day invasion, Easy Company along with\nthousands of other Allied paratroopers land behind enemy lines in\nNormandy. In the chaos of the jump however, they are spread far and\nwide with many landing far from their expected drop zone. Lt. Winters\nassembles the few men they can find and slowly make their way to their\nrendezvous point. As the men straggle in, they also must adjust such\nas when Malarkey meets a German soldier who grew up in Oregon. Easy's\nCompany commander is still missing so Winters is left in charge and\nis ordered to take ...\n\n[Part 3]\n\nCarentan\n\nEasy Company's next objective is to take the town of Carenten where\nthey engage in street to street fighting with a doggedly determined\nenemy. The fighting is hard and there are many casualties. Having\npushed the Germans out, Easy Company now has to hold the position and\nsoon face a counter-attack from German forces, including artillery\nand tanks. For Pvt. Albert Blythe, the pressure and stress pushes him\nto the breaking point. He even suffers from hysterical blindness but\nsoon recovers with a few words of encouragement from Winters. After\n36 days in battle, Easy ...\n\n[Part 4]\n\nReplacements\n\nEasy Company's stay in England is far too short when they are ordered\nto [Participate in operation Market Garden. This major engagement is to\nthrust north into Holland seizing the bridges along the way with a view\nto giving the Allies a clear route into Germany. The men of Easy Company\nare told that they will be leaving for good and they parachute into near\nEindhoven, where they get a huge welcome from the war-weary population.\nWith significant losses in Normandy invasion, Easy also has to welcome\nnew recruits who, in the eyes of the now veteran combat soldiers who ...\n\n[Part 5]\n\nCrossroads\n\nCaptain Winters leads Easy Company in an attack on what they thought\nwas a machine gun nest but turns out to 2 Companies of German SS who\nalso have artillery support. The attack is successful in that they\nvirtually wipe out the enemy but they do suffer many casualties. He\nsoon finds himself promoted as the 2nd Battalion's Executive Officer\nand while he has concern about leaving Easy Company, he knows they are\nin good hands with Lt. Moose Heyliger. In the aftermath of the\ndisastrous Operation Market Garden, Easy Company is assigned to\nassist a large group of British\n\n[Part 6]\n\nBastogne\n\nIt's a cold, harsh Christmas 1944 for the men of Easy Company as they\ntry to hold the line around Bastogne against attacking German forces.\nThey have no winter clothing, limited rations and little ammunition.\nFor Eugene Rowe, one of the medics, the problem is getting basic\nmedical supplies. He's been scrounging what he can, but it simply\nisn't enough. He's managed to get supplies from a pretty French nurse\nin Bastogne, Renee, but as the casualties mount, he finds himself\nlacking even the most basic supplies. The men of Easy Company are\nleft on their own much of the ...\n\n[Part 7]\n\nThe Breaking Point\n\nEasy Company is still in the Ardennes forest but the Germans are\nin retreat. The men are cold and living in foxholes knowing that\nthey will likely be ordered to try and take the town. The Germans\nhave been pushed back to the town of Foy but they are well\npositioned and have heavy artillery. Their artillery barrages take\na heavy toll and several of the veterans of Easy Company are\nseverely wounded including Bill Guarnere and Joe Toye. Those injuries\nhave a [Particularly heavy impact on their good friend,\nLt. Buck Compton. When the attack does come, Easy Company is led ...\n\n[Part 8]\n\nThe Last Patrol\n\nIt's February 1945 and a depleted Easy Company is now in Haguenau,\nFrance on the Rhine just across from Germany. Pvt. David Webster,\nwho was injured during Operation Market Garden, returns to the\nCompany but finds that his absence from the fighting in Bastogne\nhas alienated the others and he is treated as an outsider.\nThe Company also has a new junior officer, Lt. Henry Jones, a West\nPoint graduate who has yet to get any battlefield experience.\nThe war is clearly coming to an end and the men are starting to\nthink they might just survive the war. When Colonel Cink\n\n[Part 9]\n\nWhy We Fight\n\nThe men of Easy Company are now in Germany, aware that the Germans\nare surrendering by the thousands and that the war is winding down.\nWith more time to reflect, some of the men are wondering if it was\nall worth it and begin to question whether the sacrifices they and\ntheir absent colleagues have made were worth it. That question is\nanswered when they come across a concentration camp and they see\nfirst hand the atrocities committed by the Nazis. Captain Nixon has\nreturned from a jump behind enemy lines that did not go well and\nresulted in many deaths. He's drinking ...\n\n[Part 10]\n\nPoints\n\nIt's May 1945 and Easy Company finds itself the first Allied troops\nto enter Berchtesgarden, Hitler's Bavarian retreat. They find the\nvillage virtually empty with only a few people working in the hotel.\nThey're there only a short time when they get the news they've been\nwaiting for: the German army surrenders and the war in Europe is over.\nFor those with enough service, it means a trip home while the rest\ncontinue to train for an eventual transfer to the war in the Pacific.\nFor others still, tragedy still awaits. The men of the 101st all\nhave varied futures ahead of ...\n\n\nCredited in the opening in seven episodes or fewer are:\n\nDale Dye as Colonel [eventually Lieutenant General] Robert F. Sink [7 episodes]\nMichael Fassbender as Technical Sergeant Burton &quot;Pat&quot; Christenson [7 episodes]\nFrank John Hughes as Staff Sergeant William &quot;Wild Bill&quot; Guarnere [7 episodes]\nTim Matthews as Private First Class Alex Penkala [7 episodes]\nRene L. Moreno as Technician Fifth Grade Joseph Ramirez [7 episodes]\nDouglas Spain as Technician Fifth Grade Antonio C. Garcia [7 episodes]\nRichard Speight, Jr. as Sergeant Warren &quot;Skip&quot; Muck [7 episodes]\nKirk Acevedo as Staff Sergeant Joseph Toye [6 episodes]\nEion Bailey as Private First Class David Kenyon Webster [6 episodes]\nCraig Heaney as Private Roy W. Cobb [6 episodes]\nJamie Bamber as Second Lieutenant Jack E. Foley [3 episodes]\nRocky Marshall as Corporal Earl 'One Lung' McClung [3 episodes]\nEarlPeter O'Meara as First Lieutenant EarlNorman Dike [3 episodes]\nEarlDavid Schwimmer as Captain Herbert Sobel [3 episodes]\nMarc Warren as Private Albert Blithe [3 episodes]\nStephen Graham as Sgt. Myron &quot;Mike&quot; Ranney [2 episodes]\nColin Hanks as First Lieutenant Henry Jones [2 episodes]\nTom Hardy as Private John Janovec [2 episodes]\nSimon Pegg as First Sergeant William S. Evans [2 episodes]\nAlex Sebga as Corporal Francis J. Mellet [2 episodes]\nLuke Griffin as Staff Sergeant Terrence 'Salty' Harris [1 episode]\nJames McAvoy as Private James W. Miller [1 episode]\n\n\nFORMAT.......................: MP4\nCODEC........................: X264\nGENRE........................: Action | Drama | History | War\nFILE SIZE....................: 21:2GB\nRESOLUTION...................: 1280*720=16:9\nFRAME RATE...................: 29.970 fps\nLANGUAGE.....................: English 6 chan 447 Kbps AAC/French 2 chan 192 Kbps ac3/Spanish 2 chan 192 ac3\nSUBTITLES....................: English / French / Spanish / Portuguese\nRUNTIME......................: 705 minutes\n\nPLEASE SEED  -  PLEASE SHARE  -  PLEASE UPLOAD\n &lt;a href=&quot;\nhttp://image.geotorrents.com/images/53797541523130737021.gif&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.geotorrents.com/images/53797541523130737021.gif&lt;/a&gt;\n\n\n\n","torrent":{"xt":"urn:btih:60ee01bcad4ee8e752c7cb56bf8d365d0d5adf53","amp;dn":"Band+of+Brothers+%5B2001%5D+BDrip+720p+Multi-Subs-Audio+%5BMP4-AAC%5D%28oa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60ee01bcad4ee8e752c7cb56bf8d365d0d5adf53","infoHashBuffer":{"type":"Buffer","data":[96,238,1,188,173,78,232,231,82,199,203,86,191,141,54,93,13,90,223,83]},"announce":[],"urlList":[]}}