{"title":"Modest Mouse - Discography 1996-2009 [FLAC]","uid":8612141,"size":4205933329,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:619a4c885925d553c8de221278522db392c2f762&amp;dn=Modest+Mouse+-+Discography+1996-2009+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":3,"uploader":"rudown78","files":272,"time":1372165714,"description":"Modest Mouse - Discography 1996-2009 [FLAC]\n\n\nModest Mouse were one of the most surprising commercial success stories of the new millennium -- while their music was by turns taut and elliptical, and the lyrics sometimes cryptic and introspective, the band broke through to the mainstream audience with the platinum-selling Good News for People Who Love Bad News, and they became genuine rock stars at a time when their musical peers remained cult figures. Modest Mouse was founded in 1993 by guitarist and vocalist Isaac Brock, bassist Eric Judy, and drummer Jeremiah Green. Brock, who had a nomadic childhood, was only 18 and living in a shed next to his mother's trailer home when Modest Mouse began working together, with the shed becoming the new band's rehearsal space and base of operations. In 1994, Modest Mouse booked time at Calvin Johnson's Dub Narcotic Studio in Olympia, Washington to cut their first record, and Johnson released their debut 7&quot;, &quot;Blue Cadet-3, Do You Connect?,&quot; on his K Records label. Modest Mouse soon began work on an album, but the project was abandoned and the material went unreleased until 2001, when it appeared on a collection called Sad Sappy Sucker.\n\nAfter releasing a handful of singles, Modest Mouse went into the studio with Johnson as producer to record an EP, The Fruit That Ate Itself, but by the time it was released, the group had already moved on to another Northwest-based indie label, Up Records. 1996's This Is a Long Drive for Someone with Nothing to Think About, produced in collaboration with Steve Wold (who would find fame a few years later as grizzled blues hobo Seasick Steve), was Modest Mouse's first proper album, and received enthusiastic reviews in the independent music press. In 1997, Modest Mouse returned with The Lonesome Crowded West, which earned more positive press and was a considerable sales success by indie label standards, supported by extensive touring. As Modest Mouse's following grew, they were courted by major-label scouts, and they eventually signed with Epic Records, who released The Moon &amp; Antarctica in 2000. A collection of demos and session outtakes, Everywhere and His Nasty Parlour Tricks, was issued in 2001, and Brock released an album with his side project Ugly Casanova in 2002. In 2003, it was announced that drummer Green had left Modest Mouse; Benjamin Weikel of the Helio Sequence became the group's new percussionist (he also doubled on keyboards), and Dann Gallucci, who had been a guest guitarist on the sessions for Sad Sappy Sucker and The Lonesome Crowded West, became an official member of the band.\n\nThe new lineup recorded 2004's Good News for People Who Love Bad News, which proved to be Modest Mouse's commercial breakthrough, rising to the top of the album charts, spawning the hit singles &quot;Float On&quot; and &quot;Ocean Breathes Salty,&quot; and selling over a million copies as the band began headlining arenas. By the end of 2004, Green returned to Modest Mouse, and in 2006, after Gallucci left the group, the band recruited Johnny Marr, legendary guitarist with the Smiths, to take his place for the recording of their next album. Marr not only appeared on 2007's We Were Dead Before the Ship Even Sank, he became a full member of Modest Mouse and toured with the group in support of the album, which debuted at number one on the Billboard album charts. In 2005, Brock had launched his own record label, Glacial Pace Records, saying the name reflected his own slow working habits; while Modest Mouse continued to play live shows, work on their next album progressed very gradually, and in 2009 they issued a collection of outtakes and non-LP single sides, No One's First, And You're Next, as a stopgap. A tour was launched in support, but as Marr had joined the Cribs, Jim Fairchild (who had worked with Grandaddy and All Smiles) became the group's new guitarist, and when Modest Mouse played a round of shows in 2012, the group debuted a new lineup with the addition of second percussionist Joe Plummer. While Eric Judy was still an official member of the band, for some 2012 dates he was replaced by multi-instrumentalist Tom Peloso, who had been touring with the group as a sideman since 2004. \n\n\n1996 - Interstate 8\n1996 - This Is a Long Drive for Someone with Nothing to Think About\n1997 - The Fruit That Ate Itself\n1997 - The Lonesome Crowded West\n2000 - Building Nothing Out of Something\n2000 - The Moon &amp; Antarctica\n2001 - Everywhere and His Nasty Parlour Tricks\n2001 - Sad Sappy Sucker\n2002 - Sharpen Your Teeth [Ugly Casanova]\n2004 - Good News for People Who Love Bad News\n2007 - We Were Dead Before the Ship Even Sank\n2009 - No One's First, and You're Next\n\n\nAlbum artwork and and audiochecker logs are included. Enjoy!!!!!!!!!!!!!!!!!!!!!","torrent":{"xt":"urn:btih:619a4c885925d553c8de221278522db392c2f762","amp;dn":"Modest+Mouse+-+Discography+1996-2009+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"619a4c885925d553c8de221278522db392c2f762","infoHashBuffer":{"type":"Buffer","data":[97,154,76,136,89,37,213,83,200,222,34,18,120,82,45,179,146,194,247,98]},"announce":[],"urlList":[]}}