{"title":"OSCEs for Medical and Surgical Finals [PDF [StormRG]","uid":11009659,"size":2978537,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:61bfc061ae16a78e97bbf6046cd0e4f36c101ee6&amp;dn=OSCEs+for+Medical+and+Surgical+Finals+%5BPDF+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":4,"uploader":"0xmovva","files":2,"time":1410332160,"description":"Author: Shabana Bora (Author), Theresa Heah (Author), Shivangi Thakore (Author)\nSeries: Hodder Arnold Publication\nPaperback: 160 pages\nPublisher: CRC Press; 1 edition (May 27, 2005)\nLanguage: English\nISBN-10: 0340815892\nISBN-13: 978-0340815892\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n________________________________________________________________________________\n\n\nThroughout the UK, and elsewhere, medical schools are focusing more on objective structured clinical examinations (OSCEs) and veering away from old style medical and surgical finals. OSCEs for Medical and Surgical Finals takes a systematic approach to preparing for these new exams, giving you crucial insights into how to score well.\n\nWritten by junior doctors who recently sat the exams, this book will show you how to predict and prepare for the stations you will face. As it leads you through the cases and the examiners' mark sheets, it teaches you how to pick up every point, with extra tips on how to impress and where to go to add to your practice and experience. For overseas doctors, this book also provides essential preparation for the clinical component of the PLAB exam. \n\nKey features:\n\n* Exam focused, with key tips on how to prepare and excel on exam day\n\n* Chapters on practical skills, communication, chronic disease management, discharge planning, psychiatric histories, focused history and management, and examination\n\n* Packed with real OSCE scenarios and model mark sheets\n\nOSCEs for Medical and Surgical Finals is an essential book for all medical students and PLAB candidates.","torrent":{"xt":"urn:btih:61bfc061ae16a78e97bbf6046cd0e4f36c101ee6","amp;dn":"OSCEs+for+Medical+and+Surgical+Finals+%5BPDF+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61bfc061ae16a78e97bbf6046cd0e4f36c101ee6","infoHashBuffer":{"type":"Buffer","data":[97,191,192,97,174,22,167,142,151,187,246,4,108,208,228,243,108,16,30,230]},"announce":[],"urlList":[]}}