{"title":"Lightning Bolt - Earthly Delights (2009)","uid":5071266,"size":123625636,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6275c35f570d5ca194a6bb2bc59b120d99a47eac&amp;dn=Lightning+Bolt+-+Earthly+Delights+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"Baphom3t","files":10,"time":1251426060,"description":"Lightning Bolt is a noise rock duo from Providence, Rhode Island, composed of Brian Chippendale on drums and vocals and Brian Gibson on bass guitar. The band met and formed in 1994, when the members of the then-trio attended the Rhode Island School of Design. The band signed to Load Records in 1997, and released their self-titled debut the same year. In total, Lightning Bolt has released four full-length albums, numerous vinyl singles, and appeared on several compilations.\n\nLightning Bolt are known for their guerrilla-style live performances, where they typically play on the ground rather than a stage, with the crowd gathered around them. The band's sound is typically loud and aggressive, though the group cites composers Philip Glass and Sun Ra as compositional influences.\n\nThe band formed while Chippendale and Gibson attended the Rhode Island School of Design in Providence, Rhode Island, and Chippendale had heard about &quot;a new kid&quot; who was a whiz on the bass guitar.The two formed Lightning Bolt, with Brian Chippendale on drums, Brian Gibson on bass guitar, and with Hisham Bharoocha on guitar and vocals joining the group after their first show.Bharoocha left the group in 1996, with Chippendale taking over vocal duties. The only officially released music with Bharoocha was a track on the Repopulation Program compilation.For the first few years, Lightning Bolt was primarily an improvisational band, touring the United States for months at a time and &quot;just playing&quot;.The concept of writing songs and recording an album didn't occur to the band until 1997, when Ben McOsker, founder of Load Records, approached the duo to record an album.\n\nDuring these formative years, Chippendale and his freshman-year college roommate Matt Brinkman began to set up Fort Thunder, a disused warehouse space in the Olneyville district of Providence. The space eventually came to house a number of local avant-garde artists and musicians, including Brian Ralph as well as Lightning Bolt.\n\nIn 2006, Lightning Bolt was deported from Japan days after they arrived to continue their tour from the UK. Band members were detained on arrival on the grounds that they did not have work permits. Their official appeal was rejected after 48 hours, and they were deported back to the United States.\n\n\nCurrent line-up\nBrian Chippendale - Drum &amp; Vocals\nBrian Gibson - Bass\n\nGenre = Expierimental / Noise Rock / Avant-Garde\nFormat = Mp3\nBit Rate = 320 kbps\n\nTrack Listing\n1.Sound Guardians\n2.Nation of Boar\n3.Colossus\n4.The Sublime Freak\n5.Flooded Chamber\n6.Funny Farm\n7.Rain on Lake I'm Swimming In\n8.S.O.S.\n9.Transmissionary","torrent":{"xt":"urn:btih:6275c35f570d5ca194a6bb2bc59b120d99a47eac","amp;dn":"Lightning+Bolt+-+Earthly+Delights+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6275c35f570d5ca194a6bb2bc59b120d99a47eac","infoHashBuffer":{"type":"Buffer","data":[98,117,195,95,87,13,92,161,148,166,187,43,197,155,18,13,153,164,126,172]},"announce":[],"urlList":[]}}