{"title":"Across Atlantic Ice: The Origin of America's Clovis Culture","uid":15736543,"size":6129879,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:629dda0743cc93e148536199f2612d88721eac1c&amp;dn=Across+Atlantic+Ice%3A+The+Origin+of+America%27s+Clovis+Culture&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"marty14","files":1,"time":1472848215,"description":"Who were the first humans to inhabit North America? According to the now familiar story, mammal hunters entered the continent some 12,000 years ago via a land bridge that spanned the Bering Sea. Distinctive stone tools belonging to the Clovis culture established the presence of these early New World people. But are the Clovis tools Asian in origin? Drawing from original archaeological analysis, paleoclimatic research, and genetic studies, noted archaeologists Dennis J. Stanford and Bruce A. Bradley challenge the old narrative and, in the process, counter traditional—and often subjective—approaches to archaeological testing for historical relatedness. The authors apply rigorous scholarship to a hypothesis that places the technological antecedents of Clovis in Europe and posits that the first Americans crossed the Atlantic by boat and arrived earlier than previously thought. Supplying archaeological and oceanographic evidence to support this assertion, the book dismantles the old paradigm while persuasively linking Clovis technology with the culture of the Solutrean people who occupied France and Spain more than 20,000 years ago","torrent":{"xt":"urn:btih:629dda0743cc93e148536199f2612d88721eac1c","amp;dn":"Across+Atlantic+Ice%3A+The+Origin+of+America%27s+Clovis+Culture","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"629dda0743cc93e148536199f2612d88721eac1c","infoHashBuffer":{"type":"Buffer","data":[98,157,218,7,67,204,147,225,72,83,97,153,242,97,45,136,114,30,172,28]},"announce":[],"urlList":[]}}