{"title":"Trophy Scars - Holy Vacants (2014) 320kbps","uid":9966486,"size":133439169,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:62e629ec280134bc697dc50104a67a2be498a367&amp;dn=Trophy+Scars+-+Holy+Vacants+%282014%29+320kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"santicaz","files":12,"time":1397577027,"description":"Artist: Trophy Scars\nTitle Of Album: Holy Vacants\nYear Of Release: 2014\nLabel: Monotreme Records\nGenre: Post-Rock\nQuality: 320kbps\nTotal Time: 55:29 min\nTotal Size: 127 MB\n\nTracklist:\n\n1. Extant\n2. Qeres\n3. Archangel\n4. Crystallophobia\n5. Burning Mirror\n6. Hagiophobia\n7. Chicago Typewriter\n8. Vertigo\n9. Gutted\n10. Every City, Vacant\n11. Everything Disappearing\n12. Nyctophobia\n\nLimited pressing deluxe 180 gm double gatefold edition with a free poster and album CD included inside: 750 copies clear with blue with black marble and 250 random black vinyl. Holy Vacants, the fourth album from Trophy Scars, sees the New Jersey quartet deliver their magnum opus as they continue to evolve their sound. The album was initially worked up as a 35-page screenplay by vocalist/lyricist Jerry Jones and is even more ambitious than 2011's Never Born Never Dead, which took reincarnation as its theme. Holy Vacants uses as its springboard a bizarre cocktail of mythology, ancient religion, and conspiracy theory surrounding the Nephilitic gene. The album revolves around Jones's tale of two lovers who have discovered not only that the blood of angels contains the fountain of youth, but also the formula for Qeres. This ancient Egyptian perfume is claimed to be the only substance that can kill angels and Nephilites, who are the supposed offspring of angels/human unions. Armed with this knowledge, the couple embark on a killing spree, drinking spilled Nephilitic blood to stop growing old. The narrative may be conceptually out-there, but it doesn't fence the album in and stands as a metaphor for far simpler and more widely recognized issues the idealization of youth, loss of identity and corrupted innocence. It's also Jones' personal way of drawing a line under an intense past relationship: The album was about being so in love with somebody that they literally destroy you, he explains. I had to write the album as a way of exorcising this person from my mind and soul. I wanted a Bonnie and Clyde-type story, because I've always loved that. There's something beautiful about the idea of rebelling together against something and losing yourself in the rebellion to the extent that it destroys your life. It s the doomed romanticism thing. Holy Vacants was intended the band's final album , but instead constitutes a complete rebirth. I thought we had one more record in us and we wanted to go out with a bang ,says Jones. Guitarist Ferrara, who Jones calls an unbelievable composer , sent the singer some bare-bones riffs and he found himself connecting with them immediately, hearing how they might work with strings here, a Moog and organ, maybe some brass and an all-girl choir there. And listening to the likes of opener Archangel and Qeres , with its free-wheeling but complex and cathartic, psychedelic blues, it's obvious the band have moved light years away from their post-hardcore early years. They reveal their admiration for fellow New Jersey son Springsteen, circa Darkness on the Edge of Town with Crystallophobia , Everything Disappearing and Extant , and for Jimi Hendrix via Hagiophobia , while elsewhere there are echoes of Guns N' Roses and The Mars Volta. But what might sound like an unworkable agglomeration of disparate parts is an intense and cohesive, hugely compelling whole, with powerful contrasts that make for a visceral immediacy.","torrent":{"xt":"urn:btih:62e629ec280134bc697dc50104a67a2be498a367","amp;dn":"Trophy+Scars+-+Holy+Vacants+%282014%29+320kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62e629ec280134bc697dc50104a67a2be498a367","infoHashBuffer":{"type":"Buffer","data":[98,230,41,236,40,1,52,188,105,125,197,1,4,166,122,43,228,152,163,103]},"announce":[],"urlList":[]}}