{"title":"Pier Paolo Pasolini - Ragazzi di Vita [PDF - ITA] [TNT Village]","uid":5554870,"size":793022,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6332ffac9f3dae5dcaee9c9bbd675ce01f952c59&amp;dn=Pier+Paolo+Pasolini+-+Ragazzi+di+Vita+%5BPDF+-+ITA%5D+%5BTNT+Village%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"l.diliberto","files":1,"time":1273658067,"description":" &lt;a href=&quot;http://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=20331&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=20331&lt;/a&gt;\n\n[img]http://www.tecalibri.info/P/I/PASOLINI_ragazzi1.jpg[/img]\n\nAl termine di Ragazzi di Vita non rimane quella sensazione di soddisfazione che in genere si prova quando si finisce di leggere un romanzo distensivo, rilassante e coinvolgente; la sensazione che rimane ÃƒÂ¨, piuttosto, di malessere e tristezza: quelli che ne Il Sogno di una Cosa erano ragazzi di campagna semplici e schietti, in compagnia dei quali si trascorrevano ore tranquille, oltre che momenti piÃƒÂ¹ difficili, in quest'altro romanzo sono adolescenti della periferia di Roma, sottoproletari con alle spalle famiglie sfrattate, ammucchiate insieme ad altre famiglie in stanze e corridoi di edifici fatiscenti.\n\nIl romanzo racconta le loro giornate trascorse alla ricerca di soldi e passatempi. Sono personaggi emarginati dalla cittÃƒÂ  normale e rispettabile, non integrati in un contesto sociale di lavoro o scuola: la strada ÃƒÂ¨ il loro spazio e la loro scuola. Una delle sensazioni piÃƒÂ¹ immediate, durante la lettura, ÃƒÂ¨ che si stia assistendo alla storia di adolescenti che non sono mai stati bambini. In loro non c'ÃƒÂ¨ la voglia di giocare innocentemente, nessuno di loro ÃƒÂ¨ ingenuo; l'unico ad avere qualcosa in comune con la figura del bambino, Marcello, muore quasi subito, proprio nel momento in cui va a cercare il Riccetto, suo migliore compagno di avventure.\n\nLa strafottenza, la tracotanza, la malizia e la prepotenza sono talmente naturali da sembrare quasi congeniti; non esistono rapporti umani basati sull'amicizia, sui vincoli familiari o d'amore. La povertÃƒÂ  e la disperazione che regnano in questo romanzo non guardano in faccia a niente e nessuno: per gioco si puÃƒÂ² decidere di bruciare uno del gruppo, per rabbia si puÃƒÂ² reagire accoltellando la propria madre, per necessitÃƒÂ  si rubano i soldi di tasca a un amico con il quale ci si stava divertendo sul fiume poco prima.","torrent":{"xt":"urn:btih:6332ffac9f3dae5dcaee9c9bbd675ce01f952c59","amp;dn":"Pier+Paolo+Pasolini+-+Ragazzi+di+Vita+%5BPDF+-+ITA%5D+%5BTNT+Village%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6332ffac9f3dae5dcaee9c9bbd675ce01f952c59","infoHashBuffer":{"type":"Buffer","data":[99,50,255,172,159,61,174,93,202,238,156,155,189,103,92,224,31,149,44,89]},"announce":[],"urlList":[]}}