{"title":"Curious George (PBS Kids) Season 9 (2014-15)","uid":11824205,"size":1351523205,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:637f85d3369ff30f6f49543b77164e9ca5c35eda&amp;dn=Curious+George+%28PBS+Kids%29+Season+9+%282014-15%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":2,"uploader":"NantoVision","files":6,"time":1429412919,"description":"Curious George is an animated television series based on the Curious George children's book series, which features Jeff Bennett as the voice of The Man with the Yellow Hat. Frank Welker, who voiced George in the 2006 feature film, returns here as the voice of Curious George. The show is currently broadcast on PBS Kids.\n\n\nWhen the show was developed, educational advisers suggested using it to teach science, math, and engineering concepts. Episodes are often structured around a &quot;try-fail&quot; series of incidents, which proved to be a good way to show scientific inquiries. \n\n\nYep, thankfully they are still making new episodes of this show. Here's season 9, which aired between October 2014-April 2015. These were encoded by me, from my digital recordings off my local PBS station.\n\n\nIf you enjoy this torrent, be sure to leave me a comment! And please continue to seed after your download completes, so that others can enjoy this great kids educational show. If people keep seeding, I will continue to post more educational children's shows.\n\nSorry I haven't posted anything new in so long, I actually didn't realize the site had returned yet again. Thanks to Lisa for letting me know! More shows to come","torrent":{"xt":"urn:btih:637f85d3369ff30f6f49543b77164e9ca5c35eda","amp;dn":"Curious+George+%28PBS+Kids%29+Season+9+%282014-15%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"637f85d3369ff30f6f49543b77164e9ca5c35eda","infoHashBuffer":{"type":"Buffer","data":[99,127,133,211,54,159,243,15,111,73,84,59,119,22,78,156,165,195,94,218]},"announce":[],"urlList":[]}}