{"title":"Bertoluccis Novecento 1900 (1976) DVDRip x264 ENG ITA UNCUT","uid":5341532,"size":4422873576,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:642c03ed23e4e372aca8271c0d282b23bbd3eb21&amp;dn=Bertoluccis+Novecento+1900+%281976%29+DVDRip+x264+ENG+ITA+UNCUT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":2,"uploader":"bobdevis","files":-1,"time":1265495948,"description":"Full 315 minutes (uncut) version\n\nEnglish and Italian audio\nEnglish subs\n720x480 resolution\n1400kbps video bw\n\nSet in Italy, the film follows the lives and interactions of two boys/men, one born a bastard of peasant stock (Depardieu), the other born to a land owner (de Niro). The drama spans from 1900 to about 1945, and focuses mainly on the rise of Fascism and the peasants' eventual reaction by supporting Communism, and how these events shape the destinies of the two main characters.\n\nThe original director's cut of the film runs 311 minutes. Alberto Grimaldi, the film's producer, was contractually obligated to deliver a 195-minute version to Paramount Pictures. Bertolucci originally wanted to release the film in two parts, but Grimaldi refused.\n\nGrimaldi then locked Bertolucci out of the editing room, and assembled a 180*minute cut. Bertolucci, horrified at Grimaldi's cut, decided to compromise.[citation needed] His 255-minute version was the one initially released in the United States. In 1987 The Bravo channel broadcast the uncut version with dubbed dialogue. Later in 1991 the film was restored to its original length and shown in a limited release.\n\nWhen Bertolucci released his 311-minute version to theaters the MPAA re-classified the film with an NC-17 rating; the 245-minute American cut, the other version officially available on video in the U.S., still retained its R rating. In 2006, Paramount surrendered the NC-17 rating of the uncut version, then released it as unrated on DVD on December 5, 2006.","torrent":{"xt":"urn:btih:642c03ed23e4e372aca8271c0d282b23bbd3eb21","amp;dn":"Bertoluccis+Novecento+1900+%281976%29+DVDRip+x264+ENG+ITA+UNCUT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"642c03ed23e4e372aca8271c0d282b23bbd3eb21","infoHashBuffer":{"type":"Buffer","data":[100,44,3,237,35,228,227,114,172,168,39,28,13,40,43,35,187,211,235,33]},"announce":[],"urlList":[]}}