{"title":"Sid.Meiers.Starships-RELOADED","uid":11750614,"size":672568733,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:64af176c76dc65bded536a9a8ac62f521844fc33&amp;dn=Sid.Meiers.Starships-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"Tenguken","files":3,"time":1426193720,"description":"               Sid Meier's Starships (c) 2K\n\n03/2015 :..... RELEASE.DATE .. PROTECTION .......: Steam\n      1 :.......... DISC(S) .. GAME.TYPE ........: Strategy\n\nTake command of a fleet of powerful starships in this adventure-driven\nstrategy game from legendary designer Sid Meier. Travel to new worlds,\ncompleting missions to help save and protect the planets and their people\nfrom dangerous Space Pirates, to powerful Marauders and other hostile\nfactions. Build a planetary federation as you strengthen your fleet and\nsecure your homeworld as you attempt to preserve intergalactic peace and\nyour vision of humanity. Set in the universe of Civilization: Beyond Earth\nafter the age of the Seeding, Sid Meier s Starships offers sci-fi/strategy\nfans a full stand-alone game experience that also features\ncross-connectivity with Beyond Earth, expanding the depth of both games.\nSee if you have what it takes to rule the universe!\nFeatures:\n* Tactical Space Combat: Encounter unique tactical challenges in every\nmission, with dynamically generated maps, victory conditions, and foes.\n* Fully Customizable Starships: Create an armada that fits your tactical\nplan with modular spaceship design.\n* Diplomacy, Strategy, and Exploration: Expand the influence of your\nFederation and gain the trust of the citizens of new planets. Use the\nunique abilities of the each planet to enhance your fleet and Federation,\nand keep your opponents in check. Build improvements on worlds to\nincrease the capabilities and resources of your Federation.\n* A Galaxy Of Adventure: Explore the galaxy as you lead your fleet to\ndistant worlds and complete missions to help the citizens of these\nplanets. Fight pirates, protect colony ships, destroy rogue AI, and more.\n* Multiple Paths To Victory: Will you win by conquering the greatest threat\nto the galaxy? Or will you unite a plurality of worlds in your\nFederation? Perhaps you will lead your people to push the frontiers of\nscience. Each choice you make carries consequences on your path to\nvictory.\n\n1. Unrar.\n2. Burn or mount the image.\n3. Install the game.\n4. Copy over the cracked content from the /Crack directory on the image to\nyour game install directory.\n5. Play the game.\n6. Support the software developers. If you like this game, BUY IT!\n\n-----------------------------------------------------------------------------\nLanguages : EN/FR/DE/IT/ES/PL/JP/KR/CN-T/RU","torrent":{"xt":"urn:btih:64af176c76dc65bded536a9a8ac62f521844fc33","amp;dn":"Sid.Meiers.Starships-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64af176c76dc65bded536a9a8ac62f521844fc33","infoHashBuffer":{"type":"Buffer","data":[100,175,23,108,118,220,101,189,237,83,106,154,138,198,47,82,24,68,252,51]},"announce":[],"urlList":[]}}