{"title":"Instinto[dvdrip][spanish]","uid":6591773,"size":706563072,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:64ccb5c0326bc8502fcfc66bd0512cb9231e704b&amp;dn=Instinto%5Bdvdrip%5D%5Bspanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"Black1000","files":-1,"time":1312860596,"description":"Instinto\n\nAÃƒÂ±o: 1999\n\nDuraciÃƒÂ³n: 110 min.\n\nReparto: Anthony Hopkins, Cuba Gooding Jr., Donald Sutherland,Maura Tierney, George Dzundza, John Ashton\n \nGÃƒÂ©nero: Intriga\n\nSinopsis\n\nDentro de la inteligente mente de Ethan Powell (Anthony Hopkins) se esconde un terrible secreto, un profundo misterio no resuelto por su familia, enemistada con ÃƒÂ©l, ni por los agentes de la Ley que le han estado siguiendo y que le han arrestado por una serie de crÃƒÂ­menes ocurridos en las junglas de Ruanda. Con una vasta educaciÃƒÂ³n, la verdad de Powell se oculta tras aÃƒÂ±os de estudio de los gorilas de montaÃƒÂ±a, hasta el punto de haber convivido con ellos en plena naturaleza y haber sido aceptado como uno de los suyos. Ahora, cautivo en una prisiÃƒÂ³n brutal para enfermos mentales con tendencias criminales, Powell, que no ha hablado una sola palabra durante aÃƒÂ±os, es sometido a tratamiento por parte del psiquiatra Theo Caulder (Cuba Gooding, Jr.). La ilimitada ambiciÃƒÂ³n de Caulder le lleva a arriesgar, poniendo su vida al lÃƒÂ­mite, con el fin ÃƒÂºltimo de intentar comprender las acciones de este demente acaparador de titulares. AsÃƒÂ­, ambos hombres se embarcan en un extraordinario viaje, empujados por su insaciable bÃƒÂºsqueda de la verdad, independientemente de su coste.\n\n","torrent":{"xt":"urn:btih:64ccb5c0326bc8502fcfc66bd0512cb9231e704b","amp;dn":"Instinto%5Bdvdrip%5D%5Bspanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64ccb5c0326bc8502fcfc66bd0512cb9231e704b","infoHashBuffer":{"type":"Buffer","data":[100,204,181,192,50,107,200,80,47,207,198,107,208,81,44,185,35,30,112,75]},"announce":[],"urlList":[]}}