{"title":"Stretching &amp; Flexibility (Kit Laughlin)","uid":8233464,"size":55961362,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:650e898f8193e38d22b9daa84b17bbf1fc9d8b3e&amp;dn=Stretching+%26amp%3B+Flexibility+%28Kit+Laughlin%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"filthster4","files":1,"time":1362781663,"description":"Everyone says they need to do more stretching for all sorts of\nreasons, but the most important reason is too-rarely mentioned:\nstretching the right way simply feels great to do and leaves you\nfeeling wonderful.\n\nQuestions remain, though, like: which stretches, done what way, and\nhow often? In Stretching &amp; Flexibility, you will find effective\nexercises for all the usual places people want to stretch: hips,\nhamstrings and legs-apart movements.\n\nIn addition, however, you will find hand, wrist and forearm exercises,\na full range of neck and shoulder exercises (including the\nhard-to-stretch rotator cuff pairs) and a variety of ankle and feet\nexercises. There are even exercises to help you spread your toes and\nstrengthen your arches!\n\nAs well, you will find rotation and backward-bending exercises,\nsideways-bending movements and a large number of unique warm-ups\ntoo. There is an exercise for every muscle of the body, and the\nassociated tendons, ligaments and fascia.\n\nThe book is organised into 16 lessons and begins with very easy-to-do\nmovements. Gradually, the subsequent lessons build on these basic\n'functional units of flexibility', and in time you will find yourself\nbeing able to do the more difficult stretches.\n\nThe Posture &amp; Flexibility system is a combination of three elements:\nwe use the Contract-Relax (C-R) approach in a framework of partial and\ncomplete poses, many of which are partner-based. It is a rapidly\nevolving form being constantly tested and reassessed against two\ncriteria: is it safe? and does it work? The book features:\n\n* 96 stretching exercises, plus warm-up movements\n* exercises presented from very easy to hard\n* exercises for athletes, grouped by sport\n* exercises for the whole body, including hands and feet\n* exercises shown in partner and solo versions\n* over 700 photographs, showing all the essential details\n* full explanations, including what to do in the exercise and how to get in and out of the positions\n* 20 detailed illustrations of key anatomical points\n","torrent":{"xt":"urn:btih:650e898f8193e38d22b9daa84b17bbf1fc9d8b3e","amp;dn":"Stretching+%26amp%3B+Flexibility+%28Kit+Laughlin%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"650e898f8193e38d22b9daa84b17bbf1fc9d8b3e","infoHashBuffer":{"type":"Buffer","data":[101,14,137,143,129,147,227,141,34,185,218,168,75,23,187,241,252,157,139,62]},"announce":[],"urlList":[]}}