{"title":"Victorian Farm  (BBC 2009 - Complete Series)","uid":6512554,"size":4067712564,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:65458d4312abc21b4a03ae7e87f8113452b7d3ce&amp;dn=Victorian+Farm++%28BBC+2009+-+Complete+Series%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"rosie1966","files":7,"time":1309651465,"description":"Victorian Farm is a historical documentary TV series in six parts, first shown on BBC Two in January 2009. It was made for the BBC by independent production company Lion Television [1] and filmed on the Shropshire estate of Acton Scott. The farming team was historian Ruth Goodman and archaeologists Alex Langlands and Peter Ginn. The series was devised and produced by David Upshal and directed by Stuart Elliott.\n\nThe series was one of BBC Two's biggest hits of 2009, garnering audiences of up to 3.8 million per episode. It was also highly praised by reviewers.\n\nThe series recreated everyday life on a small farm in Shropshire in the mid-19th century, using authentic replica equipment and clothing, original recipes and reconstructed building techniques. Much use was made of period sources such as The Book of the Farm: Detailing the Labours of the Farmer, Farm-steward, Ploughman, Shepherd, Hedger, Cattle-man, Field-worker, and Dairy-maid by Henry Stephens, first published in London in 1844.\n\nEpisode 1\n\nThis was first broadcast on Thursday 8 January 2009 at 9 pm. The would-be farmers move into a disused cottage. This requires much renovation: replacing the coal-burning range, cleaning the chimney and refuelling from a narrowboat on a nearby canal; cleaning the bedroom by removing dead birds, disinfecting against bedbugs with turpentine and salt, restoring the lime plaster and redecorating.\n\nIn accordance with custom, they assist in the threshing of the previous year's crop of wheat, using a steam-powered thresher. A field is ploughed, harrowed and sown with the next year's crop using horse-drawn implements of the era. Apples are picked, milled and pressed to make cider while other fruits and berries are preserved as a spicy chutney.\n\nA flock of Shropshire ewes is acquired and the first meal is cooked and eaten - a leg of boiled mutton.\n\n\n\nEpisode 2\n\nAs winter draws on, animal fodder and shelter is provided. Mangelwurzels are stored in a clamp and then chipped with period machinery to feed the cows. A pigsty is built upon a foundation of bottles to provide insulation and three young Tamworth pigs and a pregnant Gloucestershire Old Spot sow are housed there upon completion.A ram is added to the sheep flock and marked with raddle to ensure that he impregnates all the ewes so that they will lamb in the spring. A shire horse, named Clumper, is also added to the livestock and training in his use as a draught animal is performed.\n\nDomestically, the weekly laundry is done in a Victorian style. Stain removal is first performed, for example, using milk to remove an ink stain. Then the clothes are hand-paddled, mangled and ironed over a period of several days.\n\nChristmas is celebrated with a church service; the Victorian novelty of a Christmas tree; a plum pudding and a roast turkey; and presents are exchanged such as some hand-made braces.\n\n\nEpisode 3\n\nNew Year arrives and the farm needs emergency repairs. So the team go back to DIY basics, with the help of the woodsman, the blacksmith and the basket maker. Ruth has a go at some traditional potions and remedies. When the wheat crop comes under attack, it is time for some pest control, Victorian style, as Alex and Peter join a pheasant hunt. Alex goes out catching rabbits with a team of Victorian poachers. And with spring around the corner, the first baby animals are ready to be born.\n\n\nEpisode 4\n\nIt is spring and there are lambs and pigs to be delivered - which means Alex and Peter need to master animal midwifery. A prized ewe is in danger and a lame horse may jeopardise vital work on the farm. The team witness the birth of many chicks and ducklings, along with 8 (originally 9) piglets from the pig Princess.\n\nThe team turns to Victorian science in a bid to save their struggling crops. If they succeed, they will have something to celebrate at the May Day fair. If they fail, all their hard work will have been in vain. It is make or break time on the Victorian Farm.\n\n\nEpisode 5\n\nIn this episode, the team embarks on a trip by steam train, Ruth begins a tough task in the dairy, Alex tries his hand at beekeeping, the sheep get sheared using the latest time-saving technology, and the lengthening summer days allow Alex and Peter to try out the new Victorian sport of cricket. It is also time for the hay harvest, weather permitting.\n\nRuth makes cheddar cheese in the dairy with her daughter, Eve Goodman, with milk from the cow Forget Me Not, using the rennet from a neighbour's male calf. The sheep shearing is a life saver because it turns out that the sheep have severe fly strike. It is Alex's birthday and Ruth makes him a cake and a picnic, while Peter buys him a book of apiary. The boys make a predator-proof cover for the landlord's raspberry patch.\n\n\nEpisode 6\n\nIt is the end of their year on the farm. They sell off the pigs and sheep they successfully bred and raised. Ruth learns straw plaiting and makes a hat and cooks a Victorian style curry. Everything is now focused on the wheat harvest. Peter and Alex get the dray and a reaping and binding machine repaired and brew beer for the harvest. The harvest is completed just before the rain comes with Ruth harvesting the last corn. Once the wheat is dried and stored they ring the church bells, enjoy a harvest festival and reflect upon their time on the farm. They hand over the key to their landlord and depart the farm.\n\nhave fun and for the fragg seed like hell !!","torrent":{"xt":"urn:btih:65458d4312abc21b4a03ae7e87f8113452b7d3ce","amp;dn":"Victorian+Farm++%28BBC+2009+-+Complete+Series%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65458d4312abc21b4a03ae7e87f8113452b7d3ce","infoHashBuffer":{"type":"Buffer","data":[101,69,141,67,18,171,194,27,74,3,174,126,135,248,17,52,82,183,211,206]},"announce":[],"urlList":[]}}