{"title":"Epic Manager - Create Your Own Adventuring Agency! v0.2.3","uid":15419793,"size":701500477,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:65f602a6f816e8a463b0b6c681924c35c4868408&amp;dn=Epic+Manager+-+Create+Your+Own+Adventuring+Agency%21+v0.2.3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"dauphong","files":1,"time":1469623782,"description":"About This Game\r\nYou are the General Manager and CEO of your very own Adventuring Agency, the riskiest yet most lucrative business in the Realm of Astraeus. Recruit adventurers, negotiate their contracts, send them out on dangerous quests and reap the rewards should they make it out alive. Expand your Agency, manage your growing resources and best your competitors to become the Epic Manager!\r\nEpic Manager is a fresh new take on the Tycoon RPG genre, heavily inspired by classics we all know and love! The game presents a unique mix of roster management and character progression found in titles like Football Manager or Final Fantasy Tactics, narrative choices &amp; consequences in the beloved tradition of gamebooks series Choose Your Own Adventure, the epic scope of a D&amp;D campaign or a Lord of the Rings novel and the humoristic tone of The Princess Bride, all in one awesome package!\r\nYour goal is to gain the title of Epic Manager by becoming the most famous Adventuring Agency in the vast Realm of Astraeus.\r\nSend agents on the field to prospect new job opportunities, scout the dangers ahead, recruit new adventurers, negotiate their contracts, organize them in parties and complete dangerous quests to earn more fame than your rivals and climb the rankings of the League Ladder!\r\n\r\nAlong with managing your contracts and jobs, you’ll also hire support staff, trade with the local merchants, upgrade your agency’s HQ, research new abilities and upgrades, expand your reach across Astraeus and interact with competitors by using intrigue and diplomatic actions","torrent":{"xt":"urn:btih:65f602a6f816e8a463b0b6c681924c35c4868408","amp;dn":"Epic+Manager+-+Create+Your+Own+Adventuring+Agency%21+v0.2.3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65f602a6f816e8a463b0b6c681924c35c4868408","infoHashBuffer":{"type":"Buffer","data":[101,246,2,166,248,22,232,164,99,176,182,198,129,146,76,53,196,134,132,8]},"announce":[],"urlList":[]}}