{"title":"Head First Statistics - Dawn Griffiths [ O reilly ]","uid":11622795,"size":38473239,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:660881f2312cc41ca4e2881ea1d1e3c229177433&amp;dn=Head+First+Statistics+-+Dawn+Griffiths+%5B+O+reilly+%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"vimzin","files":1,"time":1417586189,"description":"Head First Statistics - Dawn Griffiths [ O reilly ] \n\n\nAbout the Author\nDawn Griffiths started life as a mathematician at a top UK university. She was awarded a First-Class Honours degree in Mathematics but she turned down a PhD scholarship studying particularly rare breeds of differential equations when she realized people would stop talking to her at parties. Instead she pursued a career in software development and she currently combines IT consultancy with writing and mathematics. When Dawn's not working on Head First books, you will find her honing her Tai Chi skills, making bobbin lace or cooking. She hasn't yet mastered the art of doing all three at the same time. She also enjoys traveling and spending time with her lovely husband David.\n\n\nWouldn't it be great if there were a statistics book that made histograms, probability distributions and chi square analysis more enjoyable than going to the dentist? Head First Statistics brings this typically dry subject to life, teaching you everything you want and need to know about statistics through engaging, interactive and thought-provoking material, full of puzzles, stories, quizzes, visual aids and real-world examples.\n\nWhether you're a student, a professional or just curious about statistical analysis, Head First's brain-friendly formula helps you get a firm grasp of statistics so you can understand key points and actually use them. Learn to present data visually with charts and plots; discover the difference between taking the average with mean, median and mode and why it's important; learn how to calculate probability and expectation; and much more.\n\nHead First Statistics is ideal for high school and college students taking statistics and satisfies the requirements for passing the College Board's Advanced Placement (AP) Statistics Exam.\n\nWith this book, you'll:\n\nStudy the full range of topics covered in first-year statistics.\nTackle tough statistical concepts using Head First's dynamic, visually rich format proven to stimulate learning and help you retain knowledge.\nExplore real-world scenarios, ranging from casino gambling to prescription drug testing, to bring statistical principles to life.\nDiscover how to measure spread, calculate odds through probability and understand the normal, binomial, geometric and Poisson distributions.\nConduct sampling, use correlation and regression, do hypothesis testing, perform chi square analysis and more.\nBefore you know it, you will not only have mastered statistics, you will also see how they work in the real world. Head First Statistics will help you pass your statistics course and give you a firm understanding of the subject so you can apply the knowledge throughout your life","torrent":{"xt":"urn:btih:660881f2312cc41ca4e2881ea1d1e3c229177433","amp;dn":"Head+First+Statistics+-+Dawn+Griffiths+%5B+O+reilly+%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"660881f2312cc41ca4e2881ea1d1e3c229177433","infoHashBuffer":{"type":"Buffer","data":[102,8,129,242,49,44,196,28,164,226,136,30,161,209,227,194,41,23,116,51]},"announce":[],"urlList":[]}}