{"title":"Medieval cities.pdf","uid":12309191,"size":36299158,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:66a1bc9c52ae390a7457980309d605927fba2490&amp;dn=Medieval+cities.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"STBGD","files":1,"time":1440849555,"description":"Braziller | 1968 | Eng | Pdf | 127 p | 34.6 MB | ISBN10: 0807604712\n\nDr. Saalman describes and analyzes the characteristic forms of bridges, gates, and walls which guarded and controlled the flow of traffic into the medieval city; the spatial tensions created between the encroachment of buildings and the expansion of roads and markets; and the location, style, and scale of public and religious institutions -- all of which were involved in the adaptation of structure to function.\n\nMedieval towns hold a special place in the history of cities, for with the fall of the Roman Empire a great period of urbanization had died out. Not until the 11th Century was the time ripe again for mercantile expansion and a new cycle of urban growth. It is the evolution of this growth with which Dr. Saalman's study is concerned.\n\nIncludes profuse illustrations (maps and drawings of cities), Bibliography, notes, Sources of Illustrations, Index of Cities, Index. 127 pp.\n\nA volume in the illustration series on the history of urbanization PLANNING AND CITIES, produced under the general editorship of George R. Collins, Professor of Art History, Columbia University.\n\n_________\n\nHoward Saalman was Professor of the History of Architecture at Carnegie-Mellon University.\n\nAmazon","torrent":{"xt":"urn:btih:66a1bc9c52ae390a7457980309d605927fba2490","amp;dn":"Medieval+cities.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66a1bc9c52ae390a7457980309d605927fba2490","infoHashBuffer":{"type":"Buffer","data":[102,161,188,156,82,174,57,10,116,87,152,3,9,214,5,146,127,186,36,144]},"announce":[],"urlList":[]}}