{"title":"Flashpoints: The Emerging Crisis in Europe - George Friedman MP3","uid":11693669,"size":337281850,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:66d7ef0e01d95688a9ba55ddf889d4155e7d764d&amp;dn=Flashpoints%3A+The+Emerging+Crisis+in+Europe+-+George+Friedman+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"Squiddy82","files":11,"time":1423627251,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nFlashpoints: The Emerging Crisis in Europe\n\nWritten by: George Friedman\nNarrated by: Bruce Turk, George Friedman\nLength: 11 hrs and 40 mins\nUnabridged Audiobook\nRelease Date:01-27-15\n\nA major new book by New York Times best-selling author and geopolitical forecaster George Friedman (The Next 100 Years, The Next Decade) with a bold thesis about coming conflict in the world, this provocative work examines the geopolitical flashpoints - particularly in Europe - in which imminent future conflicts are brewing.\nGeorge Friedman has forecasted the coming trends (politics, technology, population, and culture) of the next century in The Next 100 Years, and focused his predictions on the coming ten years in The Next Decade. Now, in Flashpoints, Friedman zooms in on the region that has, for 500 years, been the cultural hotbed of the world - Europe - and examines the most basic and fascinating building block of the region: culture. Analyzing the fault lines that have existed for centuries - and which have led to two world wars and dozens more conflicts - Friedman walks us through the &quot;flashpoints&quot; that are still smoldering beneath the surface and are on course to erupt again.\nIn Flashpoints, George Friedman begins with a fascinating history of the events leading up to the horrific wars that nearly tore apart Western civilization - killing over 100 million people on the &quot;civilized&quot; European continent. Modern-day Europe, and the formation of the European Union, were designed to minimize the built-in geopolitical tensions that led to catastrophic war, but as Friedman shows with a mix of history and cultural analysis, those plans have failed. &quot;Flashpoints&quot; are now simmering as dangerously as in the early twentieth century. Zeroing in on half a dozen locations, borderlands, and cultural dynamics, George Friedman does what few historians can - he explains precisely how certain trends are unstoppable, and what the future holds... both in terms of conflict and also opportunity. Flashpoints also explains in riveting detail how events in Europe will affect the rest of the world","torrent":{"xt":"urn:btih:66d7ef0e01d95688a9ba55ddf889d4155e7d764d","amp;dn":"Flashpoints%3A+The+Emerging+Crisis+in+Europe+-+George+Friedman+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66d7ef0e01d95688a9ba55ddf889d4155e7d764d","infoHashBuffer":{"type":"Buffer","data":[102,215,239,14,1,217,86,136,169,186,85,221,248,137,212,21,94,125,118,77]},"announce":[],"urlList":[]}}