{"title":"McMinn's and Abrahams' Clinical Atlas of Human Anatomy, 7E [PDF]","uid":9831539,"size":274338106,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:671b7740f53afebe5f4969aca9b4fa516e7acea2&amp;dn=McMinn%27s+and+Abrahams%27+Clinical+Atlas+of+Human+Anatomy%2C+7E+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":2,"uploader":"0xmovva","files":-1,"time":1395847233,"description":"Author: Peter H. Abrahams, Jonathan D. Spratt, Marios Loukas, Albert-Neels van Schoor\nSeries: Mcminn's Color Atlas of Human Anatomy\nPaperback: 400 pages\nPublisher: Mosby; 7 edition (April 3, 2013)\nLanguage: English\nISBN-10: 0723436975\nISBN-13: 978-0723436973\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n___________________________________________________________________________________\n\n\nMcMinn and Abrahams' Clinical Atlas of Human Anatomy, 7th Edition delivers the straightforward visual guidance you need to confidently perform all of the dissections required during your medical training...while acquiring the practical anatomical knowledge needed in your future clinical practice! Respected authority Prof. Peter H. Abrahams and a team of leading anatomists use a vast collection of clinical images to help you master all essential concepts.\n\nSee what to look for and how to proceed thanks to a vast array of excellent dissection photographs with radiological correlation and color diagrams.\n\nCorrelate anatomy to clinical practice with a wealth of MR, CT, DSA, radiographic, endoscopic, and operative images that demonstrate how structures are viewed in the clinical setting.","torrent":{"xt":"urn:btih:671b7740f53afebe5f4969aca9b4fa516e7acea2","amp;dn":"McMinn%27s+and+Abrahams%27+Clinical+Atlas+of+Human+Anatomy%2C+7E+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"671b7740f53afebe5f4969aca9b4fa516e7acea2","infoHashBuffer":{"type":"Buffer","data":[103,27,119,64,245,58,254,190,95,73,105,172,169,180,250,81,110,122,206,162]},"announce":[],"urlList":[]}}