{"title":"The Last Days of Night - Graham Moore [EN EPUB AZW3] [p_s]","uid":15605248,"size":7635434,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:672f14ff22a326f236ef43ce081f0ed7a22175bb&amp;dn=The+Last+Days+of+Night+-+Graham+Moore+%5BEN+EPUB+AZW3%5D+%5Bp_s%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"perfect_stan","files":2,"time":1471712367,"description":"The Last Days of Night by Graham Moore \r\nEnglish | 2016 | Historical Fiction | 7.3 MB \r\n\r\nNew York, 1888. Gas lamps still flicker in the city streets, but the miracle of electric light is in its infancy. The person who controls the means to turn night into day will make history—and a vast fortune. A young untested lawyer named Paul Cravath, fresh out of Columbia Law School, takes a case that seems impossible to win. Paul’s client, George Westinghouse, has been sued by Thomas Edison over a billion-dollar question: Who invented the light bulb and holds the right to power the country? \r\nThe case affords Paul entry to the heady world of high society—the glittering parties in Gramercy Park mansions, and the more insidious dealings done behind closed doors. The task facing him is beyond daunting. Edison is a wily, dangerous opponent with vast resources at his disposal—private spies, newspapers in his pocket, and the backing of J. P. Morgan himself. Yet this unknown lawyer shares with his famous adversary a compulsion to win at all costs. How will he do it? \r\nIn obsessive pursuit of victory, Paul crosses paths with Nikola Tesla, an eccentric, brilliant inventor who may hold the key to defeating Edison, and with Agnes Huntington, a beautiful opera singer who proves to be a flawless performer on stage and off. As Paul takes greater and greater risks, he’ll find that everyone in his path is playing their own game, and no one is quite who they seem. \r\n\r\nEnjoy and please SEED!!!","torrent":{"xt":"urn:btih:672f14ff22a326f236ef43ce081f0ed7a22175bb","amp;dn":"The+Last+Days+of+Night+-+Graham+Moore+%5BEN+EPUB+AZW3%5D+%5Bp_s%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"672f14ff22a326f236ef43ce081f0ed7a22175bb","infoHashBuffer":{"type":"Buffer","data":[103,47,20,255,34,163,38,242,54,239,67,206,8,31,14,215,162,33,117,187]},"announce":[],"urlList":[]}}