{"title":"Miles Davis - Kind of Blue (1959) [24 bit FLAC] [vinyl]","uid":8030087,"size":955417367,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:673c2613db92ff7792addeeb9a8a7935cf705ef2&amp;dn=Miles+Davis+-+Kind+of+Blue+%281959%29+%5B24+bit+FLAC%5D+%5Bvinyl%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"politux","files":-1,"time":1358391529,"description":"\n\n  Miles Davis - Kind of Blue (1959) [24 bit FLAC] [vinyl]\n\n  Released: 1959\n  Duration: 45:25\n  Genre: Jazz\n  Codec: FLAC\n  Bit Rate: ~ 3,000 kbps\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n  Cover: Front\n\n  Side A:\n \n  01 - So What (Davis) - 9:22\n  02 - Freddie Freeloader (Davis) - 9:46\n  03 - Blue In Green (Davis, Evans) - 5:37\n\n  Side B:\n  \n  01 - All Blues (Davis) - 11:33\n  02 - Flamenco Skateches (Davis, Evans) - 9:26 \n\n  Kind of Blue isn't merely an artistic highlight for Miles Davis, it's an album that towers above its peers, a record generally considered as the definitive jazz album, a universally acknowledged standard of excellence. Why does Kind of Blue posses such a mystique? Perhaps because this music never flaunts its genius. It lures listeners in with the slow, luxurious bassline and gentle piano chords of &quot;So What.&quot; From that moment on, the record never really changes pace - each tune has a similar relaxed feel, as the music flows easily. Yet Kind of Blue is more than easy listening. It's the pinnacle of modal jazz - tonality and solos build from the overall key, not chord changes, giving the music a subtly shifting quality. All of this doesn't quite explain why seasoned jazz fans return to this record even after they've memorized every nuance. \n \n  They return because this is an exceptional band - Miles, Coltrane, Bill Evans, Cannonball Adderley, Paul Chambers, Jimmy Cobb - one of the greatest in history, playing at the peak of its power. As Evans said in the original liner notes for the record, the band did not play through any of these pieces prior to recording. Davis laid out the themes before the tape rolled, and then the band improvised. The end results were wondrous and still crackle with vitality. Kind of Blue works on many different levels. It can be played as background music, yet it amply rewards close listening. It is advanced music that is extraordinarily enjoyable. It may be a stretch to say that if you don't like Kind of Blue, you don't like jazz - but it's hard to imagine it as anything other than a cornerstone of any jazz collection.","torrent":{"xt":"urn:btih:673c2613db92ff7792addeeb9a8a7935cf705ef2","amp;dn":"Miles+Davis+-+Kind+of+Blue+%281959%29+%5B24+bit+FLAC%5D+%5Bvinyl%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"673c2613db92ff7792addeeb9a8a7935cf705ef2","infoHashBuffer":{"type":"Buffer","data":[103,60,38,19,219,146,255,119,146,173,222,235,154,138,121,53,207,112,94,242]},"announce":[],"urlList":[]}}