{"title":"Blue Exorcist Complete 1 - 25 (English dubbed)","uid":8303289,"size":1431893704,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:67f5b658bd43e77b21beeb04f1fd0d65fddb1492&amp;dn=Blue+Exorcist+Complete+1+-+25+%28English+dubbed%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":3,"uploader":"AfroDalek","files":27,"time":1364316520,"description":"The story revolves around Rin Okumura, a teenager possessing abnormal strength and endurance who, along with his younger twin brother Yukio, was raised by Father Shiro Fujimoto. One day, Rin learns that he is the son of Satan, the strongest of all demons. Witnessing Shiro dying to protect him, Rin ends up doing what his guardian asked him never to do: draw the demon-slaying blade Kurikara, which restrains his demonic powers, from its scabbard. From that moment on, Rin not only gains permanent demonic features like fangs, pointed ears, fiery &quot;horns&quot; and a tail, but also the power to ignite himself into blue flames that can destroy almost anything they touch.\n At Fujimoto's funeral, Rin has an encounter with Fujimoto's friend Mephisto Pheles, who agrees with Rin's wish to become an Exorcist like his guardian to become stronger and to defeat Satan. Rin enrolls at the prestigious True Cross Academy, which is actually the Japanese branch of an international organization dedicated to protect the human realm, Assiah, from demons and other creatures from the demon realm, Gehenna. Rin takes part in a special Exorcist course, the existence of which is known only by a few. Much to his surprise, he finds that his brother Yukio is already a veteran Exorcist and will be one of his teachers.","torrent":{"xt":"urn:btih:67f5b658bd43e77b21beeb04f1fd0d65fddb1492","amp;dn":"Blue+Exorcist+Complete+1+-+25+%28English+dubbed%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67f5b658bd43e77b21beeb04f1fd0d65fddb1492","infoHashBuffer":{"type":"Buffer","data":[103,245,182,88,189,67,231,123,33,190,235,4,241,253,13,101,253,219,20,146]},"announce":[],"urlList":[]}}