{"title":"Red Right Hand - Chris Holm [EN EPUB MOBI] [ebook] [p_s]","uid":15822306,"size":1251606,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6862e4a17433c790244428d06022513e1f68ef4e&amp;dn=Red+Right+Hand+-+Chris+Holm+%5BEN+EPUB+MOBI%5D+%5Bebook%5D+%5Bp_s%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"perfect_stan","files":4,"time":1473786478,"description":"Red Right Hand by Chris Holm (Michael Hendricks #2)\r\nEnglish | 2016 | Mystery &amp; Thriller | 1.2 MB\r\n\r\n\r\nIf the good guys can’t save you, call a bad guy.\r\nWhen viral video of an explosive terrorist attack on San Francisco’s Golden Gate Bridge reveals that a Federal witness long thought dead is still alive, the organization he’d agreed to testify against will stop at nothing to put him in the ground.\r\nFBI Special Agent Charlie Thompson is determined to protect him, but her hands are tied; the FBI’s sole priority is catching the terrorists before they strike again. So Charlie calls the only person on the planet who can keep her witness safe: Michael Hendricks.\r\nOnce a covert operative for the US military, Hendricks makes his living hitting hitmen… or he did, until the very organization hunting Charlie’s witness–the Council–caught wind and targeted the people he loves. Teaming up with a young but determined tech whiz, Cameron, on the condition she leave him alone after the case, Hendricks reluctantly takes the job.\r\nOf course, finding a man desperate to stay hidden is challenging enough without deadly competition, let alone when the competition’s shadowy corporate backer is tangled in the terrorist conspiracy playing out around them. And now Hendricks is determined to take the Council down, even if that means wading into the center of a terror plot whose perpetrators are not what they seem.\r\n\r\nEnjoy and please SEED!!!","torrent":{"xt":"urn:btih:6862e4a17433c790244428d06022513e1f68ef4e","amp;dn":"Red+Right+Hand+-+Chris+Holm+%5BEN+EPUB+MOBI%5D+%5Bebook%5D+%5Bp_s%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6862e4a17433c790244428d06022513e1f68ef4e","infoHashBuffer":{"type":"Buffer","data":[104,98,228,161,116,51,199,144,36,68,40,208,96,34,81,62,31,104,239,78]},"announce":[],"urlList":[]}}