{"title":"Rimworld Alpha 14.1249 Win","uid":15542429,"size":106565353,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6941c7dfcff177d0752e9a8a00ce6e517a6fc2fa&amp;dn=Rimworld+Alpha+14.1249+Win&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"vnihoul77","files":4,"time":1470930018,"description":"Un simulateur de colonie sci fi avec un raconteur IA intelligent.\r\nRimWorld suit trois survivants d’un écrasement de vaisseau spatial pendant qu’ils bâtissent leur colonie sur une planète à la frontière de l’espace connue. Inspiré par le genre space western de Firefly, la simulation profonde de Dwarf Fortress, et l’échelle grandiose de Dune et Warhammer 40,000.\r\n\r\nGérez les humeurs, les besoins, les pensées, les blessures individuelles et les maladies des colons. Participez aux combats armés en équipes. Fabriquez des structures, des armes, et des vêtements en métal, bois, pierre, tissue, ou des matériaux exotiques ou futuristes. Battez-vous contre des pirates, des tribus hostiles, des animaux déchaînés et des machines anciennes et meurtrières. Découvrez un nouveau monde généré chaque fois que vous jouez. Construisez des colonies dans des biomes divers, allant des déserts aux jungles et aux toundras, chacun avec une flore et une faune unique. Gérez et développer les colons avec des passés, des traits et des habiletés uniques. Apprenez à jouer facilement avec l’aide d’un mentor IA intelligent et discret","torrent":{"xt":"urn:btih:6941c7dfcff177d0752e9a8a00ce6e517a6fc2fa","amp;dn":"Rimworld+Alpha+14.1249+Win","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6941c7dfcff177d0752e9a8a00ce6e517a6fc2fa","infoHashBuffer":{"type":"Buffer","data":[105,65,199,223,207,241,119,208,117,46,154,138,0,206,110,81,122,111,194,250]},"announce":[],"urlList":[]}}