{"title":"MemoriesOnTV 4.1.2-serial incl","uid":5289348,"size":7795793,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6a72ecc4d49f6d4d5a405bf80f36a5b8c1955f3b&amp;dn=MemoriesOnTV+4.1.2-serial+incl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"jmb2012","files":2,"time":1263843258,"description":"MemoriesOnTV Version 4.1.2\n\nRuns on Windows 98SE, ME, 2000, XP, 2003, VISTA, Windows 7.\n\n\nMemoriesOnTV has been evolving over the years. Here are the highlights of the new features that we have added in Version 4:\nSmart Compilation of Slideshow\n\nGenerating a DVD slideshow is alot faster with smart caching of files. MemoriesOnTV will only rebuild those albums that have been modified since the last video generation, thus saving considerable time.\nFace Detection\n\nWe have added a face detection algorithm to the program. With this, MemoriesOnTV can automatically zoom-in to the faces within a photo to highlight the subjects, saving you the trouble of having to do this manually. It can also do a smarter Ken Burns panning/zooming effects automatically, by cropping away the background and other less important regions while leaving the faces intact.\nMasking and Overlaying\n\nMask and overlay your photos and video clips to decorate them with frames and borders. Add special visual effects like giving them burnt edges. Use the pre-built masks and overlays that comes with MemoriesOnTV, or add your own customized masks and overlays (which are 32-bit images to provide semi-or-fully transparent borders).\nMotion Menu\n\nWow the viewers of your DVD slideshow with motion menus. Set video clips to the menu thumbnails and/or background and let the menus come to life. You can also harness the power of masking and overlaying to your menus to create a cool-looking theme.\nShadowing\n\nGive your slides and menus a 3-D feel by adding realistic looking shadows. Combine shadowing and masking/overlaying to give your project texture and depth.\nSupports Extensible ClipShows\n\nWith ClipShows Volume 1.1, you can now add new images to certain ClipShows. This way, the sequences you built are not longer limited to the number of images in those ClipShows.\nUpdated Burn Driver\n\nUpdated Native burn driver supports more drives, and works with 64-bit Windows too. \n\n\nThe following are some of the core features of MemoriesOnTV. Enhancements and improvements have been made in Version 4, making them even better than before.\nQuality Transition Effects\n\nPainstakingly crafted transition effects to add that professional touch to your slideshows. The effects are highly customizeable. Also includes and supports Bitmap mask effects, allowing you to create &amp; add your own transitions with Photoshop.\nEnhanced Ken Burns Effect\n\nSettable panning, zooming, rotation and transparency for individual slides. Add multiple keyframes to your photo timeline for that sophisticated motion.\nMultiple Pictures (Layers) Slide*\n\nLayer multiple photos and/or video clips on a single slide. Use the pre-built effects to create interesting slides from multiple media files. With this feature, you can also create a slideshow-in-slideshow presentation. As usual, this is fully customizeable for those times that you want to flex your creative muscles.\nUsing ClipShows\n\nAssemble slide sequences from pre-built ClipShows, which are segments of pre-choreographed mini-slideshows. Supports extended ClipShows which allows adding new photos.\nText Caption\n\nText captions reside on independent layers. Add independent effects for each text caption. Let them persist across multiple slides.\nAdvanced Audio Support\n\nAdd background audio tracks for your slideshows, or attach audio file to individual slides. Includes a mini Audio Editor to help trim segments of audio files for use in the slideshows. Normalize the audio tracks such that they are all adjusted to similar volume levels.\nEnhanced Video Clip Support\n\nApply transition effects, masking and layering to video clips. All Ken Burns settings including opacity are supported. You can even rotate the video clips too.\nCustomizeable Disc Menu\n\nCreate 1 or 2 level disc menus. Rearrange and edit elements on the menus using the powerful built-in editor with dynamic guides.\nDVD Subtitle*\n\nAdd DVD subtitles that can be turned on/off via remote. Preview these within MemoriesOnTV.\nAdditional output formats*\n\nExport to web slideshow (Flash format) to play back on most web browsers. You can also export to AVI using installed VFW codecs.\n\n* MemoriesOnTV Pro only\n","torrent":{"xt":"urn:btih:6a72ecc4d49f6d4d5a405bf80f36a5b8c1955f3b","amp;dn":"MemoriesOnTV+4.1.2-serial+incl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a72ecc4d49f6d4d5a405bf80f36a5b8c1955f3b","infoHashBuffer":{"type":"Buffer","data":[106,114,236,196,212,159,109,77,90,64,91,248,15,54,165,184,193,149,95,59]},"announce":[],"urlList":[]}}