{"title":"Warrior of Rome Series 1-5 by Harry Sidebottom","uid":10796220,"size":29500957,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6ad1751521998535bd6382f18faf987fc0a7a2ff&amp;dn=Warrior+of+Rome+Series+1-5+by+Harry+Sidebottom&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"Jallentino","files":11,"time":1408296035,"description":"Format: mobi/epub\nGenre: Historical Fiction/Action/Adventure\nRelease Date: 2008 - 2012\nSize: 24.60Mb\n\nFire in the East (Warrior of Rome #1) (2008)\nKing of Kings (#2) (2009)\nLion of the Sun (#3) (2010)\nThe Caspian Gates (#4) (2011)\nThe Wolves of the North (#5) (2012)\n\nAD 255 - In this blood and guts tale of ancient warfare, Oxford lecturer Harry Sidebottom introduces readers to Marcus Clodius Bastilla, a third-century warrior who has risen through the ranks of the Roman army to achieve citizenship and the honorific of Dux Ripea. Charged by the emperors Valerian and Gallienus with the responsibility of defending the empire's eastern borders, Bastilla says good-bye to his new wife and sets sail for the East.\n\nOnce he arrives at the Syrian city of Arete on the banks of the Euphrates, Bastilla organizes his legionaries to defend against the besieging Sassanid Persian army and hold out until reinforcements can arrive. In addition to having his hands full with the invading army, Bastilla must also deal with traitors, saboteurs, assassins and patrician officers who resent obeying the orders of a low-born superior.\n\nAlone, Ballista is called to muster the forces and the courage to stand first and to stand hard against the greatest enemy ever to confront the Imperium. In the bestselling tradition of Bernard Cornwell and Conn Iggulden, comes a block-busting voice in historical adventure fiction.\n\nAuthor:\nHarry Sidebottom is Lecturer in Ancient History at Merton College, Oxford, and part-time lecturer in Classics and Ancient History at the University of Warwick. He has written for and contributed to many publications, including Classical Review, Journal of Roman Studies, and War and Society in the Roman World.\n","torrent":{"xt":"urn:btih:6ad1751521998535bd6382f18faf987fc0a7a2ff","amp;dn":"Warrior+of+Rome+Series+1-5+by+Harry+Sidebottom","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ad1751521998535bd6382f18faf987fc0a7a2ff","infoHashBuffer":{"type":"Buffer","data":[106,209,117,21,33,153,133,53,189,99,130,241,143,175,152,127,192,167,162,255]},"announce":[],"urlList":[]}}