{"title":"Jonny Greenwood - There Will Be Blood OST (320kbps)","uid":3950772,"size":80434839,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6b28f63afc1d4a7deff9d1a737befae34a466a78&amp;dn=Jonny+Greenwood+-+There+Will+Be+Blood+OST+%28320kbps%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"dankencity","files":11,"time":1198840239,"description":"Original Release Date: December 18, 2007\nNumber of Discs: 1\nFormat: Soundtrack\nLabel: Wea/Atlantic/Nonesuch\nASIN: B000XA50M\n\nGuitarist Jonny Greenwood has composed a hauntingly dramatic instrumental score for Oscar nominated writer-director\nPaul Thomas Anderson s ambitious new film, There Will Be Blood. An adaptation of the Upton Sinclair novel Oil!, the movie features\nDaniel Day-Lewis in what The Hollywood Reporter has described as a powerhouse performance... it s a certain awards contender. \nGreenwood s remarkable compositions, written primarily for strings, have already garnered considerable praise in advance reviews.\nThe score resembles his rock compositions only in the level of daring and inventiveness to be found throughout these tracks and in the unsettling atmosphere he is able to conjure at key moments. Greenwood s score is more indicative of his current collaborations with the BBC Orchestra as Composer In Residence activities closely followed by Pitchfork Media and The Daily Swarm.\nIn fact, the score incorporates material from two orchestral pieces he created in that position, smear and Popcorn Superhet Receiver,\nwhich will have its U.S. concert premiere this January when Greenwood appears at the Wordless Music Series in New York City.\nThere Will Be Blood takes Anderson in a radically different direction than his celebrated earlier films, Boogie Nights and Magnolia dazzling, attention-grabbing movies marked by multiple plot lines, ensemble casts and surreal visual elements. His last project,Punch Drunk Love, was a sophisticated comedy-drama with a smart pop score by composer-producer Jon Brion, released on\nNonesuch in 2002. Anderson s new work is a stark period piece filmed on arid Texas plains; critics have likened it to the brilliantly austere work of such revered directors as Stanley Kubrick and Terence Malick (Days Of Heaven). The Hollywood Reporter called Greenwood s score captivating...greatly contributing to the sense that tectonic forces lie beneath the drama. \nThe soundtrack to There Will Be Blood will appeal to serious movie-music fans, who will appreciate this rare find: an intelligent, beautiful\nand deeply cinematic orchestrated score performed by the BBC Orchestra and London Sinfonietta that can hold its own next to the classic work of such composers as Bernard Herrman, Elmer Bernstein and Ennio Morricone.\n\n1.\tOpen Spaces - Jonny Greenwood\n2.\tFuture Markets - Jonny Greenwood\n3.\tProspectors Arrive - Jonny Greenwood\n4.\tEat Him By His Own Light - Jonny Greenwood\n5.\tHenry Plainview - Jonny Greenwood\n6.\tThere Will Be Blood - Jonny Greenwood\n7.\tOil - Jonny Greenwood\n8.\tProven Lands - Jonny Greenwood\n9.\tHW/Hope Of New Fields - Jonny Greenwood\n10.\tStranded the Line - Jonny Greenwood\n11.\tProspectors Quartet - Jonny Greenwood\n\n\nThis album marks Radiohead guitarist Jonny Greenwood\\'s first high-profile soundtrack--and one that\\'s also easily among the most striking offerings of 2007. Music is particularly important for director Paul Thomas Anderson (remember Magnolia and Punch-Drunk Love?) and here, his choice of Greenwood is a gamble that more than paid off. The score is extremely string-heavy, and tension (of which there\\'s plenty in the Upton Sinclair-based movie) derives from them instead of the usual percussive Hollywood tropes (indeed, percussions are almost entirely absent from the CD). \\&quot;Henry Plainview\\&quot; and \\&quot;Proven Lands\\&quot; are part of a larger piece, Popcorn Superhet Receiver, that Greenwood wrote as Composer-in-Residence at the BBC; both cues display the musician\\'s imaginative use of strings, suggestively scary on the first, pounding and creepy on the second. But Greenwood also knows when to bring in a new instrumental voice, as with the Satie-like piano on \\&quot;Prospectors Arrive.\\&quot; Equally at ease writing for a string quartet and for a larger orchestra, Greenwood has come up with compositions closer to the new-music world that to the vast majority of scores coming out of Tinseltown--something we should be really grateful for. This is a new, exciting direction for film music.\n--Elisabeth Vincentelli \n\n","torrent":{"xt":"urn:btih:6b28f63afc1d4a7deff9d1a737befae34a466a78","amp;dn":"Jonny+Greenwood+-+There+Will+Be+Blood+OST+%28320kbps%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b28f63afc1d4a7deff9d1a737befae34a466a78","infoHashBuffer":{"type":"Buffer","data":[107,40,246,58,252,29,74,125,239,249,209,167,55,190,250,227,74,70,106,120]},"announce":[],"urlList":[]}}