{"title":"Chris Rock - Bigger &amp; Blacker 320cbr (Big Papi) 1999 Audio B","uid":9440318,"size":167340145,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:6b41d2bb0b1bea32287eeae419b92de8ed7e3ffc&amp;dn=Chris+Rock+-+Bigger+%26amp%3B+Blacker+320cbr+%28Big+Papi%29+1999+Audio+B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":2,"uploader":"Big-Papi","files":-1,"time":1389000336,"description":"Source: 1999 CD\n\n\nThis is not technically an audio book so it was left at 320cbr instead of using VBR to conserve space while retaining quality. It will also shuffle if music is shuffled. You can turn that off under settings if you like. - Big Papi\n\nBy A Customer\n[quote]Chris Rock follows up his 1996 hit &quot;Bring the Pain&quot; with another hilarious 1-hr routine. As always, Chris serves up his brutally honest opinions on the social and political nightmares we live in today. In this performance you'll find him tackling school gun violence, the plight of Native Americans, Ricky Martin, delinquent parents, racism, police brutality, incurable diseases, taxes, and a host of other issues. What makes Chris Rock so hilarious is that his commentary not only rings true but hits upon feelings and thoughts most of us have but are often afraid to express in today's &quot;politically correct&quot; atmosphere. Plus, Chris' naturally funny-looking physical appearance adds color to his performance. As with many other comedians, Chris Rock ends up spending a great deal of time on cliche comedian fodder such as sex and man-woman relationships. Thankfully, Chris Rock has managed to avoid tired old jokes and put hilarious new spins on these topics.\nIf you want intelligent comedy, this is the video for you! However, be forewarned that Chris Rock has a penchant for using the &quot;f&quot; word when emphasizing points, which some may find annoying after a while, and he is bound to say something that may offend someone. Nonetheless, I think that's what makes Chris Rock great and universal. Although Chris caters to an African-American audience, he ultimately has ideas that speaks to all segments of society- conservatives, liberals, white/black/asian/latino, homosexual, religious, non-religious, etc. A view that one segment of society finds appealing is bound to be held in disdain by another.\n\nI must admit, in the past year that I've become a Chris Rock fan, I've found it difficult to watch other comedians. Few are as hard-hitting as Chris Rock. Get this video to see what I mean! While you are at it, get &quot;Bring the Pain&quot;- this one packs even more punch than &quot;Bigger and Blacker&quot;.[/quote]","torrent":{"xt":"urn:btih:6b41d2bb0b1bea32287eeae419b92de8ed7e3ffc","amp;dn":"Chris+Rock+-+Bigger+%26amp%3B+Blacker+320cbr+%28Big+Papi%29+1999+Audio+B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b41d2bb0b1bea32287eeae419b92de8ed7e3ffc","infoHashBuffer":{"type":"Buffer","data":[107,65,210,187,11,27,234,50,40,126,234,228,25,185,45,232,237,126,63,252]},"announce":[],"urlList":[]}}