{"title":"JavaScript Programming- Pushing the Limits [PDF &amp; Epub]","uid":9225034,"size":37170947,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6bcba67aa72ac7fe0d029b07bfe5506216aa5864&amp;dn=JavaScript+Programming-+Pushing+the+Limits+%5BPDF+%26amp%3B+Epub%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":2,"uploader":"F1restorm","files":-1,"time":1384996313,"description":"JavaScript Programming: Pushing the Limits\nAuthors: Jon Raasch\nPublished: July 22, 2013\nPublisher: Wiley\nISBN: 9781118524565\nFormat: Retail Epub and Retail PDF\nReader Required: \nPDF- Adobe Reader, Adobe Digital Editions\nEpub- Adobe Digital Editions, Calibre, MoonReader for Android\nFormat conversion: convert epub to mobi (Kindle) with Calibre\nSkill Level: Experienced\n\nThis book has a companion webpage with some downloadable code, no registration required. The link in the book is incorrect and this is the correct link: &lt;a href=&quot;\nhttp://www.wiley.com/WileyCDA/WileyTitle/productCd-111852456X.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.wiley.com/WileyCDA/WileyTitle/productCd-111852456X.html&lt;/a&gt;\n\nTested on the above readers with no problems. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nEnjoy! :D\n__________________________________________________________________________________\n\nTake your JavaScript knowledge as far as it can go\n\nJavaScript has grown up, and it's a hot topic. Newer and faster JavaScript VMs and frameworks built upon them have increased the popularity of JavaScript for server-side web applications, and rich JS applications are being developed for mobile devices. This book delivers a compelling tutorial, showing you how to build a real-world app from the ground up. Experienced developers who want to master the latest techniques and redefine their skills will find this deep dive into JavaScript's hidden functionalities gives them the tools to create truly amazing and complex applications.\n\nJavaScript has evolved into much more than simple client-side scripting; this book delves into advanced topics not generally found in other more intermediate JS development books\nExpert author delivers an in-depth tutorial showing how to build a real-world app that is loosely coupled, with each component built to exist separately\nExplores how to build a backbone app, the importance of JavaScript templates, Node.js and MongoDB, 3D Canvas using WebGL / Three.js, how to convert a desktop app into a dedicated mobile app, and much more\nIdeal for experienced developers with a deep knowledge of JavaScript as well as online developers with strong graphic design skills who are experienced in HTML/CSS and want to develop their front-end skills\nJavaScript Programming: Pushing the Limits will arm you with the skills to create killer apps for the 21st Century.\n","torrent":{"xt":"urn:btih:6bcba67aa72ac7fe0d029b07bfe5506216aa5864","amp;dn":"JavaScript+Programming-+Pushing+the+Limits+%5BPDF+%26amp%3B+Epub%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6bcba67aa72ac7fe0d029b07bfe5506216aa5864","infoHashBuffer":{"type":"Buffer","data":[107,203,166,122,167,42,199,254,13,2,155,7,191,229,80,98,22,170,88,100]},"announce":[],"urlList":[]}}