{"title":"Taxi to the Dark Side - An Investigation into Torture (BBC 2007)","uid":5066946,"size":1045509612,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6bd5fb7b5e0c03bc53dc7c22becdcb02d9f65c2f&amp;dn=Taxi+to+the+Dark+Side+-+An+Investigation+into+Torture+%28BBC+2007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"eddie1969","files":-1,"time":1251059940,"description":"TV : Documentary : TV quality : English\n\n\n\n\nTaxi to the Dark Side (2007)\n\n \n \n\nOver one hundred prisoners have died in suspicious circumstances in U.S. custody during the &quot;war on terror&quot;. Taxi to the Dark Side takes an in-depth look at one case: an Afghan taxi driver called Dilawar who was considered an honest and kind man by the people of his rustic village. So when he was detained by the U.S military one afternoon, after picking up three passengers, denizens wondered why this man was randomly chosen to be held in prison, and, especially, without trial?\n\nFive days after his arrest Dilawar died in his Bagram prison cell. His death came within a week of another death of a detainee at Bagram. The conclusion, with autopsy evidence, was that the former taxi driver and the detainee who passed away before him, had died due to sustained injuries inflicted at the prison by U.S. soldiers.\n\nThe documentary, by award-winning producer Alex Gibney, carefully develops the last weeks of Dilawar's life and shows how decisions taken at the pinnacle of power in the Bush Administration led directly to Dilawar's brutal death.\n\nThe film documents how Rumsfeld, together with the White House legal team, were able to convince Congress to approve the use of torture against prisoners of war. Taxi to the Dark Side is the definitive exploration of the introduction of torture as an interrogation technique in U.S. facilities, and the role played by key figures of the Bush Administration in the process.\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:6bd5fb7b5e0c03bc53dc7c22becdcb02d9f65c2f","amp;dn":"Taxi+to+the+Dark+Side+-+An+Investigation+into+Torture+%28BBC+2007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6bd5fb7b5e0c03bc53dc7c22becdcb02d9f65c2f","infoHashBuffer":{"type":"Buffer","data":[107,213,251,123,94,12,3,188,83,220,124,34,190,205,203,2,217,246,92,47]},"announce":[],"urlList":[]}}