{"title":"King &amp; Queen of the River (Paddle-Wheel Steamboat)","uid":15789085,"size":40811296,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6c5acd8ea905f7ff39c9b80c2db7ed7cd9aeccc6&amp;dn=King+%26amp%3B+Queen+of+the+River+%28Paddle-Wheel+Steamboat%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"STBGD","files":1,"time":1473367698,"description":"King &amp; Queen of the River, The Legendary Paddle-Wheel Steamboats Delta King and Delta Queen\r\nRiver Heritage Press | 1995 | 0964251337 | English | 296 pages | PDF | 39 MB\r\n\r\nThis is the remarkable story of paddle-wheel steamers Delta King and Delta Queen, California'slast and most beloved riverboats. Since moving to the Mississippi and Ohio over half a century ago, the Delta Queen has become the world's most famous steamboat. Born in the Roaring Twenties, these historic vessels carried passengers nightly between San Francisco and Sacramento from 1927 to 1940. They offered romantic overnight cruises with dining, dancing and jazz. After serving the U.S. Navy in World War II, they went their separate ways–the Queen through the Panama Canal to America's heartland and the King to Canada where for seven years it was stranded on dry ground. The Delta Queen found fame and fortune in her new life on rivers of the Midwest and South–and still operates there today. In sharp contrast, the Delta King suffered 40 years of hardship, gloom, heartbreak–with sinkings, landlocking, fires, and piracy. Finally, the King was restored at Sacramento as a beautiful floating hotel. This is truly a tale of &quot;riches to rags to riches.&quot; Through lively interviews, anecdotes, photos, maps, and lyrical prose, King &amp; Queen of the River covers the unknown story of these legendary steamboats from the Roaring Twenties to the 1990s","torrent":{"xt":"urn:btih:6c5acd8ea905f7ff39c9b80c2db7ed7cd9aeccc6","amp;dn":"King+%26amp%3B+Queen+of+the+River+%28Paddle-Wheel+Steamboat%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c5acd8ea905f7ff39c9b80c2db7ed7cd9aeccc6","infoHashBuffer":{"type":"Buffer","data":[108,90,205,142,169,5,247,255,57,201,184,12,45,183,237,124,217,174,204,198]},"announce":[],"urlList":[]}}