{"title":"Junjou Romantica Complete (24 episodes, seasons 1 &amp; 2)","uid":4784818,"size":4190882152,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6d0c90690904b63a8a029b3e820f82dc7988714f&amp;dn=Junjou+Romantica+Complete+%2824+episodes%2C+seasons+1+%26+2%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":4,"uploader":"sbox000","files":26,"time":1237511300,"description":"This contains the full 24 episodes (seasons 1 and 2) of the Manga\nadapted Anime series &quot;Junjou Romantica&quot; (or &quot;Junjo Romanchika&quot;). The spoken language is in Japanese with hard-coded English subtitles.\n\nWhile I'm not normally into this sort of material, it is very well\npresented, and it got me hooked. Before you view even the first\nepisode, be ready to spend an entire 10-12 hours to watch these.\nWhile the material is controversial, especially in the west, it is\nwell presented.\n\nAt the end of the 24th episode it appears everything has been wrapped\nup, showing that the relationships reached some stability and mutual\nunderstanding. A third season would be nice, but unneeded. Leaving\nunanswered questions isn't always a bad thing in stories.\n\nIt would be unlikely that this series would air in the USA without\nbeing censored, if at all. The material  would probably scare most\nUSA stations away-- that dealing with intimate relationships between\nolder and younger men with as many as 17 year age difference (18 &amp;\n35)-- and often showing the younger to be the one pushing for the\nrelationship relationship than the older (with one exception,\nwhich the first few episodes deals with).  Where there is sex,\nyou only see faces, and it isn't that often.  Though mostly it is\nhinted that sex has taken place, the act is rarely shown (if one such\nscene existed in a movie in the USA, it would get a PG-13 rating).\nDon't worry Australian friends, there's nothing in this series that\nwould get you into trouble should the feds find it on your computer\n(speaking of which, an Australian is in the second season).\n\nThese are love stories, and there are some lessons to be learned from\nthe failures and successes of these people. The most important of\nwhich is to listen, be open, be patient, and assume your assumptions\nare probably wrong.\n\nIf there is a series or movie you like, you should always buy the\nDVDs to encourage the production of more works, otherwise artists\nand production companies will have no incentive to continue.\n\nThis series is suitable for 15+ year olds, though, due to the\npresence of homosexuality/gay relationships, prejudice would give\nit a R/Mature Audiences rating.  If you let your kids watch South\nPark, this series is just fine.\n\nThis isn't porn or soft porn. It's a story of love and loss between\nseveral couples in a world not fully accepting of such a union.\n","torrent":{"xt":"urn:btih:6d0c90690904b63a8a029b3e820f82dc7988714f","amp;dn":"Junjou+Romantica+Complete+%2824+episodes%2C+seasons+1+%26+2%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d0c90690904b63a8a029b3e820f82dc7988714f","infoHashBuffer":{"type":"Buffer","data":[109,12,144,105,9,4,182,58,138,2,155,62,130,15,130,220,121,136,113,79]},"announce":[],"urlList":[]}}