{"title":"VMware Workstation 10.0.2 | Build 1744117 | Win and Linux","uid":9991546,"size":1392719675,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6d5cfc607ba72fc52bc5a4955e16a32aefe5589f&amp;dn=VMware+Workstation+10.0.2+%7C+Build+1744117+%7C+Win+and+Linux+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"EFA11","files":-1,"time":1397855081,"description":"VMware Workstation 10.0.2 | 17 April 2014 | Build 1744117\n\nCheck frequently for additions and updates to these release notes.\nThese release notes cover the following topics:\n\n    What's New\n    Prior Releases\n    Resolved Issues\n    Known Issues\n\nWhat's New\n\nVMware Workstation 10.0.2 is a maintenance release that resolves some known issues. It is a free update for all VMware Workstation 10 users.\nPrior Releases of Workstation\n\n\nResolved Issues\n\nThe following issues are resolved in this release of VMware Workstation.\n\n    Better audio performance and compatibility with certain USB audio/video devices.\n    The compatibility and performance of USB audio and video devices with virtual machines has been improved.\n\n    USB devices can be connected to the Linux RHEL 5 guest operating system.\n    Resolved an issue that prevents a USB device from being connected to Linux RHEL 5 guest operating system.\n\n    Windows 8.1 Update 1 and Windows Server 2012 R2 are supported as guest operating system through easy install.\n    Easy installation option supports Windows 8.1 Update 1 and Windows Server 2012 R2 as a guest operating system.\n\n    OpenSUSE 13.1 is officially supported as a host operating system.\n    OpenSUSE 13.1 is now supported as a host operating system.\n\n    Blueray drives can burn CDs when connected to the virtual machine.\n    Resolved an issue causing burning CDs with Blueray drives to fail while connected to the virtual machine.\n\n    Using Microsoft Word and Excel in unity mode no longer produces a beep.\n    Resolved an issue that caused using Microsoft Word and Excel in unity mode causes a beep.\n\n    The UAC dialog of the Windows 8 virtual machine no longer causes the host application windows to be blanked out on Linux Host.\n    Resolved an issue causing host application windows to be blanked out in the UAC dialog on the Linux host of the Windows 8 virtual machine.\n\n    The sound card can be automatically added to a virtual machine on a Linux host at power up.\n    Resolved an issue that prevented the Sound Card from being automatically added to the VM when powering on the virtual machine on a Linux host.\n\n    Windows 8.1 guest operating system no longer display a black screen when launching Metro style applications from the launch menu.\n    Resolved an issue that could cause a Windows 8.1 guest operating system to display a black screen when launching Metro style applications in the launch menu.\n\n    Hotkeys can be used in the Preference dialog in KVM mode.\n    Resolved a hotkey conflict in the Preference dialog of the KVM mode.\n\n    Improved compatibility of GL renderer with new Nvidia drivers.\n    Resolved a compatibility issue of GL renderer with some new Nvidia drivers.\n\n    Improved graphics quality with Solidworks applications.\n    Resolved graphics errors with for Solidworks applications.\n\n    Virtual machines imported from a physical PC no longer crash on startup.\n    Resolved an issue causing virtual machines imported from a physical PC to crash on startup.\n\n    Reading and writing to a file using two threads with a shared folder has been improved.\n    Resolved an issue about shared folder when the user read and write file using two threads.\n\n    Linux virtual machines access updated contents when using shared folders.\n    Resolved an issue that caused Linux virtual machines to see stale file contents when using shared folders.\n\n    Improved performance of the virtual machine using the E1000e adapter.\n    Resolved the virtual machine performance issues when using the E1000e adapter.\n\n    Workstation now launches on Ubuntu 14.04.\n    Resolved an issue preventing Workstation from starting on Ubuntu 14.04.\n\nKnown Issues\n\nKnown issues from prior releases of VMware Workstation 10 also might apply to VMware Workstation 10.0.2.\n\n    VM BIOS show a maximum of 8 disks in Windows 8 host and Windows 8 guest.\n    Only 8 disks are shown on the boot page of BIOS.\n\n    Workaround: Remove all the disks greater than 8 from the vm setting and keep the boot disk in the BIOS boot list, then have the boot disk to the top position, then restart the VM. after VM started, add the removed disk back by selecting add existing disk.\n\n\n\n","torrent":{"xt":"urn:btih:6d5cfc607ba72fc52bc5a4955e16a32aefe5589f","amp;dn":"VMware+Workstation+10.0.2+%7C+Build+1744117+%7C+Win+and+Linux+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d5cfc607ba72fc52bc5a4955e16a32aefe5589f","infoHashBuffer":{"type":"Buffer","data":[109,92,252,96,123,167,47,197,43,197,164,149,94,22,163,42,239,229,88,159]},"announce":[],"urlList":[]}}