{"title":"[8th Street Latinas] Violet Starr (Tan That Ass)","uid":15735369,"size":291203506,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:6d8c54282641bf10b7a598f854b3a94ed37383ef&amp;dn=%5B8th+Street+Latinas%5D+Violet+Starr+%28Tan+That+Ass%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":4,"uploader":"distinc","files":5,"time":1472832782,"description":"[8th Street Latinas] Violet Starr (Tan That Ass)\r\n\r\n\r\n...::ScreenShots::...\r\n \nhttp://imagedisco.net/?v=8629862005\r\n \nhttp://imagedisco.net/?g=9327311660\r\n\r\n\r\nPlot:\r\n\r\n\r\nViolet Starr snuck into a friends tanning room after she realized no one was around. She wanted to keep her body tan line free, so she peeled off her skin tight outfit and oiled herself down. Once she was catching the rays, she got that tingling sensation between her legs while she was taking selfies. She turned herself on, so she started touching the tingle. Violet was so deep into her toy box, she didn't notice Ramon walk in. Ramon's jaw dropped like one of those silly cartoon characters. He creeped in and got up close and personal. Her excited pussy was a site to see, but he got to excited as well. While he was banging his man banana and bumped into the tanning bed. She freaked out, but realized she wasn't supposed to be there and started to beg for Ramon not to say anything. With his cock in hand, he was kind of in the same position. Once she got an eye full of his cock she wanted a mouth full. Since they were both perving out, it only made sense to help each other. She slobbered on him, and he slobbered on her then Ramon really turned the heat up on her tanning bed. Violet's innocent tanning session turned into a harcore cock engagement. She will never again look at a tanning bed the same.\r\n\r\nScenes contain hardcore one-on-one sex. Positions include missionary, doggystyle, cowgirl and reverse cowgirls. Scenes end cum on pussy","torrent":{"xt":"urn:btih:6d8c54282641bf10b7a598f854b3a94ed37383ef","amp;dn":"%5B8th+Street+Latinas%5D+Violet+Starr+%28Tan+That+Ass%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d8c54282641bf10b7a598f854b3a94ed37383ef","infoHashBuffer":{"type":"Buffer","data":[109,140,84,40,38,65,191,16,183,165,152,248,84,179,169,78,211,115,131,239]},"announce":[],"urlList":[]}}