{"title":"BBC.How.The.Wild.West.Was.Won.with.Ray.Mears.2of3.Great.Plains.7","uid":10314484,"size":1395475067,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:6df6d739c2b7ef26895e3e4a6c210a76e12cd223&amp;dn=BBC.How.The.Wild.West.Was.Won.with.Ray.Mears.2of3.Great.Plains.7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":2,"uploader":"MVGroup","files":-1,"time":1402187775,"description":"How the Wild West Was Won With Ray Mears\n\nHistory, Nature Documentary hosted by Ray Mears, published by BBC in 2014 - English narration\n &lt;a href=&quot;\nhttp://img822.imageshack.us/img822/5796/wof3.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img822.imageshack.us/img822/5796/wof3.jpg&lt;/a&gt;\n\nInformation\n------------------------------\n\nHow The Wild West Was Won With Ray Mears\nBushcraft expert Ray Mears explores how the awesome wilderness of the North American continent shaped the story of the Wild West. As Ray travels through each landscape he discovers how their awe-inspiring geography, extreme weather, wild animals and ecology presented both great opportunities and great challenges for the native Indians, mountain men, fur traders, wagon trains and gold miners of the Wild West.\n\n\n1)  Mountains \nRay begins his westward journey in the Appalachians where he explores how their timbered slopes fuelled the lumber industry and provided the fuel and building material for the emerging nation. Native Appalachian Barbara Woodall and lumberjack Joe Currie share their family history with him, and he gets to grips with the rare 'hellbender' salamander. Further west, in the high jagged peaks of the Rocky Mountains, Ray goes mule trekking with modern-day mountain man Stu Sorenson and he has close encounters with beaver, elk and black bear. Finally, in the Desert Mountains of the Sierra Nevada, he explores the tragic story of the Donner Party wagon train whose members allegedly turned to cannibalism to survive. His journey ends as he pans for gold with modern day gold prospector John Gurney, and explores the boom and bust story of ghost town, Bodie.\n\n2)  Great Plains \nRay Mears explores how 500,000 square miles of flat, treeless grassland was the setting for some of the Wild West's most dramatic stories of Plains Indians, wagon trains, homesteaders and cattle drives. Ray joins the Blackfeet Indian Nation as they demonstrate bareback riding skills before a ritual buffalo hunt and sacrifice, and learns how their ancestors were dependent upon the buffalo for their survival. He follows in the wagon ruts of the early pioneers along the Oregon Trail and hitches a ride on a prairie schooner with wagon master Kim Merchant. He discovers the stories of the early homesteaders who lived in sod-houses and farmed the wild grassland around them. At a cattle auction in Dodge City he explores the story of the railways, cow-towns and the buffalo massacre. His journey across the Great Plains ends at Moore Ranch where he joins a long-horn cattle drive and learns about the life and myth of one of the Wild West's most iconic figures, the cowboy.\n\n3)  Deserts \nRay Mears looks at how the landscapes of America's five great deserts challenged the westward push of the early pioneers. As Ray travels through the cold high mountain Great Basin desert and the hot Sonoran desert of southern Arizona, he discovers how their hostile geography and rich geology shaped the stories of fortune hunting and lawlessness in the Wild West, and were the setting for the last wars between the US Army and the Apache warrior tribes. Ray's journey begins in Monument Valley, whose dramatic desert landscape has become synonymous with the Wild West years. He explores how plants and animals survive in this waterless climate and how the Navajo Indian people adapted to the conditions. In Tucson he meets up with desert coroners Bruce Anderson and Robin Reineke, who show him how the desert still kills people today. He explores how the Apache adapted their warfare methods to the desert and how the US cavalry struggled in the hot arid landscape. In Tombstone he gets to grips with the myths around law-makers and lawlessness and how it flourished in the remote desert regions of the Old West. He discovers how this forbidding landscape was the perfect refuge for bandits and pursues the outlaw trail to Butch Cassidy's hideout at Robber's Roost. His journey ends with the story of Geronimo's surrender which marked the end of the Indian Wars, and of the Old West.\n\n\nTechnical Specs\n------------------------------\n\n\n * Video Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;327a5b555a727e061c03&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n * Video Bitrate: 3033 Kbps\n * Video Aspect Ratio: 1.778 (16:9)\n * Video Resolution: 1280 x 720\n * Audio Codec: AAC LC\n * Audio English\n * Audio Bitrate: 160 Kbps VBR 48KHz\n * Audio Channels: Stereo 3\n * Run-Time: 59mins\n * Framerate: 25 FPS\n * Number of Parts: 2\n * Container Mp4\n * Part Size: 1.30 GB\n * Source: HDTV\n * Encoded by: Harry65\n\nRelease Notes\nMerged Subtitles\n\nLinks\n------------------------------\n\n1)  Further Information \n * http://www.bbc.co.uk/programmes/b044md9y\n\n2)  Related Documentaries \n * http://docuwiki.net/?title=The%20Wild%20West\n * http://docuwiki.net/?title=The%20Wild%20West%20Uncovered\n * http://docuwiki.net/?title=Riding%20America%27s%20Wild%20West\n * http://docuwiki.net/?title=How%20The%20West%20Was%20Lost\n\n","torrent":{"xt":"urn:btih:6df6d739c2b7ef26895e3e4a6c210a76e12cd223","amp;dn":"BBC.How.The.Wild.West.Was.Won.with.Ray.Mears.2of3.Great.Plains.7","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6df6d739c2b7ef26895e3e4a6c210a76e12cd223","infoHashBuffer":{"type":"Buffer","data":[109,246,215,57,194,183,239,38,137,94,62,74,108,33,10,118,225,44,210,35]},"announce":[],"urlList":[]}}