{"title":"The Mists Of Avalon","uid":3955387,"size":1470868617,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6e1d75bc503e9fdcce975aa5ef020beb9afd6eac&amp;dn=The+Mists+Of+Avalon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":4,"uploader":"valentt","files":4,"time":1199108293,"description":"Over the past two nights, I was carried away to Avalon and Camelot. Even though I&amp;#039;ve seen virtually every version of the Arthurian legends ever filmed, and was a bit hesitant about seeing yet another, this was a winner! Being told through the eyes of the women involved, who are generally reduced to Guinevere, Morgana (aka Morgaine), and the Lady of the Lake&amp;#039;s arm in most tellings, made this completely an original. I must admit that I have never been a great fan of Juliana Margulies, even though I&amp;#039;ve watched ER since it first aired, but she was wonderful as Morgaine in this. Joan Allen and Anjelica Huston gave performances worthy of the Oscars they&amp;#039;ve been nominated for, and Samantha Mathis as the ill-fated Guinevere was heartbreaking. As a final note, I believe the casting director definitely merits an Emmy, since the little girl who played young Morgaine looked EXACTLY like a pre-teen version of Juliana, and Hans Matheson, who played the evil Mordred, Morgaine&amp;#039;s son, couldn&amp;#039;t have resembled Juliana more if she&amp;#039;d have really given birth to him! As an enchanting, mythological fantasy tale, I recommend it to anyone over 14, due to a slightly graphic (necessary) sexual scene dealing with incest and one of a menage a trois nature.","torrent":{"xt":"urn:btih:6e1d75bc503e9fdcce975aa5ef020beb9afd6eac","amp;dn":"The+Mists+Of+Avalon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e1d75bc503e9fdcce975aa5ef020beb9afd6eac","infoHashBuffer":{"type":"Buffer","data":[110,29,117,188,80,62,159,220,206,151,90,165,239,2,11,235,154,253,110,172]},"announce":[],"urlList":[]}}