{"title":"Dirty Little Secrets: True Tales and Twisted Trivia About Sex","uid":10897189,"size":223620,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6ecdf621f3da0e7cd67e6cb0ed477f5c4e3940aa&amp;dn=Dirty+Little+Secrets%3A+True+Tales+and+Twisted+Trivia+About+Sex&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"mdusanjay","files":1,"time":1409162687,"description":"Dirty Little Secrets: True Tales and Twisted Trivia About Sex by Erica Orloff, Joann Baker\nEnglish | 2014 | ISBN: 0312269498 | 176 pages | EPUB | 218 KB\n\nEverything You Ever Wanted To Know About Sex But Never Thought To Ask; Answering our seemingly inexhaustible fascination with sex, Orloff and Baker present a beguiling compendium of facts, observations, lists and general oddities. From the Temple of the Vestal Virgins to the Washington Monument, this comprehensive, sometimes irreverent, and always uproarious exploration of sexuality delves deep undercover to bring readers the most fascinating and scandalous information available on humanity's oldest (and still favourite) preoccupation. For example, did you know: That until the mid-1600s, scientists believed that each sperm cell contained a tiny human being? That Romans and Egyptians used condoms, but it wasn't until a physician crafted one from sheep's intestine for Charles II that the term 'sheepskin' came into use? That by playing Six Degrees of Sexual Separation you can get Carmen Electra into bed with Joan Collins - or Al Pacino into bed with Frank Sinatra - in just six easy steps? These are just a few of the amazing facts on offer in the funniest book currently available on sex and sexuality. ","torrent":{"xt":"urn:btih:6ecdf621f3da0e7cd67e6cb0ed477f5c4e3940aa","amp;dn":"Dirty+Little+Secrets%3A+True+Tales+and+Twisted+Trivia+About+Sex","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ecdf621f3da0e7cd67e6cb0ed477f5c4e3940aa","infoHashBuffer":{"type":"Buffer","data":[110,205,246,33,243,218,14,124,214,126,108,176,237,71,127,92,78,57,64,170]},"announce":[],"urlList":[]}}