{"title":"The Onion Book of Known Knowledge [2012 Comedy] V2","uid":8006707,"size":209481549,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6f0ca3cfedad8e667e2630c16dd2685701e0ad17&amp;dn=The+Onion+Book+of+Known+Knowledge+%5B2012+Comedy%5D+V2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"rambam1776","files":-1,"time":1357905049,"description":" &lt;a href=&quot;http://www.barnesandnoble.com/w/the-onion-book-of-known-knowledge-the-onion/1113016010&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.barnesandnoble.com/w/the-onion-book-of-known-knowledge-the-onion/1113016010&lt;/a&gt;\n\nThe Onion Book of Known Knowledge - A Definitive Encyclopaedia Of Existing Information\n\n\nOverview\nAre you a witless cretin with no reason to live? Would you like to know more about every piece of knowledge ever? Do you have cash? Then congratulations, because just in time for the death of the print industry as we know it comes the final book ever published, and the only one you will ever need: The Onion's compendium of all things known.\n\nReplete with an astonishing assemblage of facts, illustrations, maps, charts, threats, blood, and additional fees to edify even the most simple-minded book-buyer, THE ONION BOOK OF KNOWN KNOWLEDGE is packed with valuable information-such as the life stages of an Aunt; places to kill one's self in Utica, New York; and the dimensions of a female bucket, or &quot;pail.&quot; With hundreds of entries for all 27 letters of the alphabet, THE ONION BOOK OF KNOWN KNOWLEDGE must be purchased immediately to avoid the sting of eternal ignorance.\n\nEntertainment Weekly\nA tome so replete with knowledge [that it allows readers] to win friends and influence people.\n\nHuffington Post\nEverything you've ever wanted to know about anything.\n\nHuffington Post Comedy\nOne of the best works that &quot;The Onion&quot; has ever produced...[it] dryly parodies an encyclopedia in the most comprehensive manner imaginable.\n\nMiami Herald\nExtremely funny.\n\nMSN's The Bubble\nForget Wikipedia, burn all your books, and snap that Encarta CD Rom in half, because The Onion has just released its BOOK OF KNOWN KNOWLEDGE.\n\nPopmatters.com\nLeave it to the geniuses at The Onion, who have revolutionized the science of sarcasmic infoengineering in the weekly print newspaper format, to do the same for the venerable encyclopedia. Miraculously, in only 250 or so pages, they have managed to cram more meaningful information about our universe into one book than Google or Bing or even Alta Vista have been able to do with several times that number of &quot;web pages&quot;.\n\nThe Economist\nLong on laughs.","torrent":{"xt":"urn:btih:6f0ca3cfedad8e667e2630c16dd2685701e0ad17","amp;dn":"The+Onion+Book+of+Known+Knowledge+%5B2012+Comedy%5D+V2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f0ca3cfedad8e667e2630c16dd2685701e0ad17","infoHashBuffer":{"type":"Buffer","data":[111,12,163,207,237,173,142,102,126,38,48,193,109,210,104,87,1,224,173,23]},"announce":[],"urlList":[]}}