{"title":"Fundamentals of Power Electronics - (Malestrom)","uid":4689892,"size":57827536,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6f5216cdc1aa9557163dcd82191d551e2e0f4be4&amp;dn=Fundamentals+of+Power+Electronics+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"malestrom_HH","files":27,"time":1233355273,"description":" &lt;a href=&quot;http://www.image-upload.net/images/bgapon0ez6a2bslhl3r.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/bgapon0ez6a2bslhl3r.jpeg&lt;/a&gt;\n\nFundamentals of Power Electronics\nPublisher: Springer | Pages: 912 | 2001-01 | ISBN 0792372700 | PDF\n\nFundamentals of Power Electronics, Second Edition, is an up-to-date and authoritative text and reference book on power electronics. This new edition retains the original objective and philosophy of focusing on the fundamental principles, models, and technical requirements needed for designing practical power electronic systems while adding a wealth of new material.\nImproved features of this new edition include:\n* A new chapter on input filters, showing how to design single and multiple section filters;\n* Major revisions of material on averaged switch modeling, low-harmonic rectifiers, and the chapter on AC modeling of the discontinuous conduction mode;\n* New material on soft switching, active-clamp snubbers, zero-voltage transition full-bridge converter, and auxiliary resonant commutated pole. Also, new sections on design of multiple-winding magnetic and resonant inverter design;\n* Additional appendices on Computer Simulation of Converters using averaged switch modeling, and Middlebrook's Extra Element Theorem, including four tutorial examples; and\n* Expanded treatment of current programmed control with complete results for basic converters, and much more.\n\nThis edition includes many new examples, illustrations, and exercises to guide students and professionals through the intricacies of power electronics design.\nFundamentals of Power Electronics, Second Edition, is intended for use in introductory power electronics courses and related fields for both senior undergraduates and first-year graduate students interested in converter circuits and electronics, control systems, and magnetic and power systems. It will also be an invaluable reference for professionals working in power electronics, power conversion, and analog and digital electronics.","torrent":{"xt":"urn:btih:6f5216cdc1aa9557163dcd82191d551e2e0f4be4","amp;dn":"Fundamentals+of+Power+Electronics+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f5216cdc1aa9557163dcd82191d551e2e0f4be4","infoHashBuffer":{"type":"Buffer","data":[111,82,22,205,193,170,149,87,22,61,205,130,25,29,85,30,46,15,75,228]},"announce":[],"urlList":[]}}