{"title":"FS2004 PMDG MD11/MD11F fully working final release","uid":4628256,"size":153980434,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6f6607e5851ac3df54fbdee21f877dc24bc03740&amp;dn=FS2004+PMDG+MD11%2FMD11F+fully+working+final+release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"Coolboybadboy","files":1,"time":1231287442,"description":"This is the FS9 (Microsoft Flight Simulator 2004 Century of flight) version of the PMDG MD11/MD11F. The official release, not this beta scrap.\n\nThe installation flow is here:\n\n\n*******************************************************************************\n**This is the FS9 (Microsoft Flight Simulator 2004 Century of flight) version!*\n*******************************************************************************\n\n\n**Install instructions:** PLEASE READ IT CAREFULLY BEFORE YOU BEGIN WITH THE INSTALLATION!\n\nTo do it so, that will save you a lot of frustration, and the urgent need to ask a lot of stupid questions :)\n\n\n*YOU SHOULD LOGIN, OR RUN THE BELOW DESCRIBED PROGRAMS WITH ADMINISTRATOR RIGHTS!*\n\n\n1: Run the EnableButton.exe, don't pay attention for the possible virus warnings, it is not a virus! This program should run during the setup process.\n\n2: Run the PMDG MD-11 FS9 Setup.exe, you don't need anything to fill in the Email, Order number etc. fields, just leave it blank.\n\n3: Click the Validate button on the installer screen, and the Next button until you're asked to choose installation type. Chose Custom. You don't need to disable your internet connection during the setup process.\n\n***********************************************************\n**** !!!IMPORTANT!!!  !!!IMPORTANT!!!  !!!IMPORTANT!!! ****\n***********************************************************\n\nIf you use any other PMDG product and you have any custom made SID/STAR files, be sure to uncheck the Terminal Procedures option! If you leave it checked, it will overwrite your custom SID/STAR files!\nIf you don't have any modified SID/STARs, you can leave the Terminal Procedures option checked, it will update the files with the most up to date wersions available at this moment.\n\n***********************************************************\n\n4: Click Install. Wait until the install finishing, then click Exit. \n\n5: Run the PMDG MD-11 FS9 Registry Fix.reg, click OK to the warning dialogs.\n\n6: Navigate to the PMDG_MD11 folder in your FS9/Aircraft folder, locate the aircraft.cfg with Notepad.\nThe simpliest way to do that, run the Notepad from the Start menu, and drag&amp;drop the aircraft.cfg file from your preferred file browser to the Notepad window. Scroll down the text, until you see this text:\n\n\n[AFDSAuth]\n---BEGIN SHA1---\n\n---END SHA1---\n\nBetween the ---BEGIN SHA1--- and the ---END SHA1--- lines copy/paste this string:\n\n\n08300E67C0812C1E75DB8E665D09BA673166DB21\n\nPlease make sure to copy all the caracters, and check you don't make a space, or any other caracters at the front, or the end of the string. Remember to save the file!\nRepeat the Step 6 in the PMDG_MD11F folder. \n\nSo, after the edit, the lines should look like this:\n\n[AFDSAuth]\n---BEGIN SHA1---\n08300E67C0812C1E75DB8E665D09BA673166DB21\n---END SHA1---\n\nThat's it! You can begin to paint this nice triple contrail to your virtual sky! But before you begin, please notice, this addon aircraft is a very very sophisticated one, make sure you read through all the manuals. That alone will be a tough thing, because just the Flight Management System's Operating manual is a 242 pages long pdf...\n\nIf you like this beautiful addon, please buy a legal copy of this masterpeace, it's really worth that money!\n\nAdd-On liveries are available at http://www.precisionmanuals.com in the Downloads&gt;Add-On Liveries section.\n\nCoolboybadboy.\n\nThis addon is tested by me on a 32bit WinXP system, these are the steps I make to work this Lady. So I don't have any experience with any other systems.\n","torrent":{"xt":"urn:btih:6f6607e5851ac3df54fbdee21f877dc24bc03740","amp;dn":"FS2004+PMDG+MD11%2FMD11F+fully+working+final+release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f6607e5851ac3df54fbdee21f877dc24bc03740","infoHashBuffer":{"type":"Buffer","data":[111,102,7,229,133,26,195,223,84,251,222,226,31,135,125,194,75,192,55,64]},"announce":[],"urlList":[]}}