{"title":"CreativeLIVE - Senior Portraits: Create the Ultimate Experience","uid":10811368,"size":7890071384,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:6f9084a8e0b527f9b406b41757892b3dc0a0071c&amp;dn=CreativeLIVE+-+Senior+Portraits%3A+Create+the+Ultimate+Experience+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"kr33","files":3,"time":1408433527,"description":"Senior Portraits: Create the Ultimate Experience with Leslie Kerrigan\n\nA comprehensive guide to senior portrait photography.\n\nHigh school seniors are energized, creative, and fun -- and the best photographers know how to take portraits that capture that spark. Join Leslie Kerrigan for a guide to designing, marketing, shooting and sustaining a senior portrait business.\n\nIn this course, you'll learn everything you need to know to create senior portrait sessions that aren't just a photo shoot, but are memorable, once-in-a-lifetime experiences. Leslie will share her unique approach to creating a style closet, providing wardrobe consultations and keeping up with the of-the-moment social networking tools teens use. You'll learn about connecting with seniors' personalities, interests, and sense of style to ensure their portraits are every bit as unique as they are. You'll hear from the teens, themselves as Leslie hosts a roundtable discussion with a group of teenagers who will talk honestly about what they want out of their senior portraits and how to reach them. You will also explore ways to leverage that personal connection into more sessions, sales, and referrals.\n\nDon't miss this opportunity to become the dynamic, must-have senior photographer for every teen in your area! \n","torrent":{"xt":"urn:btih:6f9084a8e0b527f9b406b41757892b3dc0a0071c","amp;dn":"CreativeLIVE+-+Senior+Portraits%3A+Create+the+Ultimate+Experience+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f9084a8e0b527f9b406b41757892b3dc0a0071c","infoHashBuffer":{"type":"Buffer","data":[111,144,132,168,224,181,39,249,180,6,180,23,87,137,43,61,192,160,7,28]},"announce":[],"urlList":[]}}