{"title":"A Crack in the Edge of the World: The Great Earthquake of 1906","uid":15796127,"size":3764775,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:70e904837a6fe81abec74f1a534708ec2bf659d0&amp;dn=A+Crack+in+the+Edge+of+the+World%3A+The+Great+Earthquake+of+1906&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"marty14","files":1,"time":1473459758,"description":"A Crack in the Edge of the World: The Great American Earthquake of 1906 - Simon Winchester [epub]\r\n\r\nThe international bestselling author of The Professor and the Madman and Krakatoa vividly brings to life the 1906 San Francisco Earthquake that leveled a city symbolic of America's relentless western expansion. Simon Winchester has also fashioned an enthralling and informative look at the tumultuous subterranean world that produces earthquakes, the planet's most sudden and destructive force.\r\n\r\nIn the early morning hours of April 18, 1906, San Francisco and a string of other towns were overcome by an earthquake registering 8.25 on the Richter scale, resulting from a rupture in the San Andreas fault. Lasting little more than a minute, the earthquake wrecked 490 blocks, toppled a total of 25,000 buildings, broke open gas mains, cut off electric power lines, and effectively destroyed the gold rush capital that had stood there for a half century.\r\n\r\nWinchester brings his inimitable storytelling abilities -- as well as his unique understanding of geology -- to this extraordinary event, exploring not only what happened in northern California in 1906 but what we have learned since about the geological underpinnings that caused the earthquake in the first place. A Crack in the Edge of the World is the definitive account of the San Francisco earthquake and a fascinating exploration of a legendary event that changed the way we look at the planet on which we live","torrent":{"xt":"urn:btih:70e904837a6fe81abec74f1a534708ec2bf659d0","amp;dn":"A+Crack+in+the+Edge+of+the+World%3A+The+Great+Earthquake+of+1906","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70e904837a6fe81abec74f1a534708ec2bf659d0","infoHashBuffer":{"type":"Buffer","data":[112,233,4,131,122,111,232,26,190,199,79,26,83,71,8,236,43,246,89,208]},"announce":[],"urlList":[]}}