{"title":"Mob.Wives.Season.2.DVDRip.Uncensored-MegaJoey","uid":9163847,"size":12833489479,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:717b58f7e4e9bf2e7606d9c0a515ddb03a5d3df2&amp;dn=Mob.Wives.Season.2.DVDRip.Uncensored-MegaJoey&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":6,"uploader":"ricanjoey08","files":-1,"time":1383927760,"description":"It's the second season of VH1's hit show &quot;Mob Wives&quot; and this season is intense than before. It's RAW &amp; UNCENSORED. Taken straight from DVD. Grab it while it's hot. \n\nThe second season of &quot;Mob Wives&quot; picks up where the first left off -- with each cast member dealing with major personal life issues. The rift between Karen and Drita is far from over -- will they ever be able to 'bury the hatchet'? Renee goes under the knife for major plastic surgery that may have some unexpected consequences, while also contemplating her future with her ex-husband Junior. Drita is considering her options when it comes to leaving her husband Lee -- while Carla's relationship with her estranged husband Joe may take an unexpected twist. And, of course, everyone wants to know what's in Karen's soon-to-be-released book -- the one she moved back toNew York to write!\n\nLast season, &quot;Mob Wives&quot; gave viewers an unfiltered look into the closed-door society of Renee, Karen, Carla and Drita, four struggling &quot;allegedly&quot; associated women who have to pick up the pieces and carry on while their husbands or fathers do time for Mob-related activities. United by a bond which few understand, the women are all struggling with their identities and their futures as they raise their kids as single parents in the New York City area. ","torrent":{"xt":"urn:btih:717b58f7e4e9bf2e7606d9c0a515ddb03a5d3df2","amp;dn":"Mob.Wives.Season.2.DVDRip.Uncensored-MegaJoey","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"717b58f7e4e9bf2e7606d9c0a515ddb03a5d3df2","infoHashBuffer":{"type":"Buffer","data":[113,123,88,247,228,233,191,46,118,6,217,192,165,21,221,176,58,93,61,242]},"announce":[],"urlList":[]}}