{"title":"Buffy - 6x07 - Once More With Feeling.avi","uid":3524062,"size":417620416,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:719e9f09c583ce37251dba54ab69c8697b801147&amp;dn=Buffy+-+6x07+-+Once+More+With+Feeling.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"Vebban","files":1,"time":1158252816,"description":"TV Series: &quot;Buffy the Vampire Slayer&quot; (1997)\nOriginal Air Date: 6 November 2001 (Season 6, Episode 7)\n\nGenre: Action / Drama / Fantasy / Horror (more)\n\nPlot Summary: Sunnydale is alive with the sound of music as a mysterious force causes everyone in town to burst into full musical numbers... (more) \n\n\n\nReview by &quot;djbm150&quot; from IMDB:\n\nPlot (From DVD Case): A demon named Sweet descends upon Sunnydale in search of Dawn, his arrival causing everyone to burst into song and dance - and eventually into flame.\n\nReview: Out of all the episodes of &quot;Buffy the Vampire Slayer Season Six&quot;, this has to be the must see episode. The episode is very similar to what &quot;Xena Warrior Princess&quot; did back in 1997 with the episode &amp;#039;The Bitter Suite&amp;#039;, taking the main character&amp;#039;s hidden problems and having them face them through singing. This is the episode of Season Six where everything seems to come to its peak; Buffy begins to come to reality about being torn from heaven by her friends. Willow&amp;#039;s growing addiction to magic is creating a gap between her and Tara. Xander and Anya are having doubts about their marriage. Dawn&amp;#039;s habits of stealing are getting her in trouble, and Giles believes he is only standing in his slayer&amp;#039;s way by staying in America. Plus, Spike&amp;#039;s love/hate obsession with Buffy takes a shocking turn in the end.\n\nAside from being and awesome episode that digs into the character&amp;#039;s psychologies, it also has clever and entertaining music. There is a track on this episode that everyone will like. All the actors have wonderful voices, and Joss Whedon writes magnificent lyrics for them to sing to. &quot;Going Through the Motions&quot;, &quot;I&amp;#039;ll Never Tell&quot;, &quot;Under Your Spell&quot;, and &quot;Walk Through the Fire&quot; are among the songs which you will hear. The episode is able to use the lyrics of the songs and make them humorous and heartbreaking.\n\nThis is a must-see episode for any &quot;Buffy&quot; fan. It is heartbreaking, emotional, funny, and overall well done. After watching &amp;#039;Once More, With Feeling&amp;#039; you&amp;#039;ll agree that &quot;Buffy&quot; is music to your ears.\n","torrent":{"xt":"urn:btih:719e9f09c583ce37251dba54ab69c8697b801147","amp;dn":"Buffy+-+6x07+-+Once+More+With+Feeling.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"719e9f09c583ce37251dba54ab69c8697b801147","infoHashBuffer":{"type":"Buffer","data":[113,158,159,9,197,131,206,55,37,29,186,84,171,105,200,105,123,128,17,71]},"announce":[],"urlList":[]}}