{"title":"The Money Bubble - Turk, James","uid":9447142,"size":2200549,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:72052ba0fb3ea4fe02e403bb989c6cf6d3689d53&amp;dn=The+Money+Bubble+-+Turk%2C+James&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"420weedman","files":-1,"time":1389111593,"description":"In their 2004 book The Coming Collapse of the Dollar, James Turk and John Rubino advised readers to bet against the housing bubble before it popped and to buy gold before it soared. Those were literally the two best investment ideas of the decade. \nNow Turk and Rubino are back to say that history is about to repeat. Instead of addressing the causes of the 2008 financial crisis, the world's governments have continued along the same path, accumulating even more debt and inflating even bigger financial bubbles. \nSo another -- even bigger -- crisis is coming. Whether it ends up being called a &quot;crack-up boom&quot; or &quot;the End of Paper Money&quot; or &quot;the Second Great Depression,&quot; it will change everything, from the kinds of investments that create new fortunes to the kinds of money that most of us save and spend. \nAmong many other things, the authors explain: \nHow governments are hiding the scope of the problems they face. \nWhy the world's paper currencies will soon stop functioning as money. \nHow you can protect your savings from the threats posed by this transition from &quot;unsound&quot; paper currencies to &quot;sound&quot; money like gold and silver. \nHow you can actually make money -- perhaps a lot of it -- during this transition.","torrent":{"xt":"urn:btih:72052ba0fb3ea4fe02e403bb989c6cf6d3689d53","amp;dn":"The+Money+Bubble+-+Turk%2C+James","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72052ba0fb3ea4fe02e403bb989c6cf6d3689d53","infoHashBuffer":{"type":"Buffer","data":[114,5,43,160,251,62,164,254,2,228,3,187,152,156,108,246,211,104,157,83]},"announce":[],"urlList":[]}}