{"title":"Lassie Come Home (1943) Xvid 1cd - Elizabeth Taylor, Roddy McDow","uid":10712124,"size":843296768,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:722bf1899a55e3f8865372b0284d641990d47438&amp;dn=Lassie+Come+Home+%281943%29+Xvid+1cd+-+Elizabeth+Taylor%2C+Roddy+McDow&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"SaM","files":-1,"time":1407372742,"description":"Lassie Come Home (1943) Xvid 1cd - Elizabeth Taylor, Roddy McDowall [DDR]\n\nLassie Come Home is a 1943 Metro-Goldwyn-Mayer Technicolor film starring Roddy McDowall and canine actor, Pal, in a story about the profound bond between Yorkshire boy Joe Carraclough and his rough collie, Lassie. The film was directed by Fred M. Wilcox from a screenplay by Hugo Butler based upon the 1940 novel Lassie Come-Home by Eric Knight. The film was the first in a series of seven MGM films starring &quot;Lassie.&quot;\n\nThe original film saw a sequel, Son of Lassie in 1945 with five other films following at intervals through the 1940s. A British remake of the 1943 movie was released in 2005 as Lassie to moderate success. The film has been released to VHS and DVD.\n\n   CAST:-\n    Pal (credited as &quot;Lassie&quot;) as Lassie\n    Roddy McDowall as Joe Carraclough, a Yorkshire schoolboy\n    Donald Crisp as Sam Carraclough, Joe's father\n    Elsa Lanchester as Mrs. Carraclough, Joe's mother\n    Elizabeth Taylor as Priscilla, a young girl sympathetic to Lassie's plight\n    Nigel Bruce as Duke of Rudling, grandfather to Priscilla\n    Dame May Whitty as Dally, an elderly woman who aids Lassie on her journey home\n    Ben Webster as Dan'l Fadden, married to Dally\n    Edmund Gwenn as Rowlie, a tinker who befriends Lassie\n    J. Pat O'Malley as Hynes\n    Alan Napier as Jock\n    Arthur Shields as Andrew\n    John Rogers as Snickers\n    Alec Craig as Buckles\n    George Broughton as Allen\n\nDirected by Fred M. Wilcox\nProduced by Samuel Marx\nMusic by Daniele Amfitheatrof\nRunning time 89 minutes\n\nMOVIE REVIEW:- Lassie Come Home (1943)\nSet in Depression-era Yorkshire, England, Mr. and Mrs. Carraclough (Donald Crisp and Elsa Lanchester) are hit by hard times and forced to sell their collie, Lassie (Pal), to the rich Duke of Rudling (Nigel Bruce), who has always admired her. Young Joe Carraclough (Roddy McDowall) grows despondent at the loss of his companion. Lassie will have nothing to do with the Duke, however, and finds ways to escape her kennels and return to Joe. The Duke finally carries Lassie to his home hundreds of miles distant in Scotland. There, his granddaughter Priscilla (Elizabeth Taylor) senses the dog's unhappiness and arranges her escape. Lassie then sets off for a long trek to her Yorkshire home and the boy who loves her. She faces many perils along the way, dog catchers and a violent storm, but also meets kind people who offer her aid and comfort. At the end, when Joe has given up hope of ever seeing his dog again, the weary Lassie returns to her favorite resting place in the schoolyard at home. There, Lassie is joyfully reunited with the boy she loves.\nMain cast\n\nPRODUCTION NOTES:-\nThe film was shot in Washington state and Monterey, California, while the rapids scene was shot on the San Joaquin River.\n\nDuring the film's production, MGM executives previewing the dailies were said to be so moved that they ordered more scenes to be added to &quot;this wonderful motion picture.&quot;\n\nSome sources say that, initially, a female collie was selected for the title role, but was replaced when the dog began to shed excessively during shooting of the film in the summer. The trainer, Rudd Weatherwax, then substituted the male collie, Pal, in the role of &quot;Lassie&quot;. Pal had been hired to perform the rapids stunt and, being male, looked more impressive in the part. Still other accounts, such as a 1943 New York Times article written while the film was in production, say that Pal was cast by director Fred Wilcox after first being rejected, because no other dog performed satisfactorily with the &quot;near human attributes&quot; he sought for the canine title role. Weatherwax would later receive all rights to the Lassie name and trademark in lieu of back pay owed him by MGM.\nReception\n\nThe movie was a big hit - according to MGM records it earned $2,613,000 in the US and Canada and $1,904,000 overseas, resulting in a profit of $2,249,000.\n\nThe film was nominated for an Academy Award for Best Cinematography, Color and later the character of Lassie received a Star on the Walk of Fame at 6368 Hollywood Blvd. In 1993, Lassie Come Home was selected for preservation in the United States National Film Registry by the Library of Congress as being &quot;culturally, historically, or aesthetically significant&quot;.\n\nBosley Crowther in the New York Times of October 8, 1943 uniformly praised the performers and production, noting that the film &quot;tells the story of a boy and a dog, tells it with such poignance and simple beauty that only the hardest heart can fail to be moved.&quot;\n\nAlmost 50 years after the film's release, Parade magazine discussed its lasting cultural impact, quoting the Saturday Evening Post which said the film launched Pal on &quot;the most spectacular canine career in film history&quot;. Lassie Come Home was also cited as a cultural icon in Jane and Michael Stern's 1992 book, Encyclopedia of Pop Culture.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Bitrate: 1295 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams: 2\nAudio Languages: English\nRunTime: 89 mins\nSubtitles: NONE\nRipped by: Trinidad [DDR]   \nDuration: 89 mins","torrent":{"xt":"urn:btih:722bf1899a55e3f8865372b0284d641990d47438","amp;dn":"Lassie+Come+Home+%281943%29+Xvid+1cd+-+Elizabeth+Taylor%2C+Roddy+McDow","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"722bf1899a55e3f8865372b0284d641990d47438","infoHashBuffer":{"type":"Buffer","data":[114,43,241,137,154,85,227,248,134,83,114,176,40,77,100,25,144,212,116,56]},"announce":[],"urlList":[]}}