{"title":"Joseph Brodsky - Nobel Prize in Literature, 1987 (9 books)","uid":11727870,"size":23902878,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:725dc2bf6b279a8ac1592fe8421d8f67abdc991b&amp;dn=Joseph+Brodsky+-+Nobel+Prize+in+Literature%2C+1987+%289+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":2,"uploader":"workerbee","files":18,"time":1425148817,"description":"\nJOSEPH BRODSKY [Iosif Aleksandrovich Brodsky] (1940-1996) was a Russian and American poet and essayist.  Born in Leningrad, Brodsky ran afoul of Soviet authorities and was expelled from the Soviet Union in 1972, settling in America with the help of W. H. Auden and other supporters.  Brodsky was awarded the 1987 Nobel Prize in Literature &quot;for an all-embracing authorship, imbued with clarity of thought and poetic intensity.&quot;  He was appointed United States Poet Laureate in 1991.\n\nThroughout his career he wrote in Russian and English, self-translating and working with eminent poet-translators.  Brodsky is perhaps most known for his poetry collections A PART OF SPEECH (1977) and TO URANIA (1988).  The latter collects his work between 1965-1985, including material written during his American exile, and reflects on themes of memory, home and loss.\n\nHe is also noted for his essay collections -- LESS THAN ONE (1986), which won the National Book Critics Circle Award, and ON GRIEF AND REASON (1995) -- which include memorable critical studies of such poets as Osip Mandelshtam, W. H. Auden, Thomas Hardy, Rainer Maria Rilke and Robert Frost, sketches of his own life, and those of contemporaries such as Akhmatova, Nadezhda Mandelshtam, and Stephen Spender.  Other notable works include WATERMARK, a prose collection (1992).\n\nA recurring theme in Brodsky's writing is the relationship between the poet and society.  In particular, he emphasized the power of literature to positively impact its audience and to develop the language and culture in which it is situated.  He suggested that the Western literary tradition was in part responsible for the world having overcome the catastrophes of the 20th century, such as Nazism, Communism and the World Wars.\n\n\nThe following books are in PDF format:\n\n* A PART OF SPEECH (Farrar Straus Giroux, 1980).\n\n* DISCOVERY (Farrar Straus Giroux, 1999).  Illustrations by Vladimir Radunsky.\n\n* LESS THAN ONE: Selected Essays (Farrar Straus Giroux, 1986).\n\n* NATIVITY POEMS (Farrar Straus Giroux, 2001).\n\n* ON GRIEF AND REASON: Essays (Farrar Straus Giroux, 1995).  [Note p. 358 is missing in the original]\n\n* SELECTED POEMS (Penguin, 1973).  Translated and introduced by George L. Kline, with a Foreword by W. H. Auden.\n\n* SO FORTH: Poems (Farrar Straus Giroux, 1996).\n\n* TO URANIA: Selected Poems 1965-1985 (Farrar Straus Giroux, 1988).\n\n* WATERMARK (Farrar Straus Giroux, 1992).\n\n_____________________________________________________________________________\n\n\n&gt;&gt; CONTACT ME\nYou may reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\n &lt;a href=&quot;\nhttps://pirates-forum.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://pirates-forum.org/User-workerbee&lt;/a&gt;  \n\n&gt;&gt; PLEASE HELP TO SEED!\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:725dc2bf6b279a8ac1592fe8421d8f67abdc991b","amp;dn":"Joseph+Brodsky+-+Nobel+Prize+in+Literature%2C+1987+%289+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"725dc2bf6b279a8ac1592fe8421d8f67abdc991b","infoHashBuffer":{"type":"Buffer","data":[114,93,194,191,107,39,154,138,193,89,47,232,66,29,143,103,171,220,153,27]},"announce":[],"urlList":[]}}