{"title":"LitexMedia Youtube Video Grabber v1.9.9 with Key [iahq76]","uid":7829694,"size":12911918,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:728be4318222693b50f75323244ad3a73744ff8a&amp;dn=LitexMedia+Youtube+Video+Grabber+v1.9.9+with+Key+%5Biahq76%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"TorDigger","files":3,"time":1353020065,"description":"YouTube Video Grabber\n\ndownload and convert videos from YouTube\n\nYouTube Video Grabber is a YouTube downloader you can use to save your favorite online videos to your computer in wide range of different video formats. So you can make a hard copy of those videos, transfer them on other computer without Internet access, upload them on your mobile phone, iPad, PocketPC, PSP or any other portable device able to play video files. In addition to support of all well known online video services this software can also try to scan for embedded videos on some general internet site, all you need to do is provide URL of this page. Another feature worth to mention here is a plug-in implementation of video downloading engines for each online service, they are kept up to date and available to download with in-built online update service. If you found a site with embedded video which was not recognized by YouTube Video Grabber you can send a request to us using in-built request form, to get a plug-in update or even new plug-in supporting video downloads from this site.\n\nMain Features of YouTube Video Grabber:\n\nWell known online video services support\nThis software can download and convert online videos from all well known online services like YouTube, Google Video, MySpace, iFilm, Break, PutFile.\nOffline video conversion\nYou can also convert previously downloaded video files to any format supported by YouTube Video Grabber.\nMultiple output video formats support\nSupports conversion to wide range of video formats, such as AVI, 3GP, 3GPP, WMV, DivX, Xvid, WMV, MPEG-1, MPEG-2, MPEG-3, MPEG-4.\nAudio track extraction \nYou can save audio track of any video file or online video to audio file. MP3, WMA, M4A, AAC, RA audio formats of output file are supported.\nGeneral internet page embedded video download\nSoftware can search for supported online video on any internet page you provide, download and convert them to desired video format.\nExtension plug-in modules support\nVideo tracking is implemented as set of plug-in modules with online updates. You can also request for new plug-in if you found an internet page with video not supported by YouTube Video Grabber.\nFull drag and drop support\nYou can drag files already saved on your computer from Windows Explorer or any other program and drop them to YouTube Video Grabber, drag'n'drop of URLs from your internet browser is also supported.\nWindows Clipboard support\nYou can Copy and Paste URLs with online video from Windows Clipboard, auto track for URLs to online video sites as well.\nBatch download and conversion\nBatch processing implemented to speed up mass download and conversion of video files.\nYouTube auto-login\nFor those people who have accounts on YouTube this software offers auto-login to save files which require to be logged in to access them.\n\nSystem Requirements:\n\nWindows 98/NT/2000/ME/XP/Vista/Windows 7/Windows 8\nAbout 10 Mb free hard drive space\nInternet connection\n\nHomepage: http://www.litexmedia.com/youtube-grabber/\n\nInstallation Instructions:\n\n1. Install program.\n2. Use given key to register application.\n3. Done, Enjoy.","torrent":{"xt":"urn:btih:728be4318222693b50f75323244ad3a73744ff8a","amp;dn":"LitexMedia+Youtube+Video+Grabber+v1.9.9+with+Key+%5Biahq76%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"728be4318222693b50f75323244ad3a73744ff8a","infoHashBuffer":{"type":"Buffer","data":[114,139,228,49,130,34,105,59,80,247,83,35,36,74,211,167,55,68,255,138]},"announce":[],"urlList":[]}}