{"title":"[DVDRip-XVID-MP3-ITA] Natale In Crociera SVD [CR-Bt]","uid":4643276,"size":730173440,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:728f65a8f539e9c90d094f436620276d82abc249&amp;dn=%5BDVDRip-XVID-MP3-ITA%5D+Natale+In+Crociera+SVD+%5BCR-Bt%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"CR-Bt","files":1,"time":1231792309,"description":"Paolo (Christian De Sica) vuole trascorrere del tempo con Magda, la propria amante (Aida Yespica), e con uno stratagemma spedisce la moglie Francesca (Nancy Brilli) e il figlio in montagna. Il tentato suicidio del cognato Felice, cambia i piani di Paolo che lo accompagnerÃƒÂ  in crociera ai caraibi per distrarlo, senza perdere la possibilitÃƒÂ  di invitare di nascosto anche la giovane Magda. Sulla stessa nave anche Michela (Michelle Hunziker), animalista convinta, e Luigi (Fabio De Luigi), autore del libro &quot;Single ÃƒÂ¨ bello&quot;, si incontrano, ignari di cosa li aspetterÃƒÂ  durante un matrimonio che si celebrerÃƒÂ  proprio in crociera.\nOgni anno ci si pone sempre la stessa domanda: &quot;ÃƒË† corretto giudicare un film che ÃƒÂ¨ entrato nelle tradizioni degli italiani?&quot;. Sarebbe come criticare il cappone del pranzo di Natale. PuÃƒÂ² piacere o non piacere, un anno puÃƒÂ² essere piÃƒÂ¹ buono, l'altro meno. PerÃƒÂ² ÃƒÂ¨ sempre il cappone di Natale. Ogni critica non conta.\nNeri Parenti ha infatti sufficiente esperienza, maestria e conoscenza del pubblico italiano e riesce ad alternare ovvietÃƒÂ  richieste a qualche trovata piÃƒÂ¹ interessante (come il personaggio di Fabio De Luigi), lasciando il film all'inerzia nel finale, necessario per avere una chiusa. In effetti, si potrebbe quasi dire che i film di Vacanze di Natale sono rappresentati da un solo lungometraggio della durata di 25 anni. Natale in crociera che ÃƒÂ¨ rappresentato in un ambiente delimitato (la nave), cosÃƒÂ¬ come lo erano gli hotel, i villaggi e i paesaggi di mondi vicini (le nostre spiagge e le nostre piste da sci) e lontani (l'India e l'Egitto), si avvale di attori che sono degli ottimi professionisti e che qualche risata la riesco a strappare. A tutti. Da Christian De Sica a Fabio De Luigi (il migliore), a Michelle Hunziker. Il cappone ÃƒÂ¨ servito. Buon Natale.\n\n\nScreenshot &lt;a href=&quot;\nhttp://uptiki.com/images/x1uaymw3a9906ef058e.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://uptiki.com/images/x1uaymw3a9906ef058e.png&lt;/a&gt;","torrent":{"xt":"urn:btih:728f65a8f539e9c90d094f436620276d82abc249","amp;dn":"%5BDVDRip-XVID-MP3-ITA%5D+Natale+In+Crociera+SVD+%5BCR-Bt%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"728f65a8f539e9c90d094f436620276d82abc249","infoHashBuffer":{"type":"Buffer","data":[114,143,101,168,245,57,233,201,13,9,79,67,102,32,39,109,130,171,194,73]},"announce":[],"urlList":[]}}