{"title":"Space Pirates And Zombies 2 (Early Access - 5/17/2016)","uid":14640696,"size":769007258,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:72a472424c654ac4ffc56afc48cba2bed254de5d&amp;dn=Space+Pirates+And+Zombies+2+%28Early+Access+-+5%2F17%2F2016%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"mercs215","files":1,"time":1463516795,"description":"Install instructions:\r\nCredits: thanks to sabin1981 for the release!\r\n- Download and extract \r\n- Play\r\nPLEASE REMEMBER TO SEED, MANY OTHERS WANT THIS! :)\r\nIf you like this game, support the developers and BUY IT!\r\n\r\nTitle: Space Pirates And Zombies 2\r\nGenre: Action, Adventure, Indie, RPG, Simulation, Strategy, Early Access\r\nDeveloper: MinMax Games Ltd. \r\nPublisher: MinMax Games Ltd.\t\r\nRelease Date: May 17, 2016\r\nStore page: http://store.steampowered.com/app/252470/\r\n\r\nAbout:\r\nIn SPAZ 2 you must survive in an evolving post apocalyptic Galaxy. The zombie threat is defeated, infrastructure has collapsed, fuel is scarce, and scavenging means survival. \r\nInitially the Galaxy contains hundreds of fleets, each trying to survive. AI captains do everything the player can. The player is not special and is not the center of the Galaxy. \r\nAs resource scarcity becomes critical, ships come into conflict just to survive. Factions may form for protection or split due to starvation. Old friends must become fodder. \r\nStronger factions establish and defend territories, set up resource hubs, and establish star bases. Weaker factions may resort to banditry. Each captain is unique, persistent, and shapes the Galaxy. \r\nWhen factions meet, combat is usually the result. While the strategic side of SPAZ 2 is about exploration, territorial control, and faction building, the action side of SPAZ 2 is about ship construction, tactics, and salvage. \r\nCombat creates damaged ships and dead crew, but it also provides new salvaged parts. All the parts in SPAZ 2 are modular and randomly generated. If you see something you like, break it off an enemy, grab it with your tractor beam, and connect it to your ship. Ship construction can be done live during battles, though sometimes beating an enemy to death with their broken wing is also fun. \r\nBack on the star map, battles will attract other captains looking for salvage. Take your new parts and run. Upgrade, repair, and prepare to fight another day, for darker threats are about to emerge. \r\n\r\nKey Features: \r\nTwo hundred persistent Captains that are able to do everything the player can, including forming dynamic factions, building structures, controlling territory, and going to War. \r\nA true living galaxy that is not player centric. It will develop differently each game through the interactions of the agents. \r\nBuild your own faction from nothing. \r\nRandomly generated modular parts. Build the mothership that suits your play style, on the fly, in seconds. Every part has its own unique stats that contribute to the mothership. Every part has its own hull integrity and damage states. Every part is a real, working, ship component. \r\nStrategic ship building. The mass, location and shape of parts all matter. If a part blocks a turret, it will not fire. If a ship is too long, it will turn slowly. Too many engines will mean too little power for weapons. Every design choice counts. \r\nA fully physics based 3d environment where everything is destructible, takes damage from impacts, can be grabbed and even thrown at enemies with the tractor beam. \r\nNatural movement and controls. Movement is on a 2d plane and screen relative, much like an FPS. The combat feels like huge pirate ships battling on an ocean. Focus on tactical positioning and manage system power to unleash hell at the right moment. \r\nEpic ship to ship battles. Tear the enemy apart piece by piece over minutes, instead of seconds.\r\n\r\nSystem Requirements\r\nMINIMUM: \r\nOS: Windows XP/Vista/7/8/10 \r\nProcessor: 2.6 Ghz Dual Core \r\nMemory: 2 GB RAM \r\nGraphics: 1GB 3D DirectX 9 Compatible video card \r\nDirectX: Version 9.0c \r\nStorage: 1 GB available space\r\n\r\nRECOMMENDED: \r\nOS: Windows XP/Vista/7/8/10 \r\nProcessor: 3.1 Ghz Dual Core \r\nMemory: 4 GB RAM \r\nGraphics: 2GB 3D DirectX 9 Compatible video card \r\nDirectX: Version 9.0c \r\nStorage: 1 GB available space","torrent":{"xt":"urn:btih:72a472424c654ac4ffc56afc48cba2bed254de5d","amp;dn":"Space+Pirates+And+Zombies+2+%28Early+Access+-+5%2F17%2F2016%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72a472424c654ac4ffc56afc48cba2bed254de5d","infoHashBuffer":{"type":"Buffer","data":[114,164,114,66,76,101,74,196,255,197,106,252,72,203,162,190,210,84,222,93]},"announce":[],"urlList":[]}}