{"title":"New Doctor Who - Season 04 (2008) - 13 HD Episodes + 2 SD Specia","uid":10726298,"size":15597124903,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:72b52a767509880f89ea56108c8ad079c53885d2&amp;dn=New+Doctor+Who+-+Season+04+%282008%29+-+13+HD+Episodes+%2B+2+SD+Specia&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":4,"uploader":"bnaron","files":-1,"time":1407565619,"description":"New Doctor Who - Season 04 (2008) - 13 HD Episodes + 2 SD Specials\n\n\nSeries Description Courtesy:\n\nWikipedia, the free encyclopedia\nen.wikipedia.org/wiki/Doctor_Who_(series_4)\n\n\n\n\nThe fourth season of British science fiction television program Doctor Who began on 25 December 2007 with the Christmas special &quot;Voyage of the Damned&quot;. Following the special, a regular series of thirteen episodes aired, starting with &quot;Partners in Crime&quot; on 5 April 2008 and ending with &quot;Journey's End&quot;. &quot;Partners in Crime&quot; marked the debut of Donna Noble, as played by Catherine Tate, as a full-time companion to the Tenth Doctor. A short Children in Need special was also produced. The series started production on 8 August 2007 and concluded on 29 March 2008\n\nNOTE: You will find the Christmas Special in the 2007 season torrent. Although the BBC indicates that it is the season opener for season 04, since it was broadcast in 2007, I placed it in the 2007 season torrent instead.\n\nThe concept of the &quot;Doctor-Lite&quot; episodes (which included &quot;Love &amp; Monsters&quot; from Season 2 and &quot;Blink&quot; in Season 3), in which the Doctor plays a minimal part in the action of the story, was taken further in this season with the addition of a &quot;Companion-Lite&quot; episode; &quot;Midnight&quot; is a story primarily featuring the Doctor, with Donna only in scenes at the beginning and end of the episode, while &quot;Turn Left&quot; equally has the Doctor playing a minimal role, instead focusing on Donna.\n\n\nTotal Episodes: 13\nTotal Specials:  2\n\n\nEpisode Synopses courtesy of:\n\nThe On-line TV Database\nAn Open Database for Television Fans\nwww.thetvdb.com\n\n\n2008-04-05 - Partners in Crime (Video:H264 1280x720, 2940kbps, 23fps - Audio:AAC 44.1kHz, 190kbps)\n\nLocation: London\nDate: 2009\nEnemies: Adipose, Miss Foster\n\nDuring an alien emergency in London, a woman called Donna Noble must search for an old friend who can save the day - a man named the Doctor. But can even the Doctor halt the plans of the mysterious Miss Foster?\n\n\n2008-04-12 - The Fires of Pompeii (Video:H264 1280x720, 2964kbps, 23fps - Audio:AAC 44.1kHz, 190kbps)\n\nLocation: Pompeii\nDate: 23rd/24th August 79AD\nEnemies: Pyrovile \n\nThe Doctor takes Donna back to Pompeii, on the day of the eruption of Mt. Vesuvius, and is faced with a great moral dilemma. Should they warn the residents of the impending disaster, or let history take its natural course?\n\n\n2008-04-19 - Planet of the Ood (Video:H264 1280x720, 2944kbps, 23fps - Audio:AAC 44.1kHz, 190kbps)\n\nLocation: Ood-Sphere\nDate: 4126\nEnemies: Mr. Halpen, Ood Operations \n\nThe Doctor and Donna find themselves on an icy planet known as the Ood-Sphere. There they discover what drove the Ood to be a servant race.\n\n\n2008-04-26 - The Sontaran Stratagem (1) (Video:H264 1280x720, 2937kbps, 23fps - Audio:AAC 44.1kHz, 191kbps)\n\nLocation: Modern-day Earth\nDate: 2009\nEnemies: Sontarans \n\nAided by the Rattigan Academy, the Sontarans establish a covert base at the mysterious ATMOS Factory. Can the Doctor stop the Sontarans from unleashing a potent terror that will bring the world to its knees?\n\n\n2008-05-03 - The Poison Sky (2) (Video:H264 1280x720, 2939kbps, 23fps - Audio:AAC 44.1kHz, 190kbps)\n\nLocation: Earth\nDate: 2009\nEnemies: The Sontarans\n\nThe Sontarans continue their evil plot and begin to &quot;choke&quot; the Earth. The Doctor and Donna, now teamed with Martha have to stop them! Can they save Earth before it's too late?\n\n\n2008-05-10 - The Doctor's Daughter (Video:H264 1280x720, 2958kbps, 23fps - Audio:AAC 44.1kHz, 190kbps)\n\nLocation: Messaline\nDate: 60120724 (New Byzantine Calendar)\nEnemies: The Hath\n\nThe Doctor lands on the remote planet Messaline as an age-old war rages and the threat of genocide looms. When Martha is kidnapped by the Hath, the Doctor is distracted by &quot;the most important woman in his life.&quot;\n\n\n2008-05-17 - The Unicorn and the Wasp (Video:H264 1280x720, 2950kbps, 23fps - Audio:AAC 44.1kHz, 190kbps)\n\nLocation: England, Earth\nDate: December 3rd 1926\nEnemies: Vespiforms\n\nThe Doctor and Donna meet Agatha Christie at a manor owned buy Lady Eddison. When Agatha Christie goes missing and a body turns up in the library the adventure turns into a pulp sci-fiction murder mystery, with a murder, a jewel thief, and a wasp alien. Can they solve the mystery?\n\n\n2008-05-31 - Silence in the Library (1) (Video:H264 1280x720, 2930kbps, 23fps - Audio:AAC 44.1kHz, 190kbps)\n\nLocation: The Library\nDate: 51st century\nEnemies: Vashta Nerada\n\nThe Doctor and Donna land in a frightening position in the far future. While investigating a derelict library, the duo come face to face with the disembodied mind of a little girl, an archaeological team led by a woman from the Doctor's future, and swarms of flesh-eating creatures that are seen only as shadows.\n\n\n2008-06-07 - Forest of the Dead (2) (Video:H264 1280x720, 2938kbps, 23fps - Audio:AAC 44.1kHz, 190kbps)\n\nLocation: The Library\nDate: 51st Century\nEnemies: Vashta Nerada\n\nThe Doctor and Donna land in a frightening position in the far future. While investigating a derelict library, the duo come face to face with the disembodied mind of a little girl, an archaeological team led by a woman from the Doctor's future, and swarms of flesh-eating creatures that are seen only as shadows\n\n\n2008-06-14 - Midnight (Video:H264 1280x720, 2928kbps, 23fps - Audio:AAC 44.1kHz, 190kbps)\n\nLocation: Planet Midnight\nDate: unknown\nEnemies: unknown - possessive creature\n\nWhile visiting the planet Midnight, a beautiful and luxury planet, full of lavishes and high-tech cities, a terrifying problem arises that leaves The Doctor powerless.\n\n\n2008-06-21 - Turn Left (Video:H264 1280x720, 2958kbps, 23fps - Audio:AAC 44.1kHz, 190kbps)\n\nLocation: Earth\nDate: 2007/2008/2009\nEnemies: Member of the Trickster's Brigade\n\nWhilst attending a carnival on the Chino-planet of Shan Shen, Donna is cajoled into having her fortune read, where her past is carefully examined. With the Doctor missing, Donna must work with Rose, a traveler from a parallel universe, to prevent darkness encompassing the whole of the universe.\n\n\n2008-06-28 - The Stolen Earth (1) (Video:H264 1280x720, 2945kbps, 23fps - Audio:AAC 44.1kHz, 190kbps)\n\nLocation: Earth, The Medusa Cascade, The Shadow Proclamation\nDate: 2009\nEnemies: The Daleks and Davros\n\nThe Earth has been moved, and it's a race against time as Donna and the Doctor try to find it before the Daleks destroy everything; they head for the Shadow Proclamation and the Medusa Cascade. Meanwhile on Earth a veritable bevy of ex-companions join together to contact the Doctor and take down the Daleks. Can Captain Jack, Sarah-Jane, Martha Jones and Rose find the Doctor in time.\n\n\n2008-07-05 - Journey's End (2) (Video:H264 1280x720, 2956kbps, 23fps - Audio:AAC 44.1kHz, 191kbps)\n\nLocation: The Dalek Crucible and Earth\nDate: 2009\nEnemies: The Daleks and Davros\n\nThe Earth has been overwhelmed and the universe faces dominion by the resurgent forces of a terrifying and limitless empire led by one of The Doctor's greatest enemies. Aiding the Time Lord in a final battle are several of his closest allies and companions, but for one of them, a price will be paid.\n\n\n2007 Specials \n\n\n2008-07-27 - Special - (Proms 2008) - Music of the Spheres (Video:H264 512x288, 886kbps, 24fps - Audio:AAC 44.1kHz, 106kbps)\n\nThe Tenth Doctor (David Tennant) lies on the TARDIS floor composing a symphony whilst listening to the &quot;Music of the Spheres&quot; - the Universe's gravity patterns fed through the TARDIS harmonic filter producing a musical sound. The Graske (Jimmy Vee) teleports into the TARDIS to warn the Doctor about a space portal that promptly opens in the TARDIS linking it to the Royal Albert Hall during a Proms concert. The Doctor converses with the audience revealing that he played the tuba at the very first Proms, making a joke about Beethoven's deafness and implying that he has met him. The Doctor sends his own sheet music through the portal to the orchestra to have his symphony, Ode to the Universe, played by them. As the orchestra plays the Doctor's symphony conducted by the Doctor himself with his sonic screwdriver, the Graske steals the Doctor's water pistol and uses the portal to get to Earth. The Graske sprays some of the audience in the Royal Albert Hall with water before being pulled back through the portal by the Doctor who reversed the polarity of the neutron flow. The Doctor reverses the teleport and sends the Graske to the other side of the galaxy. The Doctor tells the audience to listen out for the &quot;Music of the Spheres&quot; that is all around them before returning to the TARDIS console to close the portal.\n\n\n2008-12-25 - Special - (Christmas 2008) - The Next Doctor (Video:H264 640x368, 889kbps, 24fps - Audio:AAC 44.1kHz, 109kbps)\n\nLocation: London, England\nDate: Christmas Eve, 1851\nEnemies: Cybermen\n\nThe Doctor arrives in Victorian London, it's Christmas, but the snow isn't the only thing descending on the tranquil and jubilant civilization...familiar silver giants of an alternate reality are amassing in numbers, The Cybermen are on the move again, and the only beings who can stop them are The Doctor...and another Doctor? \n\n","torrent":{"xt":"urn:btih:72b52a767509880f89ea56108c8ad079c53885d2","amp;dn":"New+Doctor+Who+-+Season+04+%282008%29+-+13+HD+Episodes+%2B+2+SD+Specia","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72b52a767509880f89ea56108c8ad079c53885d2","infoHashBuffer":{"type":"Buffer","data":[114,181,42,118,117,9,136,15,137,234,86,16,140,138,208,121,197,56,133,210]},"announce":[],"urlList":[]}}