{"title":"Economics In One Lesson - Henry Hazlitt (EPUB, MOBI)","uid":11780740,"size":944671,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:73d50c0289b45b43ee78e5bd35163742b2fb59b8&amp;dn=Economics+In+One+Lesson+-+Henry+Hazlitt+%28EPUB%2C+MOBI%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":null,"files":2,"time":1427563287,"description":"Free pdf here: http://mises.org/library/economics-one-lesson\n\nConverted to EPUB and MOBI from here: https://thepiratebay.se/torrent/5737395/Henry_Hazlitt_Economics_in_One_Lesson_(Improved)\n\nHenry Hazlitt wrote this book following his stint at the New York Times as an editorialist. His hope was to reduce the whole teaching of economics to a few principles and explain them in ways that people would never forget. It worked. He relied on some stories by Bastiat and his own impeccable capacity for logical thinking and crystal-clear prose.\n\nHe was writing under the influence of Mises himself, of course, but he brought his own special gifts to the project. As just one example, this is the book that made the idea of the &quot;broken window fallacy&quot; so famous. Concise and instructive, it is also deceptively prescient and far-reaching in its efforts to dissemble economic fallacies that are so prevalent they have almost become a new orthodoxy.\n\nThis is the book to send to reporters, politicians, pastors, political activists, teachers, or anyone else who needs to know. It is probably the most important economics book ever written in the sense that it offers the greatest hope to educating everyone about the meaning of the science.\n\nMany writers have attempted to beat this book as an introduction, but have never succeeded. Hazlitt's book remains the best. It's still the quickest way to learn how to think like an economist. And this is why it has been used in the best classrooms for more than sixty years","torrent":{"xt":"urn:btih:73d50c0289b45b43ee78e5bd35163742b2fb59b8","amp;dn":"Economics+In+One+Lesson+-+Henry+Hazlitt+%28EPUB%2C+MOBI%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73d50c0289b45b43ee78e5bd35163742b2fb59b8","infoHashBuffer":{"type":"Buffer","data":[115,213,12,2,137,180,91,67,238,120,229,189,53,22,55,66,178,251,89,184]},"announce":[],"urlList":[]}}