{"title":"HitFilm Plugins 1.0 for AE (Team VR fixed) [ChingLiu]","uid":10047918,"size":22909144,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:746f0483951767ea4d0b27cbc29126f2ae623a03&amp;dn=HitFilm+Plugins+1.0+for+AE+%28Team+VR+fixed%29+%5BChingLiu%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"Ching_Liu","files":-1,"time":1398563443,"description":"The ultimate VFX, compositing &amp; motion graphics collection.\n\nHitFilm technology - HitFilm effects are available for the first time as plugins, GPU-accelerated and optimized for high performance and professional rendering quality.\n\nOver 130 plugins - This versatile collection ranges from visual effects and green screen compositing to motion graphics and color grading. There's something for every project.\n\nEffects &amp; compositing\n\nThe 130 HitFilm Plugins have been selected to provide power, flexibility and value. Explore 3D muzzle flashes, distortion and warp effects, 3D extrusion, rolling shutter correction, temporal manipulation and much more.\n\nOrganic particle arrays - Create complex systems of thousands of particles with extensive fractal shape and dispersion controls.\n\nKeying &amp; matte generation - Composite layers using professional chroma key, integrated spill suppression, procedural light wrap, matte clean-up, channel controls and fine color correction.\n\nLights &amp; flares - Design beautiful lens flares and add procedural lens dirt, anamorphic streaks, volumetric light rays and high detail glows. Fully customizable and can be used individually or in combination.\n\nPyro effects - Explore explosive visual effects including customizable, infinitely variable, 3D muzzle flashes, procedural fire simulation and fully animated lightning and electricity.\n\nCinematic grading\n\nOver 30 HitFilm Plugins are dedicated to color correction, grading and visual styling.\n\nColorist toolkit - Your actors look their best with pro skin retouching and vibrance boosts to local detail and saturation. Meanwhile cine style creates a highly customizable cinematic look with s-curve and palette enhancements.\n\nVisual power - Realistic film and TV damage grunge, bleach bypass and 3-strip processing simulation, day for night with integrated horizon split, cartoon edges and newspaper half-tone styles are all easy to apply with extensive customization.\n\nOver 130 plugins\n\nHitFilm Plugins is a huge and varied collection, ranging from procedural visual effects to compositing and color grading.\n\nSystem Requirements\n\n* Operating systems : Microsoft Windows 8 (64-bit), Microsoft Windows 7 (64-bit)\n* Hosts : Adobe After Effects CS6 &amp; CC\n* Hard disk space : Up to 600MB \n* Processor : Intel Core i3, Core i5, Core i7 or Intel Xeon (Nehalem) \n* RAM : 4GB \n* Graphics card : OpenGL 2.0 capable hardware with at least 512 MB video memory\n-NVIDIA GeForce 9 Series\n-Radeon HD 5000 series\n-Intel HD 4000\n\nLanguage : English\n\nHomepage :  &lt;a href=&quot;\nhttp://hitfilm.com/plugins&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://hitfilm.com/plugins&lt;/a&gt;","torrent":{"xt":"urn:btih:746f0483951767ea4d0b27cbc29126f2ae623a03","amp;dn":"HitFilm+Plugins+1.0+for+AE+%28Team+VR+fixed%29+%5BChingLiu%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"746f0483951767ea4d0b27cbc29126f2ae623a03","infoHashBuffer":{"type":"Buffer","data":[116,111,4,131,149,23,103,234,77,11,39,203,194,145,38,242,174,98,58,3]},"announce":[],"urlList":[]}}