{"title":"The Venture Bros Brothers Season 1,2 extras [Geophage]","uid":3652189,"size":6759711234,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7482043459ec84d60db5aca77e5fd4987d60bc2b&amp;dn=The+Venture+Bros+Brothers+Season+1%2C2+extras+%5BGeophage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":7,"uploader":"mike18xx","files":41,"time":1175412248,"description":"This torrent contains:\n\n* The Venture Bros. pilot episode: &quot;The Terrible Secret of Turtle Bay&quot;\n* Season 1 - all episodes, high-quality XviD TV rips by Geophage, 1/3rd CD size (233mb)\n* Season 2 - all episodes, high-quality XviD TV rips by Geophage, 1/3rd CD size (233mb)\n* Christmas special\n* Monarch&amp;#039;s phone calls to Dr. Girlfriend and henchmen (MP3)\n-- This is ALL of the officially produced Venture Bros. material as of 3/31/2007.\n\nTV &quot;spam&quot; present: &quot;TVMA&quot; logo briefly at beginning, then small, translucent &quot;adult swim&quot; logo later on. No end-credit commercials.\n\nThe Venture Bros. scored a &quot;10&quot; on The Cartoon Rating Guide for Smart Adults.\n\n\n\nNOTICE #1: This torrent will be uploaded via uTorrent in super-seeding mode. Choke/disconnect abusing clients such as BitComet and BitLord will be aggressively banned by IP address in PeerGuardian. The &quot;patch&quot; to those clients which enables them to masquerade as another client does NOT change their abusive behavior; any peer constantly disconnecting and reconnecting will be banned -- this means the you will never receive seed pieces, only hand-me-downs. If you&amp;#039;re a BitComet user, do yourself a favor and get a super-seed supporting client, or you&amp;#039;ll get slower DL speeds in this torrent.\n\nImportant: If you strangle your upload speed, a super-seeding client (me) will refrain from sending you new seed pieces until it sees previous ones sent to you appear in another peer -- so, the faster your UL speed, the faster you get new pieces.\n\nNOTICE #2: Many of you will be DLing this torrent for season 2 only, since you already have the season 1 Geophage rips. My client will, in super-seed mode, start at the &quot;left&quot;, or the beginning -- which will be season 1. If you want the season 2s more quickly, you&amp;#039;ll have to &quot;trick&quot; my client by helping me seed season 1s. The way to do this is to pre-allocate the torrent, then stop or cancel the download in the client. Now go move your season 1 copies (which you&amp;#039;ve obtained elsewhere) to the appropriate places (renaming if necessary). Then relaunch the torrent and make your client re-check the folder (it should register it as half-done). My seeding client will, upon seeing a peer with those files already present, register season 1 as &quot;less rare&quot; and begin sending out season 2 pieces..\n &lt;a href=&quot;\nhttp://z.about.com/d/animatedtv/1/7/2/C/vb_logo.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://z.about.com/d/animatedtv/1/7/2/C/vb_logo.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:7482043459ec84d60db5aca77e5fd4987d60bc2b","amp;dn":"The+Venture+Bros+Brothers+Season+1%2C2+extras+%5BGeophage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7482043459ec84d60db5aca77e5fd4987d60bc2b","infoHashBuffer":{"type":"Buffer","data":[116,130,4,52,89,236,132,214,13,181,172,167,126,95,212,152,125,96,188,43]},"announce":[],"urlList":[]}}