{"title":"Hole - Pretty On The Inside (1991) 320 vtwin88cube","uid":6060235,"size":95424422,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:760d6d09229c85ca22d77da5790ae59a41e02974&amp;dn=Hole+-+Pretty+On+The+Inside+%281991%29+320+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1293090734,"description":"Hole\nPretty On The Inside (1991)\n\nHole is an American alternative rock band that originally formed in Los Angeles in 1989. The band is fronted by vocalist/songwriter and rhythm guitarist Courtney Love, who co-founded Hole with former songwriter/lead guitarist Eric Erlandson. Hole achieved considerable commercial and critical success throughout the 1990s.\n\nThe band made a splash in the underground rock scene in 1991 with their debut album, Pretty on the Inside, which was admittedly abrasive and raw in style. Their second studio album, Live Through This (1994), which was slightly more grunge-oriented, was critically acclaimed and has been regarded as one of the greatest albums of all time, as well as their most notable work.\n\nHole's musical style was initially influenced heavily by punk rock, no wave and noise rock, though as they progressed they began to incorporate elements of grunge and pop rock into their sound; the band's third album, Celebrity Skin (1998), fused hard rock with various pop elements, contrasting to their rougher punk rock-oriented past. Celebrity Skin went on to be the band's most commercially successful album, garnering them immense critical attention as well as several Grammy nominations.\n\nIn 2009, seven years after disbanding in 2002, Love announced she was reforming Hole with former Larrikin Love guitarist Micko Larkin. Erlandson, however, stated that no reunion could take place contractually without mutual involvement between Love and Erlandson. On January 1, 2010, a website promoting Hole's latest release, Nobody's Daughter, was launched, with links to various social media pages including Facebook, Twitter, YouTube and MySpace. The album was released on April 27, 2010.\n\nChannels:\t\t2 (stereo)\nSample Rate:\t\t44.1 KHz\nSample Size:\t\t16 bit\nBit Rate:\t\t320 kbps\n\nAudio Quality:\t\tVery High (Lossy)\nEncoder:\t\tLAME 3.98r\nEncoder Settings:\tConstant Bit Rate 320 kbps (Insane)\nContains:\t\tAlbum Art, ID Tag [ID3v2.3 (ANSI) &amp; ID3v1.1]\n\nFormat:\t\t\tMp3\nGenre:\t\t\tAlternative\t\t\nM3U Playlist:\t\tYes\n\n01.Teenage Whore\n02.Babydoll\n03.Garbage Man\n04.Sassy\n05.Good Sister/Bad Sister\n06.Mrs. Jones\n07.Berry\n08.Loaded\n09.Star Belly\n10.Pretty On The Inside/Clouds\n\n\nCheers!","torrent":{"xt":"urn:btih:760d6d09229c85ca22d77da5790ae59a41e02974","amp;dn":"Hole+-+Pretty+On+The+Inside+%281991%29+320+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"760d6d09229c85ca22d77da5790ae59a41e02974","infoHashBuffer":{"type":"Buffer","data":[118,13,109,9,34,156,133,202,34,215,125,165,121,10,229,154,65,224,41,116]},"announce":[],"urlList":[]}}