{"title":"Divergent - Veronica Roth Audiobook","uid":7825594,"size":326765506,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:7631bb3589fea4ddef0954c4d5425c903f78b359&amp;dn=Divergent+-+Veronica+Roth+Audiobook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"acidr0p","files":2,"time":1352919906,"description":"Mp3 format audiobook\n\nIn Beatrice Prior's dystopian Chicago, society is divided into five factions, each dedicated to the cultivation of a particular virtue--Candor (the honest), Abnegation (the selfless), Dauntless (the brave), Amity (the peaceful), and Erudite (the intelligent). On an appointed day of every year, all sixteen-year-olds must select the faction to which they will devote the rest of their lives. For Beatrice, the decision is between staying with her family and being who she really is--she can't have both. So she makes a choice that surprises everyone, including herself.\nDuring the highly competitive initiation that follows, Beatrice renames herself Tris and struggles to determine who her friends really are--and where, exactly, a romance with a sometimes fascinating, sometimes infuriating boy fits into the life she's chosen. But Tris also has a secret, one she's kept hidden from everyone because she's been warned it can mean death. And as she discovers a growing conflict that threatens to unravel her seemingly perfect society, she also learns that her secret might help her save those she loves . . . or it might destroy her.\nDebut author Veronica Roth bursts onto the literary scene with the first book in the Divergent series--dystopian thrillers filled with electrifying decisions, heartbreaking betrayals, stunning consequences, and unexpected romance.","torrent":{"xt":"urn:btih:7631bb3589fea4ddef0954c4d5425c903f78b359","amp;dn":"Divergent+-+Veronica+Roth+Audiobook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7631bb3589fea4ddef0954c4d5425c903f78b359","infoHashBuffer":{"type":"Buffer","data":[118,49,187,53,137,254,164,221,239,9,84,196,213,66,92,144,63,120,179,89]},"announce":[],"urlList":[]}}