{"title":"Carnival of Souls 1962 DvdRip Avi Lee1001","uid":9828931,"size":735666632,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7634494f26b1fd0b9aca288459101ea89c1bb082&amp;dn=Carnival+of+Souls+1962+DvdRip+Avi+Lee1001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"xultfoad","files":2,"time":1395810209,"description":"Carnival of Souls 1962 DvdRip Avi Lee1001\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0055830/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0055830/&lt;/a&gt; &lt;a href=&quot;\nhttps://en.wikipedia.org/wiki/Carnival_of_Souls&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://en.wikipedia.org/wiki/Carnival_of_Souls&lt;/a&gt;\nBringing dead films back to life one at a time.\nIn your run-of-the-mill horror movies, someone comes back from the grave, right? But in the case of &quot;Carnival of Souls,&quot; it's the fright flick itself that's returned from the dead. This 1961 low-budget sleeper garnered a cult following largely from late-night TV watchers and the folks who visit Video Vault and subscribe to Psychotronic magazine; now it has become The Movie That Would Not Die.\n\nThis low-budget, independently made black-and-white film is one of the sleepers of 1960s fantasy cinema. While highly acclaimed, none of the people involved ever worked in the industry again and few people saw Carnival of Souls until a major revival in late 1980's.\n\n&quot;Carnival of Souls&quot; is an odd, obscure horror film that was made on a low budget in 1962 in Lawrence, Kan., and still has an intriguing power. Like a lost episode from &quot;Twilight Zone,&quot; it places the supernatural right in the middle of everyday life and surrounds it with ordinary people. The movie is being revived in art houses around the country for Halloween, and it's possible that it plays better today than when it was released. It ventures to the edge of camp, but never strays across the line, taking itself with an eerie seriousness.\n\nThe movie stars Candace Hilligoss, one of those worried blonds like Janet Leigh in &quot;Psycho,&quot; (1960) as a young woman who goes along for the ride when two hot-rodders hold a drag race. On a narrow wooden bridge, one of the cars crashes through a railing and plunges into the flooded river below. Police and volunteers search for the wreckage in vain, and then Hilligoss appears on a sandbar, dazed and covered with mud.\n\nWhat happened to the others? How did she escape? She doesn't know. Indeed, she doesn't care. She's a brittle, cynical woman who works as a church organist but doesn't take religion seriously. That's despite the fact that the organ seems to be trying to tell her something. There is a sensational overhead shot in an organ factory, looking down past the steep and angled pipes to her diminutive figure far below, and another effective moment when she's in a car on a deserted highway and the radio only picks up organ music.\n\nA few days after she crawls out of the river, the woman leaves town for a job playing the organ in Utah, and in one of the movie's best shots, a cadaverous face appears in the car window. It's the face of a ghostly figure who will follow her to Utah (the figure is played by the film's director, Herk Harvey). In Utah, she checks into one of those B-movie boarding houses, presided over by the cherubic Frances Feist. There's one other boarder, a Mr. Linden (Sidney Berger), who is a definitive study of a nerd in lust.\n\nUnlike most of today's horror movies, &quot;Carnival of Souls&quot; has few special effects - some wavy lines as we pass through various levels of existence, and that's it. Instead, it depends on crisp black-and-white photography, atmosphere and surprisingly effective acting. It's impossible to know whether this movie was seen by such directors as David Lynch or George Romero. But in the way it shows the horror beneath the surface of placid small-town life, it suggests &quot;Blue Velvet,&quot; and a shot of dead souls at an abandoned amusement park reminded me of the lurching undead in &quot;The Night of the Living Dead.&quot;\n\nCarnival Of Souls might have its rough edges but they can't obscure the fact that this is one of the most original and unsettling horror movies to come out of America during its B-movie saturated, drive-in friendly period.\n\nVIDEO\nSize.... 701mb\nDuration.... 01:18:06\nCodec.... divx\nFrame Width..... 576\nFrame Height.... 432\nData Rate.... 1173kbps\nFrame Rate.... 23 F/S\nAUDIO\nBit Rate.... 82kbps.... MP3\n1 Channel mono\nAudio Sample Rate.... 48 KHz\nBits Per Sample 16 Bit/Sample","torrent":{"xt":"urn:btih:7634494f26b1fd0b9aca288459101ea89c1bb082","amp;dn":"Carnival+of+Souls+1962+DvdRip+Avi+Lee1001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7634494f26b1fd0b9aca288459101ea89c1bb082","infoHashBuffer":{"type":"Buffer","data":[118,52,73,79,38,177,253,11,154,202,40,132,89,16,30,168,156,27,176,130]},"announce":[],"urlList":[]}}