{"title":"Black April: The Fall of South Vietnam 1973-75","uid":15760313,"size":4365740,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:763b650d67bbb08931c3e426943318465035f958&amp;dn=Black+April%3A+The+Fall+of+South+Vietnam+1973-75&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"marty14","files":1,"time":1473105751,"description":"Black April: The Fall of South Vietnam 1973-75 - George J. Veith [epub]\r\n\r\nThe defeat of South Vietnam was arguably America’s worst foreign policy disaster of the 20th Century. Yet a complete understanding of the endgame—from the 27 January 1973 signing of the Paris Peace Accords to South Vietnam’s surrender on 30 April 1975—has eluded us.\r\n\r\nBlack April addresses that deficit. A culmination of exhaustive research in three distinct areas: primary source documents from American archives, North Vietnamese publications containing primary and secondary source material, and dozens of articles and numerous interviews with key South Vietnamese participants, this book represents one of the largest Vietnamese translation projects ever accomplished, including almost one hundred rarely or never seen before North Vietnamese unit histories, battle studies, and memoirs. Most important, to celebrate the 30th Anniversary of South Vietnam’s conquest, the leaders in Hanoi released several compendiums of formerly highly classified cables and memorandum between the Politburo and its military commanders in the south. This treasure trove of primary source materials provides the most complete insight into North Vietnamese decision-making ever complied. While South Vietnamese deliberations remain less clear, enough material exists to provide a decent overview.\r\n\r\nUltimately, whatever errors occurred on the American and South Vietnamese side, the simple fact remains that the country was conquered by a North Vietnamese military invasion despite written pledges by Hanoi’s leadership against such action. Hanoi’s momentous choice to destroy the Paris Peace Accords and militarily end the war sent a generation of South Vietnamese into exile, and exacerbated a societal trauma in America over our long Vietnam involvement that reverberates to this day. How that transpired deserves deeper scrutiny","torrent":{"xt":"urn:btih:763b650d67bbb08931c3e426943318465035f958","amp;dn":"Black+April%3A+The+Fall+of+South+Vietnam+1973-75","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"763b650d67bbb08931c3e426943318465035f958","infoHashBuffer":{"type":"Buffer","data":[118,59,101,13,103,187,176,137,49,195,228,38,148,51,24,70,80,53,249,88]},"announce":[],"urlList":[]}}