{"title":"Kennedy Hudner - Zgiełk Wojny. Tom 1 [Audiobook PL] eds [  ]","uid":14690533,"size":503934365,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:764ea7d86f18042d44bb1f0dbc3227523a32506b&amp;dn=Kennedy+Hudner+-+Zgie%C5%82k+Wojny.+Tom+1+%5BAudiobook+PL%5D+eds+%5BMP3%4064%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"everdarksoul","files":86,"time":1464194503,"description":"Audiobook PL - 84 części /   \r\nrozmiar: 480 MB / czas: 17:06:29\r\nczyta: Roch Siemianowski\r\n\r\nLudzkość opuściła Starą Ziemię i skolonizowała odległe światy. Stało się to możliwe dzięki odkryciu tuneli czasoprzestrzennych, które skróciły drogę do układów gwiezdnych z planetami nadającymi się do zamieszkania.\r\nWłaśnie dlatego sektor Victorii stał się węzłem komunikacyjnym i handlowym dla pozostałych systemów zasiedlonych przez ludzi: znajduje się tutaj aż siedem tuneli czasoprzestrzennych - i aż siedem powodów, aby zdobyć ten obszar kosmosu...\r\nRozwijające się mocarstwa - Cesarstwo Tilleke i Dominium Zjednoczenia Ludowego - pragną więc zawładnąć sektorem Victorii. Chociaż już od stuleci ludzkość żyje w pokoju, zawiązuje się spisek. Na viktoriańskich granicach trwają przygotowania do wojny...\r\nEmily Tuttle - historyczka, która nie znalazła perspektyw na swojej rodzimej planecie i postanowiła zaciągnąć się do Floty Kosmicznej Victorii - jeszcze nie wie, że już na początku swojej kariery weźmie udział w prawdziwych starciach w kosmosie i przeleje ludzką krew…\r\n\r\n&quot;Zgiełk Wojny&quot; jest pierwszą częścią cyklu Science-Fiction pod tym samym tytułem - i co może być pewną ciekawostką: tworzonym przez kobietę, 38-letnią prawniczkę. Cykl ten jak dotąd składa się z dwóch części (z czego w jęz. polskim wydano dopiero część pierwszą), całość zaś wstępnie planowana jest jako trylogia. Cykl zaczął powstawać 7 lat temu, a inspiracją dla &quot;Zgiełku Wojny&quot; (org. Alarm of War) była po części powieść &quot;The Yom Kippur War&quot; Abrahama Rabinovich'a - wg. autorki: jedna z 5 najlepszych militarno-historycznych powieści, jakie kiedykolwiek zostały wydane.\r\n\r\ncykl Zgiełk Wojny:\r\n\r\n1 - Zgiełk Wojny (Alarm of War 1: Alarm o War)\r\n\r\n2 - Alarm of War 2: The Other Side of Fear\r\n3 - ???","torrent":{"xt":"urn:btih:764ea7d86f18042d44bb1f0dbc3227523a32506b","amp;dn":"Kennedy+Hudner+-+Zgie%C5%82k+Wojny.+Tom+1+%5BAudiobook+PL%5D+eds+%5BMP3%4064%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"764ea7d86f18042d44bb1f0dbc3227523a32506b","infoHashBuffer":{"type":"Buffer","data":[118,78,167,216,111,24,4,45,68,187,31,13,188,50,39,82,58,50,80,107]},"announce":[],"urlList":[]}}