{"title":"Walking with... Monsters, Dinosaurs, Beasts, Cavemen (Eng Subs)","uid":5251116,"size":5751697512,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:767ddcf4300dc0c8a6470a94fe742fa007015479&amp;dn=Walking+with...+Monsters%2C+Dinosaurs%2C+Beasts%2C+Cavemen+%28Eng+Subs%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":8,"uploader":"impact0r","files":-1,"time":1262360243,"description":"Basic Knowledge series [L]\n==========================\n\n\n\nWalking with Monsters\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Walking_with_Monsters&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Walking_with_Monsters&lt;/a&gt;\n\n&quot;Walking with Monsters&quot; (also &quot;Walking with Monsters: Life before Dinosaurs&quot;) is a three-part British documentary film series about life in the Paleozoic, bringing to life extinct arthropods, fish, amphibians, synapsids, and reptiles. It is narrated by Kenneth Branagh, and by Avery Brooks in the American version. Using state-of-the-art visual effects, this prequel to Walking with Dinosaurs shows for example how a two-ton predatory fish came on land to hunt. The series draws on the knowledge of over 600 scientists and shows nearly 300 million years of Paleozoic history, from the Cambrian Period (530 million years ago) to the Early Triassic Period (248 million years ago). It was written and directed by Tim Haines.\nAs with some of the other BBC specials, it was renamed in North America, where its title was Before the Dinosaurs: Walking With Monsters. It has also aired as a two-hour special on the Canadian and American Discovery Channel.\nAt the 58th Primetime Emmy Awards in 2006 it won the Emmy Award in the category Outstanding Animated Program (For Programming One Hour or More).\n\n----------------------\n\nWalking with Dinosaurs\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Walking_with_Dinosaurs&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Walking_with_Dinosaurs&lt;/a&gt;\n\nWalking with Dinosaurs was a six-part documentary television mini-series that was produced by the BBC, narrated by Kenneth Branagh, and first aired in the UK in 1999. The series was subsequently aired in North America on the Discovery Channel in 2000, with Branagh's voice replaced with that of Avery Brooks. It is the first entry of the Walking with... series and used computer-generated imagery and animatronics to recreate the life of the Mesozoic, showing dinosaurs in a way that previously had only been seen in feature films. The program's aim was to simulate the style of a nature documentary and therefore does not include &quot;talking head&quot; interviews. The series used paleontologists such as Peter Dodson, Peter Larson and James Farlow as advisors (their influence in the filming process can be seen in the documentary Walking with Dinosaurs - The Making Of).\nThe Guinness Book of World Records reported that the series was the most expensive documentary series per minute ever made.\n\n----------------------\n\nWalking with Beasts\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Walking_with_Beasts&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Walking_with_Beasts&lt;/a&gt;\n\nWalking with Beasts is a 2001 six-part television documentary produced by the BBC in the United Kingdom, narrated by Kenneth Branagh. In North America it has been retitled Walking with Prehistoric Beasts, and the original Discovery Channel broadcast was narrated by Stockard Channing. Like its predecessor, Walking with Dinosaurs, it recreates life in the Cenozoic by using a combination of both Computer-generated imagery and animatronics. However, the Miocene period is not included. Also like its predecessor, it was re-edited and re-narrated as a second &quot;season&quot; of Prehistoric Planet for the Discovery Kids lineup.\nSome of the concepts it illustrates are the evolution of whales, the evolution of the horse, and the evolution of humans.\n\n----------------------\n\nWalking with Cavemen\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Walking_with_Cavemen&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Walking_with_Cavemen&lt;/a&gt;\n\nWalking with Cavemen is a four-part television documentary series about human evolution produced by the BBC in the United Kingdom. It was originally released in April 2003. It was subsequently presented in the United States as a two-part series by the Discovery Channel and its affiliates. The documentary was produced largely by the same team who produced the award-winning documentary series Walking with Dinosaurs (1999), Walking with Beasts (2001) and Walking with Monsters (2005), though the original series' director, Tim Haines, was not involved. There was an accompanying book of the same title.\n\n----------------------\n\nEnglish subtitles included\n\n\n\n* * * * * * * * *\n\n\n'Basic Knowledge' series from impact0r contains, as the name suggests, knowledge every human being should posses, unless he/she is mentally impaired or an allotted for termination Big Brother enthusiast.\n\nIt comes in these flavours:\n[C] - Cosmos\n[E] - Earth\n[L] - Life\n","torrent":{"xt":"urn:btih:767ddcf4300dc0c8a6470a94fe742fa007015479","amp;dn":"Walking+with...+Monsters%2C+Dinosaurs%2C+Beasts%2C+Cavemen+%28Eng+Subs%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"767ddcf4300dc0c8a6470a94fe742fa007015479","infoHashBuffer":{"type":"Buffer","data":[118,125,220,244,48,13,192,200,166,71,10,148,254,116,47,160,7,1,84,121]},"announce":[],"urlList":[]}}