{"title":"Franz Kafka - The Metamorphosis (Norton Critical Edition)","uid":10588058,"size":7447298,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:76a56e373341b5d1a9b46a8092b3b73ae6eaf155&amp;dn=Franz+Kafka+-+The+Metamorphosis+%28Norton+Critical+Edition%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"workerbee","files":-1,"time":1405729607,"description":"\nFranz Kafka - The Metamorphosis (Norton Critical Edition, 1996).  Translated and edited by Stanley Corngold.\n\nISBN: 0393967972 | 232 pages | PDF\n\n\nFranz Kafka's 1915 masterpiece is presented in this Norton Critical Edition in the acclaimed translation by Stanley Corngold based on the definitive German edition.\n\nThe novella is fully annotated and is accompanied by selected textual variants.  &quot;Backgrounds and Contexts&quot; introduces readers to &quot;The Metamorphosis&quot; in the richest possible setting.  The links between the author's life and his work are explored through an examination of his personal writings.  Kafka's letters and diary entries illuminate the creative process behind his portrait of Gregor Samsa, his family, and their nightmarish ordeal.  &quot;Criticism&quot; collects seven essays from the period 1970-95 representing the most important currents in literary theory -- semiotics, feminism, identity philosophy, New Historicism, and post-Freudian cultural psychoanalysis.  The essays offer a variety of perspectives on the novella by Iris Bruce, Nina Pelikan Straus, Kevin W. Sweeney, Mark Anderson, Hartmut Binder, Eric Santner, and Stanley Corngold.  A &quot;Chronology and Selected Bibliography&quot; are also included.\n\nThis PDF is an improved versions of an older scan, in which the page images have been completely reprocessed with contents in bookmarks and accurate pagination.\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                         &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n","torrent":{"xt":"urn:btih:76a56e373341b5d1a9b46a8092b3b73ae6eaf155","amp;dn":"Franz+Kafka+-+The+Metamorphosis+%28Norton+Critical+Edition%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76a56e373341b5d1a9b46a8092b3b73ae6eaf155","infoHashBuffer":{"type":"Buffer","data":[118,165,110,55,51,65,181,209,169,180,106,128,146,179,183,58,230,234,241,85]},"announce":[],"urlList":[]}}