{"title":"The Jewish Study Bible (JPS Tanakh) (pdf)","uid":8768224,"size":41589450,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:76e0020baaf88f862addd446091b343407b1af9a&amp;dn=The+Jewish+Study+Bible+%28JPS+Tanakh%29+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"pharmakate","files":-1,"time":1375384615,"description":"Adele Berlin, Marc Zvi Brettler, Michael Fishbane (editors), The Jewish Study Bible: Featuring the Jewish Publication Society Tanakh Translation (Oxford University Press, 2003). 2181 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\nQuality of the pdf is generally very good, but some page bleed-through can be seen in the in-text maps. Also, in the printed edition the name of each biblical book appears in Hebrew in grayscale, but this didn't scan well, so I eliminated the Hebrew titles. (The text of the book itself is English only.) Please let me know if any significant mistakes or defects are found in this file.\n\n\nExtremely good study Bible -- the notes and essays display a sane, intelligent attempt to mediate the demands of traditional and modern scholarship, something I wish Christian interpreters would learn from. And anyone, regardless of religious commitment, can learn a lot from this book that would be difficult to find elsewhere in accessible form.\n\n\ndescription:\n\nThe Jewish Study Bible is a one-volume resource tailored especially for the needs of students of the Hebrew Bible. Nearly forty scholars worldwide contributed to the translation and interpretation of the Jewish Study Bible, representing the best of Jewish biblical scholarship available today. A committee of highly-respected biblical scholars and rabbis from the Orthodox, Conservative, and Reform Judaism movements produced this modern translation.\n\nNo knowledge of Hebrew is required for one to make use of this unique volume. The Jewish Study Bible uses The Jewish Publication Society TANAKH Translation.\n\nSince its publication, the Jewish Study Bible has become one of the most popular volumes in Oxford's celebrated line of bibles. The quality of scholarship, easy-to-navigate format, and vibrant supplementary features bring the ancient text to life. \n\n--Informative essays that address a wide variety of topics relating to Judaism's use and interpretation of the Bible through the ages. \n--In-text tables, maps, and charts. \n--Tables of weights and measures. \n--Verse and chapter differences. \n--Table of Scriptural Readings. \n--Glossary of technical terms. \n--An index to all the study materials. \n--Full color New Oxford Bible Maps, with index.\n\n\nFrom Publishers Weekly\n\nSerious students of Judaism will want to have a copy of this outstanding and surprisingly affordable study Bible, which stands in the tradition of Oxford's great study Bibles. Using the Jewish Publication Society translation, the books of the Jewish canon are presented in their traditional order: Torah (the five books of Moses); Nevi'im (the major and minor prophets); and Kethuvim (the other writings). Leading Jewish scholars introduce each book and offer extensive sidebar commentary, discussing the views of ancient and modern rabbinic scholars. In addition, the volume provides two dozen scholarly essays on different aspects of interpretation: the Bible's use in various periods in Jewish history, in the liturgy, in the Dead Sea Scrolls. There are essays on biblical languages, canonization, textual criticism, philosophical and mystical traditions, and biblical poetry. This landmark volume is at once serious and accessible, and spans the spectrum of Jewish thought. \n\nReview\n\n&quot;The Jewish Study Bible encompasses a monumental assembly of critical learning and acumen, representing the achievement of an entire generation of Jewish scholars. The commentaries are not only erudite but purposeful and theologically alert. A heroic undertaking, brilliantly conceived and executed with panache.&quot;--Jacob Neusner\n\n&quot;Serious students of Judaism will want to have a copy of this outstanding and surprisingly affordable study Bible, which stands in the tradition of Oxford's great study Bibles.&quot;--Publishers Weekly, Religion Bookline\n\n&quot;Another superb holiday gift, especially appropriate for non-Orthodox Jews, is The Jewish Study Bible from Oxford University Press, which finally stands alongside the many verse-by-verse commentaries for Christians. This work also is recommended for serious-minded Christian readers.&quot;--Associated Press\n\n----------------------------\n\nNote: This is a Jewish Bible and therefore does not include the New Testament. For a fine Jewish interpretation of the NT, see this: \n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8221242&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8221242&lt;/a&gt;\n","torrent":{"xt":"urn:btih:76e0020baaf88f862addd446091b343407b1af9a","amp;dn":"The+Jewish+Study+Bible+%28JPS+Tanakh%29+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76e0020baaf88f862addd446091b343407b1af9a","infoHashBuffer":{"type":"Buffer","data":[118,224,2,11,170,248,143,134,42,221,212,70,9,27,52,52,7,177,175,154]},"announce":[],"urlList":[]}}