{"title":"Graham Hancock - Supernatural- Meetings With the Ancient Teacher","uid":5470321,"size":20361980,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:772ca05cc9e7c933b838ac151f327ae2ce14c4fe&amp;dn=Graham+Hancock+-+Supernatural-+Meetings+With+the+Ancient+Teacher&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"geogaddi000","files":4,"time":1269858755,"description":"Supernatural: Meetings with the Ancient Teachers of Mankind Summary:\n\n[img=http://image.ebook30.com/data_images/2009/08/15/1250375290-61e4waiz0vl.jpg]\n \nBy Graham Hancock\n\n    * Publisher:   The Disinformation Company\n    * Number Of Pages:   480\n    * Publication Date:   2007-10-01\n    * ISBN-10 / ASIN:   1932857842\n    * ISBN-13 / EAN:   9781932857849\n\nProduct Description:\n\nLess than fifty thousand years ago mankind had no art, no religion, no sophisticated symbolism, no innovative thinking. Then, in a dramatic and electrifying change, described by scientists as &quot;the greatest riddle in human history,&quot; all the skills and qualities that we value most highly in ourselves appeared already fully formed, as though bestowed on us by hidden powers. In Supernatural Graham Hancock sets out to investigate this mysterious &quot;before-and-after moment&quot; and to discover the truth about the influences that gave birth to the modern human mind.\n\nHis quest takes him on a detective journey from the stunningly beautiful painted caves of prehistoric France, Spain, and Italy to rock shelters in the mountains of South Africa, where he finds extraordinary Stone Age art. He uncovers clues that lead him to the depths of the Amazon rainforest to drink the powerful hallucinogen Ayahuasca with shamans, whose paintings contain images of &quot;supernatural beings&quot; identical to the animal-human hybrids depicted in prehistoric caves. Hallucinogens such as mescaline also produce visionary encounters with exactly the same beings. Scientists at the cutting edge of consciousness research have begun to consider the possibility that such hallucinations may be real perceptions of other &quot;dimensions.&quot; Could the &quot;supernaturals&quot; first depicted in the painted caves be the ancient teachers of mankind? Could it be that human evolution is not just the &quot;meaningless&quot; process that Darwin identified, but something more purposive and intelligent that we have barely begun to understand?\n\nThis newly revised edition of Supernatural is now available for the first time as a paperback original.\n\nGraham Hancock is the author of the international bestsellers The Sign and The Seal, Fingerprints of the Gods, and Heaven's Mirror. His books have sold more than five million copies.","torrent":{"xt":"urn:btih:772ca05cc9e7c933b838ac151f327ae2ce14c4fe","amp;dn":"Graham+Hancock+-+Supernatural-+Meetings+With+the+Ancient+Teacher","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"772ca05cc9e7c933b838ac151f327ae2ce14c4fe","infoHashBuffer":{"type":"Buffer","data":[119,44,160,92,201,231,201,51,184,56,172,21,31,50,122,226,206,20,196,254]},"announce":[],"urlList":[]}}