{"title":"Laughter Really Is the Best Medicine - Editors Of Reader's Diges","uid":9997120,"size":2746260,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:773b9a6ff9468b492731b155e95442244d57470d&amp;dn=Laughter+Really+Is+the+Best+Medicine+-+Editors+Of+Reader%27s+Diges&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1397935536,"description":"This collection of laugh-out-loud jokes, one-liners, and other lighthearted glimpses of life-drawn from Reader's Digest magazine's most popular humor columns-is sure to tickle the funny bone. Packed with more than 1,000 jokes, anecdotes, cartoons, quotes, and stories contributed by professional comedians, joke writers, and readers of the magazine, this side-splitting compilation pokes fun at the facts and foibles of daily routines, illustrating that life is often funnier than fiction\n\nDid you hear about the Broadway actor who broke through the floorboards? He was just going through a stage What did the ill comic say in the hospital? &quot;I'm here...all weak!&quot; Charles Dickens walks into a bar and orders a martini. The bartender asks, &quot;Olive or twist?&quot; Posted in a dental office: &quot;Be kind to your dentist. He has fillings too.&quot; &quot;The main advantage of being famous is that when you bore people at dinner parties, they think it is their fault.&quot; -Henry Kissinger, Nobel Peace Prize, 1973 As Groucho Marx once said, &quot;A laugh is like an aspirin, only it works twice as fast.&quot;","torrent":{"xt":"urn:btih:773b9a6ff9468b492731b155e95442244d57470d","amp;dn":"Laughter+Really+Is+the+Best+Medicine+-+Editors+Of+Reader%27s+Diges","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"773b9a6ff9468b492731b155e95442244d57470d","infoHashBuffer":{"type":"Buffer","data":[119,59,154,111,249,70,139,73,39,49,177,85,233,84,66,36,77,87,71,13]},"announce":[],"urlList":[]}}