{"title":"Programming Collective Intelligence: Building Smart Web 2.0 Appl","uid":3857688,"size":3462755,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:776b78ef6229929a3b7b59ad6b0384e8415c2c27&amp;dn=Programming+Collective+Intelligence%3A+Building+Smart+Web+2.0+Appl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"bjc23","files":1,"time":1193296130,"description":"This fascinating book demonstrates how you can build web applications to mine the enormous amount of data created by people on the Internet. With the sophisticated algorithms in this book, you can write smart programs to access interesting datasets from other web sites, collect data from users of your own applications, and analyze and understand the data once you&amp;#039;ve found it.\n\nWant to tap the power behind search rankings, product recommendations, social bookmarking, and online matchmaking? This fascinating book demonstrates how you can build Web 2.0 applications to mine the enormous amount of data created by people on the Internet. With the sophisticated algorithms in this book, you can write smart programs to access interesting datasets from other web sites, collect data from users of your own applications, and analyze and understand the data once you&amp;#039;ve found it.\n\nProgramming Collective Intelligence takes you into the world of machine learning and statistics, and explains how to draw conclusions about user experience, marketing, personal tastes, and human behavior in general -- all from information that you and others collect every day. Each algorithm is described clearly and concisely with code that can immediately be used on your web site, blog, Wiki, or specialized application. This book explains:\n\n    * Collaborative filtering techniques that enable online retailers to recommend products or media\n    * Methods of clustering to detect groups of similar items in a large dataset\n    * Search engine features -- crawlers, indexers, query engines, and the PageRank algorithm\n    * Optimization algorithms that search millions of possible solutions to a problem and choose the best one\n    * Bayesian filtering, used in spam filters for classifying documents based on word types and other features\n    * Using decision trees not only to make predictions, but to model the way decisions are made\n    * Predicting numerical values rather than classifications to build price models\n    * Support vector machines to match people in online dating sites\n    * Non-negative matrix factorization to find the independent features in a dataset\n    * Evolving intelligence for problem solving -- how a computer develops its skill by improving its own code the more it plays a game\n\nEach chapter includes exercises for extending the algorithms to make them more powerful. Go beyond simple database-backed applications and put the wealth of Internet data to work for you.\n\n&quot;Bravo! I cannot think of a better way for a developer to first learn these algorithms and methods, nor can I think of a better way for me (an old AI dog) to reinvigorate my knowledge of the details.&quot;\n-- Dan Russell, Google\n\n&quot;Toby&amp;#039;s book does a great job of breaking down the complex subject matter of machine-learning algorithms into practical, easy-to-understand examples that can be directly applied to analysis of social interaction across the Web today. If I had this book two years ago, it would have saved precious time going down some fruitless paths.&quot;\n-- Tim Wolters, CTO, Collective Intellect\n\n&lt;http://www.oreilly.com/catalog/9780596529321/&gt;","torrent":{"xt":"urn:btih:776b78ef6229929a3b7b59ad6b0384e8415c2c27","amp;dn":"Programming+Collective+Intelligence%3A+Building+Smart+Web+2.0+Appl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"776b78ef6229929a3b7b59ad6b0384e8415c2c27","infoHashBuffer":{"type":"Buffer","data":[119,107,120,239,98,41,146,154,59,123,89,173,107,3,132,232,65,92,44,39]},"announce":[],"urlList":[]}}