{"title":"The True Lives of the Fabulous Killjoys (01 - 06) (complete)(- N","uid":9458974,"size":272226507,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:7780fd01e87c4a37341268753dcfc35a5743ed3f&amp;dn=The+True+Lives+of+the+Fabulous+Killjoys+%2801+-+06%29+%28complete%29%28-+N&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"nemesis43","files":6,"time":1389317480,"description":"Written by My Chemical Romance frontman and Umbrella Academy creator Gerard Way with art by Becky Cloonan (Demo), this series is set in a dystopian future where both counterculture and forced assimilation occur behind masks. Set in Battery City after the deaths of the original Killjoys in a semi-failed attempt to rescue The Girl from the clutches of corporate machine, B.L.I., new Killjoys are popping up every day. Among them, Val Velocity and his gang, who live at the Nest. Meanwhile, Cherri Cola and Dr. Death-Defying keep the spirit of the original Killjoys alive on the airwaves.\n\nWhat role will B.L.I. Scarecrow Korse play? What is so special about The Girl, anyway? No spoilers here; see for yourselves. Way's storytelling style for this series is distinctive from previous work in Umbrella Academy books. While there are echoes of Tom Morello's Orchid and Godkiller, this series promises to be original and enduring.\n\nRELIGIONISHNESS IN A DYSTOPIAN WORLD\n\nPornBots like Red and Blue wait for the return of Destroya to &quot;come down from the sky&quot; and liberate them. The alternative is being reclaimed by B.L.I. and cannibalized for parts in satellites and other machines. The souls of the dead are ferried elsewhere by the Phoenix Queen. Beware the Draculoids (a.k.a. &quot;The Black and Whites&quot;), for if they get you in their clutches, it means corrosion for your soul.","torrent":{"xt":"urn:btih:7780fd01e87c4a37341268753dcfc35a5743ed3f","amp;dn":"The+True+Lives+of+the+Fabulous+Killjoys+%2801+-+06%29+%28complete%29%28-+N","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7780fd01e87c4a37341268753dcfc35a5743ed3f","infoHashBuffer":{"type":"Buffer","data":[119,128,253,1,232,124,74,55,52,18,104,117,61,207,195,90,87,67,237,63]},"announce":[],"urlList":[]}}