{"title":"St. Lucia - When the Night (2013) [FLAC]","uid":9014937,"size":382145255,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:779794173ebf472236140f2d28b3ca19fe5425f7&amp;dn=St.+Lucia+-+When+the+Night+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":3,"uploader":"politux","files":-1,"time":1381175742,"description":"\n  St. Lucia - When the Night (2013) [FLAC]\n\n  Genre: Pop/Rock, Electronic\n  Styles: Indie Pop, Dream Pop, Synth Pop\n  Source: WEB\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 The Night Comes Again\n  02 The Way You Remember Me\n  03 Elevate\n  04 Wait for Love\n  05 All Eyes On You\n  06 Closer Than This\n  07 Call Me Up\n  08 We Got It Wrong\n  09 September\n  10 Too Close\n  11 When the Night\n\n  The full-length debut album from Brooklyn's St. Lucia, 2013's When the Night is romantic, catchy, and surprisingly sophisticated. Centered around Johannesburg, South Africa-born singer/songwriter Jean-Philip Grobler, St. Lucia have been making their specific brand of synthesizer-based music since 2011. In fact, When the Night's shimmery, atmospheric melodicism should sound familiar to anyone who picked up the band's superb 2012 self-titled EP, as two of the songs from the EP -- &quot;We Got It Wrong&quot; and &quot;Closer Than This&quot; -- show up here. Also included is the band's epic 2012 single &quot;September,&quot; which, like many of the tracks on When the Night, sounds something along the lines of the Human League DJing an Ibiza rave. Elsewhere, St. Lucia mix glassy synthesizers, buoyant basslines, and Latin meets new wave-inspired rhythms on such cuts as &quot;Wait for Love&quot; and &quot;Elevate.&quot; Vocally, Grobler has a warm croon that helps lift his songs well above any ironic, retro '80s hipster tag. These tracks are immaculately produced, and while they at times lean heavily toward John Hughes soundtrack territory, they also never come off as completely dated. In that sense, St. Lucia fit nicely next to such similarly inclined contemporaries as Gotye and Young Galaxy as much as they do Peter Gabriel. Of course, if at any point you find yourself dancing along to When the Night and the scene starts to feel a little like a skewed version of Lionel Richie's &quot;All Night Long&quot; video, rest assured that this is probably just what St. Lucia had in mind.","torrent":{"xt":"urn:btih:779794173ebf472236140f2d28b3ca19fe5425f7","amp;dn":"St.+Lucia+-+When+the+Night+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"779794173ebf472236140f2d28b3ca19fe5425f7","infoHashBuffer":{"type":"Buffer","data":[119,151,148,23,62,191,71,34,54,20,15,45,40,179,202,25,254,84,37,247]},"announce":[],"urlList":[]}}