{"title":"A Chicken Soup for the Soul Christmas - Jack Canfield &amp; Mark","uid":11665518,"size":2125646,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:77a128561e206df175e692ad0da1dfd3efbee790&amp;dn=A+Chicken+Soup+for+the+Soul+Christmas+-+Jack+Canfield+%26amp%3B+Mark&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":2,"uploader":"Mohammad_AT","files":3,"time":1418050012,"description":"Children experience Christmas through magic, anticipation, and learning about the baby Jesus. As we mature, we experience Christmas through the gifts we give, the love we share, and the magic we create for others. A Chicken Soup for the Soul Christmas brings back the memories of childhood through the eyes of children on Christmas day and inspires good deeds by reminding us how the smallest gesture can truly change a life.\n\nGo back in time through genuine stories of hope and kindness and see how people find the true meaning of the season through unexpected miracles and those they meet along the way. Peek into the life of one family as they visit a relative at a nursing home on Christmas and how a cup of ice cream and a few moments of time brighten up the day for those who live there. Read about one woman's journey through surviving the loss of her husband and how the love and warmth of her family at Christmas strengthens her. Enjoy a sweet tale of how an old doll dressed in new clothes becomes the most precious gift and cherished memory a child ever receives. And, of course, it wouldn't be Christmas without a few stories celebrating the wonderment and joy children experience throughout this very special season","torrent":{"xt":"urn:btih:77a128561e206df175e692ad0da1dfd3efbee790","amp;dn":"A+Chicken+Soup+for+the+Soul+Christmas+-+Jack+Canfield+%26amp%3B+Mark","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77a128561e206df175e692ad0da1dfd3efbee790","infoHashBuffer":{"type":"Buffer","data":[119,161,40,86,30,32,109,241,117,230,146,173,13,161,223,211,239,190,231,144]},"announce":[],"urlList":[]}}