{"title":"The Thanos Imperative 01-06 + Ex (2010-2011|Digital|Zone-Empire)","uid":9903286,"size":146846755,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:77dac1df9c0d1dd8f0364c03b3589612a89f23bd&amp;dn=The+Thanos+Imperative+01-06+%2B+Ex+%282010-2011%7CDigital%7CZone-Empire%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"VikTSlick","files":-1,"time":1396804788,"description":"For more information about this limited series, please see the wikilink here: &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Thanos_Imperative&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Thanos_Imperative&lt;/a&gt;\n\nThis series concludes the War of Kings storyline that spanned throughout the Marvel Cosmic Universe from 2009-2011 and was spearheaded by Dan Abnett and Andy Lanning, who also created the revamped Guardians of the Galaxy. The GOTG make an appearance here as well. Promotional info for the collected edition - &quot;The dangerous cosmic fissure known as The Fault has ripped opened a portal to the Marvel Universe, spilling out the demented forces of a horrific mirror universe where there is no death and life prevails unchecked - the Cancerverse! From this dark realm, the evil Lord Mar-Vell - a twisted version of the legendary Captain Marvel - leads his army to claim our universe for their own! Nova, the Silver Surfer, Quasar, Gladiator and more of the greatest cosmic champions of the Marvel Universal rise to stop them, but when even they cannot stop the forces of the Cancerverse, the fate of the universe lies in the hands of the cosmos' never-say-die underdogs, the Guardians of the Galaxy! Facing a threat like none other, Star-Lord and company cook up an all-or-nothing plan to bring their prisoner, the mad titan Thanos, into the Cancerverse to unleash hell! With everything on the line, the fate of the universe rests in the hands of one of Marvel's greatest villains!&quot;\n\nThis torrent has all six issues of the series + the two one-shots that bookend it. \n*NOTE - The correct reading order is Ignition, then the main series, then Devastation.\nAll copies of the issues are Digital; the main story are all by Zone-Empire and the two specials are by Cypher-Empire. Thanks to them for their hard work, please seed and enjoy! :-)","torrent":{"xt":"urn:btih:77dac1df9c0d1dd8f0364c03b3589612a89f23bd","amp;dn":"The+Thanos+Imperative+01-06+%2B+Ex+%282010-2011%7CDigital%7CZone-Empire%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77dac1df9c0d1dd8f0364c03b3589612a89f23bd","infoHashBuffer":{"type":"Buffer","data":[119,218,193,223,156,13,29,216,240,54,76,3,179,88,150,18,168,159,35,189]},"announce":[],"urlList":[]}}