{"title":"ProPresenter 5.2.6","uid":9548746,"size":27292566,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:7888b59afd5bae417da3f4bb6eb0b69532e1a36d&amp;dn=ProPresenter+5.2.6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"evilfoundnation","files":1,"time":1391187354,"description":"ProPresenter\nVersion: - 5.2.6\n\nMac Platform: Intel\nIncludes: K\n\nOS version: 10.6.8 or higher\nAdditional output required for stage display function (third video out - PCI or USB)\n\nLink for more information: http://www.renewedvision.com/propresenter.php\n\n\n\nProPresenter is a presentation system that utilizes two screens, empowering users to quickly and easily present slides on one screen, while controlling the presentation with another screen.\n\nFor example, churches that display song lyrics on a big screen while a song is being performed live on stage can dynamically change the slide order for a worship song. Depending on the reaction of the audience, the band leader may choose to sing another verse, end the song early, or repeat the chorus several times. Typically these lyrics are presented through linear slide shows, but the limited flexibility of these programs make them very unpopular because of their inability to function dynamically. Our program allows an operator to click on a slide in our &quot;Control Panel&quot;, at which point the projector screen immediately transitions to the new slide.\n\nWhat's more, the program supports QuickTime, and can synch slides with an audio track for canned music presentations. ProPresenter also allows you to change your backgrounds dynamically and, of course, you can integrate ProPresenter with your video production system to key the words over live or recorded video.\n\nWhats new:\n\nImport error\nHot-Folder crash\nCloud sync setting for frequency not persistent","torrent":{"xt":"urn:btih:7888b59afd5bae417da3f4bb6eb0b69532e1a36d","amp;dn":"ProPresenter+5.2.6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7888b59afd5bae417da3f4bb6eb0b69532e1a36d","infoHashBuffer":{"type":"Buffer","data":[120,136,181,154,253,91,174,65,125,163,244,187,110,176,182,149,50,225,163,109]},"announce":[],"urlList":[]}}