{"title":"Andy Field - Discovering Statistics Using SPSS, Second Edition","uid":3764222,"size":124837479,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:790833eb0d442b3bc4262f7b0b7c63e8d218b48f&amp;dn=Andy+Field+-+Discovering+Statistics+Using+SPSS%2C+Second+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"cic","files":92,"time":1186365879,"description":"Andy Field - Discovering Statistics Using SPSS, Second Edition\n\nAuthor\nAndy Field\nPub Date: 03/2005\n\nPages: 816pp\n\nThis new edition of Field&amp;#039;s textbook provides students of statistical methods with everything they need to understand, use and report statistics - at every level. \n\nWritten in Andy Field&amp;#039;s vivid and entertaining style, and furnished with playful examples from everyday student life (among other places), the book forms an accessible gateway into the often intimidating world of statistics and a unique opportunity for students to ground their knowledge of statistics through the use of SPSS. The text is fully compliant with the latest release of SPSSÃ‚Â® (version 13).\n\nKey updates in the new edition:\n\n- More coverage with completely new material on non-parametric statistics, loglinear analysis, effect sizes and how to report statistical analysis. \n\n- Even more student-friendly features, including a glossary of key statistical terms and exercises at the end of chapters for students to work through, with datasets and answers to chapter exercises on the accompanying CD-ROM. \n\n- A larger and more easy-to-reference format: notation in each section identifies the intended level of study while the new 2-colour text design enhances the features in the book and, together with the larger format, provides extra clarity throughout.\n\nAndy Field is a Senior Lecturer in Psychology at The University of Sussex where his success in making statistics accessible was recognized with a teaching award in 2001.\n\nComments on the Second Edition: \n\nThe Second Edition of Andy Field&amp;#039;s Discovering Statistics Using SPSS is an excellent book and a valuable addition to the teaching of statistics in the behavioral sciences. The title of the book accurately reflects the approach taken. This is not simply a primer on how to use SPSS, but is a very good statistics text using SPSS as a vehicle for illustrating and expanding on the statistical content of the book. At the same time it also serves as a manual for SPSS, and has taught me things that I had not known about the software. One advantage of the text is that it is not tied specifically to the latest version of SPSS. Although the examples use version 12.0, there are many references to the difference the students will find if they are using an earlier version. A good example of how the text is structured can be seen in Chapters 8 and 9. Chapter 8 provides an introduction to the analysis of variance, and roughly the first 40 pages are devoted to statistical issues. Only after that introduction does the author move to a discussion of using SPSS to run the analyses. Chapter 9 deals with the analysis of covariance, and here the author moves almost immediately to SPSS printout, having laid most of the groundwork in the previous chapter. I find this flexible approach to the blending of content and software to be an effective way of teaching the material. It is impossible to review this book without commenting on Andy&amp;#039;s particular style. I enjoyed it immensely and think that it would appeal to both students and their instructors. It is refreshing to see someone who doesn&amp;#039;t take himself too seriously&amp;#039; - David C Howell, Professor Emeritus, University of Vermont\n\n\nThe new edition of Field&amp;#039;s textbook confirms its place as the best statistics text for undergraduate social science students. It provides support for those less confident about statistical analysis whilst having sufficient depth that it will still be valuable to more mathematically experienced people. There is a focus throughout on the practical aspects of data analysis and interpretation whilst at the same time emphasizing the importance of rigour and a good understating of theory essential reading&amp;#039; - Dr Ian Walker, Department of Psychology, University of Bath\n \nChapter 1: Everything You Wanted To Know About Statistics (Well, Sort Of)\nChapter 2: The SPSS Environment\nChapter 3: Exploring Data\nChapter 4: Correlation\nChapter 5: Regression\nChapter 6: Logistic Regression\nChapter 7: Comparing Two Means\nChapter 8: Comparing Several Means: Anova (Glm 1)\nChapter 9: Analysis Of Covariance, Ancova (Glm 2)\nChapter 10: Factorial Anova (Glm 3)\nChapter 11: Repeated-Measures Designs (Glm 4)\nChapter 12: Mixed Design Anova (Glm 5)\nChapter 13: Non-Parametric Tests\nChapter 14: Multivariate Analysis Of Variance (Manova)\nChapter 15: Exploratory Factor Analysis\nChapter 16: Categorical Data\n  &lt;a href=&quot;\nhttp://www.sagepub.co.uk/field/home.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sagepub.co.uk/field/home.htm&lt;/a&gt;","torrent":{"xt":"urn:btih:790833eb0d442b3bc4262f7b0b7c63e8d218b48f","amp;dn":"Andy+Field+-+Discovering+Statistics+Using+SPSS%2C+Second+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"790833eb0d442b3bc4262f7b0b7c63e8d218b48f","infoHashBuffer":{"type":"Buffer","data":[121,8,51,235,13,68,43,59,196,38,47,123,11,124,99,232,210,24,180,143]},"announce":[],"urlList":[]}}