{"title":"Hustler Magazine Collection PDF MEGAPACK [CARG]","uid":7480309,"size":3834141771,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7975c94055ad71ecd2135d185e3759d846ebf5f0&amp;dn=Hustler+Magazine+Collection+PDF+MEGAPACK+%5BCARG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":4,"uploader":"Hard2Find2","files":-1,"time":1343415137,"description":"            CARG Release Hustler Magazine Collection PDF MEGAPACK. \n\n\n\nBe sure to check out the other CARG PDF release's. To show your support for the time and effort in building this collection, Please seed at full speed during and after download so that others can also enjoy.\n\n\n\nThis collection contains 65 Hustler Magazine Pdf files. The contents are as follows, (50) Hustler Magazine Editions, (3) Hustler UK Editions, (1) Czech Edition, (1) Russia Edition, (1) Swedish Edition and (9) Hustler Taboo Edition Pdf files. \n\nIt also has (13) Low quality FLV Video Files that were a bonus in some Magazine editions.\n\nHustler is a monthly pornographic magazine published in the United States. It was first published in 1974 by Larry Flynt. It was a step forward from the Hustler Newsletter, which was cheap advertising for his strip club businesses at the time. The magazine grew from a shaky start to a peak circulation of around 3 million; it has since dropped to approximately 500,000. It showed explicit views of the female genitalia, becoming one of the first major US-based magazines to do so, in contrast with relatively modest publications like Playboy.\n \nToday, Hustler is still considered more explicit (and more self-consciously lowbrow) than such well known competitors as Playboy and Penthouse. It frequently depicts hardcore themes, such as the use of sex toys, penetration and group sex.\n \nLarry Flynt Publications also owns the Hustler Casino in Gardena, California, the Hustler Club chain of bars and clubs, and Hustler store chain that sells adult-oriented videos, cIothing, magazines and sex toys. The chain's flagship store is on Sunset Boulevard in West Hollywood.\n\n                        &lt;a href=&quot; http://www.hustlermagazine.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.hustlermagazine.com/&lt;/a&gt;","torrent":{"xt":"urn:btih:7975c94055ad71ecd2135d185e3759d846ebf5f0","amp;dn":"Hustler+Magazine+Collection+PDF+MEGAPACK+%5BCARG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7975c94055ad71ecd2135d185e3759d846ebf5f0","infoHashBuffer":{"type":"Buffer","data":[121,117,201,64,85,173,113,236,210,19,93,24,94,55,89,216,70,235,245,240]},"announce":[],"urlList":[]}}