{"title":"THE LIFE OF MUHAMMAD (PBUH) BBC Documentary [jehanzaibch].mp4","uid":11965803,"size":724242645,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:79cbe63971e747d38f952893d3d9de82308ffe73&amp;dn=THE+LIFE+OF+MUHAMMAD+%28PBUH%29+BBC+Documentary+%5Bjehanzaibch%5D.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":3,"uploader":null,"files":1,"time":1432662714,"description":"The Life of Muhammad\n\nBiography Documentary hosted by Rageh Omaar, published by BBC in 2011 - English narration\n\n\nInformation\n------------------------------\n\nThree-part series presented by Rageh Omaar which charts the life of Muhammad.\n\n\n1)  The Seeker \nRageh Omaar charts the life of Muhammad, a man who - for the billion and half Muslims across the globe - is the messenger and final prophet of God. In a journey that is both literal and historical, and beginning in Muhammad's birthplace of Mecca, Omaar investigates the Arabia Muhammad was born into - a world of tribal loyalties and polytheistic religion. Drawing on the expertise and comment of some of the world's leading academics and commentators on Islam, the programme examines Muhammad's first marriage to Khadijah and how he received the first of the revelations that had such a profound effect both on his life, and on the lives of those closest to him.\n\n2)  Holy Wars \nRageh Omaar continues to chart the story of The Prophet Muhammad. Drawing on the expertise and comment from some of the world's leading academics and commentators on Islam, Omaar assesses and shines a light on key events in Muhammad's life including the Night Journey to Jerusalem, his life threatening departure from Mecca, through to the establishment of the Constitution of Medina and the eight year war with the Meccan tribes. In line with Islamic tradition the programme does not depict any images of the face of Muhammad, or feature any dramatic re-constructions of Muhammad's life.\n\n3)  Holy Peace \nIn the final episode, presenter Rageh Omaar continues to chart the story of The Prophet Muhammad. Drawing on the expertise and comment from some of the world's leading academics and commentators on Islam, Omaar analyses and investigates key events during the later part of his life, including the introduction of a moral code known as Sharia and the concept of jihad. The programme also explores Muhammad's use of marriage to build alliances and looks at the key messages included in his final sermon. In line with Islamic tradition the programme does not depict any images of the face of Muhammad, or feature any dramatic re-constructions of Muhammad's life","torrent":{"xt":"urn:btih:79cbe63971e747d38f952893d3d9de82308ffe73","amp;dn":"THE+LIFE+OF+MUHAMMAD+%28PBUH%29+BBC+Documentary+%5Bjehanzaibch%5D.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79cbe63971e747d38f952893d3d9de82308ffe73","infoHashBuffer":{"type":"Buffer","data":[121,203,230,57,113,231,71,211,143,149,40,147,211,217,222,130,48,143,254,115]},"announce":[],"urlList":[]}}