{"title":"[AnonDCX] Beginning Backbone.js (incl code samples)","uid":15752084,"size":30521702,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:79d142851a07e181b7ac829a7550c9dd342d8f7b&amp;dn=%5BAnonDCX%5D+Beginning+Backbone.js+%28incl+code+samples%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":".AnonDCX.","files":767,"time":1473036493,"description":"Beginning Backbone.js is your step-by-step guide to learning and using the Backbone.js library in your web projects. Backbone.js is one of the most popular JavaScript libraries among web developers, used to create modular, single-page web apps. This book takes you from downloading Backbone.js and its dependencies all the way to using more advanced libraries to structure your application architecture, and everything in between. \r\n\r\nWith a real-world, practical approach, you will learn how you can integrate Backbone.js into the center of your JavaScript stack, and create scalable applications. James Sugrue shows you how to implement all aspects of templating, work efficiently with RequireJS, and fully understand Grunt and all its plug-ins. Armed with this knowledge you'll be able to architect a continuous integration system that is key to real-world applications. \r\n\r\nWith the explosion of JavaScript-based applications on the web, the need for more structured approaches to code management is more important than ever. Backbone.js helps create applications that separate models from views, enabling developers to avoid spaghetti code. Beginning Backbone.js will gently guide you into this amazingly powerful library, and help you ramp up to building professional applications. Integrate Backbone.js into your work today with this indispensable book. \r\n\r\nWhat you’ll learn \r\n\r\nLearn the importance of MVC approaches in software development \r\nLearn why Backbone.js is so popular and how to integrate it into your JavaScript stack \r\nUnderstand core Backbone.js concepts such as models, views, routers, and events \r\nTest your application using the latest JavaScript testing tools \r\nCreate build scripts using Grunt.js to simplify your build and deployment workflow \r\nUse additional libraries to build on the power of Backbone.js \r\nAvoid common beginner errors and code using best practices \r\n\r\nWho this book is for \r\n\r\nBeginning Backbone.js is for the web developer who is already confident with JavaScript, but who is keen to build larger, single-page web apps. If you want to introduce more structure, quality, and process to your web application using Backbone.js, and other leading JavaScript technologies, this is the book for you","torrent":{"xt":"urn:btih:79d142851a07e181b7ac829a7550c9dd342d8f7b","amp;dn":"%5BAnonDCX%5D+Beginning+Backbone.js+%28incl+code+samples%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79d142851a07e181b7ac829a7550c9dd342d8f7b","infoHashBuffer":{"type":"Buffer","data":[121,209,66,133,26,7,225,129,183,172,130,154,117,80,201,221,52,45,143,123]},"announce":[],"urlList":[]}}