{"title":"12-Lead ECG- The Art of Interpretation, 2E [Epub] [StormRG]","uid":10080888,"size":28946056,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:79dc5c53a1ea5b8a262c56d5f9d7fe6ef8ba65f8&amp;dn=12-Lead+ECG-+The+Art+of+Interpretation%2C+2E+%5BEpub%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"0xmovva","files":3,"time":1399000294,"description":"Author: Tomas B. Garcia\nPrint Length: 680 pages\nPublisher: Jones &amp; Bartlett Learning; 2 edition (November 27, 2013)\nLanguage: English\nISBN-10: 0763773514\nISBN-13: 978-0763773519\nASIN: B00HLK4CEW\nFormat: Retail Epub\nReader Required: Adobe Digital Editions, Calibre, MoonReader for Android\n\nNOTE: no PDF available, if you want it to scroll like a PDF just read it in Calibre.\nThis is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n__________________________________________________________________________________\n\n\nWelcome to the most comprehensive resource on 12-Lead ECG interpretation!\n\nThis all-encompassing, four-color text, updated to the new Second Edition, is designed to make you a fully advanced interpreter of ECGs. Whether you are paramedic, nurse, nurse practitioner, physician assistant, medical student, or physician wanting to learn or brush up on your knowledge of electrocardiography, this book will meet your needs.\n\n12-Lead ECG: The Art of Interpretation, Second Edition takes the complex subject of electrocardiography and presents it in a simple, innovative, 3-level approach. Level 1 provides basic information for those with minimal experience interpreting ECGs. Level 2 provides intermediate information for those with a basic understanding of the principles of electrocardiography. Level 3 provides advanced information for those with some mastery of the subject. The entire text is written in a friendly, easy-to-read tone. Additionally, the text contains real-life, full-size ECG strips that are integrated throughout the text and analyzed in conjunction with the concepts they illustrate.","torrent":{"xt":"urn:btih:79dc5c53a1ea5b8a262c56d5f9d7fe6ef8ba65f8","amp;dn":"12-Lead+ECG-+The+Art+of+Interpretation%2C+2E+%5BEpub%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79dc5c53a1ea5b8a262c56d5f9d7fe6ef8ba65f8","infoHashBuffer":{"type":"Buffer","data":[121,220,92,83,161,234,91,138,38,44,86,213,249,215,254,110,248,186,101,248]},"announce":[],"urlList":[]}}