{"title":"Kjaerhus Audio Golden Series Plugins v1.1 [VST]","uid":3436172,"size":20344057,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7ac01379ece1f60c1fad57935db89896d2c83434&amp;dn=Kjaerhus+Audio+Golden+Series+Plugins+v1.1+%5BVST%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"Piratox2000","files":1,"time":1138287947,"description":"The Gold Series\nThe Gold Series combines the sound and functionality of advanced vintage gear with classic signal processing methods, producing a highly desirable sound. The Gold series is made in close collaboration with professional musicians, producers, and technicians to ensure we produce a product that does not only sound good, but covers the needs of functionality in the studio and on the stage as well. All processing is done as 64 Bit floating-point operations and all Plugins supports up to 192 kHz sampling rate. Additionally, over sampling is done when it is necessary to ensure the highest quality. All of the Gold Series Plug-ins works in real time (no latency delay), making them the obvious choice for live gigs as well as in the studio.\n\nGolden Audio Channel | GAC-1 \n \nThe Golden Audio Channel | GAC-1 includes all you need to make top-notch audio tracks and mixes. It features two equalizers, two compressors, a noise-gate and a de-esser. [read more...]\n Golden Compressor | GCO-1\n \nThe GCO-1 is a versatile quality compressor and expander plugin modeled after some of the best analog compressors. It works well with all material for tracking, mixing and mastering. [read more...]\n Golden Equaliser | GEQ-7\n \nGEQ-7 is a high quality five band parametric equalizer with a selectable shelf setting on the highest and lowest band. Additionally, Low Cut and High Cut Filters with selectable slopes are provided. [read more...]\n \nGolden Modulator | GMO-1\n \nThe GMO-1 is a Professional Modulation VST-Plug-in designed to provide high quality Chorus, Flanger, Tremolo, Panning and other Frequency-, Delay- and Amplitude- Modulated effects. [read more...]\n Golden Peak-Pressor | GPP-1\n \nThe GPP-1 is a high quality soft-limiter / peak compressor designed for peak- taming / compression during real-time tracking, sub-tracking and mixing, live or in the studio. [read more...]\n Golden Uni-Pressor | GUP-1\n \nThe Golden Uni-Pressor | GUP-1 is a general-purpose compressor made for tracking, mixing and mastering. It offers VCA and Opto models that can be run in a Warm or Smooth mode [read more...]\n \n","torrent":{"xt":"urn:btih:7ac01379ece1f60c1fad57935db89896d2c83434","amp;dn":"Kjaerhus+Audio+Golden+Series+Plugins+v1.1+%5BVST%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ac01379ece1f60c1fad57935db89896d2c83434","infoHashBuffer":{"type":"Buffer","data":[122,192,19,121,236,225,246,12,31,173,87,147,93,184,152,150,210,200,52,52]},"announce":[],"urlList":[]}}