{"title":"Shriver, Atkins - Inorganic Chemistry (5th ed)","uid":9918323,"size":34889206,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7b3fc4dbf2a4a0a22dd28d050159991e1a3af3e3&amp;dn=Shriver%2C+Atkins+-+Inorganic+Chemistry+%285th+ed%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":null,"files":2,"time":1396973487,"description":"Shriver and Atkins' Inorganic Chemistry fifth edition represents an integral part of a student's chemistry education. With the same broad coverage as its predecessors - making it the ideal companion for the duration of an undergraduate degree programme - the fifth edition extends from the foundational concepts of inorganic chemistry to the forefront of contemporary research. The book seeks not just to impart knowledge, but to engage and enthuse its readers. Its unique 'Frontiers' chapters cover materials science, nanotechnology, catalysis, and biological inorganic chemistry, and have been fully updated to reflect advances in these key areas of contemporary research and industrial application. Further, examples throughout show the relevance of inorganic chemistry to real-life situations, to encourage students to engage fully with the subject. Inorganic chemistry spans a huge range of elements, whose characteristic similarities and differences students must be familiar with. Inorganic Chemistry rises to this challenge by setting out the key trends exhibited within the periodic table, and by the elements comprising each Group. These trends and behaviours are illuminated with illustrative examples, placing the content in a clear, relevant context.","torrent":{"xt":"urn:btih:7b3fc4dbf2a4a0a22dd28d050159991e1a3af3e3","amp;dn":"Shriver%2C+Atkins+-+Inorganic+Chemistry+%285th+ed%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b3fc4dbf2a4a0a22dd28d050159991e1a3af3e3","infoHashBuffer":{"type":"Buffer","data":[123,63,196,219,242,164,160,162,45,210,141,5,1,89,153,30,26,58,243,227]},"announce":[],"urlList":[]}}