{"title":"Alex Albrinck - Preserving Hope (The Aliomenti Saga #2)","uid":15322369,"size":341972731,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:7b40db5ca74e5d01b7f3ca120402f5d69923e309&amp;dn=Alex+Albrinck+-+Preserving+Hope+%28The+Aliomenti+Saga+%232%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"Cybotage","files":29,"time":1468661638,"description":"Will Stark has been sent on a mission to save the life of a young woman named Elizabeth. He does not know who is threatening her or why. He knows only that failure is not an option, for it will mean three of the most important people in his life will cease to exist.\r\n\r\nWill finds himself in a unique medieval village constructed deep in a forest, its residents prosperous and healthy to an unnatural degree. Their leader, a man named Arthur, weaves an alluring tale: that the supernatural abilities long thought the realm of myth or magic are real, that they can be developed with the correct usage of certain foods to enthrall the villagers and enrich and empower himself. The only issue is that the villagers have no idea what concoction will trigger those abilities. They must test. And the villagers have put that responsibility on one young girl - against her will.\r\n\r\nWill makes his mark on the village in the woods, increasing their prosperity and helping to introduce innovations decades or centuries before their time. Yet Arthur, in his desperate need for power and control, will sabotage everything to retain his total control of the village - even if it means sacrificing his own daughter's life.\r\n\r\nRead by Todd McLaren\r\nFormat: MP3","torrent":{"xt":"urn:btih:7b40db5ca74e5d01b7f3ca120402f5d69923e309","amp;dn":"Alex+Albrinck+-+Preserving+Hope+%28The+Aliomenti+Saga+%232%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b40db5ca74e5d01b7f3ca120402f5d69923e309","infoHashBuffer":{"type":"Buffer","data":[123,64,219,92,167,78,93,1,183,243,202,18,4,2,245,214,153,35,227,9]},"announce":[],"urlList":[]}}