{"title":"Jo Nesbo-The Bat","uid":15822247,"size":2464101,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7b99571f2bde2e35bbb68a884d098a4544ca1ff9&amp;dn=Jo+Nesbo-The+Bat&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"twocows","files":4,"time":1473784749,"description":"The Bat (Harry Hole #1)\r\nby Jo Nesbø, Don Bartlett (translator)\r\n\r\nBefore Harry took on the neo-Nazi gangs of Oslo, before he met Rakel, before The Snowman tried to take everything he held dear, he went to Australia. Harry Hole is sent to Sydney to investigate the murder of Inger Holter, a young Norwegian girl, who was working in a bar. Initially sidelined as an outsider, Harry becomes central to the Australian police investigation when they start to notice a number of unsolved rape and murder cases around the country. The victims were usually young blondes. Inger had a number of admirers, each with his own share of secrets, but there is no obvious suspect, and the pattern of the other crimes seems impossible to crack. Then a circus performer is brutally murdered followed by yet another young woman. Harry is in a race against time to stop highly intelligent killer, who is bent on total destruction\r\n\r\nInspector Harry Hole of the Oslo Crime Squad is dispatched to Sydney to observe a murder case. Harry is free to offer assistance, but he has firm instructions to stay out of trouble. The victim is a twenty-three year old Norwegian woman who is a minor celebrity back home. Never one to sit on the sidelines, Harry befriends one of the lead detectives, and one of the witnesses, as he is drawn deeper into the case. Together, they discover that this is only the latest in a string of unsolved murders, and the pattern points toward a psychopath working his way across the country. As they circle closer and closer to the killer, Harry begins to fear that no one is safe, least of all those investigating the case","torrent":{"xt":"urn:btih:7b99571f2bde2e35bbb68a884d098a4544ca1ff9","amp;dn":"Jo+Nesbo-The+Bat","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b99571f2bde2e35bbb68a884d098a4544ca1ff9","infoHashBuffer":{"type":"Buffer","data":[123,153,87,31,43,222,46,53,187,182,138,136,77,9,138,69,68,202,31,249]},"announce":[],"urlList":[]}}