{"title":"The Way - Ariana Grande ft. Mac Miller","uid":8788214,"size":3649610,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7b9b1532d82f9da8d3dd5cb282a7e3b4abe7e869&amp;dn=The+Way+-+Ariana+Grande+ft.+Mac+Miller&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"fairyprinceP","files":1,"time":1375834327,"description":"&quot;The Way&quot; is a song recorded by American singer Ariana Grande for her upcoming debut studio album, Yours Truly (2013). It was written by the song's producer Harmony Samuels, alongside Amber Streeter, Al Sherrod Lambert, Jordin Sparks, Brenda Russell and Mac Miller, who is also featured in the song. &quot;The Way&quot; was released on March 26, 2013 by Republic Records as the lead single from Yours, Truly. The song interpolates the piano melody from Russell's &quot;A Little Bit of Love&quot; and lyrics from Big Pun's &quot;Still Not a Player&quot;.\n&quot;The Way&quot; became an unexpected success from the moment it was released. It was well received by critics, with some comparing Grande's vocals to those of Mariah Carey. Seven hours after its release on the iTunes Store, &quot;The Way&quot; topped its &quot;Top Singles&quot; chart. It debuted at number ten on the U.S. Billboard Hot 100, becoming Grande and Miller's first top ten success on the chart. This made Ariana the first top 10 arrival for a lead female artist making her first Hot 100 appearance since Yael Naim, who launched with &quot;New Soul&quot; back in 2008. The song later peaked at #9 on the Billboard Hot 100. &quot;The Way&quot; holds the third-highest first-week sales figure of 2013, behind &quot;Suit &amp; Tie&quot; by Justin Timberlake featuring Jay-Z.","torrent":{"xt":"urn:btih:7b9b1532d82f9da8d3dd5cb282a7e3b4abe7e869","amp;dn":"The+Way+-+Ariana+Grande+ft.+Mac+Miller","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b9b1532d82f9da8d3dd5cb282a7e3b4abe7e869","infoHashBuffer":{"type":"Buffer","data":[123,155,21,50,216,47,157,168,211,221,92,178,130,167,227,180,171,231,232,105]},"announce":[],"urlList":[]}}