{"title":"Fantasy World Building Collection Dungeons and Dragons","uid":8964562,"size":156212003,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7bdd62622949897b07fc217d9afba4e8a0e57ea4&amp;dn=Fantasy+World+Building+Collection+Dungeons+and+Dragons&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1380186864,"description":"Sadly, after many, MANY years (decades, actually) of being a DM, I no longer have anyone to game with. Rather than leave the 60+ GB of files that will never be used on my external to take up space (which I could use for comic books), I'm going to burn them off to blu-ray data discs and file them away in hopes that they may be used at some point in the future.\n\nNo big descriptions or explanations with these - you either know what they are, and that you want them, or you don't.\n\nThese uploads are definitely an experiment; if there is interest, I'll seed them for a while, but if there isn't, I'll have them deleted and &quot;file&quot; this stuff away. \t\t\n\n\n----------------------------------------------------------------------------------------\n\nAnyone who found these by searching for something other than Dungeons &amp; Dragons, or by just browsing ebooks, could very likely find books (or shorter materials) worth reading is this collection. I certainly don't mean to exclude anyone with their suggested use. That being said...\n\nFor those of you who are downloading these as part of my ongoing D&amp;D purge, their intended use should be fairly obvious. There's some great reading in here, period, and expanding your knowledge base and imagination as a player is never a bad thing. That being said, this batch is likely to be much more useful for the dungeon or game master. Even more so for an advanced DM/GM who is either considering building their own world, is in the process of doing so, or is already running their campaign in one.","torrent":{"xt":"urn:btih:7bdd62622949897b07fc217d9afba4e8a0e57ea4","amp;dn":"Fantasy+World+Building+Collection+Dungeons+and+Dragons","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7bdd62622949897b07fc217d9afba4e8a0e57ea4","infoHashBuffer":{"type":"Buffer","data":[123,221,98,98,41,73,137,123,7,252,33,125,154,251,164,232,160,229,126,164]},"announce":[],"urlList":[]}}