{"title":"Stanley Kubrick, Director (A Visual Analysis) - Andrew Walker","uid":9069152,"size":225365,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7ca9a99abd17cc47db9151a08abd695c6e9417db&amp;dn=Stanley+Kubrick%2C+Director+%28A+Visual+Analysis%29+-+Andrew+Walker&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1382162126,"description":"An exclusive window on one of the most brilliant --and most secretive --filmmakers in history. No movie maker has kept his world so tightly sealed against intruders as the late great Stanley Kubrick. While many of his films have turned into modern metaphors --we speak of &quot;a 2001 world&quot; or &quot;a Clockwork Orange society&quot; --the man himself has withdrawn into his own obsessive visions. Few have known him personally; fewer still have gained his confidence and seen him at work. For over thirty years, Alexander Walker, a renowned film historian, has been one such privileged observer. Stanley Kubrick Directs first appeared in 1971, giving readers the most authoritative view possible of Kubrick at work by providing an in-depth look at his films, his technique, and his often unpredictable genius. Now expanded, this unique cine-biography includes analysis and photographs of all of Kubrick's films, right up to his latest and final film, the erotic thriller Eyes Wide Shut, starring Tom Cruise and Nicole Kidman. Kubrick himself allowed the use of illustrations taken directly from the film's frames. In text and pictures, this fascinating book provides a rare glimpse into the work of one of the greatest and most eccentric directors of our time. This new edition now includes material on Kubrick's films Barry Lyndon, The Shining, Full Metal Jacket, and Eyes Wide Shut.","torrent":{"xt":"urn:btih:7ca9a99abd17cc47db9151a08abd695c6e9417db","amp;dn":"Stanley+Kubrick%2C+Director+%28A+Visual+Analysis%29+-+Andrew+Walker","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ca9a99abd17cc47db9151a08abd695c6e9417db","infoHashBuffer":{"type":"Buffer","data":[124,169,169,154,189,23,204,71,219,145,81,160,138,189,105,92,110,148,23,219]},"announce":[],"urlList":[]}}