{"title":"Jonathan Franzen - How to Be Alone: Essays (2002)","uid":8798865,"size":339981,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7d32fdd557b7b027aba24bcc83ac93b4c635b5d5&amp;dn=Jonathan+Franzen+-+How+to+Be+Alone%3A+Essays+%282002%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"workerbee","files":-1,"time":1376146395,"description":"Jonathan Franzen - How to Be Alone: Essays (Farrar, Straus &amp; Giroux, 2002).\n\nISBN: 9780312422165 | 320 pages | EPUB\n\n\nFrom the National Book Award-winning author of The Corrections, a collection of essays that reveal him to be one of our sharpest, toughest, and most entertaining social critics.\n\nWhile the fourteen essays in this collection range in subject matter from the sex-advice industry to the way a supermax prison works, each one wrestles with the essential themes of Franzen's writing: the erosion of civil life and private dignity; and the hidden persistence of loneliness in postmodern, imperial America.\n\nReprinted here for the first time is Franzen's controversial l996 investigation of the fate of the American novel in what became known as &quot;the Harper's essay,&quot; as well as his award-winning narrative of his father's struggle with Alzheimer's disease, and a rueful account of his brief tenure as an Oprah Winfrey author.\n\n\nReviews\n\n&quot;The welcome paradox in How to be Alone is that the reader need not feel isolated at all. . . This collection emphasizes [Franzen's] elegance, acumen and daring as an essayist, with an intellectually engaging self-awareness as formidable as Joan Didion's.&quot; -- New York Times\n\n&quot;Franzen critiques the alienating effects of postmodern America with just as much passion as he displays in his fiction. . . He cuts to the truth with razor-sharp precision. . . These essays offer a great reason to turn of the TV and spend the evening alone, lost in thought.&quot; -- Time Out New York\n\n&quot;How to be Alone reaffirms the novelist's prerogative to engage in social criticism. And Franzen's calm, passionate critical authority derives not from any special expertise in criminology, neurology or postal science, but rather from the fact that, as a novelist, he is principally concerned with the messy architecture of the self.&quot; -- New York Times Book Review\n\n&quot;There is here the eloquence and sensitivity and profound personal engagement that is only possible with the printed word -- and, even then, only when it has no fear of being literature. Put Franzen among the living heroes of it.&quot; -- Buffalo News\n","torrent":{"xt":"urn:btih:7d32fdd557b7b027aba24bcc83ac93b4c635b5d5","amp;dn":"Jonathan+Franzen+-+How+to+Be+Alone%3A+Essays+%282002%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d32fdd557b7b027aba24bcc83ac93b4c635b5d5","infoHashBuffer":{"type":"Buffer","data":[125,50,253,213,87,183,176,39,171,162,75,204,131,172,147,180,198,53,181,213]},"announce":[],"urlList":[]}}