{"title":"Rayman 3 - Hoodlum havoc + CRACK 100% WORKING!! ENGLISH  saliko","uid":4563499,"size":1769338946,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7d88cdcda97bb338a6c76978801e6d2366aeee78&amp;dn=Rayman+3+-+Hoodlum+havoc+%2B+CRACK+100%25+WORKING%21%21+ENGLISH++saliko&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"saliko","files":6,"time":1228773456,"description":"Rayman 3 Hoodlum Havoc - Full game + crack.\n\n***I PUT DAEMONTOOLS 4.30.1 LITE IN THIS TORRENT IN CASE YOU DONT HAVE IT YET***\n\nPLZ SEED AFTER DOWNLOADING! thank you\n\n\nTHE GAME IS IN ENGLISH\n\nRayman 3: Hoodlum Havoc is the third major platforming installment in the Rayman series. It tells the story of how Rayman stops AndrÃƒÂ©, an evil black lum, from taking over the world with his army of sack-like 'Hoodlum' soldiers. The game has sarcastic self-referential undertones and pokes fun at the platforming video game genre.\n\n\nRatings:\n\n* IGN: 8.9 out of 10\n* Gamespot: 8.1 out of 10\n* GameCritics.com: 8.5 out of 10\n* ActionTrip: 8.5 out of 10\n* Nintendojo: 9.5 out of 10\n* Gameinformer: 8.5/10\n* GameKiq: 9.2/10\n\n\nMinimum configuration: System: Windows 98 SE/Windows XP/Windows 2000/Windows Me Processor type and frequency: Pentium II 450 MHz RAM: 64 MB Graphics card: TNT2 Mode: 16 &amp; 32-bit Hard disk space: 550 MB CD ROM drive: 4x DirectX (supplied on the CD-ROM): 8.1 Other: Keyboard/Mouse\n\n Recommended configuration: System: Windows 98 SE/Windows XP/Windows 2000/Windows Me Processor type and frequency: Pentium III 700 MHz Memory: 64 MB Graphics card: GeForce2 Mode: 32-bit Hard disk space: 1.3 GB CD ROM drive: 16x DirectX (supplied on the CD-ROM): 8.1 Other: Keyboard/Mouse/compatible controller\n\n\nAndre, the leader of the Black Lums, is a lum, who was supposively said to have grown out of pure evil. One night, as he is passing through the Crossroad of Dreams, he transforms other Red Lums into Dark Lums to join him. The group eventually gains enough hair from various animals throughout the forest to dress up to disguise themselves as Hoodlums. In the middle of the process, Murfy, one of the residents and workers of the Fairy Council, discovers them. Andre later on discovers him hiding nearby and begins to make chase of him. Murfy is eventually chased to a small clearing, where Rayman and his friend Globox, are sound asleep. Just as Murfy reaches them, Globox is awakened by the commotion. Now aware of the situation, Globox helps Murfy try to get Rayman, who is still unawakened by the commotion, to safety. In the process, Globox accidentally removes Rayman's hands, forcing Murfy to pick Rayman up by his hair and drag him away from the clearing himself. In an attempt to save himself, Globox runs away to safety taking Rayman's hands along with him.\n\nAs time passes, more and more Hoodlums are invading the forest. After reaching the entrance to the Council, Rayman and Murfy discover Globox hiding in a barrel. Just as Rayman gets his hands back from his rather cowardly friend, Andre and a few of his minions join them, giving chase to a much frightened Globox. As Rayman and Murfy pursue after then, they learn of Andre's evil plan: to taint the heart of the world so that he can create that same energy into an army of Hoodlums. Undeterred, the twosome continue the chase. Eventually, Andre catches up with Globox, who ends up accidentally swallowing the evil creature. Now it is up to Rayman to find a doctor to rid Andre from Globox's stomach.\n\nAlong the way, Rayman meets up with three doctors: Otto, Romeo, and Art Rytus (or Gonzo). As all three doctors fail independently to purge Andre, they succeed in getting rid of him after some teamwork. Now angry and still undeterred by his plans for world domination, Andre teams up with Reflux, a being whom Rayman had to duel with to prove his worth to the Knaaren race. Hungry for power and desperate to get rid of Rayman, the two decide to team up and make even more havoc for Rayman.\n\n\n","torrent":{"xt":"urn:btih:7d88cdcda97bb338a6c76978801e6d2366aeee78","amp;dn":"Rayman+3+-+Hoodlum+havoc+%2B+CRACK+100%25+WORKING%21%21+ENGLISH++saliko","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d88cdcda97bb338a6c76978801e6d2366aeee78","infoHashBuffer":{"type":"Buffer","data":[125,136,205,205,169,123,179,56,166,199,105,120,128,30,109,35,102,174,238,120]},"announce":[],"urlList":[]}}