{"title":"Writing Down Your Soul - Janet Conner","uid":10328270,"size":766939,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7e80ec4f38b1c4fc639879e03736c36d3560b051&amp;dn=Writing+Down+Your+Soul+-+Janet+Conner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"ZamKhan","files":-1,"time":1402381219,"description":"You could pray, or meditate, or dream, or visit a shaman, or a minister, or a hypnotherapist. With so many routes into inner consciousness, why write? Of all the ways to get in touch with God, as you understand God... to hear the small, still voice pointing you in the right direction... why take the time to write? One reason: it works. It works amazingly well. If you want to engage in a vibrant conversation with the wisdom that dwells just a hair below your conscious awareness, write. Write every day, at approximately the same time, with passion, honesty, and the intention of speaking with and listening to the voice within. Janet Conner was escaping a terrible situation of domestic abuse. While trying to ? gure out how she and her son could live and how they could eat, she realized she had hit rock bottom. With no other advisors, she listened to her own inner voice, which told her to start writing. As she did, Janet's inner voice gained clarity and strength, and she felt an incredible connection to the divine, and almost immediately miracles began to happen. Today, research scientists in psychology, physics, biochemistry, and neurology are providing peeks into what consciousness is and how it works. Their findings give us intriguing clues as to what is actually happening in and through our bodies, minds, and spirits as we roll pen across paper. Writing Down Your Soul explores some of this research and instructs readers how to access the power and beauty of their own deepest selves.","torrent":{"xt":"urn:btih:7e80ec4f38b1c4fc639879e03736c36d3560b051","amp;dn":"Writing+Down+Your+Soul+-+Janet+Conner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e80ec4f38b1c4fc639879e03736c36d3560b051","infoHashBuffer":{"type":"Buffer","data":[126,128,236,79,56,177,196,252,99,152,121,224,55,54,195,109,53,96,176,81]},"announce":[],"urlList":[]}}