{"title":"Boris Pasternak - Nobel Prize in Literature, 1958 (10 books)","uid":11812320,"size":37331408,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7eaef88e8a96f537fdac0d387c1281389daf7b6e&amp;dn=Boris+Pasternak+-+Nobel+Prize+in+Literature%2C+1958+%2810+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":4,"uploader":"workerbee","files":24,"time":1428886629,"description":"\nBORIS LEONIDOVICH PASTERNAK (1890-1960) was a Russian poet, novelist, and translator.  He was awarded the 1958 Nobel Prize in Literature &quot;for his important achievement both in contemporary lyrical poetry and in the field of the great Russian epic tradition&quot; -- an event which enraged the Communist Party of the Soviet Union and forced him to decline the prize, though his descendants later accepted it in his name in 1988.\n\nIn his native Russia, Pasternak's first book of poems, MY SISTER, LIFE (1917), is one of the most influential collections ever published in the Russian language.  Outside Russia, Pasternak is best known as the author of DOCTOR ZHIVAGO (1958), a novel which takes place between the Russian Revolution of 1905 and the Second World War.  Due to its independent-minded stance and rejection of the doctrine of socialist realism, the novel was refused publication in the USSR, but was smuggled to Milan and published in 1957.\n\nIncluded here are two translations of DOCTOR ZHIVAGO, two volumes of poetry, several collections of prose and autobiography, and two volumes of correspondence.\n\n\nThe following books are in PDF format unless otherwise indicated:\n\n* THE ADOLESCENCE OF ZHENYA LUVERS (Philosophical Library, 1961 / Open Road, 2014). -- ePUB/MOBI\n\n* THE CORRESPONDENCE OF BORIS PASTERNAK AND OLGA FREIDENBERG, 1910-1954 (Harcourt Brace Jovanovich, 1982).  Edited with an Introduction by Elliott Mossman, and translated by Elliott Mossman and Margaret Wettlin.\n\n* DOCTOR ZHIVAGO (Pantheon, 1958).  Translated by Max Hayward and Manya Harari. -- PDF + ePUB/MOBI\n\n* DOCTOR ZHIVAGO (Pantheon, 2010).  Translated by Richard Pevear and Larissa Volokhonsky. -- ePUB/MOBI\n\n* FAMILY CORRESPONDENCE, 1921-1960 (Hoover Institution, 2010).  Translated with an Introduction by Nicolas Pasternak Slater; edited by Maya Slater.\n\n* I REMEMBER: Sketch for an Autobiography (Pantheon, 1959).  Translated by David Magarshack and Manya Harari.\n\n* IN THE INTERLUDE: Poems 1945-1960 (Oxford UP, 1962).  Translated by Henry Kamen.\n\n* POEMS (Kent State UP, 1970).  Second Edition, revised and enlarged.  Translated by Eugene M. Kayden.\n\n* SAFE CONDUCT: An Autobiography and Other Writings (Signet, 1959).  Various translators.\n\n* THE VOICE OF PROSE: Volume 1, Early Prose and Autobiography (Grove, 1986).  Translated by Christopher Barnes.\n\n_____________________________________________________________________________\n\n\n&gt;&gt; CONTACT ME\nYou may reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\n        &lt;a href=&quot;\nhttps://pirates-forum.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://pirates-forum.org/User-workerbee&lt;/a&gt;  \n\n&gt;&gt; PLEASE HELP TO SEED!\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:7eaef88e8a96f537fdac0d387c1281389daf7b6e","amp;dn":"Boris+Pasternak+-+Nobel+Prize+in+Literature%2C+1958+%2810+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7eaef88e8a96f537fdac0d387c1281389daf7b6e","infoHashBuffer":{"type":"Buffer","data":[126,174,248,142,138,150,245,55,253,172,13,56,124,18,129,56,157,175,123,110]},"announce":[],"urlList":[]}}