{"title":"My.Kitchen.Rules.s06e07.WS.PDTV.x264.BF1.mkv","uid":11694342,"size":640238789,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7ee77c8e59755548cde76e5aa04ba4fc0b0519c6&amp;dn=My.Kitchen.Rules.s06e07.WS.PDTV.x264.BF1.mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":2,"uploader":"bigfish5","files":1,"time":1423662602,"description":"My Kitchen Rules Australia Series 6 Episode 7\n\nIt's time to meet Group 2 and first up, we head to Queensland for childhood friends Sheri and Emilie. Playing to their individual strengths, they're hoping to make a strong team and get the second group off to a flying start. Hosted by Pete Evans and Manu Feildel.\n\nSheri and Emilie Queensland\nWe get told that we're old at heart.\nSoul sisters Sheri and Emilie met as teenagers and say their friendship became super strong after they bonded over their childhoods.\nExplains Sheri: &quot;We have a really similar upbringing - we both lived with our grandparents and grew up with single mums.&quot;\nAs a result, their grannies Mary and Irene taught them a lot about cooking and food.\n&quot;Our grannies definitely taught us everything we know about baking,&quot; says Sheri.\n&quot;And patience and not giving up on mistakes in the kitchen,&quot; adds Emilie, who is mum to two-year-old William.\nWith work, relationships and family sometimes putting kilometres between their friendship, the girls spend a lot of time on the phone, skype and email.\n&quot;So we really haven't had much time in the kitchen together,&quot; admits Sheri. &quot;We've always been so close but from a distance so to be together and be able to do this is awesome because we don't get to spend this much time together normally.&quot;\nSheri, 22, and Emilie, 24, admit their biggest weakness in the kitchen is Emilie's hearing impairment. She has been deaf since birth, but with the help of a hearing aid has 80 percent hearing in her right ear and she can lip read perfectly.\n&quot;I'm lucky to have one ear that's working so that gets me through life,&quot; she says admitting the extra noise in the kitchen can be difficult at times.\nA lot of their time in the kitchen is split with Sheri on savoury and Emilie on sweet. Their style of cooking is hearty and homely. Sheri says: &quot;It's big, hearty dude food. But gourmet.&quot;\nEmilie adds: 'We like food that fills your belly. I'm not big on eating a drop of sauce and a little pile of meat on your plate. I want to go back for more. I don't want all that cooking for five hours and all I got was that little piece of meat. I love food that fills you up.&quot;\nAnd they're adventurous eaters too. Disability support worker Sheri, who has done a lot of travelling, admits:\n&quot;Travelling opens your eyes to different cultures and the way they eat, not just the food but the whole experience of eating together.\n&quot;I remember like the first time I tried haggis and blood sausage and all those Scottish dishes which everyone is like, 'Eww that's gross' but I'm really passionate if you're going to kill an animal don't waste it. So I use head to toe cooking.&quot;\nEmilie, who ran her first triathlon last (2014) year, is very competitive.\nBoth are artistic with Sheri into painting, writing and lapidary with her granddad, while Emilie is a photographer who loves knitting and creative writing","torrent":{"xt":"urn:btih:7ee77c8e59755548cde76e5aa04ba4fc0b0519c6","amp;dn":"My.Kitchen.Rules.s06e07.WS.PDTV.x264.BF1.mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ee77c8e59755548cde76e5aa04ba4fc0b0519c6","infoHashBuffer":{"type":"Buffer","data":[126,231,124,142,89,117,85,72,205,231,110,90,160,75,164,252,11,5,25,198]},"announce":[],"urlList":[]}}