{"title":"Writing Feature Stories - Matthew Ricketson.pdf","uid":11680967,"size":3467698,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7eec8ce11bda73cf58422fae1c4dab8a6bcd0bf2&amp;dn=Writing+Feature+Stories+-+Matthew+Ricketson.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"ZamKhan","files":1,"time":1423086823,"description":"Writing Feature Stories: How to Research and Write Newspaper and Magazine Articles\nMatthew Ricketson\n\n\nA systematic and user-friendly approach to journalistic feature story writing for journalism students, professionals, freelancers, and beginners is provided in this guide. Writers will learn to move beyond conventional news stories and embrace their creativity to create compelling features. Generating fresh ideas, gathering factual information, sifting through raw material, choosing the best angle, and working with editors are all explored. Discussion questions and exercises reinforce the ideas presented in each chapter. Pop culture examples and recently published articles are used to make concepts memorable and easily accessible.\n\nReview\n&quot;Matthew Ricketson's book is both useful and thought-provoking. For the young reporter struggling to write features, it provides a good basic primer. For those interested in pushing the boundaries of the journalistic form, it provides encouragement and provocation.&quot; --Margaret Simons, award-winning journalist and author of &quot;Meeting of the Waters&quot;\n\nAbout the Author\nMatthew Ricketson is the head of journalism at RMIT University. He has written for &quot;The Age,&quot; &quot;The Australian,&quot; and &quot;Time.&quot; He is the winner of a United Nations Media Peace Prize citation and the George Munster prize for best freelance journalism","torrent":{"xt":"urn:btih:7eec8ce11bda73cf58422fae1c4dab8a6bcd0bf2","amp;dn":"Writing+Feature+Stories+-+Matthew+Ricketson.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7eec8ce11bda73cf58422fae1c4dab8a6bcd0bf2","infoHashBuffer":{"type":"Buffer","data":[126,236,140,225,27,218,115,207,88,66,47,174,28,77,171,138,107,205,11,242]},"announce":[],"urlList":[]}}