{"title":"The Perks of Being a Wallflower --Stephen Chobsky","uid":7277226,"size":572887,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7f6041b583cc1c09340ec879f63eacf20141835e&amp;dn=The+Perks+of+Being+a+Wallflower+--Stephen+Chobsky&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"sputnikvi","files":1,"time":1337324593,"description":"A .pdf of The Perks of Being a Wallflower. I didn't make this, and sometimes the formatting is a bit rough, so sorry for that. Enjoy. Book blurb from Amazon:\n\nStanding on the fringes of life offers a unique perspective. But there comes a time to see what it looks like from the dance floor. This haunting novel about the dilemma of passivity vs. passion marks the stunning debut of a provocative new voice in contemporary fiction: The Perks of Being a Wallflower.\n\nThis is the story of what it's like to grow up in high school. More intimate than a diary, Charlie's letters are singular and unique, hilarious and devastating. We may not know where he lives. We may not know to whom he is writing. All we know is the world he shares. Caught between trying to live his life and trying to run from it puts him on a strange course through uncharted territory. The world of first dates and mixed tapes, family dramas and new friends. The world of sex, drugs, and The Rocky Horror Picture Show, when all one requires is that perfect song on that perfect drive to feel infinite.\n\nThrough Charlie, Stephen Chbosky has created a deeply affecting coming-of-age story, a powerful novel that will spirit you back to those wild and poignant roller coaster days known as growing up.","torrent":{"xt":"urn:btih:7f6041b583cc1c09340ec879f63eacf20141835e","amp;dn":"The+Perks+of+Being+a+Wallflower+--Stephen+Chobsky","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f6041b583cc1c09340ec879f63eacf20141835e","infoHashBuffer":{"type":"Buffer","data":[127,96,65,181,131,204,28,9,52,14,200,121,246,62,172,242,1,65,131,94]},"announce":[],"urlList":[]}}