{"title":"IcoFX 2.13 Multilingual + Keys [SadeemPC].zip","uid":14438159,"size":10020156,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7f734bad2037a5b200a97c25aaaf926eae966348&amp;dn=IcoFX+2.13+Multilingual+%2B+Keys+%5BSadeemPC%5D.zip&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"SadeemPC","files":1,"time":1461650246,"description":"IcoFX 2.13 Multilingual\r\n\r\nIcoFX is an award winning professional icon and cursor editor. It is an all-in-one solution for icon creation, extraction and editing. IcoFX is designed to work with Windows XP, Vista, Windows 7, Windows 8 and Macintosh icons supporting transparency. Create Windows icons up to 256×256 for Windows and Macintosh icons up to 1024×1024 for Macintosh. With more than 40 effects at your fingertips, there’s virtually no limit to the icons you can create. IcoFX features a collection of intuitive color correction tools. Using these tools you can fine-tune hue, saturation, and luminance, adjust color levels, brightness and contrast. You can easily work with multiple files using the batch processing capability of IcoFX. Create, convert, extract or export all your icons or cursors with just a few clicks. \r\n\r\nConvert your Macintosh icons to Windows icons and vice versa. Support for static and animated cursors. Create a favicon for your website or blog. IcoFX allows you to rearrange, blend layers and change their opacity. IcoFX gives you the possibility to create icon libraries or change icons inside exe files.\r\n\r\nMain Features of IcoFX:\r\n• Create icons and cursors. Create icons for Windows and Macintosh. Support for Windows Vista icons with PNG compression. Convert your Macintosh icons to Windows icons and vice versa. Support for static and animated cursors. Create a favicon for your website or blog.\r\n• Import, export and extract. You can easily convert your favorite images into icons or cursors, or icons into images. Supported image formats BMP, PNG, JPG, JPG2000, TIF and GIF. You can extract icons from other files, including Windows Vista, Windows 7 and Macintosh files.\r\n• Advanced Editor. IcoFX features a full blown image editor with many useful tools. You can use different brush sizes, shapes, hardness, even blending modes when painting. With more than 40 effects at your fingertips, there’s virtually no limit to the icons you can create.\r\n• Image objects. Using pre-made image object icon creation has never been easier. You can combine the image objects in layer based images using IcoFX. It allows you to rearrange, blend layers and change their opacity.\r\n• Batch process files. You can easily work with multiple files using the batch processing capability of IcoFX (Business License). Create, convert, extract or export all your icons or cursors with just a few clicks.\r\n• Icon libraries. IcoFX gives you the possibility to create and edit icon and cursor libraries using the built in resource editor. Using the resource editor you can also change icons inside exe files.\r\n\r\nWhats New :\r\n+ Changing layer visibility will not select the layer\r\n+ Saved images are also added to the recent files list\r\n* [Fixed] Could not draw equilateral shapes using shift when zoom &lt; 100%\r\n* Minor enhancements and bugfixes","torrent":{"xt":"urn:btih:7f734bad2037a5b200a97c25aaaf926eae966348","amp;dn":"IcoFX+2.13+Multilingual+%2B+Keys+%5BSadeemPC%5D.zip","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f734bad2037a5b200a97c25aaaf926eae966348","infoHashBuffer":{"type":"Buffer","data":[127,115,75,173,32,55,165,178,0,169,124,37,170,175,146,110,174,150,99,72]},"announce":[],"urlList":[]}}