{"title":"Mathias and Ginastera: Harp Concertos - Ann Hobson Pilot (1994)","uid":16032256,"size":218525280,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:800a7655a4bc22e7c450814454dae1e2ed79aa01&amp;dn=Mathias+and+Ginastera%3A+Harp+Concertos+-+Ann+Hobson+Pilot+%281994%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"Scheheraz","files":25,"time":1476438724,"description":"http://cps-static.rovicorp.com/3/JPG_500/MI0000/965/MI0000965559.jpg\r\n\r\nGramophone [12/1994]:\r\n&quot;The connection between Wales and the harp is a long-standing one, and Mathias's part in it began 12 years before his Harp Concerto was written, with Improvisations for harp solo; even a Welshman has to learn how to cope with such an idiosyncratic instrument. He learned his lessons well—even using semitone pedal glissandos in the second movement, and he keeps the harp audible by alternating its solo passages with orchestral ones or, when the two are working together treating the orchestra with a light touch (the celesta is used as a particularly effective companion to the harp), at other times resorting to the more familiar across-the-strings sweep. Two movements have declared Welsh associations: the first juxtaposes but does not develop three themes the second is a 'bardic' elegy; the last is simply ''joyful and rhythmic''. The whole makes pleasing listening appealing to the emotions and imagination rather than the intellect.\r\nGinastera also took a long time to become properly acquainted with the harp—eight years, his concerto is a much grittier and purposeful affair rather a mixture of styles but not one that allows you to forget his South American roots. Of the available recordings of it (Zabaleta's, DG, 1/71, no longer is) this is arguably the best. Ann Hobson Pilot's name is new to me, though not to the Boston Symphony Orchestra whose Principal Harpist she is, an addition to the long list of outstanding women harpists, here matched in every good respect by the ECO in a most enjoyable and well-engineered recording.&quot; --John Duarte\r\n\r\nWilliam Mathias (1934-1992)\r\nHarp Concerto Opus 50 (1970)\r\nAlberto Ginastera (1916-1983)\r\nHarp Concerto Opus 25 (1956)\r\n\r\nAnn Hobson Pilot, harp\r\nEnglish Chamber Orchestra\r\nIsaiah Jackson, conductor","torrent":{"xt":"urn:btih:800a7655a4bc22e7c450814454dae1e2ed79aa01","amp;dn":"Mathias+and+Ginastera%3A+Harp+Concertos+-+Ann+Hobson+Pilot+%281994%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"800a7655a4bc22e7c450814454dae1e2ed79aa01","infoHashBuffer":{"type":"Buffer","data":[128,10,118,85,164,188,34,231,196,80,129,68,84,218,225,226,237,121,170,1]},"announce":[],"urlList":[]}}