{"title":"Needtobreathe - Rivers In the Wasteland [2014]  [EAC/FLAC]","uid":10425430,"size":309247448,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8010965b84381d4e6be7aa1435b01ef6b42a8250&amp;dn=Needtobreathe+-+Rivers+In+the+Wasteland+%5B2014%5D++%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":7,"uploader":"dickspic","files":-1,"time":1403695272,"description":"FLAC / Lossless / Log (100%) / Cue\nLabel/Cat#: Atlantic #7567867692\nCountry: USA\nYear: April 15, 2014\nGenre: rock,pop\nFormat: CD,Album\n\n[b]\n\n1. Wasteland (04:31)\n2. State I'm In (03:19)\n3. Feet, Don't Fail Me Now (03:44)\n4. Oh, Carolina (03:25)\n5. Difference Maker (05:40)\n6. Rise Again (03:19)\n7. The Heart (03:44)\n8. Where the Money Is (03:23)\n9. Multiplied (04:38)\n10. Brother (04:51)\n11. More Heart, Less Attack (05:01)\n\n\n\n\nWhile Needtobreathe have always carefully straddled the divide between sacred and secular music, their emergence as bona fide mainstream rock stars is due in large part to their knack for consistently delivering arena-sized epics that appealingly mix Coldplay-esque modern rock with rootsy Carolina stomp. It's a formula they've followed since their 2006 debut, Daylight, with each subsequent album making frequent pendulum swings that showcase both their rock and folk sides. Though the band has been together since 2000, it wasn't until 2011's The Reckoning that brothers Bear and Bo Rinehart along with bassist Seth Bolt attained the kind of success they'd been slowly building toward. Their thinly cloaked inspirational messages and heartily sung Americana coincided with the commercial breakthrough of the nu-folk sound and their album reached number four on the Billboard charts. Following up a breakout album is tough business for any artist and when the platform for your music is Christian faith, the heavy demands of trying repeat a commercial success can lead to some serious soul-searching. So it was with the members of Needtobreathe as they took a lengthy personal break before recording the 11 new songs on 2014's Rivers in the Wasteland. As Bear Rinehart sings &quot;If God is on my side, then who could be against me&quot; on the slow-building opener &quot;Wasteland,&quot; it seem fairly clear that Needtobreathe are out to conquer their past demons and reclaim both their success and their sacred roots. More overt references to God and faith appear on warm acoustic tracks like &quot;Difference Maker&quot; and &quot;Multiplied,&quot; which will appeal to the CCM community who helped launch the band's career. Peppered throughout the more subtly built folk pieces are some rock-based curve balls like the charming Beach Boys-meets-roadhouse shuffle &quot;State I'm In&quot; and the punchy, melodic rock of &quot;Where the Money Is.&quot; Lyrical content aside, Rivers in the Wasteland is well-produced and full of warm melodies that feel both pleasantly world-weary and uplifting. When Rinehart isn't too busy overplaying his throaty growl to the rafters, he achieves a welcoming Cat Stevens sort of tone that helps bring out the retro singer/songwriter nuances on many of the tracks. If Needtobreathe's intention was to deliver a more down-to-earth and reflective record following The Reckoning's big-budget glitz, they've succeeded.","torrent":{"xt":"urn:btih:8010965b84381d4e6be7aa1435b01ef6b42a8250","amp;dn":"Needtobreathe+-+Rivers+In+the+Wasteland+%5B2014%5D++%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8010965b84381d4e6be7aa1435b01ef6b42a8250","infoHashBuffer":{"type":"Buffer","data":[128,16,150,91,132,56,29,78,107,231,170,20,53,176,30,246,180,42,130,80]},"announce":[],"urlList":[]}}