{"title":"Tricks of the Mind - Derren Brown","uid":6744253,"size":19791361,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:803886ba9355400d45ae0997999be1473fc31ea9&amp;dn=Tricks+of+the+Mind+-+Derren+Brown&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"neil1966hardy","files":2,"time":1318622580,"description":"Tricks Of The Mind\nDerren Brown (Author)\n\nDerren Brown's television and stage performances have entranced and dumbfounded millions. His baffling illusions and stunning set pieces - such as The Seance, Russian Roulette and The Heist - have set new standards of what's possible, as well as causing more than their fair share of controversy. Now, for the first time, he reveals the secrets behind his craft, what makes him tick and just why he grew that beard. Tricks of the Mind takes you on a journey into the structure and psychology of magic. Derren teaches you how to read clues in people's behaviour and spot liars. He discusses the whys and wherefores of hypnosis and shows you how to do it. And he investigates the powers of suggestion and how you can massively improve the power of your memory. He also takes a long hard look at the paranormal industry, and looks at why some of us feel the need to believe in it in the first place... Alternately hilarious, controversial and challenging, Tricks ofthe Mind is essential reading for Derren's legions of fans, and pretty bloody irresistible even if you don't like him that much...\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:803886ba9355400d45ae0997999be1473fc31ea9","amp;dn":"Tricks+of+the+Mind+-+Derren+Brown","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"803886ba9355400d45ae0997999be1473fc31ea9","infoHashBuffer":{"type":"Buffer","data":[128,56,134,186,147,85,64,13,69,174,9,151,153,155,225,71,63,195,30,169]},"announce":[],"urlList":[]}}