{"title":"XLN Audio Addictive Drums DVDR HYBRID","uid":4104149,"size":1879365386,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8180433cf2254bc9bbff007b3c50a2128097a2f0&amp;dn=XLN+Audio+Addictive+Drums+DVDR+HYBRID&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"koenop","files":2,"time":1206722358,"description":"Addictive Drums is a Complete Drum Production Studio. Our concept is this: \n\nTo  create  a  convincing drum track in any style you\nneed 3 things:                                       \n                                                     \n- The &quot;raw&quot; drum/cymbal sounds, recorded with a multi mic  setup\n- The  mixing process, including all the effects and the  know-how of a producer/technician \n- The  grooves, beats and fills of a good drummer    \n                                                     \nAddictive  Drums  offers  all this, in an easy to use plugin,  compatible  with  all  the  major  hosts out there!                                               \n                                                     \nWith  the  included  Presets  you can immediately try out  different  production  styles  and  easily tweak anything  in  the  mix to make it perfect. No more ?I have  30 plugin windows to keep track of just for the drums?.  And  when  you?ve  perfected  your favourite drum  sound,  just  save it and re-use it in the next project!\n                                                     \nKits &amp; Pieces                                        \nAddictive  Drums ships with 3 complete kits, and lots of extra drums and cymbals. The samples include every nuance  from  the  softest  to the hardest hits, many stroke variations (hihat has 12 variations, snare has 6  for example) Alternating samples through-out bring unparalleled realism.                                                     \nAll  sampled  drum/cymbal  sounds are recorded with a multi  channel  mic setup, just as you would record a real drum kit.\n                                                     \nTune and tweak Shaping the basic sound is easy within AD?s  sampler  section. Controls for volume and pitch (with  envelopes),  levels  (adjust balance of Close, Overhead  and  Room  levels  of  each  Kitpiece), and filter  (cut the low end on hihats for example) means you  can  do  anything  from slight tweaking to major reconstruction of the sound.\n                                                     \nMix it up - built in effects                         \n\n12  mixer  channels,  52 insert effects and 2 reverbs are  at  your  disposal,  giving  you  the freedom to create  just  about any drum sound you&amp;#039;ve ever heard. And  then  some! Everything is quickly accessible, no hidden  menus get in your way. See it, tweak it, move on.  Drum  production  has  never been this easy, and  even  our  pro  users agree that Pro should not equal &quot;impossible to understand&quot;.\n                                                     \nPresets  =  Instant results The included presets make it  easy to try out different styles for a track, and  lets you save and re-use complete drum productions in new  songs. You can create your own folders with your own presets and they immediately appear in the Preset menu!\n                                                     \nMidi  files A vast library of midi files in different styles,  all  easily  accessible from within AD gives you   the  building  blocks  to  create  drum  tracks quickly.  The  built  in  browser  lets you search by keyword  (Ride,  Metal),  or  sort  by Category, BPM, Time  signature. Drag&amp;#039;n&amp;#039;drop files the files you like to  AD&amp;#039;s favourite list, or drag them right into your host&amp;#039;s arrangement window!                                                     \nLet  it  all out ? separate outputs AD is a multi-out plugin,  meaning  that  every channel in the AD mixer can  be  routed  to  a  separate  output if you like.                                                      \nThe  AD  Kits Sonor Designer (Kick, Snare, 5 toms) DW Collector&amp;#039;s   Series   (Kick,  Snare,  5  toms)  Tama Starclassic (Kick, Snare, 3 toms)\n                                                     \nExtras:                                              \nPearl  Signature  Ferrrone  snare,  Pearl Masterworks Piccolo snare, Pearl Masterworks kick                \n                                                     \nCymbals: (Sabian &amp; Paiste)                           \n3  Hihats,  4 Rides, 9 Crashes, 3 Splashes &amp; 2 Chinas\n                                                     \nThe AD sampler                                       \nFor each Kitpiece:                                   \n- Solo/Mute                                          \n- Main Level                                         \n- Overhead Level + Pan/Width                         \n- Room Level + Pan/Width                             \n- Single Sample mode                                 \n- Main Pitch + OH/Room Pitch Offset                  \n- Pitch Envelope (w velocity mod)                    \n- Amp Envelope                                       \n- HiPass/LoPass Filter                               \n                                                     \nThe AD Effects                                       \nFor each channel:                                    \n- Compressor                                         \n- Dist (4 algos, selectable bandwidth)               \n- EQ (3 band)                                        \n- Saturating Limiter                                 \n- Master  and  Bus  channels  additionally  include: \n- Tape Saturation                                    \n- HiPass/LoPass Filter                               \n                                                     \nReverbs include                                      \n- 4 algorithms   (Ambience,  Room,  Hall,  Plate)    \n- Decay Time, Predelay, Damping                      \n- 2 band EQ                                          \n- Pan/Width control                                  \n                                                     \nThe AD Presets                                       \nOver  100  presets  are  included,  ranging from pure acoustic   pop,   to   Metal,   Funk   and  distorted electronica mayhem. Preset categories include: Clean, Distorted,  Electronica, LoFi, PopRock (Big), PopRock (Medium),   PopRock   (Dry),   Retro,   Rock,   Soft, Xperimental. \n                                                     \nThe AD Midi Library More than 3000 beats and fills in various  styles  such  as Pop/Rock, Metal, Funk, Jazz etc  are  included.  There are basic Kick+Snare beats with   variations   on   each  like  &quot;8th  Hihat&quot;  &quot;w Ghostnotes&quot;  &quot;4th  Ride&quot;  etc. There are also &quot;Songs&quot; which   contain   4  bar  Verse/Bridge/Chorus/Middle8 variations. And lots more!\n                                                     \nNote : Keygen larger than usual to support mac users \n                                                      &lt;a href=&quot;\nhttp://www.xlnaudio.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.xlnaudio.com&lt;/a&gt;                              \n                                                     \nInstall:                                             \n                                                     \n1. Enter your computer Id into the keygen            \n2. Replace Resources.xpak file with one from keygen  \n3. Use authorization code from keygen to unlock      \n4. Mac users :                                       \n   run the keygen on a PC and enter your Computer ID \n   copy and replace the Resources.xpak file on your  \n   Mac then use the authorization code               \n   from the keygen to unlock.                        \n5. Enjoy this fine Team AiRISO release !!!           \n","torrent":{"xt":"urn:btih:8180433cf2254bc9bbff007b3c50a2128097a2f0","amp;dn":"XLN+Audio+Addictive+Drums+DVDR+HYBRID","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8180433cf2254bc9bbff007b3c50a2128097a2f0","infoHashBuffer":{"type":"Buffer","data":[129,128,67,60,242,37,75,201,187,255,0,123,60,80,162,18,128,151,162,240]},"announce":[],"urlList":[]}}