{"title":"The Book of General Ignorance -  Lloyd &amp; Mitchinson [epub] [","uid":8094716,"size":1148134,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:81a453bf1f03ad05ba54fdc561b7fdca98dd0045&amp;dn=The+Book+of+General+Ignorance+-++Lloyd+%26amp%3B+Mitchinson+%5Bepub%5D+%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"KatQwerty","files":3,"time":1359811087,"description":" \nThink Magellan was the first man to circumnavigate the globe, baseball was invented in America, Henry VIII had six wives, Mount Everest is the tallest mountain? Wrong, wrong, wrong, and wrong again. \nMisconceptions, misunderstandings, and flawed facts finally get the heave-ho in this humorous, downright humiliating book of reeducation based on the phenomenal British bestseller. Challenging what most of us assume to be verifiable truths in areas like history, literature, science, nature, and more, \n&quot;The Book of General Ignorance&quot; is a witty &quot;gotcha&quot; compendium of how little we actually know about anything. It'll have you scratching your head wondering why we even bother to go to school. \nRevealing the truth behind all the things we think we know but don't, this book leaves you dumbfounded about all the misinformation you've managed to collect during your life, and sets you up to win big should you ever be a contestant on Jeopardy! or &quot;Who Wants to Be a Millionaire.&quot; \nBesides righting the record on common (but wrong) myths like Captain Cook discovering Australia or Alexander Graham Bell inventing the telephone, &quot;The Book of General Ignorance&quot; also gives us the skinny on silly slipups to trot out at dinner parties (Cinderella wore fur, not glass, slippers and chicken tikka masala was invented in Scotland, not India). \nThomas Edison said that we know less than one millionth of one percent about anything: this book makes us wonder if we know even that much. \nYou'll be surprised at how much you don't know! Check out THE BOOK OF GENERAL IGNORANCE for more fun entries and complete answers to the following: \nHow long can a chicken live without its head?\nAbout two years. \nWhat do chameleons do? \nThey don't change color to match the background. Never have; never will. Complete myth. Utter fabrication. Total Lie. They change color as a result of different emotional states. \nWho invented champagne? \nNot the French. \nHow many legs does a centipede have?\nNot a hundred. \nHow many toes has a two-toed sloth? \nIt's either six or eight. \nHow many penises does a European earwig have? \na)Fourteen\nb)None at all\n&quot;c)Two (one for special occasions)\n&quot;d)Mind your own business \nWhich animals are the best-endowed of all?\nBarnacles. These unassuming modest beasts have the longest penis relative to their size of any creature. They can be seven times longer than their body. \nWhat is a rhino's horn made from? \nA rhinoceros horn is not, as some people think, made out of hair. \nWho was the first American president?\nPeyton Randolph. \nWhat were George Washington's false teeth made from? \nMostly hippopotamus. \nWhat was James Bond's favorite drink? \nNot the vodka martini.\n \n ","torrent":{"xt":"urn:btih:81a453bf1f03ad05ba54fdc561b7fdca98dd0045","amp;dn":"The+Book+of+General+Ignorance+-++Lloyd+%26amp%3B+Mitchinson+%5Bepub%5D+%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81a453bf1f03ad05ba54fdc561b7fdca98dd0045","infoHashBuffer":{"type":"Buffer","data":[129,164,83,191,31,3,173,5,186,84,253,197,97,183,253,202,152,221,0,69]},"announce":[],"urlList":[]}}