{"title":"Badass: A Relentless Onslaught of the Toughest Warlords ...","uid":15791746,"size":8161365,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:81bc42ab6e8ccffd1b9dad459518f873c0a22da7&amp;dn=Badass%3A+A+Relentless+Onslaught+of+the+Toughest+Warlords+...&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"marty14","files":1,"time":1473387247,"description":"Badass: A Relentless Onslaught of the Toughest Warlords, Vikings, Samurai, Pirates, Gunfighters, and Military Commanders to Ever Live - Ben Thompson [epub]\r\n\r\nThe badasses populating the pages of Badass are the most savagely awesome historical figures to ever strap on a pair of chain mail gauntlets and run screaming into battle. Author Ben Thompson — considered by many to be the Internet’s foremost expert on badassitude — has gathered together a rogues’ gallery of butt-stomping rogues, from Julius Caesar and Genghis Khan to Blackbeard, George S. Patton, and Bruce Lee. Their bone-breaking exploits are illustrated by top artist from the fields of gaming, comics, and cards—DC Comics illustrator Matt Haley and Thomas Denmark, illustrator for the collectible card game Magic: The Gathering. This is not your boring high school history — this is tough, manly, unrelentingly Badass!\r\n\r\nChandragupta Maurya\r\nAn Indian warlord who commanded an army of drunken war elephants and employed an elite detachment of highly trained female bodyguards\r\n\r\nPeter Francisco\r\nAn unsung hero of the American Revolution, this powerful giant battled the British with a massive five-foot-long broadsword\r\n\r\nWolf the Quarrelsome\r\nA mysterious barbarian leader who only appears in history twice—and both times he's kicking someone's ass\r\n\r\nBhanbhagta Gurung\r\nA fearless Gurkha who won the Victoria Cross by clearing out six Japanese foxholes with nothing more than grenades, a bayonet, and a knife\r\n\r\nFrom Alexander the Great to George S. Patton, from Genghis Khan to Bruce Lee, this pantheon of ass-kicking awesomeness should inspire you to quit your stupid job and dive headfirst into a new career as a professional badass","torrent":{"xt":"urn:btih:81bc42ab6e8ccffd1b9dad459518f873c0a22da7","amp;dn":"Badass%3A+A+Relentless+Onslaught+of+the+Toughest+Warlords+...","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81bc42ab6e8ccffd1b9dad459518f873c0a22da7","infoHashBuffer":{"type":"Buffer","data":[129,188,66,171,110,140,207,253,27,157,173,69,149,24,248,115,192,162,45,167]},"announce":[],"urlList":[]}}