{"title":"Nursing Leadership from the Outside In [PDF][StormRG]{HTD15}","uid":11785059,"size":3435919,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:81c529929aa7d8de63ae2c9b3e8c6b2f83b7ce16&amp;dn=Nursing+Leadership+from+the+Outside+In+%5BPDF%5D%5BStormRG%5D%7BHTD15%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"0xmovva","files":3,"time":1427723908,"description":"TITLE/EDITIONNursing Leadership from the Outside In \nBy: Greer Glazer PhD FAAN RN CNP (Author), Joyce J. Fitzpatrick PhD MBA RN FAAN (Author)\nPaperback: 302 pages\nPublisher: Springer Publishing Company; 1 edition (April 26, 2013)\nLanguage: English\nISBN-10: 0826108660\nISBN-13: 978-0826108661\nNOTE: This is the standalone ebook and may not include access codes that come packaged with the bound book\n\n___________________________________________________________________________________\n\n\nWith the goal of advancing quality health care, this innovative text moves beyond the often insular world of nurse leadership values to offer the perspectives of leaders in other health care disciplines that interface with nurses. These professionals describe and analyze their interactions with nurse leaders regarding their role in quality health care delivery, patient safety, health care reform, and partnering outside the profession, along with suggested improvements.\n\nThe book will enable nurse leaders to clarify strengths and opportunities for growth and to develop strategies for effective collaborations that are necessary for advancing and transforming our health care system. Each chapter is written by an accomplished health care leader outside the nursing profession, and follows a consistent format that includes definitions of leadership, best and worst professional experience with nurse leaders (in terms of strategic vision, risk-taking, creativity, interpersonal and communication effectiveness, inspiring change and self-knowledge), lessons learned, and implications for leaders within and outside nursing.\n\nKey Features:\n\nOffers unique views of nursing leadership from healthcare professionals in other arenas\nDiscusses strengths and weaknesses of nurse leaders and leadership values for inter-professional collaboration\nReflects the Robert Wood Johnson Executive Nurse fellowship values for excellence\nPromotes inter-professional strategies to advance health care reform on a national level\nDesigned for use in graduate nursing leadership courses including DNP","torrent":{"xt":"urn:btih:81c529929aa7d8de63ae2c9b3e8c6b2f83b7ce16","amp;dn":"Nursing+Leadership+from+the+Outside+In+%5BPDF%5D%5BStormRG%5D%7BHTD15%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81c529929aa7d8de63ae2c9b3e8c6b2f83b7ce16","infoHashBuffer":{"type":"Buffer","data":[129,197,41,146,154,167,216,222,99,174,44,155,62,140,107,47,131,183,206,22]},"announce":[],"urlList":[]}}