{"title":"Metal Gear Solid : Integral","uid":6511223,"size":715296768,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:81dca0e70d1e02c4c04242c35992c06151bfdf0e&amp;dn=Metal+Gear+Solid+%3A+Integral&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"BrantX","files":1,"time":1309630606,"description":"Share from ThePirateBay.org\nCredits go to xraidenx fromfor original copy.\nThis is just a share! I take no original credits for this!\n\n[ Information ]\nMetal Gear Solid is a stealth action video game directed and written by Hideo Kojima. The game was developed by Konami Computer Entertainment Japan and first published by Konami in 1998 for the PlayStation video game console. It is the third canonical title in the Metal Gear series, and the direct sequel to Metal Gear 2: Solid Snake. The game featured an unprecedented amount of cinematic cut scenes rendered using the in-game engine and graphics, as well as voice acting in numerous codec sequences.\n\nThe story of Metal Gear Solid takes place in 2005, south-west of Alaska in the Bering sea. It follows Solid Snake, a retired soldier who infiltrates a nuclear weapons disposal facility to neutralize the terrorist threat from FOXHOUND, a renegade special forces unit. Snake must liberate two hostages, the head of DARPA and the president of a major arms manufacturer, confront the terrorists, and stop them from launching a nuclear strike.\n\n[ What is Intergral? ]\nIntegral is essentially a relocalized version of Metal Gear Solid based on the English version. Integral features most of the added content from the international versions of Metal Gear Solid which were not featured in the initial Japanese release such as adjustable difficulty settings, a First Person Perspective Mode, different patrol routes for enemy guards, two hidden Codec frequencies, an alternate sneaking suit outfit for Meryl Silverburgh, and PocketStation minigames\n\n[ System Requirement ]\nPentium II 233 MHz CPU, 32 MB RAM, 4 MB video card, DirectX v. 7.0A[4]\n\n[How to Install] ","torrent":{"xt":"urn:btih:81dca0e70d1e02c4c04242c35992c06151bfdf0e","amp;dn":"Metal+Gear+Solid+%3A+Integral","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81dca0e70d1e02c4c04242c35992c06151bfdf0e","infoHashBuffer":{"type":"Buffer","data":[129,220,160,231,13,30,2,196,192,66,66,195,89,146,192,97,81,191,223,14]},"announce":[],"urlList":[]}}