{"title":"The New York Review of Books (2016).pdf - {Vofuse}","uid":15700184,"size":62920044,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:827b874af5ae382cee5820465093095a7bc2b522&amp;dn=The+New+York+Review+of+Books+%282016%29.pdf+-+%7BVofuse%7D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"Vofuse","files":7,"time":1472470426,"description":"The New York Review of Books (or NYREV or NYRB) is a semi-monthly magazine with articles on literature, culture, economics, science and current affairs. Published in New York City, it is inspired by the idea that the discussion of important books is an indispensable literary activity. Esquire called it &quot;the premier literary-intellectual magazine in the English language.&quot; In 1970 writer Tom Wolfe described it as &quot;the chief theoretical organ of Radical Chic&quot;.\r\n\r\nThe Review publishes long-form reviews and essays, often by well-known writers, original poetry, and has lively letters and personals advertising sections. In 1979 the magazine founded the London Review of Books, which continues independently. In 1990 it founded an Italian edition, la Rivista dei Libri, published until 2010. Robert B. Silvers and Barbara Epstein edited the paper together from its founding in 1963, until her death in 2006. Since then, Silvers has been sole editor. The Review has a book publishing division, established in 1999, called New York Review Books, which publishes classics, collections and children's books. Since 2010, the journal has hosted an online blog written by its contributors","torrent":{"xt":"urn:btih:827b874af5ae382cee5820465093095a7bc2b522","amp;dn":"The+New+York+Review+of+Books+%282016%29.pdf+-+%7BVofuse%7D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"827b874af5ae382cee5820465093095a7bc2b522","infoHashBuffer":{"type":"Buffer","data":[130,123,135,74,245,174,56,44,238,88,32,70,80,147,9,90,123,194,181,34]},"announce":[],"urlList":[]}}