{"title":"David Foster Wallace - Brief Interviews with Hideous Men","uid":15410640,"size":175210665,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8295705077eb48eb070c95bf59ee54368eba0d4d&amp;dn=David+Foster+Wallace+-+Brief+Interviews+with+Hideous+Men&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"Cybotage","files":23,"time":1469551373,"description":"In his startling and singular new short story collection, David Foster Wallace nudges at the boundaries of fiction with inimitable wit and seductive intelligence. Venturing inside minds and landscapes that are at once recognisable and utterly strange, these stories reaffirm Wallace's reputation as one of his generation's pre-eminent talents, expanding our ides and pleasures fiction can afford.\r\n\r\nAmong the stories are 'The Depressed Person', a dazzling and blackly humorous portrayal of a woman's mental state; 'Adult World', which reveals a woman's agonised consideration of her confusing sexual relationship with her husband; and 'Brief Interviews with Hideous Men', a dark, hilarious series of portraits of men whose fear of women renders them grotesque. Wallace's stories present a world where the bizarre and the banal are interwoven and where hideous men appear in many different guises. Thought-provoking and playful, this collection confirms David Foster Wallace as one of the most imaginative young writers around. Wallace delights in leftfield observation, mining the ironic, the surprising and the illuminating from every situation. His new collection will delight his growing number of fans, and provide a perfect introduction for new readers.\r\n\r\n\r\n\r\n\r\nRead by David Foster Wallace\r\nFormat: MP3\r\nBitrate: 128 Kbps","torrent":{"xt":"urn:btih:8295705077eb48eb070c95bf59ee54368eba0d4d","amp;dn":"David+Foster+Wallace+-+Brief+Interviews+with+Hideous+Men","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8295705077eb48eb070c95bf59ee54368eba0d4d","infoHashBuffer":{"type":"Buffer","data":[130,149,112,80,119,235,72,235,7,12,149,191,89,238,84,54,142,186,13,77]},"announce":[],"urlList":[]}}