{"title":"The Ascent of Man (BBC2 Documentary) - MP4/M4V for smartphones","uid":5219825,"size":7060064960,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:82b2d1551aea2af7aab87351dfcbd90419c1e038&amp;dn=The+Ascent+of+Man+%28BBC2+Documentary%29+-+MP4%2FM4V+for+smartphones&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"ultrapope","files":-1,"time":1260892454,"description":"An American Film Festival Award winner, this 13 volume series attempts a massive survey of science, from flint tools to the theory of relativity. The series, a co-production of the BBC and Time-Life Films was made as a science counterpart to &quot;Civilization&quot;. It is given superb technical support, with two crews using innovative filming techniques, shooting in 27 countries. Dr. Jacob Bronowski makes for an unorthodox narrator, his non-scripted delivery ranging from hushed awe to trembling passion. He uses the crawling infant, the performing athlete, the development of the hunt and the discovery of fire to illustrate the most distinctive feature of man: imagination. His Scientific-Humanism is often spectacular, always provocative.\n\n\n\nEpisodes:\n\n1.\tLower than the Angels - Evolution of man from proto-ape to 400,000 years ago.\n\n2.\tThe Harvest of the Seasons - Early human migration, agriculture and the first settlements, war.\n\n3.\tThe Grain in the Stone - Tools, development of architecture and sculpture.\n\n4.\tThe Hidden Structure - Fire, metals and alchemy.\n\n5.\tMusic of the Spheres - The language of numbers.\n\n6.\tThe Starry Messenger - Galileo's universe\n\n7.\tThe Majestic Clockwork - Explores Kepler and Newton's laws.\n\n8.\tThe Drive for Power - The Industrial Revolution.\n\n9.\tThe Ladder of Creation - Darwin and Wallace's ideas on the origin of species.\n\n10.\tWorld within World - The story of the periodic table.\n\n11.\tKnowledge or Certainty - Physics and the clash of absolute knowledge, the oppressive state, and its misgivings realizing the result of its terrible outcome.\n\n12.\tGeneration upon Generation - Life, genetics, and the cloning of identical forms.\n\n13.\tThe Long Childhood - Bronowski's treatise on the commitment of man.\n\n14.\tInterview with sir David Attenborough\n","torrent":{"xt":"urn:btih:82b2d1551aea2af7aab87351dfcbd90419c1e038","amp;dn":"The+Ascent+of+Man+%28BBC2+Documentary%29+-+MP4%2FM4V+for+smartphones","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82b2d1551aea2af7aab87351dfcbd90419c1e038","infoHashBuffer":{"type":"Buffer","data":[130,178,209,85,26,234,42,247,170,184,115,81,223,203,217,4,25,193,224,56]},"announce":[],"urlList":[]}}