{"title":"The Soup Club Cookbook (gnv64)","uid":11680042,"size":29614281,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:82d66a9678424530d932dd384d65bab704ac3703&amp;dn=The+Soup+Club+Cookbook+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"gnv65","files":4,"time":1423039641,"description":"The Soup Club Cookbook - Feed Your Friends, Feed Your Family, Feed Yourself\nby Courtney Allison and Tina Carr\nClarkson Potter | January 2015 | ISBN-10: 0770434622 | ePUB | 208 pages | 28 mb\n\nThe Soup Club began when four friends (who, between them, have four husbands and ten hungry kids and several jobs) realized that they didn't actually have to cook at home every night to take pleasure in a home-cooked meal. They simply had to join forces and share meals, even if they weren't actually eating them together. Caroline, Courtney, Julie, and Tina happen to be neighbors, but a soup club is for anyone: colleagues, a group of workout buddies, a book club. All you need are a few people who simply want to have more home-cooked food in their lives.\n\nIn a soup club each person takes a turn making soup--and sometimes other dishes for sides or for when everyone needs a break from soup, so if a club has four people, in a month each person will have dinner delivered three times--a dish that can start as a full meal and stretch into more dinners or lunches or even morph into a sauce. Soup is forgiving, versatile, and perfect for sharing; it can be spiced to taste, topped elaborately or not at all, and dressed up or down. It travels well and reheats beautifully. The Soup Club Cookbook also has dozens of tips for cooking in quantity and for tailoring soup to individual tastes and needs. Here, too, are simple guidelines for starting your own soup club, anecdotes, and a few cautionary tales that will inspire anyone to share food and eat well.\n\nRecipes include quick and easies, classics, twist on favorites, and dozens of flavor-rich new crowd pleasers:\n* Carrot Coconut and Chicken Chili,\n* Senegalese Peanut Soup\n* Faux Ramen\n* Red Lentil Curry Soup\n* Potato Cheddar Soup\n* Sun Dried Tomato Soup\n* Jeweled Rice Salad\n* Cheddar Cornbread,\n* Summer Corn Hash\n* Soy Simmered Chicken Wings","torrent":{"xt":"urn:btih:82d66a9678424530d932dd384d65bab704ac3703","amp;dn":"The+Soup+Club+Cookbook+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82d66a9678424530d932dd384d65bab704ac3703","infoHashBuffer":{"type":"Buffer","data":[130,214,106,150,120,66,69,48,217,50,221,56,77,101,186,183,4,172,55,3]},"announce":[],"urlList":[]}}