{"title":"Hubris: Why Economists Failed to Predict the Crisis (2015)epub","uid":11900754,"size":719025,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:82eb913c25f0dc1b4757d65df66aed095a19f404&amp;dn=Hubris%3A+Why+Economists+Failed+to+Predict+the+Crisis+%282015%29epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"bookzilla","files":1,"time":1431302608,"description":"Hubris: Why Economists Failed to Predict the Crisis and How to Avoid the Next One\n\n\n The failure of economists to anticipate the global financial crisis and mitigate the impact of the ensuing recession has spurred a public outcry. Economists are under fire, but questions concerning exactly how to redeem the discipline remain unanswered. In this provocative book, renowned economist Meghnad Desai investigates the evolution of economics and maps its trajectory against the occurrence of major political events to provide a definitive answer.\n\n Desai underscores the contribution of hubris to economists' calamitous lack of foresight, and he makes a persuasive case for the profession to re-engage with the history of economic thought. He dismisses the notion that one over-arching paradigm can resolve all economic eventualities while urging that an array of already-available theories and approaches be considered anew for the insights they may provide toward preventing future economic catastrophes. With an accessible style and keen common sense, Desai offers a fresh perspective on some of the most important economic issues of our time","torrent":{"xt":"urn:btih:82eb913c25f0dc1b4757d65df66aed095a19f404","amp;dn":"Hubris%3A+Why+Economists+Failed+to+Predict+the+Crisis+%282015%29epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82eb913c25f0dc1b4757d65df66aed095a19f404","infoHashBuffer":{"type":"Buffer","data":[130,235,145,60,37,240,220,27,71,87,214,93,246,106,237,9,90,25,244,4]},"announce":[],"urlList":[]}}