{"title":"How to Stay Positive in Times of Uncertainty with Judith Orloff","uid":11892384,"size":144580222,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:83841123bdc6d9f6dc48d2b1eb1e45b584d95be0&amp;dn=How+to+Stay+Positive+in+Times+of+Uncertainty+with+Judith+Orloff&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"elessedilgirl","files":5,"time":1431028205,"description":"Lead a more empowered and joyful life!\n\nLearn to powerfully listen to your body's needs.\nMake sense of your life when it's most confusing.\nUse your body's subtle energies to heal pain, panic, depression and other symptoms.\n\nIn this uplifting workshop, psychiatrist Dr. Judith Orloff discusses the power of staying positive no matter what is happening in your life. She shares with you how to blend intuition and analytic thinking to overcome any obstacles. She also discusses how to nurture your sensitivity in an often-overwhelming world so that you are not drained by negative circumstances or people. You'll learn the role that spirituality plays in keeping a positive attitude and the freedom that comes from knowing that you are larger than any one emotion or any one event--that there is something greater at work that can support you, even when you feel alone. This workshop will bring great inspiration to everyone who wants to lead a more empowered and joyful life.\n\nJudith Orloff, M.D. is an intuition expert and board-certified psychiatrist with a private practice in Los Angeles. She is the author of the bestsellers Positive Energy, upon which this CD set is based, and Guide to Intuitive Healing and Second Sight. She is an Assistant Clinical Professor of Psychiatry at UCLA and an international workshop leader on the interrelationship of intuition, energy, and medicine.\n\nPart 1 - 1.00.11\nPart 2 - 1.10.54\nPart 3 - 1.04.44\nPart 4 - 0.44.58\n\nMP3 - 80 kbps - CBR\n\nSource: WebRip","torrent":{"xt":"urn:btih:83841123bdc6d9f6dc48d2b1eb1e45b584d95be0","amp;dn":"How+to+Stay+Positive+in+Times+of+Uncertainty+with+Judith+Orloff","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83841123bdc6d9f6dc48d2b1eb1e45b584d95be0","infoHashBuffer":{"type":"Buffer","data":[131,132,17,35,189,198,217,246,220,72,210,177,235,30,69,181,132,217,91,224]},"announce":[],"urlList":[]}}