{"title":"The Mammoth Book of the Best of Best New SF - Gardner Dozois","uid":11660221,"size":1093435,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:838e65729d1001461a9d1caab4a425ad6b6b549e&amp;dn=The+Mammoth+Book+of+the+Best+of+Best+New+SF+-+Gardner+Dozois&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1417987153,"description":"Hugo Award-winning editor Gardner Dozois' annual anthology has long been considered the standard by which other best-of-the-year SF collections are judged. After two decades' worth of superlative science fiction, Dozois now presents a retrospective compilation culling from the last 20 years. Here under one banner is some of the finest work by the genre's leading authors, with a star-studded list of contributors that features among others: Stephen Baxter, Greg Bear, William Gibson, Terry Bisson, Greg Egan, Ursula K. Le Guin, Robert Reed, Robert Silverberg, Bruce Sterling , Charles Stross, Michael Swanwick, Gene Wolfe. A number of the selections are now considered classics. Some notable stories include: 'Blood Music', Greg Bear's Hugo-winning exploration of nanotechnology. 'Bears Discover Fire', Terry Bisson's tongue-in-cheek consideration of future ursine evolution. 'The Left Hand of Darkness', Ursula K. Le Guin's coming-of-age SF tale. 'The Winter Market', in which William Gibson returns to the subject that made him a cultural icon, cyberpunk. With work spanning two decades, this is the most significant science fiction short story anthology published in years","torrent":{"xt":"urn:btih:838e65729d1001461a9d1caab4a425ad6b6b549e","amp;dn":"The+Mammoth+Book+of+the+Best+of+Best+New+SF+-+Gardner+Dozois","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"838e65729d1001461a9d1caab4a425ad6b6b549e","infoHashBuffer":{"type":"Buffer","data":[131,142,101,114,157,16,1,70,26,157,28,170,180,164,37,173,107,107,84,158]},"announce":[],"urlList":[]}}