{"title":"Olsen Twins Collection: 4 movies (1998-2000)","uid":5193530,"size":3108326500,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:83deaecfa7664c34cd744d72be7de2452b0734ff&amp;dn=Olsen+Twins+Collection%3A+4+movies+%281998-2000%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":6,"uploader":"ForAnAngel","files":5,"time":1259814840,"description":"4 movies:\nBillboard Dad.avi 1:28:55 778MB\nOur Lips Are Sealed.avi 1:30:01 724MB\nPassport to Paris.avi 1:27:19 764MB\nSwitching Goals.avi 1:23:55 671MB\n\nCodec:XVID\nResolution:564x420\nFrame rate:24 fps\nAudio bitrate:112kb/s\n\nPreviews:\ntrailers.avi 2:14 25.4MB\nCodec:DIV3\nResolution:720x480\nFrame rate:30\nAudio bitrate:64kb/s\n================================================================================\nBillboard Dad (1998)\nhttp://www.imdb.com/title/tt0167049/\n\nSet in Los Angeles, the plot revolves around 11 year old twins, Emily Tyler (Ashley), who enjoys surfing, and her sister Tess (Mary-Kate), a member of a high diving team, who try various schemes to get their widowed dad Max (Tom Amandes), a talented artist and sculptor, a girlfriend. After all their attempts end in failure, Tess and Emily decide to paint an advertisement on a giant billboard situated high above Sunset Boulevard. A lady named Brooke Anders answers the ad, and she and Max come to like each other and start dating. At first, Tess and Emily don't like Brooke's son Ryan, but when he helps foil an elaborate scheme by Max's business manager Nigel to break up the romantic relationship between Max and Brooke (Nigel thinks Max's work will suffer as a result), the girls eventually accept him.\n\nScreencap: http://img692.imageshack.us/img692/602/billboarddad.jpg\nTrailer: http://www.imdb.com/video/screenplay/vi2042233113/\n================================================================================\nSwitching Goals (1999)\nhttp://www.imdb.com/title/tt0217074/\n\nTwelve year old identical twin sisters Sam (Mary-Kate) and Emma (Ashley) Stanton both play soccer. Sam is a star athlete and a tomboy; however, the only sports her more stylish sister Emma enjoys are fashion and dating. When their father (Eric Lutes), one of the league's coaches, is pressured by his wife into picking Emma first for his team, another coach picks Sam. Soon after, the girls come up with a scheme to switch places in soccer so each can be on the team they prefer. As a result, Sam learns about letting others share the spotlight and Emma becomes a better player.\n\nScreencap: http://img687.imageshack.us/img687/9208/switchinggoals.jpg\nTrailer: http://www.imdb.com/video/screenplay/vi412418329/\n================================================================================\nPassport to Paris (1999)\nhttp://www.imdb.com/title/tt0202521/\n\nDuring their Spring Break school vacation, thirteen year old twin sisters Melanie (Mary-Kate) and Allison Porter (Ashley), reluctantly travel to Paris to visit their Grandpa Edward, the U.S. Ambassador to France. Expecting a great time with their grandfather, they instead end up with his no-nonsense assistant, Jeremy Bluff, chaperoning them. While there, they befriend Brigitte, a beautiful French fashion model, and fall for two charming French boys named Jean and Michel. The girls find various ways to ditch Jeremy, so they can spend time cruising around the city on mopeds with the boys.\n\nScreencap: http://img695.imageshack.us/img695/2824/passporttoparis.jpg\nTrailer: http://www.imdb.com/video/screenplay/vi3953066265/\n================================================================================\nOur Lips Are Sealed (2000)\nhttp://www.imdb.com/title/tt0270560/\n\nThe family of twin sisters Maddie (Mary-Kate) and Abby (Ashley) Parker are placed in the FBI's Witness Protection Program after the girls witness a robbery at the local museum, in which the priceless Kneel Diamond is stolen. Unfortunately, the fourteen year old sisters have a problem of being blabbermouths; as a result, everywhere the Parkers are sent to live, the girls inadvertently end up revealing their witness status. A crime family led by a man by the name of Emil Hatchew (from the little-known nation of Yurugli) will do anything to get his hands on the diamond, which the thieves slipped into Abby's shoulder-bag during their escape from the crime scene. After the family has been moved to every geographic location around the world possible, with the single exception of Australia, the FBI sends them to live in Sydney.\n\nScreencap: http://img692.imageshack.us/img692/4004/ourlipsaresealed.jpg\nTrailer: http://www.imdb.com/video/screenplay/vi983236889/","torrent":{"xt":"urn:btih:83deaecfa7664c34cd744d72be7de2452b0734ff","amp;dn":"Olsen+Twins+Collection%3A+4+movies+%281998-2000%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83deaecfa7664c34cd744d72be7de2452b0734ff","infoHashBuffer":{"type":"Buffer","data":[131,222,174,207,167,102,76,52,205,116,77,114,190,125,226,69,43,7,52,255]},"announce":[],"urlList":[]}}