{"title":"Dario Fo - Nobel Prize in Literature, 1997 (3 books)","uid":13850698,"size":12875378,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:842219bde248a9407b97ac3563c1da0ec2b46c42&amp;dn=Dario+Fo+-+Nobel+Prize+in+Literature%2C+1997+%283+books%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"workerbee","files":6,"time":1457987947,"description":"\nDARIO FO (b. 1926) is an Italian avant-garde playwright, author, manager-director, and actor-mime.  In awarding Fo the 1997 Nobel Prize in Literature, the Swedish Academy praised him as a writer &quot;who emulates the jesters of the Middle Ages in scourging authority and upholding the dignity of the downtrodden.&quot;\r\n\r\nFo is one of the most widely performed contemporary playwrights in world theatre whose work has been translated into 30 languages.  A caricaturist with a flair for social agitation, Fo and his wife developed an agitprop theatre of politics, often blasphemous and scatological, but rooted in the tradition of commedia dell'arte and blended with what Fo called &quot;unofficial leftism&quot;.  His work has often faced government censure.\r\n\r\nACCIDENTAL DEATH OF AN ANARCHIST (1970), described by the playwright as &quot;a grotesque farce about a tragic farce&quot;, is Fo's most internationally recognised play and considered a classic of twentieth-century theatre.  It is a farce based on the real-life events surrounding Italian railwayman and anarchist Giuseppe Pinelli, who fell -- or was thrown -- to his death from the fourth floor window of a Milan police station in 1969.\r\n\r\nMY FIRST SEVEN YEARS (2005) is Fo's fantastic, enchanting memoir of his youth spent in Northern Italy on the shores of Lago Maggiore.  Of his teenage years, Fo recounts the struggles of the Fascists and Partisans, the years of World War II, and his own tragicomic experience trying to desert the Fascist army.  In a series of colorful vignettes, Fo draws us into a remarkable early life filled with characters and anecdotes that would become the inspiration for his own creative genius.\r\n\r\nTHE POPE'S DAUGHTER (2014) is a novel about Lucrezia Borgia, the daughter of a notorious pope and one of the most vilified figures in modern history.  Although the Borgias are unrivalled for the range and magnitude of their political machinations and opportunism, Fo reveals Lucrezia's humanity, her passion for life, her compassion for others, and her skill at navigating around her family's evildoings.  Fo's brilliance rests in his rendering their story as a shocking mirror image of the uses and abuses of power in our own time.\r\n\r\n\r\nThe following books are in PDF or ePUB format as indicated:\r\n\r\n* Accidental Death of an Anarchist [excerpted from Dario Fo: Plays One] (Methuen, 1988).  Translated by Ed Emery. -- PDF\r\n\r\n* Against Jesters Who Defame and Insult: The Nobel Prize Lecture (Nobel Foundation, 1997).  Translated by Paul Claesson. -- PDF\r\n\r\n* My First Seven Years (Plus a Few More): A Memoir (St Martins, 2014).  Translated by Joseph Farrell. -- ePUB\r\n\r\n* The Pope's Daughter (Europa Editions, 2015).  Translated by Anthony Shugaar. -- ePUB\r\n\r\n_____________________________________________________________________________\r\n\r\n\r\nCONTACT ME: You can reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\r\n                         \nhttps://pirates-forum.org/User-workerbee  \r\n\r\nPLEASE HELP TO SEED!  If you like these books and want others to have access to them, please help to seed for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:842219bde248a9407b97ac3563c1da0ec2b46c42","amp;dn":"Dario+Fo+-+Nobel+Prize+in+Literature%2C+1997+%283+books%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"842219bde248a9407b97ac3563c1da0ec2b46c42","infoHashBuffer":{"type":"Buffer","data":[132,34,25,189,226,72,169,64,123,151,172,53,99,193,218,14,194,180,108,66]},"announce":[],"urlList":[]}}