{"title":"Louise Hay - Creating Your Own Health","uid":4362976,"size":19299329,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8465d4bf1da44f47e4e5606ad96572c35be6e608&amp;dn=Louise+Hay+-+Creating+Your+Own+Health&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"praeator","files":4,"time":1219764873,"description":"Creating Your Own Health\n\nBook Description\nOn this helpful recording, Louise Hay provides a powerful psychological tool for healing oneself. Inside, her explanation of the power of memory and emotion in the healing process; she talks about her own life, how she was abused as a child and how she overcame this trauma through the application of understanding and forgiveness. It also discusses the principles of personal transformation. It also contains a beautiful healing meditation that includes sections on how to forgive oneself and others, how to let go of negative thoughts and how to become the optimistic, joyful and created person that we were all meant to be. Hay has a powerful reassuring voice and her words exude confidence, insight and optimism. I highly recommend this tape to all who need psychological support in physical or mental healing. In my experience it has been most effective. Also listen to her Meditations For Personal Healing, a series of meditations that covers all the important aspects of life and Self-Esteem: Motivational Affirmations For Building Confidence and Recognizing Self-Worth\n\nSynopsis\nThis contains a series of positive affirmations created and narrated by Louise L. Hay. Affirmations are like seeds. It takes time for them to germinate, take root, and grow. Life- changing and soul satisfying benefits are possible by using this tape with determination and consistency. We recommend that you listen to this recording twice a day for at least 30 days. You can easily do this while you relax, work, do your chores, or sleep.\n\n\nAbout the Author\nLouise L. Hay is a lecturer and teacher, founder of Hay House Publishing and the bestselling author of 27 books. Her books have been translated into 25 different languages and are available in 33 countries worldwide. Since beginning her career as a Science of Mind minister in 1981, she has assisted thousands of people in discovering and using the full potential of their own creative powers for personal growth and self-healing.","torrent":{"xt":"urn:btih:8465d4bf1da44f47e4e5606ad96572c35be6e608","amp;dn":"Louise+Hay+-+Creating+Your+Own+Health","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8465d4bf1da44f47e4e5606ad96572c35be6e608","infoHashBuffer":{"type":"Buffer","data":[132,101,212,191,29,164,79,71,228,229,96,106,217,101,114,195,91,230,230,8]},"announce":[],"urlList":[]}}