{"title":"Business Process Management: Concepts, Languages, Architectures,","uid":9731612,"size":9229748,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8465f7d947fa957dd7f315d22c96b2989c1ec7f9&amp;dn=Business+Process+Management%3A+Concepts%2C+Languages%2C+Architectures%2C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"xXGalaxyXx","files":-1,"time":1394392241,"description":"English | 2012 | 400 pages | PDF | 8.80 Mb\n\nBusiness process management is usually treated from two different perspectives: business administration and computer science. While business administration professionals tend to consider information technology as a subordinate aspect in business process management for experts to handle, by contrast computer science professionals often consider business goals and organizational regulations as terms that do not deserve much thought but require the appropriate level of abstraction. Matthias Weske argues that all communities involved need to have a common understanding of the different aspects of business process management. To this end, he details the complete business process lifecycle from the modeling phase to process enactment and improvement, taking into account all different stakeholders involved. After starting with a presentation of general foundations and abstraction models, he explains concepts like process orchestrations and choreographies, as well as process properties and data dependencies. Finally, he presents both traditional and advanced business process management architectures, covering, for example, workflow management systems, service-oriented architectures, and data-driven approaches. In addition, he shows how standards like WfMC, SOAP, WSDL, and BPEL fit into the picture. This textbook is ideally suited for classes on business process management, information systems architecture, and workflow management. This 2nd edition contains major updates on BPMN Version 2 process orchestration and process choreographies, and the chapter on BPM methodologies has been completely rewritten. The accompanying website www.bpm-book contains further information and additional teaching material.","torrent":{"xt":"urn:btih:8465f7d947fa957dd7f315d22c96b2989c1ec7f9","amp;dn":"Business+Process+Management%3A+Concepts%2C+Languages%2C+Architectures%2C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8465f7d947fa957dd7f315d22c96b2989c1ec7f9","infoHashBuffer":{"type":"Buffer","data":[132,101,247,217,71,250,149,125,215,243,21,210,44,150,178,152,156,30,199,249]},"announce":[],"urlList":[]}}