{"title":"Roller Coaster Tycoon 3 with both Wild and Soaked expansion pack","uid":4569735,"size":3104883406,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:84670f3528501859061acf1b409e59ea0c8cdf50&amp;dn=Roller+Coaster+Tycoon+3+with+both+Wild+and+Soaked+expansion+pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"thesickguy","files":-1,"time":1229014668,"description":"The Best of all 3 RCT games that you can have without needing any CD and it includes both expansion packs\n\nfor those who don&amp;#039;t really know, Roller Coaster Tycoon 3 is a strategy and simulation game in which players manage amusement parks, adding and removing rides, food stalls, paths, scenery and adjusting prices to fufill set goals and ensure the satisfaction of park visitors, known as &quot;peeps&quot;.\n\nRoller Coaster Tycoon 3 includes new gameplay features such as the CoasterCam, which allows players to &quot;ride&quot; roller coasters and other rides, and the MixMaster, which allows the player to coordinate firework shows and time them to in-game music. A day/night cycle changes the demographics of the park&amp;#039;s peeps; rides at night appeal to teenagers, while the daytime attracts families with children. Parks now have opening and closing times, and the time of day is displayed. Scenery is divided into themes to customize parks, with western-, spooky-, science fiction- and adventure-themed pieces.[1] Another feature is the ability to import coasters from previous games in the series into RCT3.\n\nThe game uses fully 3D graphics instead of the isometric viewpoint of the previous games; players can rotate and zoom the view of the park to any degree.\n\nHope you enjoy and Please Seed.","torrent":{"xt":"urn:btih:84670f3528501859061acf1b409e59ea0c8cdf50","amp;dn":"Roller+Coaster+Tycoon+3+with+both+Wild+and+Soaked+expansion+pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84670f3528501859061acf1b409e59ea0c8cdf50","infoHashBuffer":{"type":"Buffer","data":[132,103,15,53,40,80,24,89,6,26,207,27,64,158,89,234,12,140,223,80]},"announce":[],"urlList":[]}}