{"title":"The Edge of Physics (gnv64)","uid":14683022,"size":30219015,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:85150ebbf9ad9e38b87918b60f21efb85cba226e&amp;dn=The+Edge+of+Physics+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"gnv65","files":4,"time":1464106848,"description":"The Edge of Physics - A Journey to Earth's Extremes to Unlock the Secrets of the Universe\r\nby Anil Ananthaswamy\r\nMariner Books | February 2010 | ISBN 978-0-618-88468-1 | PDF | 322 pages | 28.8 mb\r\n\r\nIn this deeply original book, science writer Anil Ananthaswamy sets out in search of the telescopes and detectors that promise to answer the biggest questions in modern cosmology. Why is the universe expanding at an ever faster rate? What is the nature of the &quot;dark matter&quot; that makes up almost a quarter of the universe? Why does the universe appear fine-tuned for life? Are there others besides our own?\r\nAnanthaswamy soon finds himself at the ends of the earth—in remote and sometimes dangerous places. Take the Atacama Desert in the Chilean Andes, one of the coldest, driest places on the planet, where not even a blade of grass can survive. Its spectacularly clear skies and dry atmosphere allow astronomers to gather brilliant images of galaxies billions of light-years away. Ananthaswamy takes us inside the European Southern Observatory’s Very Large Telescope on Mount Paranal, where four massive domes open to the sky each night &quot;like dragons waking up.&quot;\r\nHe also takes us deep inside an abandoned iron mine in Minnesota, where half-mile-thick rock shields physicists as they hunt for elusive dark matter particles. And to the East Antarctic Ice Sheet, where engineers are drilling 1.5 miles into the clearest ice on the planet. They’re building the world’s largest neutrino detector, which could finally help reconcile quantum physics with Einstein’s theory of general relativity.\r\nThe stories of the people who work at these and other dramatic research sites—from Lake Baikal in Siberia to the Indian Astronomical Observatory in the Himalayas to the subterranean lair of the Large Hadron Collider—make for a compelling new portrait of the universe and our quest to understand it. An atmospheric, engaging, and illuminating read, The Edge of Physics depicts science as a human process, bringing cosmology back down to earth in the most vivid terms\r\n\r\nAbout the Author \nhttps://s33.postimg.org/e517ofevj/Anil_Ananthaswamy.jpg\r\nANIL ANANTHASWAMY is former deputy news editor and current consultant for New Scientist. He is a guest editor at UC Santa Cruz's science-writing program and teaches an annual science journalism workshop at the National Centre for Biological Sciences in Bangalore, India. He is a freelance feature editor for the Proceedings of the National Academy of Science's &quot;Front Matter&quot; and has written for National Geographic News, Discover, and Matter. He has been a columnist for PBS NOVA's The Nature of Reality blog. He won the UK Institute of Physics' Physics Journalism award and the British Association of Science Writers' award for Best Investigative Journalism. His first book, The Edge of Physics, was voted book of the year in 2010 by Physics World.\r\n\r\nCONTENTS\r\nList of Illustrations • viii\r\nAuthor's Note • ix\r\nPrologue· 1\r\n1 Monks and Astronomers • 9\r\n2 The Experiment That Detects Nothing· 31\r\n3 Little Neutral Ones • 56\r\n4 The Paranal Light Quartet· 81\r\n5 Fire, Rock, and Ice • 109\r\n6 Three Thousand Eyes in the Karoo • 135\r\n7 Antimatter over Antarctica • 168\r\n8 Einstein Meets Quantum Physics at the South Pole· 194\r\n9 The Heart of the Matter • 222\r\n10 Whispers from Other Universes • 248\r\nEpilogue • 273\r\nAppendix 1: The Standard Model of Particle Physics • 283\r\nAppendix II: From the Big Bang to Now: The Standard Model\r\nof Cosmology • 285\r\nNotes· 287\r\nBibliography • 293\r\nAcknowledgments • 298\r\nIndex • 301\r\n \nhttps://s33.postimg.org/aj4l36n8v/The_Edge_of_Physics.jpg","torrent":{"xt":"urn:btih:85150ebbf9ad9e38b87918b60f21efb85cba226e","amp;dn":"The+Edge+of+Physics+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85150ebbf9ad9e38b87918b60f21efb85cba226e","infoHashBuffer":{"type":"Buffer","data":[133,21,14,187,249,173,158,56,184,121,24,182,15,33,239,184,92,186,34,110]},"announce":[],"urlList":[]}}