{"title":"Romex PrimoCache 1.0.1 Desktop Edition + Trial Reset","uid":11665794,"size":7232424,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8566837163de6aff407a1cef1517848abc7abfac&amp;dn=Romex+PrimoCache+1.0.1+Desktop+Edition+%2B+Trial+Reset&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"xderx","files":1,"time":1418055104,"description":"PrimoCache (formerly FancyCache) is a fantastic piece of software that intelligently caches parts of files which will give you a large performance boost. The more ram you have to spare the more you can cache.\nYou can also create a dedicated level2 cache partition on your SSD to let it intelligently place your most used bits of data onto the drive. No more fumbling around swapping things back forth from your hdd to ssd, this will do it for you with no wasted space with things you don't use. Better yet it caches bits of data you use, not the entire file. 10gb file but you only use 100mb of it often? it'll only cache that much! No wasted space.\nIt is also intellgent, it will hold onto cache that you use often, while discarding things you use less/rarely, so your most used things stay at their fastest, improving overall performance greatly.\nIt can also boost your write speed dramaticly if you enable deferred write+read/write cache strategy, it will write directly to ram, and then trim unneeded blocks from it, reducing how much wear your SSD will get and bypassing the bottleneck of a regular drive.\n\nCheck romex's website on how to set it up, but it's pretty easy. Basically just click the green plus button, choose what drives will use this cache, choose how much ram this cache will use, and then the block size. The lower the block size the faster the performance, but the higher the ram overhead cost of using the cache (bottom left of window). 16kb is the perfect middle ground imo.\n\nI recommend atleast a 2GB cache, but the more the better. Don't forget that windows itself and your games/programs needs some ram! You don't wanna max out your ram and start using the dreaded pagefile, it'll grind your system to a halt.\n\nCheck the readme file for how to do the trial reset.\nI've included a freeware copy of Registrar to delete the required registry keys to do the trial reset, as when using regedit the keys wouldn't let me delete them.\n\n\nRuns on both 32 and 64 bit versions of windows. Enjoy!\n\n-------=======================-------------------\n\nOfficial description:\n\n\nPrimoCache Overview\n\nPrimoCache is a supplementary software caching scheme that cooperates with physical memory, solid-state drives (SSDs) and flash drives to provide data caching for local physical disks. It transparently stores disk data into fast cache devices such as physical memory, so that future read requests for those data will be served directly from the cache and be faster. Thus access time will be reduced, showing a great improvement in overall system performance.\n\nPrimoCache implements a two-level caching architecture consisting of level-1 cache and level-2 cache. Level-1 cache, also called primary cache, is composed of physical memory. Level-2 cache is a secondary cache which typically resides on a solid-state drive, a flash drive or other fast persistent storage device. Obviously level-1 cache runs much faster than level-2 cache, although it is usually much smaller. PrimoCache allows a single level cache configuration using either level-1 cache or level-2 cache, as well as a two-level cache configuration using both levels of cache.\n\nUnlike level-1 cache which cannot keep cache contents on reboot, level-2 cache is able to retain its cache contents across computer reboots because of the persistent nature of storage devices. This avoids fetching often-accessed data again from slow disks each time computer boots up. Thus level-2 cache will remarkably reduce boot-up time and speed up applications for those computers which install mechanical hard disks.\n\nPrimoCache also supports write-deferred caching mode, which executes write requests on the cache first and synchronizes data from the cache to the disk after custom delays. Therefore write requests can be responded and completed very fast, greatly improving the disk write performance.\n\nIn addition, PrimoCache implements the Unified Invisible Memory Management Interface (UIMMI), which can use Invisible Memory as level-1 cache. Invisible Memory, also known as Unmanaged Memory, usually exists on 32-bit desktop Windows where 4GB or more physical memory is installed. This feature helps to overcome the Windows limits on amount of system memory and fully utilize all installed physical memory.\n\nPrimoCache fulfills an intelligent cache replacement algorithm which optimally determines cache blocks needed to be discarded to make room for new data when cache space is full. This cache algorithm combines two normal algorithms which are Least Frequently Used (LFU) and Least Recently Used (LRU), and provides a better cache hit ratio. It is self-tuning and requires no user-specified parameters.\n\nPrimoCache allows multiple cache strategies and flexible configurations. It is implemented in Windows kernel level and is transparent to other applications. Therefore no application or system changes are required for this caching solution. With PrimoCache, you can easily setup caches for local disks and speed up your computers.\n\n\n\n\nMain Features\nSupports physical memory, solid-state drives and flash drives as cache storage. \nImplements a two-level caching architecture. \nSupports persistent level-2 caching. \nSupports Write-Through and Write-Deferred caching modes. \nSupports TRIM command. \nSupports OS Invisible Memory. \nImplements an intelligent and self-tuning cache replacement algorithm. \nSupports caching strategies: Read/Write Caching, Read-Only Caching and Write-Only Caching. \nSupports performance statistics and monitor. \nSupports caching for multiple volumes \nSupports caching for volumes with proprietary file system. \nSupports caching for volumes on basic and dynamic disks. \nSupports plug and play. \nSupports command-line interface. \n\n\nWhy PrimoCache?\nWhy do we need PrimoCache since Windows has already implemented a file-system level cache?\n\nPrimoCache is a block-level cache program which caches data on a logical block basis (offsets within a disk), while windows cache is a file-system level program which caches on a virtual block basis (offsets within a file). Each has strengths and weaknesses, and PrimoCache can be a good supplement to Windows cache. \nSome applications can bypass Windows cache but cannot bypass PrimoCache because PrimoCache runs at a lower level in Windows. \nWindows caches all data, while PrimoCache can cache on behalf of a specified volume in which users are interested. Given same size of system memory, the latter has a higher hit-rate. \nPrimoCache supports persistent SSD caching for mechanical hard disks, improving system boot-up time and applications loading time. Windows cache cannot. \nPrimoCache can customize write-deferred mode, while Windows cache cannot. \nPrimoCache can make use of Invisible Memory on 32-bit Windows as cache, overcoming the Windows limits on amount of system memory","torrent":{"xt":"urn:btih:8566837163de6aff407a1cef1517848abc7abfac","amp;dn":"Romex+PrimoCache+1.0.1+Desktop+Edition+%2B+Trial+Reset","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8566837163de6aff407a1cef1517848abc7abfac","infoHashBuffer":{"type":"Buffer","data":[133,102,131,113,99,222,106,255,64,122,28,239,21,23,132,138,188,122,191,172]},"announce":[],"urlList":[]}}