{"title":"Rocco The Impaler (Evil Angel) XXX WEB-DL NEW 2016 (Split Scenes","uid":15759431,"size":3702437828,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:85883204b49876541c33ee392f1d5a6ebdd3374a&amp;dn=Rocco+The+Impaler+%28Evil+Angel%29+XXX+WEB-DL+NEW+2016+%28Split+Scenes&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":8,"uploader":"xxxlavalxxx","files":6,"time":1473093921,"description":"Category\tCompilation, Fetish, Feature, Foreign, Vampire\r\n\r\nDirector\tJohn Stagliano\r\nStarring\tStoya, Skin Diamond, Chastity Lynn, Lea Lexis, Brooklyn Lee, Ashley Fires, Roxy Raye, Samantha Bentley, Ivana Sugar, Mira Sunset, James Deen, Rocco Siffredi, Rain Degrey, Zorah White, Wolf Hudson, Omar Galanti\r\n\r\nCollaborating across their careers, director John Stagliano and porn icon Rocco Siffredi have contributed mightily to each other's Hall Of Fame acclamation. 'Rocco The Impaler' compiles the fiercest action from the recent 'Voracious' and 'Voracious Season Two' projects, in which Rocco delivered hardcore fetish carnality motivated by John's cinematic vampire intrigue. As ferocious vampire clan leader Vlad, Rocco subjects redhead Brooklyn Lee to an interrogation face fuck. Finding a vampire hunter (British beauty Samantha Bentley) trussed up in chains, Rocco and Mira Sunset harshly manhandle her with biting, slapping and spanking; both girls get all holes reamed. Fair-skinned Stoya and Rocco delight in fetish explorations, power fucking, rim jobs and breath control by cock, foot and tongue. Bad girl Chastity Lynn escapes a convent-like halfway house for a spit-slick blow job and a choking fuck under a full moon. Rocco sodomizes her to gaping and she sucks cock ass-to-mouth. Three superhuman encounters of throat fucking, asshole mastery and messy spit play climax this epic collection: Skin Diamond and Roxy Raye blaspheme with glowing crucifix dildos - Roxy's flexible rectum takes two at once! Rocco pushes Roxy, Ashley Fires and corrupted Mother Superior Rain DeGrey to their submissive limits. But lithe Lea Lexis gets the ultimate suck-off.\r\n \nhttp://imgdone.com/viewer.php?file=67440093354926546448.jpg\r\n \nhttp://imgdone.com/viewer.php?file=37589301521280167402.jpg","torrent":{"xt":"urn:btih:85883204b49876541c33ee392f1d5a6ebdd3374a","amp;dn":"Rocco+The+Impaler+%28Evil+Angel%29+XXX+WEB-DL+NEW+2016+%28Split+Scenes","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85883204b49876541c33ee392f1d5a6ebdd3374a","infoHashBuffer":{"type":"Buffer","data":[133,136,50,4,180,152,118,84,28,51,238,57,47,29,90,110,189,211,55,74]},"announce":[],"urlList":[]}}