{"title":"Exploited College Girls - CLAIRE - Squirting High School Senior","uid":8627778,"size":1225236122,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:8595d243238d52f2ea0483817f05cdd007b6b765&amp;dn=Exploited+College+Girls+-+CLAIRE+-+Squirting+High+School+Senior&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":2,"uploader":"beta2008x","files":1,"time":1372554345,"description":" &lt;a href=&quot;http://imgboxxx.com/viewer.php?file=fyhfb_preview_claire_large.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://imgboxxx.com/viewer.php?file=fyhfb_preview_claire_large.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=sgkmp_ecg_claire2013_s.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=sgkmp_ecg_claire2013_s.jpg&lt;/a&gt;\n\n\nYou'll probably notice that on Claire's titles it doesn't list a university. That's because Claire is a senior in high school, and like all 18 year olds is great at making decisions and planning ahead, in this case choosing her first grown up job as a co-star in a little internet porn. Fortunately for us it looks like Claire got an A in Sex Ed. If there is a better example of the word 'spinner' I don't think I've ever seen it. Claire is probably 90 pounds soaking wet (and trust me, she gets soaking wet in today's shoot - Claire is a squirter!) with some little A cups that fit her frame perfectly and a really great little body, she's very hot. The reason she's joining me today is the one I love the most - she just loves sex. The fact is, the best updates I shoot for ECG are always girls who forget about performing and just lose themselves in the session. Claire is definitely one of those. When I get her settled in makeup and a cute outfit, she gives us a little insight into the sex life of an 18 year old. Aside from the endless giggling it's actually surprisingly wild for a girl who was a virgin as recently as the last Breaking Bad season. We'll find out before this session is over that Claire is full of surprises. The first one is when she hops up to strip: her pussy is so wet that she's left a wet spot in her panties and on the bed. I have her grab her legs and spread for me and sure enough, her pussy is soaked. She mentioned that she loves G-spot stimulation and she was definitely not lying. I slip a finger in her and she lights up, within a minute or two she's already orgasming and before long she busts out 2-3 more. I grab a toy and her enthusiasm for it is just off the charts. I'd say she's as giddy as a schoolgirl...but...yeah. Between the toy, the pocket vibe, my fingers and some anal beads (!), Claire orgasms at least 4 or 5 times. That's also when she squirts for the first time. The next surprise is when I have her drop to her knees to suck my cock. She just goes crazy for it. Between licks and sucks she moans, &quot;Oooh, I love this cock.&quot; Wow, what a girl. After a fantastic BJ and some asslicking, she lets me fuck her in every possible position and in every one of them she orgasms at least once. I even get a chance to put her ballet skills to use by fucking her standing up from the side, yet another ECG first. She shows me how I can make her squirt and sure enough, it works. Look closely and you'll see Claire's teen pussy shoot out girl cum again and again. Before I splash Claire with her first facial we try to figure out how many times she came during our session, she says ten, but after re-watching the tape I counted 12 for sure, and possibly as many as 14. I have a huge load built up from fucking this prima ballerina and when I unload on her face she's smiling and giggling the whole time. I don't know if I've shot a girl this enthusiastic about every second of the shoot, ever. As you know I almost NEVER shoot the same girl twice, but if you liked Claire...stay tuned for more. ","torrent":{"xt":"urn:btih:8595d243238d52f2ea0483817f05cdd007b6b765","amp;dn":"Exploited+College+Girls+-+CLAIRE+-+Squirting+High+School+Senior","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8595d243238d52f2ea0483817f05cdd007b6b765","infoHashBuffer":{"type":"Buffer","data":[133,149,210,67,35,141,82,242,234,4,131,129,127,5,205,208,7,182,183,101]},"announce":[],"urlList":[]}}