{"title":"SOHN - Tremors (2014) [FLAC]","uid":9973531,"size":238805921,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:85b826fd628e4321d547950b606e90b8fbaa8322&amp;dn=SOHN+-+Tremors+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":2,"uploader":"politux","files":-1,"time":1397657730,"description":"\n  SOHN - Tremors (2014) [FLAC]\n\n  Genre: Electronic, Pop/Rock\n  Styles: Experimental, Soul, R&amp;B\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bitrate: ~ 900 kbps\n  Bit Depth: 16\n  Sample Rate: 44.1 kHz\n \n  01 Tempest \n  02 The Wheel \n  03 Artifice\n  04 Bloodflows \n  05 Ransom Notes \n  06 Paralysed\n  07 Fool \n  08 Lights \n  09 Veto \n  10 Lessons \n  11 Tremors \n\n  London-bred producer Sohn first emerged in 2012 with his immaculately composed track &quot;The Wheel,&quot; a song that glided effortlessly along on clouds of vocal samples, marrying daydreamy bliss with utter exhaustion as it patiently wandered its emotional arc. Debut album Tremors offers up track after track of similarly considered and meticulous sounds, capturing lonely and frustrated feelings that are often wrapped in, and ultimately redeemed by, gorgeous electronic backdrops. &quot;The Wheel&quot; shows up here as a kind of loose template, with lots of the album's songs built on a minimal foundation of processed vocal samples and raw bass synth. These foundations are often overlayed with more glistening sound elements like the fluttering bell and acoustic guitar sounds of &quot;Ransom Notes&quot; that compete with a sea of muted vocal delays. \n\n  The beats here range from the booming percussion-heavy lope of funkier track &quot;Artifice&quot; to more glacial and understated R&amp;B hi-hat clicks on &quot;Veto,&quot; which recalls the indie take on quiet storm slow jams perfected by Sohn's contemporaries Rhye and James Blake. The vocals, often pained to the point of despair, will remind many listeners of Blake's style, though Sohn veers from Blake's quavering falsetto, opting for an earthier, less delicate delivery. While there are undeniable similarities between Tremors and albums by Blake, Jamie Woon, and other producers from the soul chapter of dubstep's evolution, Sohn stands out based on the total opulence of almost every track here. The feeling of complete immersion in a particular feeling is deeply palpable, with every song smacking of loss, searching, and helplessness. In the end, what keeps Tremors from drowning in its own paralyzed sadness is the feeling that Sohn himself has defeated these dark feelings through the painstaking process of crafting an album so beautiful.","torrent":{"xt":"urn:btih:85b826fd628e4321d547950b606e90b8fbaa8322","amp;dn":"SOHN+-+Tremors+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85b826fd628e4321d547950b606e90b8fbaa8322","infoHashBuffer":{"type":"Buffer","data":[133,184,38,253,98,142,67,33,213,71,149,11,96,110,144,184,251,170,131,34]},"announce":[],"urlList":[]}}