{"title":"FSX PMDG BAE jetstream 4100","uid":5194415,"size":153611293,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:860a22282a0a4219594fed39121d57096f423888&amp;dn=FSX+PMDG+BAE+jetstream+4100&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"Blablounet","files":1,"time":1259861392,"description":"Product Features\n Exterior Model\nThe external model has been accurately modeled to the smallest details, and painted using high resolution photoreal textures..\nExternal objects can be shown/hidden using the Ramp Manager, adding to the realism and immersion - Baggage Cart, Ground Power Unit (GPU), Cones, Covers, Stanchion with rope, Baggage (in baggage compartments) and passengers (matches the in-cockpit load sheet).\nAircraft Animations - The animated parts on the J41 were carefully researched and faithfully reproduced to match their operation with the actual aircraft. The J41 sports realistically animated gear, gear doors, flaps, spoilers, oil cooler flaps, passenger and cargo doors, AOA indicators and flight deck crew.\n Virtual Cockpit\nFully Interactive, Dynamic Virtual Cockpit - Designed and animated using the same proprietary techniques developed for previous PMDG award-winning product lines, Virtual Cockpit users will truly enjoy the sensation of &quot;being there&quot; when flying this simulator from the fully interactive and animated 3D virtual cockpit.\nStunning, high definition photoreal textures in the VC truly brings this cockpit to life, and makes the J41 look 100% authentic compared to its real world counterpart.\nSelf-shadowing is supported in DX-10 Preview mode.\nExternal Objects - External objects, when activated via the Ramp Manager, are visible from the Virtual Cockpit. The wings, props, stanchion and baggage cart can be seen from the flight deck.\n Engine Model\nUnique advanced mathematical model of Garret turboprop engine including sophisticated features such as completely custom start up sequence, Automatic Power Reserve (APR) , Torque Temperature Limiting (TTL) and flight idle control. Fire and failure probability model (optional) as a result of high engine EGT.\n Aircraft Systems\nThe J41's systems were reproduced to match the operation of those in the real aircraft, and include:\nPressurization\nElectrical\nFuel\nFire Protection\nHydraulics\nIce Protection\nAvionics\n\ngood download ;)","torrent":{"xt":"urn:btih:860a22282a0a4219594fed39121d57096f423888","amp;dn":"FSX+PMDG+BAE+jetstream+4100","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"860a22282a0a4219594fed39121d57096f423888","infoHashBuffer":{"type":"Buffer","data":[134,10,34,40,42,10,66,25,89,79,237,57,18,29,87,9,111,66,56,136]},"announce":[],"urlList":[]}}