{"title":"Cambridge IGCSE &amp; International Certificate French (gnv64)","uid":15618474,"size":49346284,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:861d49fd05af5dc8454613cf52b4cfe16d22d942&amp;dn=Cambridge+IGCSE+%26amp%3B+International+Certificate+French+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"gnv65","files":4,"time":1471859407,"description":"Cambridge IGCSE &amp; International Certificate French Foreign Language (French Edition)\r\nby Yvette Grime, Jayn Witt\r\nHodder Education | September 2013 | ISBN-10: 1444180959 | PDF | 250 Pages | 47 mb\r\n\r\nRecommended by Cambridge International Examinations. A grammar-led approach with extensive exam preparation to help you develop independent, culturally aware students of French, ready for their exam. - Develops students' ability to use French effectively with up-to-date content following a clear sequencing of topics designed specifically for teaching French at this level - Stretches and challenges students to achieve their best grades and ensures the progression required for further study at A-level or equivalent - Provides insight and encourages the cultural awareness at the heart of this qualification, with topics on Francophone culture integrated throughout The book is written to the latest Cambridge International Examinations syllabus by experienced teachers with an extensive use of French to reflect the style of the exams. It is designed to develop spontaneous, confident linguists who are able to progress to further study of French. \r\n\r\nAbout the Author\r\nYvette Grime has taught extensively at GCSE. She now combines her teaching with working part time as a freelance translator. \r\nJayn Witt was Head of Modern Foreign Languages in an 11-16 comprehensive school for over 25 years. Series editor: Mike Thacker is a former Director of the Language Centre at the University of Surrey. He is the author of several textbooks for the teaching of Spanish and has many years of experience as a senior examiner at GCSE and A-level. \r\n \nhttps://s9.postimg.io/hb6y6fkn3/Cambridge_IGCSE_International_Certificate_Fren.jpg","torrent":{"xt":"urn:btih:861d49fd05af5dc8454613cf52b4cfe16d22d942","amp;dn":"Cambridge+IGCSE+%26amp%3B+International+Certificate+French+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"861d49fd05af5dc8454613cf52b4cfe16d22d942","infoHashBuffer":{"type":"Buffer","data":[134,29,73,253,5,175,93,200,69,70,19,207,82,180,207,225,109,34,217,66]},"announce":[],"urlList":[]}}