{"title":"Crochet motif pattern collection","uid":7067166,"size":879822121,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:870ebac2d39f564fdfa012e7c2fa10161761b8dc&amp;dn=Crochet+motif+pattern+collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"whitecat2010","files":1312,"time":1330554306,"description":"A collection of crochet patterns for motifs, divided by kind: flowers and hearts, hexagons, rounds and squares. Many books, leaflets, compilations and tutorials, all cleaned up, sorted, formatted, retouched, with good contrast, some resized to A4, page numbers checked, duplicates pruned out etc... \nThey are not rar-ed, so you can pick and choose which files you need. If you happen to have some of these, and you're not happy with the scan quality, do check the file sizes, if mine are bigger, chances are that they have gone through Photoshop and are better.\nTo choose the files you want to download when downloading a magnet link.\nIn uTorrent) go to the lower half of the window, click the &quot;Files&quot; tab, wait a bit until the list of files appear; select all those you don't want, right click and check &quot;Don't download&quot;. Other clients also have this capability. \nHowever, if you download the whole thing and seed it, you will do a service to other downloaders. \n\nIMPORTANT NOTE: Site statistics are not always accurate. For instance, you may see 0 seeders and just a few leechers, but if you download and open in your torrent client, you may see that in fact there are many. So don't trust the numbers you see and despair, check for yourself before giving up. \n","torrent":{"xt":"urn:btih:870ebac2d39f564fdfa012e7c2fa10161761b8dc","amp;dn":"Crochet+motif+pattern+collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"870ebac2d39f564fdfa012e7c2fa10161761b8dc","infoHashBuffer":{"type":"Buffer","data":[135,14,186,194,211,159,86,79,223,160,18,231,194,250,16,22,23,97,184,220]},"announce":[],"urlList":[]}}