{"title":"MTVs_Jersey_Shore_Complete_Season_1_-GPB2008","uid":5309016,"size":3909339694,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:871b2bc88de34204d5b6a83d699c3c5ef6591179&amp;dn=MTVs_Jersey_Shore_Complete_Season_1_-GPB2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":9,"uploader":"GPB2008","files":-1,"time":1264499773,"description":"Ok Guys .... Heres My Third Video Contribution... This is The Full Complete First \n\nSeason Of &quot;Jersey Shore&quot;... Enjoy!!!\n\n\n\n1.01 \t&quot;A New Family&quot;                    December 3, 2009 (2009-12-03)\n\nSummer at the Jersey Shore kicks off when eight soon-to-be roommates move into their summer share. Romance heats up between Sammi and Mike, but all might be lost when the guys invite three random girls to join them in the hot tub. Meanwhile, Snooki comes on way too strong, and finds herself the outcast. She can only hope that first impressions won't be lasting impressions. \n\n\n\n1.02 \t&quot;The Tanned Triangle&quot;             December 3, 2009 (2009-12-03)\n\nStill feeling like the outcast, Snooki tells the others that she's leaving the Shore. And the roommates' first night out at the club gets flirty, proving that the boyfriends back home might, in fact, have something to worry about. And what started with Mike and Sammi turns into a love triangle that threatens to divide the house. \n\n\n1.03 \t&quot;Good Riddance&quot;  \t           December 10, 2009 (2009-12-10)\n\nMike has trouble accepting the fact that Sammi chose Ronnie over him. Angelina decides she's too good to work at the Shore Store and Danny fires her, which means she's no longer allowed at the house and has to leave the show. And JWoww's boyfriend comes for a visit but she waits before telling him about kissing Pauly D.\n\n \n1.04 \t&quot;Fade To Black&quot; \t           December 17, 2009 (2009-12-17)\n\nAfter a night at the clubs, and &quot;beating the beat&quot;, Pauly and Mike have to juggle multiple groups of girls. Pauly takes a grenade for The Situation. Snooki's mother comes in for a visit, and an emotional Snooki shows her &quot;true colors&quot;. And later that night mayhem breaks out when a fight erupts at a bar, and one of the housemates goes down. \n\n\n1.05 \t&quot;Just Another Day at the Shore&quot;    December 31, 2009 (2009-12-31)\n\nWith the support from most of her housemates, Snooki recovers from the punch. Ronnie's family comes for a visit and Sammi does her best to make a good first impression. J-WOWW gets tired of all the haters at the club and gets in a fight. Mike, Pauly and Vinny continue their schemes to hook-up with as many girls as possible, but Vinny may have crossed a line when he takes the boss' girl home. \n\n\n1.06 \t&quot;Boardwalk Blowups&quot; \t \t    January 7, 2010 (2010-01-07)\n\nWhen Mike invites girls back to the house, the situation gets out of control, and Snooki gets into her second fight of the summer. Meanwhile Ronnie gets into a brawl of his own, leaving Sammi questioning their relationship.\n\n\n\n1.07 \t&quot;What Happens In AC&quot; \t \t    January 14, 2010 (2010-01-14)\n\nThe roommates head to Atlantic City where fun turn to fury when Mike manages to antagonize both Snooki and J-WOWW. Snooki reveals that she used to have an eating disorder. \n\n\n1.08 \t&quot;One Shot&quot;  \t                    January 14, 2010 (2010-01-14)\n\nThe summer's winding down but the drama doesn't stop. Pauly's got a stalker and a fight lands another roommate in jail. \n\n\n1.09 \t&quot;That's How The Shore Goes&quot;  \t    January 21, 2010 (2010-01-21)\n\nRonnie is released from his night in the slammer and the guys comfort Snooki after she has a bad encounter with her ex-boyfriend. The housemates wrap things up at the Shore as summer draws to a close, but not before one final house hot tub hook up. \n\n\n1.10    &quot;Jersey Shore: Reunion&quot;\n\nQuestions are answered when Snooki, The Situation, J-WOWW, DJ Pauly D, Angelina, Ronnie, Sammi and Vinny return for more fights and insight into what truly happen down at the Jersey Shore.","torrent":{"xt":"urn:btih:871b2bc88de34204d5b6a83d699c3c5ef6591179","amp;dn":"MTVs_Jersey_Shore_Complete_Season_1_-GPB2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"871b2bc88de34204d5b6a83d699c3c5ef6591179","infoHashBuffer":{"type":"Buffer","data":[135,27,43,200,141,227,66,4,213,182,168,61,105,156,60,94,246,89,17,121]},"announce":[],"urlList":[]}}