{"title":"The New Avengers, Secret War, and The Sentry","uid":3751806,"size":702684328,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:8754b88ffcef626ff53ac43c783905cff71d2f6f&amp;dn=The+New+Avengers%2C+Secret+War%2C+and+The+Sentry&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":2,"uploader":"GreedosCreations","files":64,"time":1185316342,"description":"Contains all New Avengers issues as of 2007-07-24 (1-32, Annual 1, Illuminati 1-3, Military Giveaway 1-2, and the Most Wanted files). I couldn&amp;#039;t find these all in one place---I had to scrounge them out of multiple torrents.\n\nAlso contains the entire Secret War miniseries (which takes place somewhere in the middle of New Avengers, as does House of M and Civil War) plus all published comics about the Sentry, an intriguing new character introduced in New Avengers that I wanted to find out more about and thus downloaded some comics about.\n\nI suggest reading Secret War first (even though it occurs after a few issues of New Avengers, it doesn&amp;#039;t rely on any information from it), then New Avengers, then the Sentry comics. As long as you realize that the consequences of Secret War don&amp;#039;t play out for a few issues, that should work fine. Otherwise, track down some chronology somewhere and figure out where to insert Secret War into the reading order. Read the Sentry last (or at least, after the Civil War issues start in New Avengers) since it&amp;#039;s better to be introduced to his enigma in New Avengers than to know it already going in.\n\nAs with all my re-packagings, I&amp;#039;ve removed scanner self-promotions and other advertisements, and stitched together any double pages that were left apart. I certainly appreciate the work the scanners do, but would rather not have their logos inside the comic. If you hate me for this, I suggest not downloading the torrent.","torrent":{"xt":"urn:btih:8754b88ffcef626ff53ac43c783905cff71d2f6f","amp;dn":"The+New+Avengers%2C+Secret+War%2C+and+The+Sentry","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8754b88ffcef626ff53ac43c783905cff71d2f6f","infoHashBuffer":{"type":"Buffer","data":[135,84,184,143,252,239,98,111,245,58,196,60,120,57,5,207,247,29,47,111]},"announce":[],"urlList":[]}}