{"title":"Orson Welles - The Stranger (1946)","uid":5240713,"size":1150806764,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:87bc1daf5da5787a73ff2f7483e3082ece02f669&amp;dn=Orson+Welles+-+The+Stranger+%281946%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"kerouac_rj","files":3,"time":1261749129,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0038991/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0038991/&lt;/a&gt;\n\nThe Stranger is often considered Orson Welles' most &quot;traditional&quot; Hollywood-style directorial effort. Welles plays a college professor named Charles Rankin, who lives in a pastoral Connecticut town with his lovely wife Mary (Loretta Young). One afternoon, an extremely nervous German gentleman named Meineke (Konstantin Shayne) arrives in town. Professor Rankin seems disturbed--but not unduly so--by Meineke's presence. He invites the stranger for a walk in the woods, and as they journey farther and farther away from the center of town, we learn that kindly professor Rankin is actually notorious Nazi war criminal Franz Kindler. Conscience-stricken by his own genocidal wartime activities, Meineke has come to town to beg his ex-superior Kindler to give himself up. The professor responds by brutally murdering his old associate. If Kindler believes himself safe--and he has every reason to do so, since no one in town, especially Mary, has any inkling of his previous life--he will change his mind in a hurry when mild-mannered war crimes commissioner Wilson (Edward G. Robinson) pays a visit, posing as an antiques dealer.\n\nFile Name ....................: The.Stranger.1946.DVDRip.XviD-KG.avi\nFile Size (in bytes) .........: 1150633200 bytes\nRuntime (# of frames) ........: 01:31:22 (137052 frames)\nVideo Codec ..................: XviD\nFrame Size ...................: 624x464 [=1.34]\nFPS ..........................: 25.0\nVideo Bitrate ................: 1540.0 kbit/s\nBits per Pixel ...............: 0.218 bpp\nB-VOP, N-VOP, QPel, GMC ......: [B-VOP]...[]...[]...[]\nAudio Codec ..................: mp3\nSample Rate ..................: 48000 Hz\nAudio bitrate ................: 96 kbit/s [1 channel]\n\n\nEnglish audio, english and portuguese subtitles. Not my rip.\n\n\n*********************************** FREAKYFLICKS **********************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE","torrent":{"xt":"urn:btih:87bc1daf5da5787a73ff2f7483e3082ece02f669","amp;dn":"Orson+Welles+-+The+Stranger+%281946%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87bc1daf5da5787a73ff2f7483e3082ece02f669","infoHashBuffer":{"type":"Buffer","data":[135,188,29,175,93,165,120,122,115,255,47,116,131,227,8,46,206,2,246,105]},"announce":[],"urlList":[]}}