{"title":"[Clips4Sale / BareBackStudios] Rikki Nyx (The Montage Father, D","uid":15576486,"size":277736580,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:87cea5538557056d75d6a11afb4b1e6bdc87f8a2&amp;dn=%5BClips4Sale+%2F+BareBackStudios%5D+Rikki+Nyx+%28The+Montage+Father%2C+D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":2,"uploader":"LucasCar","files":2,"time":1471343017,"description":"[Clips4Sale / BareBackStudios] Rikki Nyx (After Lunch BJ Daddy, Daughter) 720p [Roleplay]\r\n\r\nDad is in the kitchen cleaning up after Breakfast. Mum is on the couch watching one of her shows she PVR'd. Daughter walks in (after shopping in the morning) and casual starts unzipping Dad's pants, takes out his cock, and says &quot;Hey mum&quot; Mum without turning around, asks &quot;Did you get the sunglasses you wanted?&quot; Dad stands there nervously looking back and forth at his daughter's eyes and the back of mum's head. Daughter replies &quot;No, I'm going to check out few other stores later on today&quot; The daughter starts sucking dad's cock. While looking up at him hungrily. Mum says something along the lines of &quot;You should check out That other place at the mall, I think the ones with oval lenses would look best on you&quot; The daughter takes the cock out of her mouth to briefly respond, &quot;For sure&quot;, then goes back to sucking. Mum says &quot;If you're going to go back by yourself later on today, I can't pick you up, since I have an appointment&quot; Daughter says &quot;Ok, sounds good&quot; between sucks. After a minute of sucking, mum gets up, and grabs dad's attention (pov shoot towards mum getting up after finishing her show) Mum tells dad &quot;I'm gonna get ready&quot;, and Dad responds &quot;Ok&quot;, and mum takes off to the bedroom. Daughter stop sucking her dad off, takes off what remaining clothes she has on and lies on the ground asking her dad to take her, to &quot;make my pussy yours&quot;. Dad obliges, and starts fucking her. Action ensues, Dirty talk, positions changes. She begs for the taste of his cum. He blows his load into her mouth once again, and she swallows. She continues to suck his cock vigorously till he withdraws. He tells her, &quot;Now, go get those sunglasses you need&quot; She goes through the pile of her clothes and takes out sunglasses. She says &quot;I already have them&quot;, and smiles mischievously and says &quot;I'll be seeing more of you later&quot; to dad's cock.\r\n \nhttp://screenimage.net/img-57b2cd96c802e.html\r\n \nhttp://screenimage.net/img-57b2cd8c715a5.html \r\n\r\n\r\n\r\n★ ★ ★  For more Exclusive Porn please visit ★ ★ ★\r\n \nhttps://thepiratebay.org/user/LucasCar","torrent":{"xt":"urn:btih:87cea5538557056d75d6a11afb4b1e6bdc87f8a2","amp;dn":"%5BClips4Sale+%2F+BareBackStudios%5D+Rikki+Nyx+%28The+Montage+Father%2C+D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87cea5538557056d75d6a11afb4b1e6bdc87f8a2","infoHashBuffer":{"type":"Buffer","data":[135,206,165,83,133,87,5,109,117,214,161,26,251,75,30,107,220,135,248,162]},"announce":[],"urlList":[]}}