{"title":"Scene Design and Stage Lighting (10th Ed)(gnv64)","uid":8757395,"size":109130698,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:87d733ae7feed34fcd0085110ae9c539d78fa346&amp;dn=Scene+Design+and+Stage+Lighting+%2810th+Ed%29%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"gnv65","files":-1,"time":1375175717,"description":"Scene Design and Stage Lighting (10th Ed)\nby R. Craig Wolf and Dick Block\nCengage Learning | March 2013 | ISBN-10: 1111344434 | True PDF | 672 pages | 104 mb &lt;a href=&quot;\nhttp://www.amazon.com/Scene-Design-Stage-Lighting-Craig/dp/1111344434&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Scene-Design-Stage-Lighting-Craig/dp/1111344434&lt;/a&gt;\n\nNow in full color and packed with professional information and cutting-edge technologies, SCENE DESIGN AND STAGE LIGHTING, Tenth Edition, equips you with the most up-to-date coverage available on scenery, lighting, sound, and technology. Completely current, the exciting new tenth edition has two new chapters on digital integration in scene design and lighting design (Chapters 12 and 13), a new chapter on getting work in the profession (Chapter 28), and mirrors the best of real-world practices. Vibrant color production photographs support the text and spotlight examples of contemporary work. The book retains its strong emphasis on modern technology, with many changes in the lighting design and sound design chapters, reflecting the latest practices. The text also includes an expanded section on television design, as well as an emphasis on health and safety issues. The authors emphasize collaboration in all sections of the text, and they provide insight via interviews with professional lighting and scenery designers in two features: &quot;Working Professionals&quot; and &quot;Designers at Work.&quot; Reflecting current professional practice, SCENE DESIGN AND STAGE LIGHTING, Tenth Edition, offers in-depth coverage of a broad range of topics, making it the most detailed and comprehensive text available in the scenic, lighting, and sound design fields.\n\nAbout the Authors\nR. Craig Wolf is a professional lighting designer as well as an educator. Mr. Wolf's designs have been seen nationwide, including productions for San Diego's Old Globe Theatre, San Diego Repertory Theatre, Dance Theatre Workshop in New York, Virginia Shakespeare, Richmond Ballet Company, Theatre Artaud in San Francisco, and Japan America Center and Odyssey Theatre Ensemble of Los Angeles. He currently serves on the Board of Directors of United States Institute for Theatre Technology (USITT) and is vice chair of their Publications Committee and, for five years, he was lighting commissioner. He became a lighting associate member of the United Scenic Artists Design Union in 1977. Mr. Wolf has taught at the Universities of Michigan and Virginia and is currently professor of design, MFA graduate adviser, and head of the design program in the School of Theatre, Television, and Film at San Diego State University.\nDick Block has worked as a freelance scene designer and a scenic artist for more than 25 years. He has designed for AMAS, Columbia Artists, and TheatreWorks USA, all in New York, and for the Virginia Stage Company, the Weston Playhouse (Vermont), and the Human Race (Ohio). Additional regional credits include work at the McCarter Theatre in Princeton, the American Repertory Theatre in Cambridge, Center Stage in Baltimore, Opera Theatre of St. Louis, as well as the Pittsburgh Playhouse and the Pittsburgh Public Theatre. Block is also active with United States Institute for Theatre Technology (USITT), having served as scene design co-commissioner and on the board of directors, and with the Kennedy Center/American College Theatre Festival both regionally and nationally, having served as the first national design chair. He is the recipient of the Kennedy Center Medallion for Distinguished Service. Block received his MFA from Northwestern University. After teaching at the University of Michigan and Cornell, he is currently the associate head of the School of Drama at Carnegie Mellon. \n\nBrief Contents\nChapter 1 Introduction 1\nPart I | CREATING THE DESIGN 5\nChapter 2 Scene Design and the Theatre Space 6\nChapter 3 Scene Design as a Visual Art 20\nChapter 4 The Design Process 37\nChapter 5 Color in the Design 84\nChapter 6 Drafting the Design 94\nChapter 7 The Scene Shop, Tools, and Equipment 114\nChapter 8 Building the Scenery 153\nChapter 9 Painting Scenery 180\nChapter 10 Handling Scenery 208\nChapter 11 Stage Properties and the Designer 234\nPart II | DIGITAL AGE INTEGRATION:\nSCENERy AND LIGHTING 255\nChapter 12 Projection in the Theatre 256\nChapter 13 Automation in the Theatre 284\nPart III | STAGE LIGHTING 307\nChapter 14 Introduction to Stage Lighting 308\nChapter 15 Distribution 328\nChapter 16 Color and Light 340\nChapter 17 Lighting Fixtures 358\nChapter 18 Projected Effects, Practicals, and Special Effects 385\nChapter 19 Design: Choices and Process 398\nChapter 20 Design: The Light Plot, Paperwork, and Production 419\nChapter 21 Power Distribution and Control 438\nChapter 22 Stage Lighting and Electricity 457\nChapter 23 Light Sources 473\nChapter 24 Design Techniques 491\nChapter 25 Lighting Design as a Profession 521\nPart IV | SOUND FOR THE THEATER 561\nChapter 26 Sound and Music in the Theatre 562\nChapter 27 Sound Systems and Equipment 585","torrent":{"xt":"urn:btih:87d733ae7feed34fcd0085110ae9c539d78fa346","amp;dn":"Scene+Design+and+Stage+Lighting+%2810th+Ed%29%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87d733ae7feed34fcd0085110ae9c539d78fa346","infoHashBuffer":{"type":"Buffer","data":[135,215,51,174,127,238,211,79,205,0,133,17,10,233,197,57,215,143,163,70]},"announce":[],"urlList":[]}}