{"title":"31 Lastest After Effects Plugins","uid":3526153,"size":67993975,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:88017bcbebe89e541bbf79157e8983067f30931a&amp;dn=31+Lastest+After+Effects+Plugins&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"cooolway","files":31,"time":1158624115,"description":"GenArts Sapphire v1.07\nGenArts Sapphire v1.07 is a premier provider of visual special effects software for the film and video industry. Our Sapphire Plug-ins extend the capabilities of editing and effects workstations by providing digital artists with a collection of over 175 state-of-the-art image processing and synthesis effects.\n\nMagic Bullet Suite 2.1\nIncludes 18 After Effects plug-ins that deliver a complete production pipeline for processing digital video footage for output to DVD, TV, or film. Magic Bullet was developed at The Orphanage, by former Industrial Light &amp; Magic visual effects artist Stu Maschwitz, to provide digital video professionals the tools to transform the harsh look of video to the softer, more organic look of film. \n?Video to video workflow Add film-like 24p motion effects, with true 24p conversion tools, to 60i or 50i (interlaced) video [Read Creative Cow article] \n? Video to film workflow True high quality 24p conversion, deinterlacing and frame rate converting 60i or 50i material, for film transfer.\n? DV compression correction Remove DV compression artifacts for cleaner and smoother results.\n? Library of 65 film treatments including looks inspired by The Matrix, Traffic, Three Kings, Amelie, and Saving Private Ryan. \n? Customize and save your own unique Looks.\n? Film damage effects - 13 filters to accurately mimic film grain, splotches, scratches, and projection artifacts.\n? Create film-like dissolves, fades to black or burns to white.\n? Letterboxer - crop footage to any standard format, from TV safe to Ben Hur wide.\n? Test and fix your video colors to ensure they meet the broadcast specification parameters.\n\nPanopticum Water v1.03\nThis plug-in you can art up your image with breath-taking water effects such as streaming water and more. You can create effects that are extremely realistic as well as effects that you will not see in real life. Both are amazingly beautiful. Creating various water transitions with this plug-in becomes easy and exciting.\n\nSupressor v1.7\nSupressor is a plugin for Adobe After Effects which allows you to supress different colours in a picture. This can be good for example for supressing blue in bluescreen scenes.\n\nWalker Effects v2.2 Professional\nWalker Effects is the Swiss Army knife of After Effects plug-ins. Compactly designed, each of the 18 plug-ins are built with agility and flexibility in mind and have a rich feature set that goes above and beyond expectation. This toolset is the realization of many years of experience in the visual effects and motion graphics industries and is available to you now in the following 3 packages.\n\nAurora Sky v1.0.1\nAurora Sky is great if you want to create skies and clouds in your AE or FCP composition, but don&amp;#039;t want to build them in a 3D program. It also keeps you safely tucked into AE?s production pipeline, so you don&amp;#039;t deal with render or import issues.\n\nConoa Superpak v1.9\nThis package includes Conoa 3D, Conoa EasyShapes and EasyFX. It is for users who want the multiple intersecting shapes of Conoa 3D, and the warpage of &amp;#039;Conoa CylinderWarp and the ease and flexibility of Conoa Cube.\n\nCycore Effects 1.0.1\nCycore has developed a plug-in collection containing 61 professional effects for Adobe After Effects. The effects range from blurs and color adjustments through distortions and particle generators to lighting and transitions, making it one of the most complete plug-in packages available.\n\nDigital Anarchy 3D Assistants v1.1.1\nThe 3D assistants allow designers a simple way of positioning and animating 3D layers. Layers can be arranged to form various 3D shapes or the Assistants can be used to easily distribute a large number of layers throughout AE&amp;#039;s 3D space. This makes possible animations or arrangements that would be too time consuming or calculation intensive otherwise.\n\nDigital Anarchy Anarchy Toolbox v1.02\nnarchy Toolbox is a set of nine tools that create a variety of sophisticated effects. These visuals include creative blurs, beautiful glows, controlled distortions, seamlessly tiled images, and warped graphics.\n\nDigital Anarchy Data Animator v1.0\nData Animator is a set of eight plugins that allow After Effects users to quickly and easily generate animated charts and graphs. The results are perfect for news programs, simulated displays, corporate communication projects, and any other presentation that requires an animated visualization of data.\n\nDigital Anarchy Geomancy v1.2.1\nGeomancy is a three plugin set that creates and animates lines and shapes. While these common design elements are easy to create, they can be quite tedious to animate. We make this easy for you.\n\nDigital Anarchy Gradient v1.1\nGradient! offers many features expected from a gradient tool: transparency for all colors, direction dial, built-in transfer modes, four different gradient types, and the ability to repeat the gradient.\n\nFrischluft Flair v1.12\nFlair brings 8 high quality effects to Adobe After Effects and Photoshop compatible programs. Among them shine, glow and sparkle effects. Of course with 16bit and multi CPU support.\n\nFrischluft Lenscare v1.21\nLenscare moves depth of field and out of focus generation to post production. If you need high quality camera blurs with the flexibility of 2d post processing, Lenscare is a great choice. It can get you rid of long extra 3d rendering times. The key aspect during the development of these filters was to match the real thing as good as possible.\n\nObviousFX InverseTelecine v1.1.6\nInverse Telecine removes 3:2 pulldown from footage, to restore original film frames from interlaced video fields. And it does it automatically!\n\nObviousFX MilkyWay v1.1.3\nThe Milky Way plug-in uses software based 3D rendering, to render high resolution images, without conflicting with After Effects&amp;#039;s OpenGL renderer. However, this does have limitations, primarily:\n? Only one Milky Way effect should be applied per project! This is very important. We recommend you create your audio visualizations in a separate project, render it, and use the resulting footage in another project.\n? The 3D renderer stores the rendered image, to reuse this for the next frame&amp;#039;s video echo effect. Footage should be rendered sequentially from frame 0, allowing the visualizations to accumulate over time. Starting a render midway through a composition will still work, but will produce different results.\n\n\nPanopticum New Year Toy v1.0\nPanopticum New Year Toy is a very simple plugin, which will help you create unique Christmas and New Year decorations.It will enable you to alter size, color, and orientation of your Christmas toys. The main feature of the program is that it allows to wrap your toy with a certain texture. For example, you can use your company logo to match the toy with your company style.\n\nProfound Effects Gak Pak v2.0\nGak Pak? Version 2.0, the latest release of effects for creating animated background and structural elements, is now available. Version 2.0 includes 6 new shapes and 6 new color selection modes for more creative possibilities. Plus, 40 effect presets (for After Effects, Premiere Pro, combustion, and Avid AVX systems) are included to jumpstart your creativity.\n\nRed Giant Composite Wizard v1.2\nComposite Wizard helps integrate After Effects composites. Tattered edges, poor matte extractions, improper focal depth cues, and unbalanced color schemes are common compositing challenges. Composite Wizard?s tools automate color correction effects, blur or feather edge borders, and clean up unwanted artifacts. \n? Over 20 filters for automating color correction, blurring and feathering edges, and removing unwanted artifacts. \n? Miracle AlphaCleaner and Denoiser?eliminate unwanted elements such as dirt, film grain, and other chatter. \n? Wire/Rig Zapper?erases wires, boom mics, and other on-set elements. \n? Spill Killer?removes bounced light or color spill.\n\nRed Giant Image Lounge v1.2\nImage Lounge contains a set of over 20 stylistic filters to make dynamic images or motion text. Replicate natural elements like fire, smoke, and water. Add realistic touches using shadows, displacement, color mapping, and accurate camera blurs based on lens artifacts to replicate out-of-focus images shot with a 35mm-film camera. \n? Over 20 filters for making dynamic images or motion text. \n? Dozens of parameters for controlling particle size, color, velocity, and direction. \n? Numerous text effects for simulating an animated typewriter text and credit rolls.\n\nStageTools Moving Picture v5.06\nMovingPicture makes smooth pans and zooms on hi-res stills. It is available as a standalone app or plug-in for most popular nonlinear editing systems, on  Macintosh and Windows.\n\nSynthetic Aperture Color Finesse v1.5.6\nColor Finesse gives you the high-end color correction and enhancement tools you need both as a plug-in for your favorite application?including After Effects, Final Cut Pro, and Premiere Pro?and as a standalone application. Because the standalone Color Finesse is not limited by restrictions imposed by a host application, it offers improved workflow, video handling, and project management.\n\nThe Foundry Keylight v1.1 for only Adobe After Effects PRO 7\nThe Foundry has released a floating point version of Keylight for Shake so that EXR and other floating point image file formats can be keyed without clipping. This plug-in is based on the original CFC algorithm but includes screen matte processing tools and improvements to the fgBias.\n\nTrapcode Echospace v1.0.1\nEchospace is used to duplicate, manage and animate layers in a convenient manner. It works similair to an echo effect, but instead of creating 2D echoes, it creates new instances of a layer in 3D space.\n\nTrapcode Particular v1.5.0\nParticular is a powerful 3D particle system that can produce a wide range of effects from natural smoke and explosions to geometric or organic abstract motion graphics design elements.\n\nTrapcode 3DStroke v2.04\n3D Stroke uses paths from one or more masks to render volumetric strokes that can be rotated and moved freely in 3D space. It has a built-in camera for AE41 and Combustion 3 users and can also use AE5&amp;#039;s comp camera. Path reveals in 3D are easily made using the keyframable sliders for start and end.\n\nTrapcode Lux v1.01\nLux simulates the phenomena of light reflection in a sparse medium, also known as &quot;visible light&quot;. This can be observed when lights are present in a slightly foggy environment, like on stage during a concert or outdoors on a misty night.\n\nTrapcode Starglow v1.03\nStarglow is a fast-rendering glow effect. It creates a star-shaped glow around the highlights of the source. The star shape consists of eight directions, and each direction can be assigned an individual colormap and streak length.\n","torrent":{"xt":"urn:btih:88017bcbebe89e541bbf79157e8983067f30931a","amp;dn":"31+Lastest+After+Effects+Plugins","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88017bcbebe89e541bbf79157e8983067f30931a","infoHashBuffer":{"type":"Buffer","data":[136,1,123,203,235,232,158,84,27,191,121,21,126,137,131,6,127,48,147,26]},"announce":[],"urlList":[]}}