{"title":"[ NDS Ita] Animal Crossing Wild World [volpebianca].rar","uid":4689420,"size":25718609,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:881bbdd643e7faff9b772126448606e6b5e1bbea&amp;dn=%5B+NDS+Ita%5D+Animal+Crossing+Wild+World+%5Bvolpebianca%5D.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"Volpebianca","files":-1,"time":1233342450,"description":"Nome: animal crossing wild word\ntestato su r4\n\nAnimal Crossing arriva su DS! Avventurati in un villaggio virtuale in cui puoi arredare la tua casa, andare a pesca o semplicemente startene a spasso con i tuoi amici animali! Non devi giocare da solo: oltre a una modalitÃƒÂ  single player, fino a quattro giocatori possono trovarsi nello stesso villaggio utilizzando un collegamento wireless LAN o una connessione Nintendo Wi-Fi.\n\nA differenza degli altri giochi, in Animal Crossing non sei costretto a completare livelli, raggiungere determinati punteggi o imparare controlli complicati: puoi giocare quando e come vuoi. Ad esempio, all'inizio del gioco ti viene data una casa di cui dovrai pagare il mutuo, ma puoi scegliere di ripagarlo come meglio credi. Puoi dare un mano al negozio del villaggio, diventare cercatore di tesori e vendere le tue scoperte al museo, oppure guadagnare stelline grazie ai tuoi modelli di t-shirt.\n\nGiocare ÃƒÂ¨ di una facilitÃƒÂ  assoluta, in quanto i controlli vengono gestiti con lo stilo e il Touch Screen. Per andare in giro, basterÃƒÂ  puntare nella direzione in cui vuoi andare; per disegnare un modello, basterÃƒÂ  farne lo schizzo sullo schermo.\n\nPersino visitare la cittÃƒÂ  virtuale di un amico o di un'amica ÃƒÂ¨ davvero facile, anche se si trovano a centinaia di chilometri da te nel mondo reale! Inoltre puoi inviare ai tuoi amici un regalo, o scambiare degli oggetti che hanno colpito la tua attenzione. Dall'arredare la tua casa con mobili speciali, allo stringere legami con animaletti amichevoli sempre nuovi, la tua vita virtuale inizia proprio qui!\n\n    * Vivi in un villaggio virtuale dove potrai fare tutto nei tempi che preferisci.\n    * La semplicitÃƒÂ  dei controlli ti permetterÃƒÂ  di fare tutto, dallo scrivere lettere, al disegnare motivi decorativi, allo spostarti; il tutto con dei semplici movimenti del tuo stilo.\n    * Gioca in wireless con i tuoi amici, e visita una cittÃƒÂ  creata da qualcun altro!\n\n","torrent":{"xt":"urn:btih:881bbdd643e7faff9b772126448606e6b5e1bbea","amp;dn":"%5B+NDS+Ita%5D+Animal+Crossing+Wild+World+%5Bvolpebianca%5D.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"881bbdd643e7faff9b772126448606e6b5e1bbea","infoHashBuffer":{"type":"Buffer","data":[136,27,189,214,67,231,250,255,155,119,33,38,68,134,6,230,181,225,187,234]},"announce":[],"urlList":[]}}