{"title":"Feel This Moment (Feat Christina Aguilera) - Transformer","uid":8531502,"size":3880960,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8866d8bc2facf1d63dc9e75a2cfb101f92085404&amp;dn=Feel+This+Moment+%28Feat+Christina+Aguilera%29+-+Transformer+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"kPulsate","files":1,"time":1370164681,"description":"&quot;Feel This Moment&quot; is a song by Cuban-American rapper Pitbull featuring American recording artist Christina Aguilera, taken from the former's seventh studio album Global Warming. The song was released on February 4, 2013 by Mr. 305, Polo Grounds Music, and RCA Records as the fourth single from the album. It is a dance-pop, hip house and electro house song. Lyrically, it talks about stopping to take a moment to appreciate life. &quot;Feel This Moment&quot; was written by Nasri Atweh, Chantal Kreviazuk, Adam Messinger, Sir Nolan, DJ Buddha, Pitbull, and Aguilera, while production was handled by Adam Messinger, Sir Nolan, Nasri Atweh, and DJ Buddha. The song features an interpolated melody from &quot;Take on Me&quot; by A-ha.\n&quot;Feel This Moment&quot; received generally favorable reviews from music critics, some of them praised Aguilera's vocals and the sample used on the song. The song is a commercial success, peaking at number one in Spain and reached the top five in several countries including Austria, Canada and the UK. In the United States, it peaked at number 8 on the Billboard Hot 100, becoming Pitbull's eighth top ten hit on the chart and Aguilera's tenth. An accompanying music video for &quot;Feel This Moment&quot; was directed by David Rousseau, shot in black and white scene. Pitbull and Aguilera performed the song on several shows, including the 2012 American Music Awards, 2013 Kids' Choice Awards and the 2013 Billboard Music Awards.","torrent":{"xt":"urn:btih:8866d8bc2facf1d63dc9e75a2cfb101f92085404","amp;dn":"Feel+This+Moment+%28Feat+Christina+Aguilera%29+-+Transformer+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8866d8bc2facf1d63dc9e75a2cfb101f92085404","infoHashBuffer":{"type":"Buffer","data":[136,102,216,188,47,172,241,214,61,201,231,90,44,251,16,31,146,8,84,4]},"announce":[],"urlList":[]}}