{"title":"Arrow - Season 2 - Episodes 1 thru 12","uid":9539453,"size":8344691563,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:88669c2abc3582e80106f3625f055680a4819545&amp;dn=Arrow+-+Season+2+-+Episodes+1+thru+12&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":6,"uploader":"POtHS11","files":-1,"time":1391011707,"description":"Description\n\n\nArrow (TV series)SEASON 2 -- 1 THRU 10\n\nArrow\nGenre\n\n   Superhero fiction\n   Drama\n   Action\n   Mystery\n\n\n\nArrow is an American television series developed by writer/producers Greg Berlanti, Marc Guggenheim, and Andrew Kreisberg. It is based on the DC Comics character Green Arrow, a costumed crime-fighter who was created by Mort Weisinger and George Papp. It premiered in North America on The CW on October 10, 2012, with international broadcasting taking place in late 2012. The series follows billionaire playboy Oliver Queen, portrayed by Stephen Amell, who, after five years of being stranded on a hostile island, returns home to fight crime and corruption as a secret vigilante whose weapon of choice is a bow and arrow. Unlike in the comic books, Oliver does not go by the alias &quot;Green Arrow&quot; in the television series. Arrow also features appearances by other DC Comics characters.\n\nThe series attempts to take a realistic look at the Green Arrow character, as well as other characters from the DC Comics universe. Although Oliver Queen/Green Arrow had been featured in the television series Smallville from 2006 to 2011, the producers decided to start clean and find a new actor (Amell) to portray the character. Arrow focuses on the humanity of Oliver Queen, and how his time on a presumably deserted island affected him. The creative team chose to illustrate that in the series by crafting flashback scenes to the island for every episode. The series is primarily filmed in Vancouver, British Columbia, Canada.\n\nArrow has received generally favorable reviews from critics, and was the highest rated new series on the CW in past five years up to its release. The series averaged approximately 3.68 million viewers over the course of the first season, and has garnered multiple award nominations and three wins. To assist in promotion, a preview comic book was released before the television series began; webisodes featuring a product tie-in with Bose were developed for the second season. The first season is available on DVD and Blu-ray in regions 1, 2 and 4. The second season of Arrow premiered on October 9, 2013.","torrent":{"xt":"urn:btih:88669c2abc3582e80106f3625f055680a4819545","amp;dn":"Arrow+-+Season+2+-+Episodes+1+thru+12","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88669c2abc3582e80106f3625f055680a4819545","infoHashBuffer":{"type":"Buffer","data":[136,102,156,42,188,53,130,232,1,6,243,98,95,5,86,128,164,129,149,69]},"announce":[],"urlList":[]}}