{"title":"ECG 2014 Pocket Brain (Expanded) [Epub] [StormRG]","uid":10111855,"size":11657265,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:888c77483a88e74a97e3a4e8800aa36b912041e2&amp;dn=ECG+2014+Pocket+Brain+%28Expanded%29+%5BEpub%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"0xmovva","files":-1,"time":1399525321,"description":"Author: Ken Grauer\nSpiral-bound: 260 pages\nPublisher: KG/EKG Press; 6th edition (September 1, 2013)\nLanguage: English\nISBN-10: 1930553250\nISBN-13: 978-1930553255\nFormat: Retail Epub\nReader Required: Adobe Digital Editions, Calibre, MoonReader for Android\n\nNOTE: no PDF available, if you want it to scroll like a PDF just read it in Calibre.\nThis is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n__________________________________________________________________________________\n\n\nThe 2014 (6th Edition) of the ECG Pocket Brain is out! (September, 2013). We have greatly enhanced and more than doubled the content of ECG-2011 PB. ECG-2014-PB (Expanded) retains its pocket size - adds spiral binding - and now contains 260 pages (plus ~ 200 illustrations). Written in the same user-friendly style that is Dr. Grauer's trademark - this 6th Edition takes ECG education to a new level. Aimed for beginning, novice AND experienced interpreters (acclaimed by students, nurses, physician extenders, EMS personnel, residents, and clinicians in practice of all specialties). Ideal for use on the ward, in the office or ED - and/or as a study aid for ECG workshops, classes, or more intense courses. Greatly enhanced sections include Bundle Branch Block/Hemiblocks, Chamber Enlargement, Acute MI/Ischemia. NEW topics include ECG signs of Pulmonary Embolus; Clinical Use of Lead aVR; ECG identification of the Culprit Vessel with Acute STEMI; RV MI; Posterior MI; Wellens Syndrome; DeWinter T waves; Giant T Waves; Takotsubo Cardiomyopathy; and more ...","torrent":{"xt":"urn:btih:888c77483a88e74a97e3a4e8800aa36b912041e2","amp;dn":"ECG+2014+Pocket+Brain+%28Expanded%29+%5BEpub%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"888c77483a88e74a97e3a4e8800aa36b912041e2","infoHashBuffer":{"type":"Buffer","data":[136,140,119,72,58,136,231,74,151,227,164,232,128,10,163,107,145,32,65,226]},"announce":[],"urlList":[]}}