{"title":"Craft Beer World - A guide to over 350 of the finest beers known","uid":10347142,"size":51198781,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:889edc9c51906b0eb7ef1596d4bcf0bab9a72af7&amp;dn=Craft+Beer+World+-+A+guide+to+over+350+of+the+finest+beers+known&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"hheyyouguys","files":-1,"time":1402623292,"description":"Craft Beer World: A guide to over 350 of the finest beers known to man\n \nby Mark Dredge\n\nCraft Beer World is the must-have companion for anyone who appreciates decent beer. The last few years have seen an explosion in the popularity of craft beers across the globe, with excellent new brews being produced everywhere from Copenhagen to Colorado, Amsterdam to Auckland. With more amazing beers available than ever before, it's hard to know which ones to choose. That's where Craft Beer World comes in. Gathering together over 300 of the most innovative and tastiest beers you need to try, and divided into 50 different catagories, you will find the best of the best each style has to offer. Every category comes with an explanation of the key characteristics of the style - whether it's an American IPA bursting with citrusy C-hops or an Imperial Stout full of dark roasted malts - along with an example of a classic brew and a selection of cutting edge versions that are certain to become instant favourites. So whether you're looking for bitter beers or balanced flavours, a hit of hops or a hint of coffee, the reviews will point you in the right direction to find the perfect beer to suit your tastebuds. Also included throughout the book are interesting nuggets of beer information, covering everything from the catalyst that has caused the astonishing growth in craft beer through to matching beer with food and how to serve your drinks.\n\nMark Dredge is an award-winning beer writer and runs the popular blog Pencil and Spoon where he writes about anything ale-related. Mark has won awards from the British Guild of Beer Writers in 2009, 2010 and 2011, his work is featured in leading publications across the globe and he's an international beer judge.\n\n--------------------------------------------------------------\n--------------------------------------------------------------\n\nCheck out my other Brewing Books, Zymurgy and BYO torrents\n                                                   &lt;a href=&quot;\nhttp://thepiratebay.se/user/hheyyouguys&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/hheyyouguys&lt;/a&gt;\t(NOTE: If TPB keeps changing domains (ie... .org to .sx to .se), you will have to change it yourselves to see my other torrents)\t \n\n\n***************************************\n\t\t\t\nAlways looking for new brewing books digital or otherwise. If you have ones you want to share, use email above to contact me.\n\n***************************************\t\t\n","torrent":{"xt":"urn:btih:889edc9c51906b0eb7ef1596d4bcf0bab9a72af7","amp;dn":"Craft+Beer+World+-+A+guide+to+over+350+of+the+finest+beers+known","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"889edc9c51906b0eb7ef1596d4bcf0bab9a72af7","infoHashBuffer":{"type":"Buffer","data":[136,158,220,156,81,144,107,14,183,239,21,150,212,188,240,186,185,167,42,247]},"announce":[],"urlList":[]}}