{"title":"Club Dance for Men Level 2 (PickupDance.com)","uid":6512102,"size":1086420394,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:88b8cc722cad379f6fbe5352034b195f689975d0&amp;dn=Club+Dance+for+Men+Level+2+%28PickupDance.com%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"inst23","files":-1,"time":1309668832,"description":"Club Dance for Men Level 2: Confidence\n\n\n&quot;EASY To Learn Dance Moves That Will Sculpt You Into A CONFIDENT Dancer!&quot;\n\nContinuing on Club Dance For Men Level 1, Club Dance For Men Level 2 steps it up a notch to develop your club dancing and to sculpt you into a confident dancer when you go out. The program uses the same solid formula of breaking down easy-to-learn dance moves, practicing them, and making them look great.\n\nClub Dance For Men Level 1 gets you comfortable to take your first steps on the dance floor. Level 2 doubles your arsenal of dance moves to get you dancing and having a great time in the clubs. You can now choose to blend in with the dancing crowd or making your presence known on the dance floor.\n\nI mean it. I named Level 2 &quot;Confidence&quot; because I truly believe that dancing well will build your confidence immensely. I am a HUGE fan of personal development and even run my own website on this topic. I've seen the smiles and changes men make by learning how to dance. I myself am a living example. Let's face it. You probably have many years ahead of you, and TONS OF OPPORTUNITIES for you to dance. Dancing is the spice of life, and it's never too late to start.\n\nStill designed with beginners in mind, Level 2 puts more focus on style and combining body movements, so BE PREPARED to create more movement and to use your shoulders, hips, and hands more. Again, all the dance moves are club-tested. I've spent an immeasurable time in the clubs and teaching guys how to dance so everything I teach is FOR REAL.\n\nThe moves work on all kinds of club music: hip hop, house, trance, techno, dance, rock, etc. Some moves are explained to work better with certain kinds of music than others.\n\n&quot;Learn To Dance Confidently, Make Your Presence Known, And Party Like You've Never Partied Before In The Clubs!&quot;\n\nHomepage: &lt;a href=&quot; http://www.pickupdance.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.pickupdance.com&lt;/a&gt;\nYouTube Channel: \n\nQuality: DVDRip\nFormat: AVI\nVideo: MPEG-4 1 124 Kbps 720 x 480 (1.500) 29.970 fps\nAudio: MPEG 128 Kbps 2 channels 48.0 KHz\n\n* Only 1 hour and 44 minutes of the original 3 hours long video is in this torrent","torrent":{"xt":"urn:btih:88b8cc722cad379f6fbe5352034b195f689975d0","amp;dn":"Club+Dance+for+Men+Level+2+%28PickupDance.com%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88b8cc722cad379f6fbe5352034b195f689975d0","infoHashBuffer":{"type":"Buffer","data":[136,184,204,114,44,173,55,159,111,190,83,82,3,75,25,95,104,153,117,208]},"announce":[],"urlList":[]}}