{"title":"TV on the Radio - Seeds (2014) [FLAC]","uid":11533296,"size":396561381,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:88e246635783d53ea239c52a4bc7858712c32c2f&amp;dn=TV+on+the+Radio+-+Seeds+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"politux","files":-1,"time":1416597751,"description":"\n  TV on the Radio - Seeds (2014) [FLAC]\n\n  Genre: Rock\n  Styles: Indie, Alternative\n  Source: CD (log + cue) \n  Codec: FLAC\n  Bit rate: ~ 1,000 kbps\n  Bit depth :16\n  Sample rate: 44.1 kHz\n\n  01 Quartz \n  02 Careful You \n  03 Could You \n  04 Happy Idiot \n  05 Test Pilot \n  06 Love Stained \n  07 Ride \n  08 Right Now \n  09 Winter \n  10 Lazerray \n  11 Trouble\n  12 Seeds \n\n  Arriving three years after the mellow Nine Types of Light -- and the death of bassist Gerard Smith, who succumbed to lung cancer just days after the album's release -- Seeds has a palpable sense of moving on for TV on the Radio. Sonically, it's crisper and clearer than ever before; songs like the beautiful ballad &quot;Test Pilot&quot; use this clarity to prove, once again, that TV on the Radio fuse indie and R&amp;B more genuinely than many of the acts that sprang up during their hiatus. Though they rein in their trademark lushness ever so slightly, it doesn't diminish their sound's magnitude; instead, it adds an urgency that feels even more pointed after Nine Types' hazy reveries. Similarly, that album's philosophical tone continues on Seeds, with the band confronting loss directly on the album's first half and accepting it on the second. TV on the Radio are often at their most compelling when they're grappling with something, and album opener &quot;Quartz&quot; -- on which Tunde Adebimpe asks &quot;How hard must we try?&quot; -- showcases them in all their frustrated glory. \n\n  Likewise, that songs as emotionally opposed as &quot;Could You,&quot; where Kyp Malone wonders about being able to love again, and &quot;Happy Idiot,&quot; where Adebimpe willfully numbs himself to the pain, are both triumphs is another testament to the band's complexity. Seeds' first half is so strong that it's not surprising that it sags by comparison a little later. To be fair, it's harder to write uplifting and empowering songs that don't sound trite, and TV on the Radio manage more than a few: the anthemic &quot;Ride,&quot; the fired-up &quot;Winter,&quot; and the furious rocker &quot;Lazerray&quot; all deliver far more than platitudes. Just when it feels like things might be too relentlessly positive, the band injects some welcome ambiguity into &quot;Trouble&quot;'s refrain of &quot;Everything's gonna be OK,&quot; letting it teeter between reassurance and uncertainty. By the time the title track closes the album with the promise of rebirth, TV on the Radio's reinvention as survivors is complete. At its best, Seeds is a fine tribute to Smith and the sound of enduring unimaginable loss","torrent":{"xt":"urn:btih:88e246635783d53ea239c52a4bc7858712c32c2f","amp;dn":"TV+on+the+Radio+-+Seeds+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88e246635783d53ea239c52a4bc7858712c32c2f","infoHashBuffer":{"type":"Buffer","data":[136,226,70,99,87,131,213,62,162,57,197,42,75,199,133,135,18,195,44,47]},"announce":[],"urlList":[]}}