{"title":"Traditional Archery from Six Continents - The Charles E Grayson ","uid":9950007,"size":8022620,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:89744f75f9462b5bedf6edb7b87ce3511c512895&amp;dn=Traditional+Archery+from+Six+Continents+-+The+Charles+E+Grayson+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"STBGD","files":-1,"time":1397386593,"description":"Traditional Archery from Six Continents: The Charles E. Grayson Collection By Charles E. Grayson; Mary French; Michael J. O'Brien\nEnglish | 2007-10-21 | 280 Pages | ISBN: 0826217516 | PDF | 7,7 MB\n\nAs a major hunting tool and weapon, the bow changed human history around the world, and its diverse forms reflect the cultures that adopted it. Those variations can be seen in the Charles E. Grayson Archery Collection housed at the University of Missouri - Columbia Museum of Anthropology, one of the largest and most comprehensive assemblages of archery-related materials in the world. \n\nThis handsome book drawn from that collection offers a unique look at archery as it has been practiced through the ages. Drawing on a collection of more than five thousand bows, arrows, and associated paraphernalia, &quot;Traditional Archery from Six Continents&quot; presents color photographs and descriptions of some three hundred items - including quivers, thumb rings, and more - that represent traditional archery practices and customs from around the world. From the Chinese &quot;monkey bow&quot; to the English longbow, the artifacts are organized by region, taking in equipment from Asia, the Middle East, Africa, the Americas, and Europe used over the past five hundred years. The book's introduction provides an overview of traditional archery and its nomenclature, and chapter essays situate the items in their historical, cultural, and technological contexts. Plate descriptions note materials, construction methods, dimensions, and temporal and cultural affiliations. \n\nThe sharp, detailed photographs will enable users to identify the geographic or cultural origins of the pieces by visual comparison. Additional illustrations show how archery equipment has been used in various settings such as hunting, warfare, and sport. These superb representations from a masterful collection constitute a complete introduction to worldwide archery and mark the first wide-ranging survey of European and non-European archery equipment ever available. &quot;Traditional Archery from Six Continents&quot; will be the standard reference work in the study of archery, indispensable for students of material culture or general readers interested in the history of this timeless art.\n\nAbout the Author\nCharles E. Grayson is a physician who has studied archery as a historian, bowyer, and hunter. Now retired, he lives in Clatskanie, Oregon, and continues to participate in archery competitions. Mary French is Cultural Resources Coordinator at the American Museum of Natural History in New York City. Michael J. O'Brien is Professor of Anthropology and Dean of the College of Arts and Science at the University of Missouri - Columbia. Daniel S. Glover is Associate Museum Curator at the Museum of Anthropology at the University of Missouri - Columbia.","torrent":{"xt":"urn:btih:89744f75f9462b5bedf6edb7b87ce3511c512895","amp;dn":"Traditional+Archery+from+Six+Continents+-+The+Charles+E+Grayson+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89744f75f9462b5bedf6edb7b87ce3511c512895","infoHashBuffer":{"type":"Buffer","data":[137,116,79,117,249,70,43,91,237,246,237,183,184,124,227,81,28,81,40,149]},"announce":[],"urlList":[]}}