{"title":"Science for Heretics: Why So Much of Our Science is Wrong","uid":16035459,"size":432636,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8a228086a1c991f9537ffeca59896c30747705b5&amp;dn=Science+for+Heretics%3A+Why+So+Much+of+Our+Science+is+Wrong&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":3,"uploader":"marty14","files":1,"time":1476476030,"description":"Science for Heretics: Why So Much of Our Science is Wrong - Barrie Condon [epub]\r\n\r\nScience, as has often been remarked, is the religion of the day. However, unlike religion, it is far more firmly embedded in the everyday workings of our society and indeed we have got to the point where we can no longer envisage any real progress without it. Unfortunately there are profound problems with all aspects of scientific theory and methods.\r\n\r\nFor example: could it be that the idea of universal laws underpinning reality is a falsehood and, as a result, we need more and more scientists, and more and more computing power, to produce greater and greater elaborations of our theories to make them fit inconvenient experimental data? Indeed, we're being forced to break science down into smaller and smaller sub-specialities, each with ever more divergent theories applicable only to one speciality and not applicable to others. Rather than an underlying unity we are finding only disparity and greater complexity. What’s worse, scientists are routinely having to resort to completely untestable concepts, such as many more spatial dimensions and infinite universes, to ‘explain’ our reality.\r\n\r\nThroughout the history of science, reputable figures in science and philosophy have been casting doubt on some of the central assumptions of science and its various disciplines. These objections and criticisms have been ignored and then often forgotten in the face of the apparent overwhelming successes of science, but many of them are still perfectly valid. Often these criticisms are buried deep within academic texts.\r\n\r\nThe aim of this book is, for the first time, to summarise these profound concerns across all the fields of science in a way that is accessible to the general reader who does not have a background in science. It also attempts to provide a warning of the risks that, perhaps even at extinction level for mankind, science runs by not acknowledging the often hollow foundations on which it is built","torrent":{"xt":"urn:btih:8a228086a1c991f9537ffeca59896c30747705b5","amp;dn":"Science+for+Heretics%3A+Why+So+Much+of+Our+Science+is+Wrong","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a228086a1c991f9537ffeca59896c30747705b5","infoHashBuffer":{"type":"Buffer","data":[138,34,128,134,161,201,145,249,83,127,254,202,89,137,108,48,116,119,5,181]},"announce":[],"urlList":[]}}