{"title":"The UFO Phenomenon (Time-Life Mysteries of the Unknown).pdf","uid":11821638,"size":26960548,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8a4a5c477b54feba136f3d2f0ba3623e1a30c36f&amp;dn=The+UFO+Phenomenon+%28Time-Life+Mysteries+of+the+Unknown%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"STBGD","files":1,"time":1429280909,"description":"pdf / English / 1987 Time-Life / 160 pages / ISBN 10 0809463245 / 25.7 mb\n\n&quot;The UFO Phenomenon&quot;, a part of Time-Life Magazine's &quot;Mysteries of the Unknown&quot; series of books, is one of the best-illustrated UFO books you'll ever see. And, thanks to the work of Time magazine's first-rate writers and researchers, this book is also superior to many of the mediocre and poorly-researched books published on UFOs. The book offers a good history of the UFO phenomenon, dating back to 1947 when a respected pilot and businessman, Kenneth Arnold, saw what he later described to reporters as nine &quot;flying saucers&quot; buzzing over Mount Rainier in Washington State. Soon many people were reporting strange airborne objects all over the nation, prompting a worried US Air Force to begin a secret investigation that would last until 1969, plus covering almost every aspect of UFOs, from mysteries such as the nuclear bomb-style explosion in Siberia in 1908 which destroyed a thousand square miles of forest, to most of the better-known UFO sightings in the USA, to the creepy &quot;Men In Black&quot; who have been rumored to try and intimidate UFO witnesses into not publicizing their sightings, to possible explanations for UFOs - from the sensible to the outlandish","torrent":{"xt":"urn:btih:8a4a5c477b54feba136f3d2f0ba3623e1a30c36f","amp;dn":"The+UFO+Phenomenon+%28Time-Life+Mysteries+of+the+Unknown%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a4a5c477b54feba136f3d2f0ba3623e1a30c36f","infoHashBuffer":{"type":"Buffer","data":[138,74,92,71,123,84,254,186,19,111,61,47,11,163,98,62,26,48,195,111]},"announce":[],"urlList":[]}}