{"title":"The Satanic Bible by Anton LaVey (18 PDF ebooks)","uid":15477213,"size":15797828,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8aeab492df1b041407cb71264853e084e61543f5&amp;dn=The+Satanic+Bible+by+Anton+LaVey+%2818+PDF+ebooks%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"Replicant70","files":18,"time":1470199746,"description":"--------------------------------------------------\r\n- - - EVERY PDF EDITION OF THE SATANIC BIBLE - - -\r\nALL THE ONLINE VERSIONS OF THE SATANIC BIBLE - - -\r\n--------------------------------------------------\r\n--------------------------------------------------\r\n\r\nThe Satanic Bible by Anton LaVey (18 PDF ebooks)\r\nThe Best Collection of Satanic Bibles.\r\nThe Satanic Bible by Anton Szandor LaVey\r\n\r\nThe Satanic Bible is a collection of essays, observations, and rituals published by Anton LaVey in 1969. It contains the core principles of Satanism, and is considered the foundation of its philosophy and dogma. It has been described as the most important document to influence contemporary Satanism. Though The Satanic Bible is not considered to be sacred scripture in the way the Christian Bible is to Christianity, LaVeyan Satanists regard it as an authoritative text as it is a contemporary text that has attained for them scriptural status. It extols the virtues of exploring ones own nature and instincts. Believers have been described as atheistic Satanists because they believe that God is not an external entity, but rather something that each person creates as a projection of his or her own personality-a benevolent and stabilizing force in his or her life. There have been thirty printings of The Satanic Bible, through which it has sold over a million copies.\r\n\r\nThe Satanic Bible is composed of four books: The Book of Satan, The Book of Lucifer, The Book of Belial, and The Book of Leviathan. The Book of Satan challenges the Ten Commandments and the Golden Rule, and promotes Epicureanism. The Book of Lucifer holds most of the philosophy in The Satanic Bible, with twelve chapters discussing topics such as indulgence, love, hate, and sex. LaVey also uses the book to dispel rumors surrounding the religion. In The Book of Belial, LaVey details rituals and magic. He discusses the required mindset and focus for performing a ritual, and provides instructions for three rituals: those for sex, compassion, or destruction. The Book of Leviathan provides four invocations for Satan, lust, compassion, and destruction. It also lists the nineteen Enochian Keys (adapted from John Dees Enochian keys), provided in both Enochian and translated to English.\r\n\r\nOne might expect The Satanic Bible at least to offer a few prancing demons or a virgin sacrifice, but if you hopped this train expecting a tour of the house of horrors, you're on the wrong ride. Far from a manual for conquering the realms of earth, air, fire, and water, The Satanic Bible is Anton LaVey's manifesto of a new religion separate from the traditional Judeo-Christian definitions of Satanism. While LaVey rails against the deceit of the Christian church and white magicians, he busily weaves his own deceptions.\r\n\r\nThe Satanic Bible claims the heritage of a horde of evil deities--Bile, Dagon, Moloch, and Yao Tzin to name a few--but these ancient gods have no coherent connection between each other or to Satanism, except that all have been categorized by Christianity as &quot;evil.&quot; Calling on these ancient names like a magician shouting, Abracadabra, LaVey attempts to shatter the classical depiction of Satanism as a cult of black mass and child sacrifice. As the smoke clears, he leads us through a surprisingly logical argument in favor of a life focused on self-indulgence. The Satanic Bible is less bible and more philosophy (with a few rituals thrown in to keep us entertained), but this philosophy is the backbone of a religion that, until LaVey entered the scene, was merely a myth of the Christian church. It took LaVey, and The Satanic Bible, to turn this myth into a legitimate public religion. --Brian Patterson\r\n\r\nLaVey founded the Church of Satan in 1966.\r\nHail, Satan!!!!","torrent":{"xt":"urn:btih:8aeab492df1b041407cb71264853e084e61543f5","amp;dn":"The+Satanic+Bible+by+Anton+LaVey+%2818+PDF+ebooks%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8aeab492df1b041407cb71264853e084e61543f5","infoHashBuffer":{"type":"Buffer","data":[138,234,180,146,223,27,4,20,7,203,113,38,72,83,224,132,230,21,67,245]},"announce":[],"urlList":[]}}