{"title":"Forged: Why The Bible's Authors Are Not Who We Think They Are","uid":11701430,"size":140789489,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8af588f3cc181b439876ee62bda9381fb72c4532&amp;dn=Forged%3A+Why+The+Bible%27s+Authors+Are+Not+Who+We+Think+They+Are&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"davieboy1966","files":12,"time":1423932405,"description":"Audio Books : Educational : Other quality : English\n\n\nUnabridged and read by Walter Dixon. 9 hours 45 mins duration. eDownload. (32 kbps / 22 kHz Mono CBR MP3 )\n\n\n[2011]\nIt is often said, even by critical scholars who should know better, that writing in the name of another was widely accepted in antiquity. But New York Times best-selling author Bart D. Ehrman dares to call it what it was: literary forgery, a practice that was as scandalous then as it is today. In Forged, Ehrman's fresh and original research takes readers back to the ancient world, where forgeries were used as weapons by unknown authors to fend off attacks to their faith and establish their church. So, if many of the books in the Bible were not in fact written by Jesus' inner circle - but by writers living decades later, with differing agendas in rival communities - what does that do to the authority of scripture?\n\nEhrman investigates ancient sources to:\nReveal which New Testament books were outright forgeries.\nExplain how widely forgery was practiced by early Christian writers - and how strongly it was condemned in the ancient world as fraudulent and illicit\nExpose the deception in the history of the Christian religion.\n\nEhrman's fascinating story of fraud and deceit is essential reading for anyone interested in the truth about the Bible and the dubious origins of Christianity's sacred texts.\n\n\nEnjoy and Seed!!\n\nPS: I have uploaded the most recent of Ehrman's offering as an ebook","torrent":{"xt":"urn:btih:8af588f3cc181b439876ee62bda9381fb72c4532","amp;dn":"Forged%3A+Why+The+Bible%27s+Authors+Are+Not+Who+We+Think+They+Are","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8af588f3cc181b439876ee62bda9381fb72c4532","infoHashBuffer":{"type":"Buffer","data":[138,245,136,243,204,24,27,67,152,118,238,98,189,169,56,31,183,44,69,50]},"announce":[],"urlList":[]}}