{"title":"Das Leben der Anderen (2006) The Lives of others 1080p Xvid HD ","uid":6981973,"size":2700907581,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:8b0296c11927d30ddd31775cde8a5466b0615dcc&amp;dn=Das+Leben+der+Anderen+%282006%29+The+Lives+of+others+1080p+Xvid+HD+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":2,"uploader":"moviesbyrizzo","files":-1,"time":1327432934,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0405094/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0405094/&lt;/a&gt;\n\nlovely 1920 X 808 XviD HD 2200k video bitrate 256k main audio track in German\nwith a supplementary audio track in Italian with similar volume projection, \nyet just 160k taking only 160megs to include - just 2.52GB overall size\n\nEnglish subtitles are included - and could be instantly translated into\nany language of your choice I suppose - using instant &quot;google translate&quot; etc\nat the time of this posting. Italian subtitles were also included and are\nin the folder too. Opening credits are in Italian text rather than German \n- sorry about that - we don't have German translations for you - only\nEnglish subtitles for all to use.\n\nmovie review comments:\n\nThere are no greater peoples in my own way of thinking on these matters\nthan those true Irish spirits of Germany and their relative kin in\nItaly most of all, along with Holland especially, Sweden and I would say France\nto the fullest extent that I would love to see my dream of unification between \nthese German states (Germany-austria-Holland-Sweden) combined with France\ninto a formal state with Italian and Spanish integration in some way in a\nmanner that ensure the spirit strongly yet improves while moving towards an\neven truer understanding of right harmony so all can coexist that truly do belong\nto the best spirit that can be made from all the peoples I mention, sensibly\ncombined somehow.\n\nWe must allow Germans to be the best they can be - and imposition of \ncommunistic ideas is an anathema to the Irish spirit - yet a cruel world\nchose to impose it on fully half of the German Nation at the end of the\nsecond world war, rather than just placing the blame where it lay - \nat the grave of Hitler himself and settle for that.\n\nThis movie deals with how Germans tried to cope with the secret Police\napparatus and the difficult situations in what was a world devoid of human\nunderstanding on such issues as personal space free of state orchestrated\nharassment, directed by the Soviet Bloc hierarchy overall. It was also the\nwrong prescription for the great peoples of Russia too for that matter -\nspeaking of those that are truly Irish spirited folks there too I might add.\n\n\nMichael Rizzo Chessman\nmoviesbyrizzo\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:8b0296c11927d30ddd31775cde8a5466b0615dcc","amp;dn":"Das+Leben+der+Anderen+%282006%29+The+Lives+of+others+1080p+Xvid+HD+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b0296c11927d30ddd31775cde8a5466b0615dcc","infoHashBuffer":{"type":"Buffer","data":[139,2,150,193,25,39,211,13,221,49,119,92,222,138,84,102,176,97,93,204]},"announce":[],"urlList":[]}}