{"title":"Young Marble Giants - Colossal Youth  1980","uid":8179633,"size":63532653,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8b52e9a491a09465c7d87a5f92fdba5eefd42c88&amp;dn=Young+Marble+Giants+-+Colossal+Youth++1980&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"davely","files":25,"time":1361599735,"description":"Pitchfork gives 9.3 out of 10 for &quot;Colossal Youth&quot; by the Young Marble Giants from 1980.\n\nThere really ought to be more bands like Young Marble Giants, which doesn't mean that there ought to be more bands that sound like Young Marble Giants. They came out of the nowheresville of Cardiff, Wales; they didn't particularly have a local scene to buoy them up, or a niche to fit into. What they had was an aesthetic that was totally theirs, a sound and style that essentially had no antecedents. Play any six seconds of any YMG song and you'll know exactly who you're listening to, and probably be thunderstruck by its unsentimental beauty of tone.\n\nIn a year when everyone was trying to make a big noise-- but isn't that every year?-- YMG switched tactics, forcing their audience to lean in to hear them. It's not simply that they were quiet, although substituting a drum machine that sounded like it had a thick quilt on top of it for a human drummer was a radical move at the time. They weren't even all that quiet-- they were just in love with negative space, and their lyrics were so much about things unsaid that the space was formally appropriate. Stuart Moxham flicks at his guitar like a card-shark snapping out an ace, amplifying the impact of his pick on the strings as much as the notes themselves; his brother Philip Moxham bangs at his bass, then lets the sound decay. Alison Statton's not an affectless singer, exactly, but her chief weapon is understatement. She knows how angry Stuart's songs are, and just barely hints at that fury, in a voice that suggests someone finding the courage to say something she's needed to say for a while and has only one chance to get right.\n\n\n What's sort of shocking about their sole album, actually, is how full of rage it is, and how many ways the band manages to translate that rage into something that's not the way the rock idiom usually expresses it. Colossal Youth ticks like a not-yet-exploded bomb. In theory, &quot;Include Me Out&quot; is a mighty garage-rocker, something the Stones or Count Five could've played with a sneer and a great big beat; the Giants strip it of virtually all its audible violence, reducing its rhythm to a muffled thump. &quot;Credit in the Straight World&quot; is a vicious little song about the relationship between subculture and mass culture, and it's all tension, no release, with a riff that keeps landing a half-step above where it should resolve. (The caterwauling Hole cover of it, from Live Through This, demonstrates that you could fill in all the space in Stuart Moxham's songs and still have something impressive.)\n\n\nThere's another space in the center of these songs, though: a pervasive sense of lost youth, toward which most of their fury is directed. &quot;Young&quot; and &quot;youth&quot; turn up in the band name and album title (both were taken from a description of a classical statue), and Statton was only 20 when they got together. But Stuart Moxham's fixation on a moment of perfection he could feel slipping away-- &quot;Salad Days&quot; is another song title-- is the reason it's poetically apt that the band only made one, exquisite record.\n\n","torrent":{"xt":"urn:btih:8b52e9a491a09465c7d87a5f92fdba5eefd42c88","amp;dn":"Young+Marble+Giants+-+Colossal+Youth++1980","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b52e9a491a09465c7d87a5f92fdba5eefd42c88","infoHashBuffer":{"type":"Buffer","data":[139,82,233,164,145,160,148,101,199,216,122,95,146,253,186,94,239,212,44,136]},"announce":[],"urlList":[]}}