{"title":"Business intelligence roadmap: The complete project lifecycle fo","uid":8031067,"size":7533004,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8ba7ecb7ce043e9bd876ae35249d59ac5fa94408&amp;dn=Business+intelligence+roadmap%3A+The+complete+project+lifecycle+fo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":2,"uploader":"imarion","files":-1,"time":1358418679,"description":"Larissa Terpeluk Moss, S. Atre, &quot;Business intelligence roadmap: The complete project lifecycle for decision-support applications&quot;\n2003 | pages: 576 | ISBN: 0201784203 | PDF | 7,1 mb\n\n\nBusiness Intelligence Roadmap is a visual guide to developing an effective business intelligence (BI) decision-support application. This book outlines a methodology that takes into account the complexity of developing applications in an integrated BI environment. The authors walk readers through every step of the process--from strategic planning to the selection of new technologies and the evaluation of application releases. The book also serves as a single-source guide to the best practices of BI projects.\nPart I steers readers through the six stages of a BI project: justification, planning, business analysis, design, construction, and deployment. Each chapter describes one of sixteen development steps and the major activities, deliverables, roles, and responsibilities. All technical material is clearly expressed in tables, graphs, and diagrams.\nPart II provides five matrices that serve as references for the development process charted in Part I. Management tools, such as graphs illustrating the timing and coordination of activities, are included throughout the book. The authors conclude by crystallizing their many years of experience in a list of dos, don'ts, tips, and rules of thumb. The accompanying CD-ROM includes a complete, customizable work breakdown structure.\nBoth the book and the methodology it describes are designed to adapt to the specific needs of individual stakeholders and organizations. The book directs business representatives, business sponsors, project managers, and technicians to the chapters that address their distinct responsibilities. The framework of the book allows organizations to begin at any step and enables projects to be scheduled and managed in a variety of ways.\nBusiness Intelligence Roadmap is a clear and comprehensive guide to negotiating the complexities inherent in the development of valuable business intelligence decision-support applications ","torrent":{"xt":"urn:btih:8ba7ecb7ce043e9bd876ae35249d59ac5fa94408","amp;dn":"Business+intelligence+roadmap%3A+The+complete+project+lifecycle+fo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ba7ecb7ce043e9bd876ae35249d59ac5fa94408","infoHashBuffer":{"type":"Buffer","data":[139,167,236,183,206,4,62,155,216,118,174,53,36,157,89,172,95,169,68,8]},"announce":[],"urlList":[]}}