{"title":"The Cinematic Headshot With Dylan Patrick","uid":11668066,"size":9134241361,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:8c011ca82d58fe48e82d85db0f6d881d782b3d33&amp;dn=The+Cinematic+Headshot+With+Dylan+Patrick&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":null,"files":14,"time":1418090569,"description":"Fstoppers has teamed up with the incredibly successful headshot photographer, Dylan Patrick to produce the 6 hour tutorial, The Cinematic Headshot. Dylan has become widely sought after in New York and Los Angeles for his unmistakably stylized portraits and actors headshots. In this tutorial Dylan will teach you his entire processes of coaching, lighting, and then retouching his pictures. \n\n\nWithin 1 year Dylan went from being a struggling actor/bar tender to a full time portrait photographer without ever using a studio. Managing natural light outside can be difficult but Dylan's lighting style brings the benefits of studio lighting out on location. \n\nDylan has simplified his bag of gear into just 1 camera, 1 lens,  2 speedlights, 1 reflector, and 2 modifiers. Photographers on any budget will be able to easily afford the equipment necessary to shoot similar images. \n \nDylan's photography isn't about expensive gear, it's about the knowledge of how to use what you have. In this tutorial you will learn how to light in ideal lighting situations, extremely harsh lighting situations, and even at night. Dylan's techniques will help you produce repeatable results in any location at any time of day. \n\n50% of Dylan's signature look can be attributed to his coaching and lighting, the other 50% comes from his post production. This tutorial includes 4 different RAW files that you can use to follow along with Dylan as he works. After following along in Photoshop for over 3 hours with Dylan, you'll know everything necessary to edit your portraits at a world class level","torrent":{"xt":"urn:btih:8c011ca82d58fe48e82d85db0f6d881d782b3d33","amp;dn":"The+Cinematic+Headshot+With+Dylan+Patrick","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c011ca82d58fe48e82d85db0f6d881d782b3d33","infoHashBuffer":{"type":"Buffer","data":[140,1,28,168,45,88,254,72,232,45,133,219,15,109,136,29,120,43,61,51]},"announce":[],"urlList":[]}}