{"title":"DivineBitches--DiB-40858 Maitresse Madeline, Rick Fantana, Tommy","uid":15737788,"size":2203139815,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:8c0d4fe7c4bb03dfab5e728de8ee358fc9dc2561&amp;dn=DivineBitches--DiB-40858+Maitresse+Madeline%2C+Rick+Fantana%2C+Tommy&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":14,"uploader":"merzedes","files":2,"time":1472860234,"description":"Reservation: Cuckold \r\n\r\nSep 2, 2016 - Maitresse Madeline Marlowe , Rick Fantana, Tommy Pistol\r\n\r\n\r\nHi and HD MP4.\r\n\r\n\r\nMaitresse Madeline Marlowe's Hotel Divine has been busy! Rick Fantana noticed the new hotel on his way to his construction job and thought he'd check in for an hour on his lunch break. He's welcomed by the divine gimp and to Rick's surprise nothing is what it seems. It's obvious he has stepped into a world unlike any other. Maitresse Madeline emerges from a bath of milk and rose peddles covered head to toe in latex. She slithers and slides over to him with the help of her gimp and without missing a beat Rick realizes his place in this triad. \r\n\r\nHis raging cock is locked and trapped in chastity while Madeline slips her latex flesh up and down his body and sucks her gimps raging hard cock and spitting back into Rick's belt. Madeline is skull fucked hard, just the way she likes it, producing so much saliva. This is the only nectar of pleasure Rick gets to enjoy of Madeline's large, perfect, wet lips. \r\n\r\nRick's bent over and penetrated with Madeline large long stick. The on going theme of Divine Hotel is to torment men not with pain but with pleasure. Rick adores having his prostate milked and Madeline hits his multiple orgasm button over and over again but pulls out every single time he is about to cum. You see he has made a cuckolding reservation and that means the only ones cumming are Madeline and her gimp bull! Madeline gets railed hard in her hungry, evil pussy while Rick is made to watch on his back getting pounded in his ass and denied every time he's on the edge. Orgasm after orgasm and Madeline is finally ready for her gimp bull to cum. She takes two loads of his in her mouth and swallows it all down. Lucky for Rick she sends him back to work with one last kiss and just the smallest scent of the sex he will never have with her. \r\n\r\nScreens \nhttp://www.kink.com/shoot/40858\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n22 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://s4.postimg.org/5zaprzep9/Merzedes_Shallow2_FAQ2_1337_X_3.jpg\r\n \nhttp://s32.postimg.org/ym8wkx6hx/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:8c0d4fe7c4bb03dfab5e728de8ee358fc9dc2561","amp;dn":"DivineBitches--DiB-40858+Maitresse+Madeline%2C+Rick+Fantana%2C+Tommy","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c0d4fe7c4bb03dfab5e728de8ee358fc9dc2561","infoHashBuffer":{"type":"Buffer","data":[140,13,79,231,196,187,3,223,171,94,114,141,232,238,53,143,201,220,37,97]},"announce":[],"urlList":[]}}