{"title":"Musical Comedy - Garfunkel and Oates - 4 Albums [320 CBR]","uid":7331399,"size":252939792,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8c0dd6a57150ac062247165d4d532bb187fbd9e6&amp;dn=Musical+Comedy+-+Garfunkel+and+Oates+-+4+Albums+%5B320+CBR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"rambam1776","files":-1,"time":1338917329,"description":"Garfunkel and Oates are a comedy-folk duo from Los Angeles, California, consisting of actress-songwriters Kate Micucci (Oates) and Riki Lindhome (Garfunkel). The two met at the Upright Citizens Brigade theatre in Los Angeles, where they were introduced to one another by comic Doug Benson. The duet was formed when they started working together to turn a short film made by Lindhome, entitled &quot;Imaginary Larry&quot;, into a musical. Lindhome hails from Portville, New York; Micucci is from Nazareth, Pennsylvania.\n\nIn February 2009, the Garfunkel and Oates song &quot;Fuck You&quot; (reworked as &quot;Screw You&quot;) was featured in the Scrubs episode &quot;My Lawyer's In Love&quot; which featured Micucci in a supporting role. In March 2009, Micucci announced in a bulletin on MySpace that the two had entered the studio to record an EP.\n\nTheir song &quot;Sex With Ducks&quot; parodies arguments against same-sex marriage. Other songs include &quot;Me, You, and Steve&quot;, a song about being on a date with a guy, but his best friend keeps showing up; &quot;Pregnant Women Are Smug&quot;, which parodies comments women make when pregnant; and &quot;Present Face&quot;, about the face that people make when they get a Christmas present they really don't like.\n\nThe band gets their name from &quot;two famous rock-and-roll second bananas&quot;, Art Garfunkel and John Oates.\n\nOn December 14, 2009, Garfunkel and Oates were on the Jay Leno Show to perform their song &quot;Year End Letter.&quot; On The Tonight Show with Jay Leno, they have performed &quot;Pregnant Women Are Smug&quot; on March 12, 2010,[6] and &quot;Self-Esteem&quot; on May 18, 2010. In late October 2010, they performed &quot;Weed Card&quot; on The Tonight Show.\n\nOn December 9, 2010, the women announced on YouTube that they are coming out with a new album entitled &quot;All Over Your Face.&quot;[8] Also in 2010, they were featured on the track &quot;These Girls&quot;, on Childish Gambino's album, Culdesac.\n\nOn January 13, 2011, Garfunkel and Oates signed a deal with HBO for a pilot for their own show. Lindhome has described it as &quot;Glee with dick jokes&quot;.\n\nNOTE - There is a lot of repetition on the albums, but they are different recordings of the same songs. The rare &quot;Mix Tape&quot; album is a CD that was given away by the duo during their one-year anniversary show.","torrent":{"xt":"urn:btih:8c0dd6a57150ac062247165d4d532bb187fbd9e6","amp;dn":"Musical+Comedy+-+Garfunkel+and+Oates+-+4+Albums+%5B320+CBR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c0dd6a57150ac062247165d4d532bb187fbd9e6","infoHashBuffer":{"type":"Buffer","data":[140,13,214,165,113,80,172,6,34,71,22,93,77,83,43,177,135,251,217,230]},"announce":[],"urlList":[]}}