{"title":"Heterogeneous Catalysis at Nanoscale for Energy Applications","uid":15878010,"size":28146534,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8c425ca3191a95de2d42aca3207f458c0f9bb90b&amp;dn=Heterogeneous+Catalysis+at+Nanoscale+for+Energy+Applications&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"clouderone","files":1,"time":1474550783,"description":"Heterogeneous Catalysis at Nanoscale for Energy Applications - F. Tao et al. (Wiley, 2015).pdf\r\n\r\nThis book presents both the fundamentals concepts and latest achievements of a field that is growing in importance since it represents a possible solution for global energy problems.  It focuses on an atomic-level understanding of heterogeneous catalysis involved in important energy conversion processes. It presents a concise picture for the entire area of heterogeneous catalysis with vision at the atomic- and nano- scales, from synthesis, ex-situ and in-situ characterization, catalytic activity and selectivity, to mechanistic understanding based on experimental exploration and theoretical simulation.\r\n\r\nThe book:\r\n\r\nAddresses heterogeneous catalysis, one of the crucial technologies employed within the chemical and energy industries\r\nPresents the recent advances in the synthesis and characterization of nanocatalysts as well as a mechanistic understanding of catalysis at atomic level for important processes of energy conversion\r\nProvides a foundation for the potential design of revolutionarily new technical catalysts and thus the further development of efficient technologies for the global energy economy\r\nIncludes both theoretical studies and experimental exploration\r\nIs useful as both a textbook for graduate and undergraduate students and a reference book for scientists and engineers in chemistry, materials science, and chemical engineering","torrent":{"xt":"urn:btih:8c425ca3191a95de2d42aca3207f458c0f9bb90b","amp;dn":"Heterogeneous+Catalysis+at+Nanoscale+for+Energy+Applications","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c425ca3191a95de2d42aca3207f458c0f9bb90b","infoHashBuffer":{"type":"Buffer","data":[140,66,92,163,25,26,149,222,45,66,172,163,32,127,69,140,15,155,185,11]},"announce":[],"urlList":[]}}