{"title":"Fra Lippo Lippi-Essential-Essence &amp; Rare","uid":5270390,"size":188386920,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8ce98025e8807a9ee9d2134252ae76e56e2a3d21&amp;dn=Fra+Lippo+Lippi-Essential-Essence+%26+Rare&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"fanciz","files":-1,"time":1263036326,"description":"Biography by Michael Sutton \nThe Norwegian band Fra Lippo Lippi swam in the depths of despair before diving into pop and jazz. Per Oystein Sorensen (vocals, synthesizer, keyboards), Rune Kristoffersen (guitar, bass, keyboards, piano), and Morten Sjoberg (drums, keyboards) formed Fra Lippo Lippi in 1978. Fra Lippo Lippi enveloped their first album, In Silence, with ominous bass lines, death-march percussion, pensive keyboards, and sinister, indecipherable vocals. However, by 1983's Small Mercies, Sorensen's pop background helped the group to become increasingly melodic. In 1985, Fra Lippo Lippi signed with Virgin Records in the U.K., releasing their third album, Songs. Fra Lippo Lippi jettisoned the gloom of their earlier efforts on Songs, experimenting with synth-pop and romantic balladry powered by Kristoffersen's piano. The transformation enabled the group to achieve minor chart success in England and Canada, but in the Philippines many of their singles became staples on the country's new wave radio stations. Tracks such as &quot;The Distance Between Us&quot; and &quot;Come Summer&quot; topped request lines. When the jazz-inflected Light and Shade was released in 1987, Fra Lippo Lippi had become superstars in the Philippines, much to the band's surprise. Largely unknown throughout most of the world, Fra Lippo Lippi performed to sold-out audiences of thousands in Manila, Philippines, in 1989. Fra Lippo Lippi released two more albums, 1989's The Colour Album and 1991's Dreams, before the lack of commercial success forced the group into indefinite hiatus. Since Fra Lippo Lippi's departure from the recording studio, Kristoffersen released two instrumental albums, Elephant Song and Monolight, and started his own label, Rune Grammofon. Sorensen has worked with fellow Norwegian artist Trine Rein. \n\nBitrate: 320kbps\n\n\nTrack Listings\n1. Angel  \n2. Crash of Light  \n3. Home  \n4. Light and Shade  \n5. Crazy Wisdom  \n6. Distance Between Us  \n7. Regrets  \n8. Stitches and Burns  \n9. Should Have to Be Like That  \n10. Some People  \n11. Everytime I See You  \n12. Beauty and Madness  \n13. Coming Home  \n14. Come Summer  \n15. Fade Away [Live]  \n16. Distance Between Us [Live]  \n17. Shouldn't Have to Be Like That [Live]  \n18. Everytime I See You [Live]  \n","torrent":{"xt":"urn:btih:8ce98025e8807a9ee9d2134252ae76e56e2a3d21","amp;dn":"Fra+Lippo+Lippi-Essential-Essence+%26+Rare","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ce98025e8807a9ee9d2134252ae76e56e2a3d21","infoHashBuffer":{"type":"Buffer","data":[140,233,128,37,232,128,122,158,233,210,19,66,82,174,118,229,110,42,61,33]},"announce":[],"urlList":[]}}