{"title":"Pharmacology for Nurses, A Pathophysiologic Approach, 4E [PDF] [","uid":10162405,"size":35955005,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8d03c0d76caf3e41df1361044413b37f8b74734f&amp;dn=Pharmacology+for+Nurses%2C+A+Pathophysiologic+Approach%2C+4E+%5BPDF%5D+%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"0xmovva","files":-1,"time":1400316729,"description":"Author: Michael Adams, Leland Holland, Carol Urban \nPaperback: 944 pages\nPublisher: Prentice Hall; 4 edition (February 1, 2013)\nLanguage: English\nISBN-10: 0133026183\nISBN-13: 978-0133026184\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n___________________________________________________________________________________\n\n\nThis up-to-date text helps nursing students master pharmacology by tightly linking it to therapeutic goals and patient wellness. Organized by body systems (units) and diseases (chapters), PHARMACOLOGY FOR NURSES: A PATHOPHYSIOLOGIC APPROACH, 4/e provides complete information on the drug classifications used to treat each disease class. Students can easily locate all relevant anatomy, physiology, pathology, and pharmacology in the same chapter where each drug is discussed. Exclusive Nursing Process Focus features clearly and concisely relates pharmacotherapy to patient assessment, nursing diagnoses, planning patient outcomes, implementing patient-centered care, and evaluating the outcomes. This new Fourth Edition links pharmacology to patient care through exceptionally accurate, attractive graphics, rich media resources, extensive self-assessment tools, and features covering complementary medicine; diverse patient/lifestyle considerations; and evidence-based practice. It has been thoroughly updated to reflect current pharmacologic drugs, drug classes, processes, mechanisms, and warnings; and the newest QSEN competencies and NCLEX question formats.","torrent":{"xt":"urn:btih:8d03c0d76caf3e41df1361044413b37f8b74734f","amp;dn":"Pharmacology+for+Nurses%2C+A+Pathophysiologic+Approach%2C+4E+%5BPDF%5D+%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d03c0d76caf3e41df1361044413b37f8b74734f","infoHashBuffer":{"type":"Buffer","data":[141,3,192,215,108,175,62,65,223,19,97,4,68,19,179,127,139,116,115,79]},"announce":[],"urlList":[]}}