{"title":"Trine.2.Complete.Story-SKIDROW","uid":8552615,"size":3204517483,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8d23524a54aa5307cef85e431f127d68759d8f9f&amp;dn=Trine.2.Complete.Story-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"Mr.Stifmeister","files":-1,"time":1370686214,"description":"\nS  K  I  D  R  O  W\n.the leading force.\n\nproudly presents\nTrine 2: Complete Story (c) Frozenbyte\n\n08-06-2013......Release Date - Protection.................Steam\nAction.............Game Type - Disk(s)....................1 DVD\n\nRELEASE NOTES\n\nTrine 2 is a sidescrolling game of action, puzzles and platforming\nwhere you play as one of Three Heroes who make their way through\ndangers untold in a fantastical fairytale world.\n\nJoin Amadeus the Wizard, Pontius the Knight and Zoya the Thief in their\nadventure full of friendship, magic and betrayal.\n\nTrine 2: Complete Story fully integrates the Goblin Menace expansion\ncampaign and the all-new unlockable Dwarven Caverns level into one\nmighty fairytale. All owners of Trine 2: Goblin Menace are\nautomatically upgraded to the Complete Story edition.\n\nFeatures:\n\nComplete Story edition features the all-new unlockable Dwarven Caverns\nlevel that takes our heroes on a journey through deep and dark\nlava-filled tunnels resonating with ancient legends\n\n20 levels chock-full of adventure, physics-based puzzles, hazards,\nenemies and contraptions.\n\n3 Heroes  Amadeus the Wizard, Pontius the Knight and Zoya the Thief,\neach with their own skills  and personalities charming and otherwise\n\nChoose new skills to aid the heroes in their quest fight dragon fire\nwith fire arrows or turn your goblin enemies to ice, fly across chasms\nwith the Kitesail Shield, levitate monsters to great heights and then\ntrap them in a box, or slow down the game world with the time-bending\ngravity bubble\n\nTravel through beautiful vistas and environments (sometimes using\nextremely unreliable methods of transportation), including a castle by\nthe treacherous sea, a burning desert, snowy ice mountains, all the\nway to the insides of a giant worm\n\nAccessible for both casual and core gamers\n\nOnline and local co-op with up to three players\n\nSave anywhere to play as long or short sessions as you like and use the\nUnlimited Character Mode and Game for additional replay value\n\nSuperb graphics with next-gen visuals use impressive technical effects,\nimmerse yourself in the fantastical fairytale world full of magic and\nwonder\n\nHidden collectibles for extra adventuring\n\nFun and challenging achievements to unlock\n\nAmazing 27-track soundtrack composed by the acclaimed Ari Pulkkinen\n\nFull language support for English, French, German and Spanish, and\noptional subtitling for more than 10 languages\n\nSupports NVIDIA 3D Vision\n\nINSTALL NOTES\n\n1. Unpack the release\n2. Mount or burn image\n3. Install\n4. Copy the cracked content from the SKIDROW folder and into the main\ninstall folder and overwrite\n5. Block the game in your firewall and mark our cracked content as\nsecure/trusted in your antivirus program\n6. Play the game\n7. Support the companies, which software you actually enjoy\n\nADDITIONAL NOTES\n\nYou set game language in the games launcher -)\n\nThis is a complete new version of Trine 2 with new levels and story\n\nGREETINGS\n\nTo all friends of the family and honorable rival groups\n\nascii art by the\ngodlike &amp; terrific duo\nmalodix  irokos\ntitan artdivision\n\n","torrent":{"xt":"urn:btih:8d23524a54aa5307cef85e431f127d68759d8f9f","amp;dn":"Trine.2.Complete.Story-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d23524a54aa5307cef85e431f127d68759d8f9f","infoHashBuffer":{"type":"Buffer","data":[141,35,82,74,84,170,83,7,206,248,94,67,31,18,125,104,117,157,143,159]},"announce":[],"urlList":[]}}