{"title":"You Have a Brain: A Teen's Guide to .. Ben Carson Audiobook MP3","uid":11694110,"size":178228077,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8d36185223e349c7aea7abd5eb7adc5083057ff4&amp;dn=You+Have+a+Brain%3A+A+Teen%27s+Guide+to+..+Ben+Carson+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"Squiddy82","files":23,"time":1423645450,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nYou Have a Brain: A Teen's Guide to T.H.I.N.K. B.I.G.\n\nWritten by: Ben Carson, M.D., Gregg Lewis, Deborah Shaw Lewis\nNarrated by: Dan John Miller\nLength: 6 hrs and 8 mins\nUnabridged Audiobook\nRelease Date:02-03-15\n\nThroughout his life renowned neurosurgeon Dr. Benjamin Carson has needed to overcome many obstacles: his father leaving the family, being considered stupid by his classmates in grade school, growing up in inner-city Detroit, and having a violent temper. But Dr. Carson didn't let his circumstances control him and instead discovered eight principles that helped shape his future.\nIn You Have a Brain: A Teen's Guide to T.H.I.N.K. B.I.G., Dr. Carson unpacks the eight important parts of thinking big--talent, honesty, integrity, being nice, knowledge, books, in-depth learning, and God--and presents the stories of people who demonstrated those things in his life. By applying the idea of T.H.I.N.K. B.I.G. to your life, and by looking at those around you as well, you too can overcome obstacles and work toward achieving your dreams","torrent":{"xt":"urn:btih:8d36185223e349c7aea7abd5eb7adc5083057ff4","amp;dn":"You+Have+a+Brain%3A+A+Teen%27s+Guide+to+..+Ben+Carson+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d36185223e349c7aea7abd5eb7adc5083057ff4","infoHashBuffer":{"type":"Buffer","data":[141,54,24,82,35,227,73,199,174,167,171,213,235,122,220,80,131,5,127,244]},"announce":[],"urlList":[]}}