{"title":"Max Payne 1, working on windows 8.1","uid":10796611,"size":936044220,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8d57069b8e2f7655328091188e3e81068d111302&amp;dn=Max+Payne+1%2C+working+on+windows+8.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"PiratenisGod","files":-1,"time":1408300576,"description":"Plot:\n\nIn December 2001, as New York City is enduring the tail end of the worst blizzard in the history of the city, Max Payne, a renegade DEA agent and former NYPD detective, is standing at the top of a skyscraper with a sniper rifle in his hands, smiling, as police units arrive on the scene to arrest him. He then experiences flashbacks from three years ago and the last two days he experienced.\n\nThree years earlier, on August 22nd 1998, Max was working as a regular NYPD detective, having just finished his day's work. His longtime friend and DEA agent, Alex Balder, invites him to transfer into the DEA, but Max declines the offer, wanting to focus on his full-time life with his wife, Michelle, and their newborn daughter, Rose. As he returns to his house in New Jersey, he finds that a trio of junkies had broken into his house, all addicted on a brand new designer drug, Valkyr. Max receives a call from a mysterious woman who seems pleased at the trouble in the house and refuses to call for help. Max rushes to aid his family and kill the junkies, but is too late as he finds his wife shot dead, and his daughter slaughtered. After his family's funeral, Payne accepts Alex's offer, and transfers to the DEA at his own request to stop the spreading of the drugs.\n\n\n\n\n\n\n\n\nTo run the game:\n\n1:Extract the files to a map and rename the map to for example MaxPayne 1.\n\n2:Make sure MaxPayne.exe is set to compatibility windows 98/windows Me by right clicking and select properties.\n\nNow you are done and now it's just to get started by clicking MaxPayne.exe\n\nDon't forget to seed.\n","torrent":{"xt":"urn:btih:8d57069b8e2f7655328091188e3e81068d111302","amp;dn":"Max+Payne+1%2C+working+on+windows+8.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d57069b8e2f7655328091188e3e81068d111302","infoHashBuffer":{"type":"Buffer","data":[141,87,6,155,142,47,118,85,50,128,145,24,142,62,129,6,141,17,19,2]},"announce":[],"urlList":[]}}