{"title":"Echoes of Sherlock Holmes - Laurie R. King-Leslie S. Klinger [EN","uid":16025064,"size":13124664,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8d7124285c17463cb4cf91f1c6726941bd36a33c&amp;dn=Echoes+of+Sherlock+Holmes+-+Laurie+R.+King-Leslie+S.+Klinger+%5BEN&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"perfect_stan","files":1,"time":1476377145,"description":"Echoes of Sherlock Holmes: Stories Inspired by the Holmes Canon by Laurie R. King, Leslie S. Klinger (Editors)\r\nEnglish | 2016 | Mystery &amp; Thriller | 12.5 MB\r\n\r\n\r\nIn this follow-up to the acclaimed In the Company of Sherlock Holmes, expert Sherlockians Laurie King and Les Klinger put forth the question: What happens when great writers/creators who are not known as Sherlock Holmes devotees admit to being inspired by Conan Doyle stories? While some are highly-regarded mystery writers, others are best known for their work in the fields of fantasy or science fiction. All of these talented authors, however, share a great admiration for Arthur Conan Doyle and his greatest creations, Sherlock Holmes and Dr. Watson.\r\nTo the editors’ great delight, these stories go in many directions. Some explore the spirit of Holmes himself; others tell of detectives themselves inspired by Holmes’s adventures or methods. A young boy becomes a detective; a young woman sharpens her investigative skills; an aging actress and a housemaid each find that they have unexpected talents. Other characters from the Holmes stories are explored, and even non-Holmesian tales by Conan Doyle are echoed. The variations are endless!\r\nAlthough not a formal collection of new Sherlock Holmes stories—however some do fit that mold—instead these writers were asked to be inspired by the Conan Doyle canon. The results are breathtaking, for fans of Holmes and Watson as well as readers new to Doyle’s writing—indeed, for all readers who love exceptional storytelling.\r\n\r\nEnjoy and please SEED!!!","torrent":{"xt":"urn:btih:8d7124285c17463cb4cf91f1c6726941bd36a33c","amp;dn":"Echoes+of+Sherlock+Holmes+-+Laurie+R.+King-Leslie+S.+Klinger+%5BEN","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d7124285c17463cb4cf91f1c6726941bd36a33c","infoHashBuffer":{"type":"Buffer","data":[141,113,36,40,92,23,70,60,180,207,145,241,198,114,105,65,189,54,163,60]},"announce":[],"urlList":[]}}