{"title":"DmC Devil May Cry 5 (2013) [PCDVD][MULTi10]","uid":8064577,"size":9030516736,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8dc1a95e548905351d61a7cde23c678534a31e2a&amp;dn=DmC+Devil+May+Cry+5+%282013%29+%5BPCDVD%5D%5BMULTi10%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":6,"uploader":"gatasalvaje","files":-1,"time":1359145880,"description":"DmC Devil May Cry 5 (2013) [PCDVD][MULTi10]\n &lt;a href=&quot;\nhttp://es.ign.com/spiele/134823/DmC/PC&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://es.ign.com/spiele/134823/DmC/PC&lt;/a&gt; &lt;a href=&quot;\nhttp://www.3djuegos.com/13834/dmc/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.3djuegos.com/13834/dmc/&lt;/a&gt;\n\nDate Posted: January 25, 2013\nGenre: Action / Person 3-d\nDeveloper: Ninja Theory\nPublished by: Capcom\nPlatform: PC\nPublication Type: License (Rip)\nLanguage: English / Russian / German / French / Italian / Spanish / Polish / Portuguese / Dutch / Japanese\nSound language: English / German / French / Italian / Spanish / Japanese\nTablet: 3DM\nSize: 8.41 GB\n\nAs retell stories translation of Dante personality in contemporary reality, DmC Devil May Cry â„¢, a preserved environment, flexible combat confident protagonist that have defined the characteristics of the cult game series, and brings something of darkness and cruelty. Dante in DmC - boy, does not recognize the authority of another person, and society as a whole. Dante knows he is not a man, but not of the evil spirits that haunted him throughout his life. Sandwiched between the worlds, it feels like an outcast. With his twin brother Vergil, the leader of the opposition &quot;Order&quot;, Dante knows it means to be a devil and an angel offspring. This dual personality affects the mechanics of the game, giving Dante the opportunity to use the skills of both parties at any time, on the fly leaf Rebel reincarnated, that changes as the battle and movement. As partners in DmC Capcom chose British study Ninja Theory is known for creating compelling characters action and plot together with high quality material. Ninja Theory connection professionalism and unparalleled experience in creating games Capcom melee oriented to provide a new set of traditions of fidelity to sell over 11 million copies and beloved fans of Devil May Cry series, and take her to a new level of cinematic.\n\nFeatures\n- Survive Limbaugh - Limbaugh is a living city, eager to kill Dante. The world will change before your eyes and try to hinder or even destroy Dante. Our hero will have to master the demonic forces to change the world to their liking Limbaugh, angelic honing the skills to succeed in this hostile environment iskruchennoy. - Who is Dante? - Research the history of personality in the retelling of Dante, engrossed in a fascinating plot, where there was a place like brand new characters and old friends, as Vergil, Dante's twin brother. - Uncontrolled action - intense mixture became a legendary combat weapons and firearms will be back and will expand the angelic and demonic powers and varieties of weapons, created with the sole purpose of bringing it all back to hell evil and cynical panache. - Increased cost of production - Ninja Theory studio uses the latest advances in performance capture technology to achieve the level of detail of the characters, storytelling and cutscenes beautifully complementing the high level DmC warhead.\n\nSystem Requirements:\nOperating System: Windows Â® XP / Windows Vista Â® / Windows Â® 7 / Windows Â® 8\nProcessor: Intel (R) Core (TM) 2 Duo processor with a clock speed of 2.4 GHz or higher, AMD Athlon (TM) X2 processor with a clock speed of 2.8 GHz or higher\nRAM: 2 GB\nVideo Card: NVIDIA (R) GeForce (R) 8800GTS or better, ATI Radeon (TM) HD 3850 or better\nFree space: 9 GB\n\nGame Info\n- Version 1.0, January 25, 2013, is identical to an activated licensed copy of the game.\n- No need to unpack the game in Phoenix! Everything is installed and updated.\n- Current DLC:\nÂ»Suit Package\n\nInstallation\n1. Download game\n2. Download crack at the top 3DM\n3. The Devil.May.Cry.5.crack.3dm file folder in the game folder  Binaries  Win32\n4. Play\n","torrent":{"xt":"urn:btih:8dc1a95e548905351d61a7cde23c678534a31e2a","amp;dn":"DmC+Devil+May+Cry+5+%282013%29+%5BPCDVD%5D%5BMULTi10%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8dc1a95e548905351d61a7cde23c678534a31e2a","infoHashBuffer":{"type":"Buffer","data":[141,193,169,94,84,137,5,53,29,97,167,205,226,60,103,133,52,163,30,42]},"announce":[],"urlList":[]}}