{"title":"Jean-Jacques Rousseau: Philosophical Works (6 books)","uid":8921517,"size":94423723,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8dc4c4f458c8c3b0eecc76910538502931deec71&amp;dn=Jean-Jacques+Rousseau%3A+Philosophical+Works+%286+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"workerbee","files":-1,"time":1379264788,"description":"\nJEAN-JACQUES ROUSSEAU (1712-1778) was a Genevan philosopher and writer of the 18th-century. His political philosophy influenced the French Revolution as well as the overall development of modern political, sociological and educational thought.\n\nForemost among the books included here are Rousseau's novel Ã‰MILE: or, ON EDUCATION, a treatise on the education of the whole person for citizenship (&quot;the best and most important of all my writings&quot;); JULIE, or THE NEW HELOISE, a sentimental novel that was central to the development of romanticism in fiction; the CONFESSIONS, which initiated the genre of modern autobiography; and THE SOCIAL CONTRACT and DISCOURSE ON THE ORIGIN OF INEQUALITY, both cornerstones of modern political and social thought, and here presented in two translations.\n\n\nAll the following are PDFs except THE ESSENTIAL WRITINGS (epub):\n\n* BASIC POLITICAL WRITINGS (Hackett, 1987).  Translated and edited by Donald A. Cress; Introduced by Peter Gay.\n\n* COLLECTED WRITINGS, VOL. 5: The Confessions and Correspondence, Including the Letters to Malesherbes (University Press of New England, 1995).  Translated by Christopher Kelly; edited by Christopher Kelly, Roger D. Masters, and Peter G. Stillman.\n\n* COLLECTED WRITINGS, VOL. 12: Autobiographical, Scientific, Religious, Moral, and Literary Writings (University Press of New England, 2007).  Translated and edited by Christopher Kelly.\n\n* Ã‰MILE, or ON EDUCATION (Basic Books, 1979).  Introduction, Translation, and Notes by Allan Bloom.\n\n* THE ESSENTIAL WRITINGS OF JEAN-JACQUES ROUSSEAU (Modern Library, 2013).  Translated by Peter Constantine; edited with an Introduction by Leo Damrosch. (EPUB)\n\n* THE SOCIAL CONTRACT &amp; THE FIRST AND SECOND DISCOURSES (Yale University Press, 2002).  Edited with an Introduction by Susan Dunn, with contributions by Gita May, Robert N. Bellah, David Bromwich and Conor Cruise O'Brien.\n","torrent":{"xt":"urn:btih:8dc4c4f458c8c3b0eecc76910538502931deec71","amp;dn":"Jean-Jacques+Rousseau%3A+Philosophical+Works+%286+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8dc4c4f458c8c3b0eecc76910538502931deec71","infoHashBuffer":{"type":"Buffer","data":[141,196,196,244,88,200,195,176,238,204,118,145,5,56,80,41,49,222,236,113]},"announce":[],"urlList":[]}}