{"title":"Jean.Luc.Godard.Sympathy.for.the.Devil.(1968)","uid":4149305,"size":1049680229,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8dd309c7a4fa8078ab81ff12baae0bdafbff6d7f&amp;dn=Jean.Luc.Godard.Sympathy.for.the.Devil.%281968%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":2,"uploader":"OnTheQT","files":2,"time":1208864880,"description":"File Size (in bytes) ..: 1,049,677,608\nRuntime (# of frames) .: 01:37:10 (145,747 frames)\n\nVideo Codec ...........: h264 ITU H.26n\nFrame Size ............: 720x544\nFPS ...................: 25\nVideo Bitrate .........: 1304 kb/s\nBits per Pixel ........: 0.133 bpp\n\nAudio Codec ...........: 0x0055(MP3) ID&amp;#039;d as MPEG-1 Layer 3\nSample Rate ...........: 44100 Hz\nAudio bitrate .........: 128 kb/s (64/ch, stereo) CBR audio\nInterleave ............: 78 ms\nNo. of audio streams ..: 1\n\n---------------------------\n\nJean-Luc Godard&amp;#039;s Sympathy for the Devil, also known as One Plus One, uses both documentary and staged sequences, alternating between an inside look at a rock band&amp;#039;s recording process and reflections on contemporary politics and aesthetics. One half of the film focuses on the Rolling Stones, as they rehearse and ultimately record the song that would become &quot;Sympathy for the Devil.&quot; By presenting repeated takes of the entire composition, the film allows the viewer to witness the progressive evolution of the song from its original, slower conception to the more percussive version that became the final recording. The other half of the film -- which is occasionally accompanied by the song -- presents a series of sequences dealing with issues like black power, pornography, racism, and Marxism, amongst others. These sequences, which often focus on a group of revolutionary youth in Paris, provide a chance for Godard to inject political commentary and meta-fictional musings on the nature of cinema. These more cerebral scenes serve as counterpoint to the direct presentation of the creative process seen in the Stones&amp;#039; studio sessions, and provide oblique commentary on the political meanings of popular music.\n\n----------------------\n\n*********************************** FREAKYFLICKS ************************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n\n&amp;#039;If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE&amp;#039;","torrent":{"xt":"urn:btih:8dd309c7a4fa8078ab81ff12baae0bdafbff6d7f","amp;dn":"Jean.Luc.Godard.Sympathy.for.the.Devil.%281968%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8dd309c7a4fa8078ab81ff12baae0bdafbff6d7f","infoHashBuffer":{"type":"Buffer","data":[141,211,9,199,164,250,128,120,171,129,255,18,186,174,11,218,251,255,109,127]},"announce":[],"urlList":[]}}