{"title":"Lonely Planet Greek Islands (Travel Guide)(ePUB,Retail)","uid":10866189,"size":78862017,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8de70c3cac2a4c2dfb27aa4118c7a32c580b61f5&amp;dn=Lonely+Planet+Greek+Islands+%28Travel+Guide%29%28ePUB%2CRetail%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"32Skulls","files":-1,"time":1408918598,"description":"                      â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ \n\n\nLonely Planet: The world's leading travel guide publisher\n\nLonely Planet Greek Islands is your passport to all the most relevant and up-to-date advice on what to see, what to skip, and what hidden discoveries await you. Wander along cobbled footpaths, laze on isolated sandy coves and witness some of the best sunsets in the world; all with your trusted travel companion. Get to the heart of the GreekIslands and begin your journey now!\n\nInside Lonely Planet's Greek Islands Travel Guide:\n\n- Colour maps and images throughout\n- Highlights and itineraries show you the simplest way to tailor your trip to your own personal needs and interests\n- Insider tips save you time and money, and help you get around like a local, avoiding crowds and trouble spots\n- Essential info at your fingertips - including hours of operation, phone numbers, websites, transit tips, and prices\n- Honest reviews for all budgets - including eating, sleeping, sight-seeing, going out, shopping, and hidden gems that most guidebooks miss\n- Cultural insights give you a richer and more rewarding travel experience - including history, art, literature, cinema, music, architecture, politics, landscapes, wildlife, cuisine and customs\n- Free, convenient pull-out Athens map (included in print version), plus over 105 colour maps\n- Useful features - including Travel with Children, Month by Month (annual festival calendar) and Island Hopping\n- Coverage of Athens, Crete, the Ionian Islands, the Cyclades, Santorini, the Saronic Gulf Islands, Dodecanese, the Northeastern Aegean Islands, Evia, the Sporades, and more\n\nThe Perfect Choice: Lonely Planet Greek Islands, our most comprehensive guide to the Greek Islands, is perfect for those planning to both explore the top sights and take the road less travelled.\n\nLooking for more coverage? Check out Lonely Planet's Greece guide for a comprehensive look at what the whole country has to offer, or Lonely Planet's Discover Greece, a photo-rich guide to the region's most popular attractions.\n\nLooking for a guide focused on only one or a few islands in this destination? Check out Lonely Planet's Crete for a comprehensive look at all the island has to offer.\n\nAuthors: Written and researched by Lonely Planet, Korina Miller, Alexis Averbuck, Michael S Clark, Victoria Kyriakopoulos, Andrea Schulte-Peevers and Richard Waters.\n\nAbout Lonely Planet: Started in 1973, Lonely Planet has become the world's leading travel guide publisher with guidebooks to every destination on the planet, as well as an award-winning website, a suite of mobile and digital travel products, and a dedicated traveller community. Lonely Planet's mission is to enable curious travellers to experience the world and to truly get to the heart of the places they find themselves in.\n\nAbout Lonely Planet: Started in 1973, Lonely Planet has become the world's leading travel guide publisher with guidebooks to every destination on the planet, as well as an award-winning website, a suite of mobile and digital travel products, and a dedicated traveller community. Lonely Planet's mission is to enable curious travellers to experience the world and to truly get to the heart of the places they find themselves in.\n\nTripAdvisor Travelers' Choice Awards 2012 and 2013 winner in Favorite Travel Guide category\n\n'Lonely Planet guides are, quite simply, like no other.' -The New York Times\n\n'Lonely Planet. It's on everyone's bookshelves; it's in every traveller's hands. It's on mobile phones. It's on the Internet. It's everywhere, and it's telling entire generations of people how to travel the world.' -Fairfax Media (Australia)\n\n\n\n\nBy Korina Miller\nPublished by Lonely Planet in 2014\nEPUB, Retail, 584 pages, English ","torrent":{"xt":"urn:btih:8de70c3cac2a4c2dfb27aa4118c7a32c580b61f5","amp;dn":"Lonely+Planet+Greek+Islands+%28Travel+Guide%29%28ePUB%2CRetail%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8de70c3cac2a4c2dfb27aa4118c7a32c580b61f5","infoHashBuffer":{"type":"Buffer","data":[141,231,12,60,172,42,76,45,251,39,170,65,24,199,163,44,88,11,97,245]},"announce":[],"urlList":[]}}