{"title":"Glastonbury, the Templars and the Sovran Cloth","uid":15770519,"size":2529095,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8df3ea2cc0e6d08a42d44034f801f5242932eb91&amp;dn=Glastonbury%2C+the+Templars+and+the+Sovran+Cloth&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"marty14","files":1,"time":1473199977,"description":"Glastonbury, the Templars and the Sovran Cloth: A New Perspective on the Grail Legends - Juliet Faith [epub]\r\n\r\nShedding new light on the Grail stories and the arrival of Christianity to Somerset, this book illustrates important links between Glastonbury and the Celtic settlement at Old Lammana in Cornwall; and examines old tales of an object of great importance—known as &quot;the Sovran cloth&quot;—secretly hidden at both places.\r\n\r\nThe author reveals that Henri de Blois, Abbot of Glastonbury, assisted in the transmission of the Grail stories, and that his family line were in possession of the Shroud and first exhibited it at Lirey in France in 1356. She also examines why there was such great importance placed on oral traditions in ancient times, and what importance these traditions hold for present-day historians.\r\n\r\nFinally, recent examination of the Templecombe panel reveals why it is believed the Templars may have brought the Shroud to England for safekeeping in 1307. Richly illustrated and compiled using original research, this book is sure to appeal to everyone interested in the Knights Templar and their Somerset history","torrent":{"xt":"urn:btih:8df3ea2cc0e6d08a42d44034f801f5242932eb91","amp;dn":"Glastonbury%2C+the+Templars+and+the+Sovran+Cloth","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8df3ea2cc0e6d08a42d44034f801f5242932eb91","infoHashBuffer":{"type":"Buffer","data":[141,243,234,44,192,230,208,138,66,212,64,52,248,1,245,36,41,50,235,145]},"announce":[],"urlList":[]}}