{"title":"Calculus, 9th Edition by Ron Larson, Bruce H. Edwards","uid":6160755,"size":41685992,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8e625e89be5da115fced8fd73063b52a19436621&amp;dn=Calculus%2C+9th+Edition+by+Ron+Larson%2C+Bruce+H.+Edwards&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"abuel-3bbas","files":1,"time":1297204404,"description":"Product Description\nThe Larson CALCULUS program has a long history of innovation in the calculus market. It has been widely praised by a generation of users for its solid and effective pedagogy that addresses the needs of a broad range of teaching and learning styles and environments. Each title is just one component in a comprehensive calculus course program that carefully integrates and coordinates print, media, and technology products for successful teaching and learning.\n\nAbout the Author\nRon Larson received his Ph.D. in mathematics from the University of Colorado and has been a professor of mathematics at The Pennsylvania State University since 1970. He has pioneered the use of multimedia to enhance the learning of mathematics, having authored over 30 software titles since 1990. Dr. Larson has also conducted numerous seminars and in-service workshops for math teachers around the country about using computer technology as a teaching tool and motivational aid. His INTERACTIVE CALCULUS (a complete text on CD-ROM) received the 1996 Texty Award for the most innovative mathematics instructional material at the college level, and was the first mainstream college textbook to be offered on the Internet.\n\nBruce Edwards has been a mathematics professor at the University of Florida since 1976. Dr. Edwards majored in mathematics at Stanford University, graduating in 1968. He then joined the Peace Corps and spent four years teaching math in Colombia, South America. He returned to the United States and Dartmouth in 1972, and he received his PhD. in mathematics in 1976. Dr. Edwards' research interests include the area of numerical analysis, with a particular interest in the so-called CORDIC algorithms used by computers and graphing calculators to compute function values. His hobbies include jogging, reading, chess, simulation baseball games, and travel.\n\nProduct Details\nHardcover: 1328 pages\nPublisher: Brooks Cole; 9 edition (January 16, 2009)\nLanguage: English\nISBN-10: 0547167024\nISBN-13: 978-0547167022","torrent":{"xt":"urn:btih:8e625e89be5da115fced8fd73063b52a19436621","amp;dn":"Calculus%2C+9th+Edition+by+Ron+Larson%2C+Bruce+H.+Edwards","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e625e89be5da115fced8fd73063b52a19436621","infoHashBuffer":{"type":"Buffer","data":[142,98,94,137,190,93,161,21,252,237,143,215,48,99,181,42,25,67,102,33]},"announce":[],"urlList":[]}}