{"title":"Jay Abraham - Abraham Factor Seminar [19 DVDs + 32 CDs + 28 PDFs","uid":11025862,"size":11724385271,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8eb70b7108a9e0520612a86c99c25954d06e88c3&amp;dn=Jay+Abraham+-+Abraham+Factor+Seminar+%5B19+DVDs+%2B+32+CDs+%2B+28+PDFs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":6,"uploader":"tayshyan","files":339,"time":1410659312,"description":"There are three types of entrepreneurs in the business world.\n\n1. The people who are constantly making things happen\n2. The ones who watch things happenÂ¦and\n3. The people things keep happening to\n\nNo matter which of the three groups you may currently fall into, one thing is certain: You want your business to do more, have more, reach farther and achieve a lot more financial and business success.\n\nThe problem is at all three places on the entrepreneurial continue most people don't know how to move up to the higher (let alone the HIGHEST) levels. That's where I can help.\n\nIf you are a mover, shaker, someone who's always committed to action, achievement and maximizing opportunity I can show you how to broaden your scope of opportunities AND see your business at a higher, broader sense of what's possible.\n\nIf you're someone who tends to stagnate, contemplate and rarely initiate business growth activities or marketing expansion actions ----You need me to turn you from a mere business custodian into a business growth maximizer.\n\nJust by shifting your thinking and focus, your business can quickly advance upward and forward at a rapid rate.\n\nFINALLY if you're someone who operates your business timidly, reactively, non-responsivelyÂ¦OR you feel more like a spectator up in the stands than a player on the business field---I can totally change (no, make that totally transform) your thinking, actions and transactional capability.\n\nGoing from mediocrity to greatness as a business builder is probably the most exciting, fulfilling and engaging move you could make.\n\nIt will animate your business spirit. It will stimulate your intellect. It will re-invigorate your entrepreneurial side and get it going and growing --for the first time in a long time (or, perhaps, for the first time EVER). ","torrent":{"xt":"urn:btih:8eb70b7108a9e0520612a86c99c25954d06e88c3","amp;dn":"Jay+Abraham+-+Abraham+Factor+Seminar+%5B19+DVDs+%2B+32+CDs+%2B+28+PDFs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8eb70b7108a9e0520612a86c99c25954d06e88c3","infoHashBuffer":{"type":"Buffer","data":[142,183,11,113,8,169,224,82,6,18,168,108,153,194,89,84,208,110,136,195]},"announce":[],"urlList":[]}}