{"title":"ratchet and clank up your arsenal (PS2)","uid":8128709,"size":4379377664,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:8ebc4721ebf5c2f57c1a1875de24b2f602c9edce&amp;dn=ratchet+and+clank+up+your+arsenal+%28PS2%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":4,"uploader":"mindcrasher","files":-1,"time":1360543230,"description":"tory\nThe game opens with Ratchet and Clank finding a news report about Ratchet's home planet, Veldin, which is under attack by an army of aliens named Tyhrranoids.[14] The lead suspect is a mysterious villain by the name of Dr. Nefarious. After they help to defeat the Tyhrranoids on Veldin, the Galactic President tells Ratchet that Captain Qwark, an enemy from the first two games in the series, is the only person to ever have defeated Dr. Nefarious and that Qwark's help is needed to defeat him again. Ratchet finds Qwark on a lone planet, and from a MegaCorp experiment, he has gone senile as he thinks he is a giant monkey, and takes him to the Starship Phoenix, whose commander has been ordered to help Ratchet and Qwark defeat Dr. Nefarious.[15] Qwark creates the &quot;Q-Force&quot;, a group of &quot;elite&quot; people working against Dr. Nefarious, and he assigns Ratchet a new mission to infiltrate Nefarious' base[16] to acquire as much information on Nefarious' plans as possible. They find that Dr. Nefarious is a fan of Secret Agent Clank, Clank's TV show, along with an encrypted star map to the Tyhrranoids' home planet.[17] After the Q-Force destroys a Tyhrranoid base on their home planet, Dr. Nefarious sends the Q-Force a transmission[18] telling them that they won't be able to defeat him, and Al traces the transmission to planet Daxx.","torrent":{"xt":"urn:btih:8ebc4721ebf5c2f57c1a1875de24b2f602c9edce","amp;dn":"ratchet+and+clank+up+your+arsenal+%28PS2%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ebc4721ebf5c2f57c1a1875de24b2f602c9edce","infoHashBuffer":{"type":"Buffer","data":[142,188,71,33,235,245,194,245,124,26,24,117,222,36,178,246,2,201,237,206]},"announce":[],"urlList":[]}}