{"title":"Tigran Hamasyan Aratta Rebirth - Red Hail (2009)","uid":6373642,"size":467293898,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8f04265de28c5c5bd6e9858663c07187dc2b430e&amp;dn=Tigran+Hamasyan+Aratta+Rebirth+-+Red+Hail+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"mariorg","files":-1,"time":1304773336,"description":"Plus Loin Music: PL4510 (distribution: Harmonia Mundi) &lt;a href=&quot;\nhttp://store.harmoniamundi.com/aratta-rebirth-red-hail.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.harmoniamundi.com/aratta-rebirth-red-hail.html&lt;/a&gt;\n\n* Tigran Hamasyan: piano, fender Rhodes, nord electro keybord, fantom x8 synthesizer\n* Areni Agbabian: vocals\n* Nate Wood: drums\n* Ben Wendel: soprano saxophone, tenor saxophone, bassoon, melodica\n* Sam Minaie: acoustic bass, electric bass\n* Charles Altura: guitar (tracks 3, 7 and 11)\n\nAbout Tigran Hamasyan: &lt;a href=&quot;\nhttp://nextbop.com/tigranhamasyan/822&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://nextbop.com/tigranhamasyan/822&lt;/a&gt; &lt;a href=&quot;\nhttp://www.tigranhamasyan.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tigranhamasyan.com/&lt;/a&gt;\n\nReviews\n~~~~~~~ &lt;a href=&quot;\nhttp://www.allmusic.com/album/aratta-rebirth-r1538649&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/album/aratta-rebirth-r1538649&lt;/a&gt;\nby Michael G. Nastos\n\nEmerging keyboardist Tigran Hamasyan is truly a virtuoso performer who minces no\nmusical words, and never holds back on his immense talent. Aratta Rebirth is his\nsecond release as a leader, in this case with the group dubbed Red Hail,\nembracing his Middle Eastern heritage, playing modern jazz based on folk tunes\nthat stretch far beyond their origins. With vocalist Areni Agbabian, Hamasyan\nsomehow conjures up whirling dervish motifs that stagger the imagination while\nalso retaining a soulful quality that suggests seductive late-night scenarios in\nsmoke-filled rooms laced with immediate sexual pleasure references. But it's\nonly marginally about the act of intertwining, and more about the catalyst and\nspark that start fires burning, for Hamasyan's acoustic and electric piano\nplaying is a long fuse that eventually incites the explosive music. Saxophonist\nBen Wendel and drummer Nate Wood are kindling for the roaring flames, with\nbassist Sam Minale chopping up underlying lines that keep the excited heat\nstoked and nourished. There's some stunning music here, starting with the bold\ninventions of the opening track, &quot;Shogher Jan,&quot; an adapted Armenian folk song\nturned into a fiery discourse between Hamasyan's impressively fast and\nspontaneous spiky, complex piano lines and the sidled voice of Agbabian stewed\nin many mixed meters. The title track is a rock-hard, edgy fusion, loud and\nultra-kinetic; &quot;Falling&quot; is similar in beat with some insane Arabic or East\nIndian scatting and a modal jazz segment; while &quot;The Awakening of Mher&quot; is also\nrocked out via Hamasyan's Fender Rhodes, the electric guitar of Charles Altura,\nand Wendel's tenor sax. Six consecutive tracks include Wendel on soprano sax and\nbassoon, including the serene &quot;Love Song,&quot; the piercing &quot;Sibylla&quot; (which is the\nbasis for the following piece, &quot;Corrupt&quot;), and the two-part &quot;Serpentine&quot; and\n&quot;Moneypulated&quot; (starting as a brash electronica-based minimalist directive and\nmerging into Hamasyan's pleasant, echoed Rhodes sans bass). The most innately\nbusy piece is &quot;The Glass-Hearted Queen,&quot; soulful and busy within a kinetic form\nwith Agbabian's wordless vocals, all wrapped in a 9/8 rhythm. Tigran Hamasyan is\nas impressive as any relatively new piano voice like Eldar Djangirov, Vijay\nIyer, or Taylor Eigsti, playing a lot of notes and exhaustive in his\nconcept. This recording, with its world and ethnic fusion approach, sets him\napart from the rest, and like similar artists Rami Khalife and Fahir Atakoglu,\nestablishes new standards, raising the bar very high for new music, while\nHamasyan plays in a league of his own.\n\nRed Hail &lt;a href=&quot;\nhttp://www.citizenjazz.com/Tigran-Hamasyan-Aratta-Rebirth.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.citizenjazz.com/Tigran-Hamasyan-Aratta-Rebirth.html&lt;/a&gt;\nPar Diane Gastellu (fr)","torrent":{"xt":"urn:btih:8f04265de28c5c5bd6e9858663c07187dc2b430e","amp;dn":"Tigran+Hamasyan+Aratta+Rebirth+-+Red+Hail+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f04265de28c5c5bd6e9858663c07187dc2b430e","infoHashBuffer":{"type":"Buffer","data":[143,4,38,93,226,140,92,91,214,233,133,134,99,192,113,135,220,43,67,14]},"announce":[],"urlList":[]}}