{"title":"Eleanor Robson - Handbook Of The History Of Mathematics [2009][A","uid":10090817,"size":14674337,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8f9e9bcf908173d4f05ffe3c868b786d4802416c&amp;dn=Eleanor+Robson+-+Handbook+Of+The+History+Of+Mathematics+%5B2009%5D%5BA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"Anette14","files":-1,"time":1399191831,"description":"Description\nProduct Details\nBook Title: The Oxford Handbook of the History of Mathematics (Oxford Handbooks)\t\nBook Author: Eleanor Robson, Jacqueline Stedall\nSeries: Oxford Handbooks\nHardcover: 800 pages\nPublisher: Oxford University Press (February 18, 2009)\nLanguage: English\nISBN-10: 0199213127\nISBN-13: 978-0199213122\n\n===================================================================================\nBook Description\nPublication Date: February 18, 2009 | ISBN-10: 0199213127 | ISBN-13: 978-0199213122\nThis Handbook explores the history of mathematics under a series of themes which raise new questions about what mathematics has been and what it has meant to practice it. It addresses questions of who creates mathematics, who uses it, and how. A broader understanding of mathematical practitioners naturally leads to a new appreciation of what counts as a historical source. Material and oral evidence is drawn upon as well as an unusual array of textual sources. Further, the ways in which people have chosen to express themselves are as historically meaningful as the contents of the mathematics they have produced. Mathematics is not a fixed and unchanging entity. New questions, contexts, and applications all influence what counts as productive ways of thinking. Because the history of mathematics should interact constructively with other ways of studying the past, the contributors to this book come from a diverse range of intellectual backgrounds in anthropology, archaeology, art history, philosophy, and literature, as well as history of mathematics more traditionally understood.\nThe thirty-six self-contained, multifaceted chapters, each written by a specialist, are arranged under three main headings: 'Geographies and Cultures', 'Peoples and Practices', and 'Interactions and Interpretations'. Together they deal with the mathematics of 5000 years, but without privileging the past three centuries, and an impressive range of periods and places with many points of cross-reference between chapters. The key mathematical cultures of North America, Europe, the Middle East, India, and China are all represented here as well as areas which are not often treated in mainstream history of mathematics, such as Russia, the Balkans, Vietnam, and South America. This Handbook will be a vital reference for graduates and researchers in mathematics, historians of science, and general historians.\n\n===================================================================================\nReview\n&quot;This impressive and ambitious volume is aimed at presenting a panorama of the history of Mathematics on a 5000 years span, across all significant mathematical cultures. This book will constitute an interesting lecture for a wide readership and it is highly recommended.&quot;--Libertas Mathematica&quot;A delightful collection of essays, each of which will most certainly raise more questions in the reader's mind than it answers.&quot;--CHOICE\n\n===================================================================================\nAbout the Authors\nEleanor Robson is a Senior Lecturer in the Department of History and Philosophy of Science at the University of Cambridge and a Fellow of All Souls College, Oxford. She is the author of Mesopotamian mathematics, 2100-1600 BC (1999), Mathematics in Ancient Iraq: A Social History (2008), and many articles on the socio-intellectual history of the cuneiform world. She is co-director of an AHRC-funded project on the geography of knowledge in Assyria and Babylonia.\n\nJacqueline Stedall is Junior Research Fellow in Mathematics at The Queen's College, Oxford. Her research focuses on European mathematics from the 16th century to the 18th with a special interest in the development of algebra. Recent publications include Mathematics Emerging: A Sourcebook, 1540-1900 (2008) and The 'Magisteria magna' of Thomas Harriot (2008, with Janet Beery). She is also editor of the BSHM Bulletin, journal of the British Society of the History of Mathematics.\n===================================================================================","torrent":{"xt":"urn:btih:8f9e9bcf908173d4f05ffe3c868b786d4802416c","amp;dn":"Eleanor+Robson+-+Handbook+Of+The+History+Of+Mathematics+%5B2009%5D%5BA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f9e9bcf908173d4f05ffe3c868b786d4802416c","infoHashBuffer":{"type":"Buffer","data":[143,158,155,207,144,129,115,212,240,95,254,60,134,139,120,109,72,2,65,108]},"announce":[],"urlList":[]}}