{"title":"Sensual Pain - SSS number One  Abigail Dupree High","uid":15795017,"size":2344066855,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:907dbedba23633c0a8fc198b5330206bc8f8714a&amp;dn=Sensual+Pain+-+SSS+number+One++Abigail+Dupree+High&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"merzedes","files":1,"time":1473445991,"description":"Sensual Pain - SSS number One  Abigail Dupree High\r\n\r\nSSS number One | Abigail Dupree\r\n\r\nAugust 31, 2016\r\n\r\n\r\nHigh MP4 only.\r\n\r\n\r\nSSS # One \r\n\r\nSex Slave Stock- The Sex Slave Stock is a huge back log of Web-cam footage featuring slave 525-871-465 aka Abigail Dupree. Her servitude extends out to those in need of the mystique, erotic, and acutely individual kinks that we all have. She serves those in need because that is her kink, her calling... she lives to see what it is that makes you tick and to somehow make that fantasy come to life without the luxury of human touch. You will leave feeling like you have had an out of body experience as she pulls you in to her genuine and twisted mind.. Watching her is mesmerizing, inviting and addictive. Please enjoy this gem of pleasure and let her warm your heart like she has her Master's... In this archive video, you will witness three different moods and scenarios from slave abigail. She starts out with a short clip of her getting ready for a night in her cam room after getting a new massive toy in the mail. Her Master catches her &quot;practicing&quot; with it and decides to take over the filming as she struggles to get this giant toy inside of her un-used holes. In order to do her best by Him she ends up fisting her ass to prepare herself for the bigger toy... \r\n\r\nStill reading? well to spare you the task of waiting any longer I'll just list a few of the things that you will witness in this sumptuous film... ass to mouth dildo fucking and sucking, large anal insertions, behind the scenes commentary, weighted labia stretching, self spanking with leather strap, a bit of dirty bathroom talk, self tit slapping with leather strap, self face slapping and more anal fucking!... just trust me... she is divine. \r\n \r\nScreens \nhttp://www.sensualpain.com/sadomasochism/trailer.php?y=2016&amp;p=08_31adupree26&amp;u=SensualPain-Abigail-Dupree-\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n22 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://s4.postimg.org/5zaprzep9/Merzedes_Shallow2_FAQ2_1337_X_3.jpg\r\n \nhttp://s32.postimg.org/ym8wkx6hx/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:907dbedba23633c0a8fc198b5330206bc8f8714a","amp;dn":"Sensual+Pain+-+SSS+number+One++Abigail+Dupree+High","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"907dbedba23633c0a8fc198b5330206bc8f8714a","infoHashBuffer":{"type":"Buffer","data":[144,125,190,219,162,54,51,192,168,252,25,139,83,48,32,107,200,248,113,74]},"announce":[],"urlList":[]}}