{"title":"PC-Conflict Vietnam","uid":6103102,"size":1752040155,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9139da8a289f041cbff44b622fa9f77a9f7de40b&amp;dn=PC-Conflict+Vietnam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":7,"uploader":"xcheekyleex","files":3,"time":1295051043,"description":"Conflict Vietnam  4 PC\n\n\nThis Is A ISO CD Image File Of The Game..\n\nYou Will Need Nero,Power2Go,Cyberlink DVD Suite Or Other DVD/CD Burning Software To Mount/Extract &amp; Burn The CONFLICTVIETNAM.ISO Image Files Contents Back To CD Before You Can Install,Crack &amp; Play The Game.\n\nDouble Clickin On CONFLICTVIETNAM.ISO Image File Shud Strt Ur CD/DVD Burning Software,If It Dont Open Your DVD/CD Software,Load The Image File Mount/Extract &amp; Burn To CD..\n\nRun The Setup/Install File As Usual..\nAfta Install Is Complete &amp; B4 U Run D Game 4D 1st Time Copy The Vietnam.exe File Frm The NoCDcrack Folder To Your Installed Game Directory... .  Run The Game Usin  Vietnam.exe\n\n\n\nConflict: Vietnam is the third entry in the Conflict series, which began\n   with Conflict: Desert Storm. Developer Pivotal Games is taking the series\n   a few decades back to the Vietnam War and is placing you in the role of a \n   new recruit who finds himself cut off behind enemy lines during the 1968 \n   Tet Offensive. Your goal is to make it through 100 miles of booby-trapped \n   and enemy-infested terrain, along with your squad, to get to the capital \n   city of Hue. Today we'll offer a look at the new skill system that's being\n   implemented into the latest iteration of Conflict to add a new element to its\n   gameplay. The skill advancement system in Conflict: Vietnam lets you choose \n   one of nine different skill sets for the members of your squad to specialize \n   in. These features add a level of customization that makes it possible to\n   build up all manner of squad configurations, such as a stealth-kill team \n   consisting entirely of snipers or a squad of heavy-weapon experts. \n \n   You'll increase the different skills available to you with points that you\n   earn for completing primary and bonus objectives, such as taking down enemy\n   soldiers and vehicles, maintaining fire accuracy, and successfully executing\n   stealth kills. Points are deducted for killing civilians and friendly \n   soldiers. These points are split among the four squadmates and are then spent\n   to raise their skills in such skill categories as Pistol, Assault Rifle, \n   Sniper Rifle, Machine Gun, Grenade, Shotgun, Medic, Rocket Launcher, \n   and Booby Traps. The higher the skill, the more points it costs to raise.\n\n\n\n\nNjoy.\n\n\n\nxcheekyleex\ntHeRiPpEr","torrent":{"xt":"urn:btih:9139da8a289f041cbff44b622fa9f77a9f7de40b","amp;dn":"PC-Conflict+Vietnam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9139da8a289f041cbff44b622fa9f77a9f7de40b","infoHashBuffer":{"type":"Buffer","data":[145,57,218,138,40,159,4,28,191,244,75,98,47,169,247,122,159,125,228,11]},"announce":[],"urlList":[]}}