{"title":"Happy.End.1999.DVDRiP.XviD.AC3 [koreanmovies]","uid":3461605,"size":1468687938,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:921cd6ade8530f7d360bb2b4525a65db8d29cf99&amp;dn=Happy.End.1999.DVDRiP.XviD.AC3+%5Bkoreanmovies%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":3,"uploader":"koreanmovies","files":4,"time":1143150178,"description":":ABOUT:\n\n\n(warning! may contain spoilers)\nIn the 1999 film &quot;Happy End (Haepi endeu)&quot;, one of the more controversial films to come out of South Korea in recent years, a man learns that his wife is cheating on him and comes up with an extreme solution to the problem. And despite what is implied by the title, the film&amp;#039;s resolution leaves the protagonist debating whether or not he has achieved his &amp;#039;happy end&amp;#039;, or merely substituted one torment with another.\n\nIn a scene that borders on soft-core pornography, the film&amp;#039;s startling opening graphically depicts a vigorous lovemaking session between career woman Bo-ra (Jeon Do-yeon, seen recently in &quot;I Wish I Had a Wife&quot;) and her lover Il-beom (Ju Jin-mo of &quot;Musa&quot;), a former college sweetheart. This is then sharply contrasted with Bo-ra&amp;#039;s staid domestic life and her passionless marriage to the older Min-ki (Choi Min-shik of &quot;Shiri&quot; and &quot;Failan&quot;). An out-of-work former banker, Min-ki has had little luck and ambition in finding gainful employment, and prefers to spend his days reading romance novels in a used bookstore, or watching soap operas on television. Together, Bo-ra and Min-ki have a baby daughter, and raising her seems to be the only thing they have in common.\n\nHowever, as the film unspools, Min-ki gradually pieces together the evidence of Bo-ra&amp;#039;s infidelity, and is devastated by what he finds. And though the shiftless side of his character seems quietly resigned to live with what his wife has done, he is soon galvanized into taking far more aggressive measures when his wife&amp;#039;s indiscretions threaten the well being of their infant daughter. Taking cues from the mystery books that have become the new staple of his reading habits, Min-ki meticulously plots and executes his uncompromising solution.\n\n\n\n\n\nUse VLC to view this movie (with subs): http://www.videolan.org\n\nLiked this? Then make sure you upload at least as much as you download of it!\n\nYou want more korean movies? Search for KOREANMOVIES.\nYou want more asian movies? Search for ASIANTORRENTS.\t\t","torrent":{"xt":"urn:btih:921cd6ade8530f7d360bb2b4525a65db8d29cf99","amp;dn":"Happy.End.1999.DVDRiP.XviD.AC3+%5Bkoreanmovies%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"921cd6ade8530f7d360bb2b4525a65db8d29cf99","infoHashBuffer":{"type":"Buffer","data":[146,28,214,173,232,83,15,125,54,11,178,180,82,90,101,219,141,41,207,153]},"announce":[],"urlList":[]}}