{"title":"The Encyclopedia of Birds (9-Volume Illustrated Set)","uid":5491703,"size":260084768,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:92b22ef81cea4389df9db83c64f6f81a7962f671&amp;dn=The+Encyclopedia+of+Birds+%289-Volume+Illustrated+Set%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"artpepper","files":-1,"time":1271063252,"description":"The Encyclopedia of Birds (9-Volume Illustrated Set)\n\nFacts on File | 2007 | ISBN: 0816059047 | 1152 pages | PDF \n\n\n\n\n\nThousands of species of birds are known to live throughout the world. Some make their home in aeries high in the mountains; many others fly from tree to tree in temperate or tropical forests; and still others glide above shifting desert sand dunes. \n\nThen there are the birds, such as ostriches and s, which do not fly but instead run across land or swim in the oceans. &quot;The Encyclopedia of Birds&quot; details various aspects of these amazing creatures' lives and pres insight into humans' fascination, and complicated relationship, with birds of all kinds. \n\n&quot;The Encyclopedia of Birds&quot; nine-volume set presents a comprehensive look at the world's most interesting birds, showing their extreme diversity as well as common features including wings, feathers, and hollow bones. \n\nHighly illustrated with full-color photographs of birds in the wild and outstanding diagrams, this valuable reference offers concise, clearly organized information on birds, including physical features, diet, distribution, behavior, habitat, and more. \n\nA useful resource for students, researchers, and bird lovers alike, &quot;The Encyclopedia of Birds&quot; offers over 1,000 color photos of birds in the wild, includes diagrams and drawings, and discusses habitats, physical features, breeding, behavior and more. The blend of striking, lovely color photos and drawings and detailed natural history make it an exceptional student reference and helps readers understand and appreciate these important, and in some cases endangered, life forms. \n\n","torrent":{"xt":"urn:btih:92b22ef81cea4389df9db83c64f6f81a7962f671","amp;dn":"The+Encyclopedia+of+Birds+%289-Volume+Illustrated+Set%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92b22ef81cea4389df9db83c64f6f81a7962f671","infoHashBuffer":{"type":"Buffer","data":[146,178,46,248,28,234,67,137,223,157,184,60,100,246,248,26,121,98,246,113]},"announce":[],"urlList":[]}}