{"title":"Das.Boot.1981.DC.1080p.BluRay.x264.EAC3-SARTRE","uid":15900393,"size":6616014500,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:92c6cff62b292d2d0aa0b5b28c2513e1ce987e41&amp;dn=Das.Boot.1981.DC.1080p.BluRay.x264.EAC3-SARTRE&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":3,"uploader":"sartre7","files":13,"time":1475001774,"description":"Das Boot is one of the most gripping and authentic war movies ever made. Based on an autobiographical novel by German World War II photographer Lothar-Guenther Buchheim, the film follows the lives of a fearless U-Boat captain (Jurgen Prochnow) and his inexperienced crew as they patrol the Atlantic and Mediterranean in search of Allied vessels, taking turns as hunter and prey. There's very little plot, so the movie's power comes from both its riveting, epic battle scenes and its details of the boring hours spent waiting for orders or signs of the enemy. With the exception of one staunch Hitler Youth lieutenant, none of the crew is particularly loyal to the Nazis, and some are openly hostile toward their Fuhrer; this allows viewer sympathy with the men as they perform their laborious, monotonous duties in cramped, filthy quarters, or await death as depth charges explode all around the sub. Prochnow is excellent as the nerves-of-steel commander, and many of the supporting actors -- all German -- are solid as well, although the characterizations border on war movie clichés (the young crewman who has left behind his pregnant girlfriend, the Chief Engineer whose wife is seriously ill). The real star, however, is cinematographer Jost Vacano, who makes the sub's grimy, claustrophobic interior come to vivid life, as his camera follows the crew through hatches, up ladders, into bunks, and under pipes, creating a palpable sense of claustrophobia while injecting it with movement. Originally edited by writer/director Wolfgang Petersen as both a two-and-a-half hour theatrical release and a six-hour German miniseries, Das Boot was re-released in a restored version in 1997 with nearly one hour of added footage which made it even more suspenseful than before. The commentary track features director Wolfgang Petersen, actor Jurgen Prochnow and director's cut supervisor Ortwin Freyermuth.\r\n\r\n\r\n\r\n\r\nSTARS.........: Jürgen Prochnow, Herbert Grönemeyer, Klaus Wennemann\r\nDIRECTOR......: Wolfgang Peterson\r\nWRITER........: Wolfgang Petersen, Lothar G. Buchheim (novel)\r\nGENRE.........: War | Action | Drama\r\nMETASCORE.....: 86\r\nIMDB RATING...: 8.4/10  169,642 votes\r\nIMDB link.....: http://www.imdb.com/title/tt0082096\r\nRUNTIME.......: 3h 28mn\r\nSIZE..........: 6.14GB\r\nVIDEO CODEC...: x264 (  )\r\nRESOLUTION....: 1920x1040\r\nASPECT RATIO..: 1.85:1\r\nBITRATE.......: 3500 Kbps\r\nFRAMERATE.....: 23.976 fps\r\nAUDIO.........: German E-AC3 5.1 640kbps\r\nAUDIO2........: Commentary with Wolfgang Petersen, Jurgen Prochnow, Ortwin Freyermuth.\r\nCHAPTERS......: Yes\r\nSUBTITLES.....: ENG, DAN, DUT, FRE, GER, POR, SPA\r\nSOURCE........: Untouched US Director's Cut Blu Ray\r\nENCODED BY....: Sartre\r\nENCODE DATE...: 2016-09-19","torrent":{"xt":"urn:btih:92c6cff62b292d2d0aa0b5b28c2513e1ce987e41","amp;dn":"Das.Boot.1981.DC.1080p.BluRay.x264.EAC3-SARTRE","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92c6cff62b292d2d0aa0b5b28c2513e1ce987e41","infoHashBuffer":{"type":"Buffer","data":[146,198,207,246,43,41,45,45,10,160,181,178,140,37,19,225,206,152,126,65]},"announce":[],"urlList":[]}}