{"title":"Sport Psychology - PDF - WD","uid":9424220,"size":1710804,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:92e97cd03d43ff0442a1bdb67a207d170060dc55&amp;dn=Sport+Psychology+-+PDF+-+WD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"AtomTPB","files":1,"time":1388659813,"description":"Author: Britton Brewer | Date: 2009-02-04 | Format: pdf | Pages: 148 | Language: English | ISBN10: 1405173637\n\nDescription: This volume in the Handbook of Sports Medicine and Science series presents a concise summary of the science and practice of psychology in the context of sport. Psychological aspects central to sport performance such as motivation, cognition, stress, confidence, and mental preparation are examined and interventions designed to enhance individual and team performance are reviewed. Reflecting the breadth of the field, issues such as sport injury prevention and rehabilitation, athlete psychopathology, child and adolescent development, sport career termination, and the practice of sport psychology are also addressed.\n\nPublished under the auspices of the Medical Commission of the International Olympic Committee, Sport Psychology shows how the performance and the overall well-being of athletes can be improved by highlighting research findings and their practical application. With contributions from internationally renowned experts and useful case studies in each chapter, this handbook is an essential resource for medical doctors who serve athletes and sports teams and an invaluable reference for all students of sport psychology.\n","torrent":{"xt":"urn:btih:92e97cd03d43ff0442a1bdb67a207d170060dc55","amp;dn":"Sport+Psychology+-+PDF+-+WD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92e97cd03d43ff0442a1bdb67a207d170060dc55","infoHashBuffer":{"type":"Buffer","data":[146,233,124,208,61,67,255,4,66,161,189,182,122,32,125,23,0,96,220,85]},"announce":[],"urlList":[]}}