{"title":"Lost Soul Doomed Journey Richard Stanley 2014 720p 2ch subs x265","uid":14160699,"size":745520307,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:938883dd8ea5808e3b248438affd8daeb8cf50b6&amp;dn=Lost+Soul+Doomed+Journey+Richard+Stanley+2014+720p+2ch+subs+x265&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":2,"uploader":"bsg4you","files":3,"time":1459716281,"description":"Lost.Soul.Doomed.Journey.Richard.Stanley.2014.720p.2ch.subs.x265.mkv\r\n\r\nTHIS TORRENT USES X265 HEVC (High Efficiency Video Coding) VIDEO\r\nPLEASE USE A PLAYER THAT SUPPORTS X265 HEVC VIDEO LIKE VLC, POTPLAYER, ETC\r\n\r\nLost Soul: The Doomed Journey of Richard Stanley's Island of Dr. Moreau (2014)\r\nvideo: 1280x720 HEVC crf=23.00 preset=medium ~912Kbps\r\naudio: 2.0 Stereo HE-AAC 96Kbps\r\nsubs1: English\r\n1hour38min26sec 745,463,967bytes\r\n  http://www.imdb.com/title/tt1935156/  \r\n\r\nIMDB: Behind the scenes chronicle of how clash of vision, bad creative decisions, lack of interest and really bad weather plagued the disastrous production of the infamous 1996 remake of The Island of Dr. Moreau.\r\n\r\nWIkipedia: Lost Soul: The Doomed Journey of Richard Stanley's Island of Dr. Moreau is a 2014 documentary that was directed by David Gregory. The film had its world premiere on 24 August 2014 at the London FrightFest Film Festival and covers Richard Stanley's experiences while he served as director for the 1996 film The Island of Dr. Moreau.\r\n\r\nIn Lost Soul Gregory looks at the filming of The Island of Dr. Moreau, specifically the period during which director Richard Stanley spent on the project. Stanley was brought on to the project early but was fired only a few days after principal photography began and was replaced by John Frankenheimer. The documentary looks into Stanley's vision for the film, as he had spent years working on the movie's script and had intended for Bruce Willis to star as Edward, a role that was later given to Val Kilmer- a move that Stanley viewed as a mistake. Lost Soul features interviews with several people involved with the movie's production and focuses on various aspects of the film, including numerous changes to the script and reports that Kilmer was difficult to deal with on set.\r\n\r\nCritical reception for Lost Soul has been positive and the film has received praise from Nerdly and Shock Till You Drop, with the latter describing it as a &quot;must see&quot;. IGN rated Lost Soul favorably and summed it up as &quot;a no-holds-barred making of documentary that proves that fact really is stranger than fiction.&quot;\r\n\r\nThe Rotten Tomatoes TOMATOMETER rating for Lost Soul is 100%.\r\n\r\nPlease check out other releases of documentaries, Rifftrax, MST3K, Battlestar Galactica, DC Comics, Gotham, Star Trek, and more at:\r\n  https://thepiratebay.se/user/bsg4you/  \r\n  https://kat.cr/user/bsg4you/uploads/  \r\nand leave any corrections, criticism, comments and requests.\r\n\r\nThanks, bsg4you","torrent":{"xt":"urn:btih:938883dd8ea5808e3b248438affd8daeb8cf50b6","amp;dn":"Lost+Soul+Doomed+Journey+Richard+Stanley+2014+720p+2ch+subs+x265","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"938883dd8ea5808e3b248438affd8daeb8cf50b6","infoHashBuffer":{"type":"Buffer","data":[147,136,131,221,142,165,128,142,59,36,132,56,175,253,141,174,184,207,80,182]},"announce":[],"urlList":[]}}