{"title":"Stephen King - Lśnienie [PL]","uid":14422317,"size":2434087252,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:939ec50c60cb0c521e6ec5edea4f1a0c47c43394&amp;dn=Stephen+King+-+L%C5%9Bnienie+%5BPL%5D+MP3%40256&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"everdarksoul","files":62,"time":1461544267,"description":"SUPERPRODUKCJA - czyli teatr dźwięku i wyobraźni, pełny audiobook w formie słuchowiska. Wydawnictwa &quot;Prószyński-Media&quot; i &quot;Audioteka&quot; przedstawiają powieść Stephena Kinga - uważaną przez wielu za horror wszech czasów - tym razem w formie słuchowiska, z udziałem największych gwiazd współczesnego polskiego kina!\r\n\r\nAudiobook PL - 58 części /   \r\nrozmiar: 2,28 GB / czas: 21:06:33\r\nczyta: Zesół Lektorów\r\n\r\nJack Torrance - były nauczyciel, a obecnie poszukujący weny pisarz - otrzymuje pracę dozorcy, w opuszczonym na okres zimowy, górskim hotelu &quot;Panorama&quot;. Kiedy burze snieżne odcinają od swiata rodzinę Torrance’ów, obdarzony telepatycznymi zdolnościami Danny (pięcioletni syn Jacka), odkrywa, ze hotel jest nawiedzony, a duchy powoli doprowadzają jego ojca do obledu.\r\nSytuacja staje się coraz bardziej napięta - aż pewnego dnia mężczyzna całkowicie przestaje nad sobą panować...\r\nW 1980, Stanley Kubrick podjął się ekranizacji &quot;Lśnienia&quot;, a glówną rolę w filmie zagrał &quot;demoniczny&quot; Jack Nicholson. W 1997, Stephen King - który zarzucal Kubrickowi pominięcie wielu, istotnych faktów z książki - zrealizowal miniserial telewizyjny na podstawie własnej powiesci i scenariusza.\r\nKontynuację &quot;Lśnienia&quot; - choć nie bezpośrednią - stanowi napisana przez Kinga ponad 35 lat później powieść &quot;Doktor Sen&quot;, której głównym bohaterem jest - dorosły już - Danny.\r\nWstawka zawiera również plik torrent do pobrania powieści &quot;Doktor Sen&quot;.\r\n\r\nW audio-adaptacji powieści, w rolach głównych wystąpili:\r\nNarrator - Krzysztof Gosztyła\r\nJack Torrance - Adam Woronowicz \r\nWendy Torrance - Agata Kulesza \r\nDanny Torrance - Bernard Lewandowski \r\nDick Hallorann - Mariusz Bonaszewski \r\nStuart Ullman - Marian Opania \r\n\r\nw pozostałych rolach:\r\nKrzysztof Banaszyk, Marek Barbasiewicz, Adam Bauman, Anna Bojara, Tomasz Borkowski, Izabella Bukowska-Chadzynska, Pawel Ciolkosz, Damian Damiecki, Marta Dudz, Marta Dylewska, Elzbieta Gaertner, Jakub Jankiewicz, Barbara Kaluzna, Ewa Kania, Elzbieta Kepinska, Elzbieta Kijowska, Mikolaj Klimek, Julia Kolakowska-Bytner, Milosz Konkel, Maciej Kowalik, Jan Kulczycki, Wojciech Machnicki, Olaf Marchwicki, Andrzej Mastalerz, Aleksander Mikolajczak, Janusz Rafal Nowicki, Tomasz Olejnik, Jan Peczek, Krzysztof Plewako-Szczerbinski, Marcin Przybylski, Aleksandra Radwan, Ewa Serwa, Zbigniew Suszynski, Pawel Szczesny, Sebastian Swierszcz, Kinga Tabor, Marcin Tronski, Anna Wodzynska, Przemyslaw Wyszynski, Diana Zamojska, Wojciech Zoladkowicz.\r\n\r\nScenariusz i rezyseria: Janusz Kukula, Polskie Radio S.A. \r\nProducent wykonawczy: Audioteka Poland Sp. z o.o. \r\nRealizacja nagran: Tomasz Marek \r\nKompozycja muzyki i wykonanie, gitary: Krzysztof Scieranski \r\nPostprodukcja dzwieku: Stereotyp Studio Tomasz Bogacki, Katarzyna Lewinska, Kamil Sajewicz, Jacek Szczepanek \r\nKoordynacja nagran: Tomasz Cieslak \r\nKoordynacja produkcji: Paulina Drzastwa \r\nNagrania zrealizowano w Teatrze Polskiego Radia","torrent":{"xt":"urn:btih:939ec50c60cb0c521e6ec5edea4f1a0c47c43394","amp;dn":"Stephen+King+-+L%C5%9Bnienie+%5BPL%5D+MP3%40256","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"939ec50c60cb0c521e6ec5edea4f1a0c47c43394","infoHashBuffer":{"type":"Buffer","data":[147,158,197,12,96,203,12,82,30,110,197,237,234,79,26,12,71,196,51,148]},"announce":[],"urlList":[]}}