{"title":"S O D (Stormtroopers Of Death) -1985- Speak English Or Die","uid":11164384,"size":74185832,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:94b9c7efa2efcf8e92ad054e76a49d2203921eda&amp;dn=S+O+D+%28Stormtroopers+Of+Death%29+-1985-+Speak+English+Or+Die&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":3,"uploader":"analogkid6103","files":26,"time":1412606770,"description":"94b9c7efa2efcf8e92ad054e76a49d2203921eda\nDescription:\tSpeak English or Die is the first studio album by the crossover thrash band Stormtroopers of Death (S.O.D.).\nAfter Anthrax finished recording Spreading the Disease, there was still some studio time left, so Scott Ian and Charlie Benante called some friends, practiced some songs, and recorded it all within a week. It was released in 1985 and re-released on the Megaforce label in August 1995. A platinum edition of the album was released in February 2000.\n\n\nQuote:\nStormtroopers of Death, more commonly known as S.O.D., formed in New York in 1985. They are commonly credited as being among the first bands to fuse hardcore punk with thrash metal into a style sometimes called &quot;crossover thrash&quot;. Their 1985 debut album was the Headbanger's Ball intro anthem for many years. They have also been a subject of controversy due to their politically-incorrect lyrics. S.O.D. member Dan Lilker has stated: &quot;The lyrics were never intended to be serious, just to piss people off.&quot;\n\n\nQuote:\nS.O.D. was created by Anthrax's guitarist, Scott Ian, as a side project for his crossover ideas. During a tour with Anthrax, the band was stranded for a while and Scott started drawing sketches of what is now known as Sargent D. Then, when recording &quot;Spreading the Disease&quot; with Anthrax, Dan, Scott and Charlie were bored in the studio while waiting for the end result of that album, so they started playing random riffs mostly inspired by hardcore bands like Agnostic Front. Later, with Scott knowing Billy, he asked him if he would like him to sing for the band. At the time, Billy was apart of the hardcore band The Psychos and played bass. He tried out for singing and his first time ironically singing was in the studio recording &quot;Speak English or Die.&quot;\n\nWhile the band is highly regarded as one of the first &quot;crossover&quot; bands in metal and hardcore punk, the band has suffered huge amounts of criticism from the media for their very offensive humor, and also other bands within the hardcore punk community, ranging from Sore Throat, Extreme Noise Terror and so on for being a &quot;unorthodox&quot; style hardcore band becuase of all the fame they've received from being a hardcore band.\n\nBilly Milano went on to create M.O.D. (Methods of Destruction) after S.O.D. disbanded.\n\nBilly Milano was previously a roadie for Anthrax.\n\nTrack listing\nAll tracks written by S.O.D.\n\nMarch of the S.O.D.\nSargent D and the S.O.D.\nKill Yourself\nMilano Mosh\nSpeak English or Die\nUnited Forces\nChromatic Death\nPi Alpha Nu\nAnti-Procrastination Song\nWhat's that Noise\nFreddy Krueger\nMilk\nPre-Menstrual Princess Blues\nPussy Whipped\nFist Banging Mania\nNo Turning Back\nFuck the Middle East\nDouche Crew\nHey Gordy!\nBallad of Jimi Hendrix\nDiamonds and Rust&quot; (Extended Version)\nRam It Up\nGenre:\tThrash\nSubgenre:\tCrossover Thrash\nBitrate:\t320 k\nSize:\t70.75 MB\nShow/Hide Files: \t\n26 files","torrent":{"xt":"urn:btih:94b9c7efa2efcf8e92ad054e76a49d2203921eda","amp;dn":"S+O+D+%28Stormtroopers+Of+Death%29+-1985-+Speak+English+Or+Die","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94b9c7efa2efcf8e92ad054e76a49d2203921eda","infoHashBuffer":{"type":"Buffer","data":[148,185,199,239,162,239,207,142,146,173,5,78,118,164,157,34,3,146,30,218]},"announce":[],"urlList":[]}}