{"title":"Final.Fantasy.IV.The.After.Years-RELOADED","uid":11909621,"size":819860884,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:94ec605ea2ada9fdfec9fba1db9de2319f140043&amp;dn=Final.Fantasy.IV.The.After.Years-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"Tenguken","files":3,"time":1431449333,"description":"       FINAL FANTASY IV: THE AFTER YEARS (c) Square Enix\n\n05/2015 :..... RELEASE.DATE .. PROTECTION .......: Steam\n      1 :.......... DISC(S) .. GAME.TYPE ........: RPG\n\nAbout This Game Now with a full 3-D remake, FINAL FANTASY IV: THE AFTER\nYEARS can now be played as never before on PC. Take part in the epic sequel\nthat unfolds nearly two decades after the events of FINAL FANTASY IV.\nClassic characters make their return alongside several new heroes, such as\nCeodore, son of Cecil and Rosa.\nStory : Seventeen years have passed since the war's end, and the son born\nto King Cecil and Queen Rosa of Baron has grown into a young man. Prince\nCeodore has enlisted in the airship fleet known as the Red Wings, eager to\nmeet the expectations demanded of his blood and station. Yet once more\nanother moon has appeared in the sky, and with it vast hordes of monsters\nintent on destruction. The brief peace enjoyed by the Blue Planet now\nstands threatened under the shadow of impending catastrophe.\nTen Playable TalesBegin your journey with &quot;Ceodore's Tale.&quot; Complete it to\nunlock the tales of six additional characters, which can be played in any\norder, and then return to the core story with &quot;Kain's Tale,&quot; &quot;The\nLunarian's Tale,&quot; and &quot;The Crystals.&quot; A total of ten tales in all, and all\ncontained in FINAL FANTASY IV: THE AFTER YEARS.\n\nActive Time Battle\nTake control of exhilarating combat made possible by the non-stop action in\nSquare Enix's iconic battle system.\nLunar Phases\nFeel the moon's presence in combat, as its waxing and waning influences the\npotency of attacks and abilities of all combatants. Lunar phases cycle\nnaturally with the passage of in-game time, or when resting at an inn,\ntent, or cottage.\nBand Abilities\nCombine the strength of your party members to awesome effect with Band\nabilities that can be unlocked through in-game events or by levelling your\ncharacters' Affinity.\nMinimap\nKeep an eye on your current location and nearby surroundings, or click for\nquick access to the world map.\nIncludes STEAM Trading cards!\n\n1. Unrar.\n2. Burn or mount the image.\n3. Install the game.\n4. Copy over the cracked content from the /Crack directory on the image to\nyour game install directory.\n5. Play the game.\n6. Support the software developers. If you like this game, BUY IT!","torrent":{"xt":"urn:btih:94ec605ea2ada9fdfec9fba1db9de2319f140043","amp;dn":"Final.Fantasy.IV.The.After.Years-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94ec605ea2ada9fdfec9fba1db9de2319f140043","infoHashBuffer":{"type":"Buffer","data":[148,236,96,94,162,173,169,253,254,201,251,161,219,157,226,49,159,20,0,67]},"announce":[],"urlList":[]}}