{"title":"Car Mechanic Simulator 2014 v1.1.2.0 (2-click run)","uid":10524579,"size":483027725,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:94f1b19b703a30c2718002bd9b6aca572dfa0799&amp;dn=Car+Mechanic+Simulator+2014+v1.1.2.0+%282-click+run%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"The_Duck1","files":-1,"time":1405029332,"description":"No need for serials and cracks to get the full version, (already done it for you).\nNo unnecessary registry changes. \nNo boring installation of tool-bars in your browser or other unwanted things.\nYou can even run this torrent from an USB-Stick.\nEasy Uninstall with the Windows control panel.\nChoose where you want to put the files on your PC. \nThese are a few things that makes a 'Easy Run' version a better version.\n\nIf everybody seeds, you will get higher downloading speeds.\n\nDESCRIPTION:\nDid you have your own car dealer? Polish Studio Project Red Dot Games called Car Mechanic Simulator 2014 gives you the opportunity. If you have not heard anything about the development team, we can name a couple of their games, for example: Need for Russia 4 and Rally Poland. Game Car Mechanic Simulator 2014 you have to assume the role of automobile mechanics. Diagnosis, order the necessary parts, repair - your task. Gameplay complicate a variety of orders and vehicles at the disposal of the mechanics may be a few that will further increase the load. You have to communicate with customers and repairing cars. It will be interesting for all racing maniacs. But you can do that? After the adoption of the machine in the workshop, the player must explore a total of about 150 items. Use tools: various kinds of keys, screwdrivers and other necessary devices and objects. The fault could be anywhere, because you need to very carefully examine all parts of the vehicle. You can try to repair or replace the item with a new ordering over the Internet. Once the car is repaired, you can test it on a special site. At the heart of Car Mechanic Simulator 2014 is a three-dimensional design, which will allow you to inspect the car from all sides by rotating the camera.\n\nInstallation instructions:\n1. Execute the .exe file.\n2. Follow the instructions.\n3. Enjoy the program.","torrent":{"xt":"urn:btih:94f1b19b703a30c2718002bd9b6aca572dfa0799","amp;dn":"Car+Mechanic+Simulator+2014+v1.1.2.0+%282-click+run%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94f1b19b703a30c2718002bd9b6aca572dfa0799","infoHashBuffer":{"type":"Buffer","data":[148,241,177,155,112,58,48,194,113,128,2,189,155,106,202,87,45,250,7,153]},"announce":[],"urlList":[]}}