{"title":"Encyclopedia of Information Systems [4 Vol. Set]","uid":15573338,"size":59200126,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:95117efaa045ee44ef5a018b11d2aa5bc064f10d&amp;dn=Encyclopedia+of+Information+Systems+%5B4+Vol.+Set%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"clouderone","files":4,"time":1471292594,"description":"The Encyclopedia of Information Systems provides essential answers to questions increasingly asked by people in all walks of life. People can no longer claim that information about computer viruses, for example, is unimportant to their work, or that advances in speech recognition and encryption will leave them unaffected. The Encyclopedia is therefore more useful than one might suspect to people well beyond the walls of information systems departments. Offering both general and technical information about major elements, issues, opinions, and key studies, as well as cross-references to related subjects, it captures the dynamic growth and complexity unique to our era.\r\nOffers the only major encyclopedic examination of information systems; there are no competitors\r\nArticles begin with easily understandable concepts and become increasingly sophisticated, satisfying the needs of all readers\r\nArticles emphasize information that will not quickly go out of date \r\nEach article contains an average of 8 graphs and 8 tables illustrating its important points\r\nContains approximately 220 separate articles, all original contributions commissioned for this work\r\nIncludes approximately 700 figures and tables within the text; more than 2,000 glossary entries explain key terms, &quot;further reading&quot; lists appear at the end of each entry, and an extensive cross-referencing system links related articles","torrent":{"xt":"urn:btih:95117efaa045ee44ef5a018b11d2aa5bc064f10d","amp;dn":"Encyclopedia+of+Information+Systems+%5B4+Vol.+Set%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95117efaa045ee44ef5a018b11d2aa5bc064f10d","infoHashBuffer":{"type":"Buffer","data":[149,17,126,250,160,69,238,68,239,90,1,139,17,210,170,91,192,100,241,13]},"announce":[],"urlList":[]}}