{"title":"Orson Welles - Chimes At Midnight [CiN]","uid":3284621,"size":1235893970,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:95131741173b013640d028f108c59472e5139e00&amp;dn=Orson+Welles+-+Chimes+At+Midnight+%5BCiN%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"Pippin","files":2,"time":1107440238,"description":"The best film Welles ever made: Chimes At Midnight (1966):\n&lt;p&gt;\n&lt;img src=&quot;http://server3.uploadit.org/files/Pippin-Falstaff1.JPG&quot; /&gt;\n&lt;/p&gt;\nJust got this from Spain (only place where its available on DVD) and was blown away by it: I think its his best. Welles was made for the role as Falstaff. Also, the humanity in this character is something new in his films. And the battle scene should be a lesson to all Hollywood blockbuster-directors (it was shot with no more than 200 extras). But be aware that the plot is hard to follow unless you are familiar (Im not) with the 4 plays it was condensed from: They speak fast and, well, its Shakespeare. Theres also a strange thing with the (english) subtitles: It looks like they just took the lines from the play, not paying attention to that Welles had rewritten some of them. But the meaning is the same, so its not a huge problem. Video quality is fine without being great.\n&lt;p&gt;\nWelles himself: There's the triangle: the prince, his king-father and Falstaff, who's a kind of foster father. Essentially the film is the story of that triangle. Opposed to Falstaff, the king stands for responsibility. But what is so fascinating in Shakespeare is that the king himself is an adventurer - he who has usurped the throne speaks for legitimacy. And Hal must betray the one good man in the story to protect a doubtful heritage and realize his coolly chosen destiny as an English hero. And, of course, Falstaff is in himself a reproach and a rebuke to all those royal and heroic pretensions....I think he's one of the only great characters in all dramatic literature who is essentially &lt;i&gt;good&lt;/i&gt;. He's good in the sense that the hippies are good. The comedy is all about the gross faults in the man, but those faults are so trivial: his famous cowardice is a joke - a joke Falstaff seems to be telling himself against himself; a strong case could be made for his courage. But his goodness is basic - like bread, like wine. He's just shining with love; he asks for so little, and in the end, of course, he gets nothing.....Even if the good old days never existed, the fact that we can &lt;i&gt;conceive&lt;/i&gt; of such a world is, in fact, an affirmation of the human spirit. That the imagination of man is capable of creating the myth of a more open, more generous time is not a sign of our folly. Every country has its &quot;Merrie England&quot;, a season of innocence, a dew-bright morning of the world. Shakespeare sings of that lost Maytime in many of his plays, and Falstaff - that pot-ridden old rogue - is its perfect embodiment.\n&lt;/p&gt;\n&lt;p&gt;\nCodec: DivX Pro 5.2.1\nResolution: 656x418\nFramerate: 25 fps\nAspect Ratio: 1.60:1\nBitrate: 1413 kbit/s\nAudio: Mp3PRO @ 64 kbit/s (Mono)\n&lt;/p&gt;\n&lt;p&gt;\n&lt;A HREF=&quot;http://trackerwww.prq.to/torrents-details.php?id=3283313&amp;hit=1&quot;&gt;This Is Orson Welles - interviews&lt;/A&gt;\n&lt;/p&gt;\n&lt;A HREF=&quot;http://www.piratbyran.org/?view=forum&amp;a=thread&amp;id=19235&quot;&gt;Cineastklubben&lt;/A&gt;","torrent":{"xt":"urn:btih:95131741173b013640d028f108c59472e5139e00","amp;dn":"Orson+Welles+-+Chimes+At+Midnight+%5BCiN%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95131741173b013640d028f108c59472e5139e00","infoHashBuffer":{"type":"Buffer","data":[149,19,23,65,23,59,1,54,64,208,40,241,8,197,148,114,229,19,158,0]},"announce":[],"urlList":[]}}