{"title":"Mysteries of Templar Treasure and the Holy Grail","uid":15770690,"size":2627393,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:952976d31efcf8bea07a0ae8e6aab51edad96fd4&amp;dn=Mysteries+of+Templar+Treasure+and+the+Holy+Grail&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"marty14","files":1,"time":1473200646,"description":"Mysteries of Templar Treasure &amp; the Holy Grail: The Secrets of Rennes-Le-Château  - Lionel &amp; Patricia Fanthorpe [epub]\r\n\r\nWith the possible exception of Rosslyn, no other place on earth holds as much esoteric symbolism and mystery as Rennes-le-Château. Its location, design, and history are the subjects of countless rumours, myths and legends. Mysteries of Templar Treasure and the Holy Grail delves into the reality behind the tales associated with the place in such fictions as Dan Brown’s The Da Vinci Code and Umberto Eco’s Foucault’s Pendulum.\r\n\r\nThis book exhaustively surveys the history and secrets of Rennes-le-Château, including:\r\n• Its relationship to the Merovingian bloodline of Christ.\r\n• Its mystical layout and location on the same Paris meridian as many other esoteric mysteries.\r\n• The possible location of a vast treasure of either Templar, Cathar, or Priory of Sion origin.\r\n• The final resting place of famous artefacts such as the Ark of the Covenant, the Spear of Longinus, the Emarald Tablets of Hermes Trismegistus, or even the Holy Grail. \r\n• The proximity of Cathar and Templar strongholds.\r\n\r\nExtensive appendices in the book offer possible solutions to secret cryptograms, point out odd connections and commonalities between Rennes-le-Château and J.R.R. Tolkien’s Lord of the Rings, and suggest the possibility of fourth-dimension/tesseract implications","torrent":{"xt":"urn:btih:952976d31efcf8bea07a0ae8e6aab51edad96fd4","amp;dn":"Mysteries+of+Templar+Treasure+and+the+Holy+Grail","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"952976d31efcf8bea07a0ae8e6aab51edad96fd4","infoHashBuffer":{"type":"Buffer","data":[149,41,118,211,30,252,248,190,160,122,10,232,230,170,181,30,218,217,111,212]},"announce":[],"urlList":[]}}