{"title":"The Invisible Gorilla: And Other Ways Our Intuitions Deceive Us","uid":5866728,"size":260790090,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9564d3c8b498756443e865e842ee4c6df6b7e10e&amp;dn=The+Invisible+Gorilla%3A+And+Other+Ways+Our+Intuitions+Deceive+Us&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"snuk11","files":4,"time":1286235320,"description":"Reading this book will make you less sure of yourself - and that's a good thing. In The Invisible Gorilla, Christopher Chabris and Daniel Simons, creators of one of psychology's most famous experiments, use remarkable stories and counterintuitive scientific findings to demonstrate an important truth: Our minds don't work the way we think they do. We think we see ourselves and the world as they really are, but we're actually missing a whole lot.\n\nChabris and Simons combine the work of other researchers with their own findings on attention, perception, memory, and reasoning to reveal how faulty intuitions often get us into trouble. In the process, they explain:\n\n    * Why a company would spend billions to launch a product that its own analysts know will fail\n    * How a police officer could run right past a brutal assault without seeing it\n    * Why award-winning movies are full of editing mistakes\n    * What criminals have in common with chess masters\n    * Why measles and other childhood diseases are making a comeback\n    * Why money managers could learn a lot from weather forecasters\n\nThe Invisible Gorilla reveals the myriad ways that our intuitions can deceive us, but its much more than a catalog of human failings. Chabris and Simons explain why we succumb to these everyday illusions and what we can do to inoculate ourselves against their effects. Ultimately, the book provides a kind of x-ray vision into our own minds, making it possible to pierce the veil of illusions that clouds our thoughts and to think clearly for perhaps the first time.","torrent":{"xt":"urn:btih:9564d3c8b498756443e865e842ee4c6df6b7e10e","amp;dn":"The+Invisible+Gorilla%3A+And+Other+Ways+Our+Intuitions+Deceive+Us","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9564d3c8b498756443e865e842ee4c6df6b7e10e","infoHashBuffer":{"type":"Buffer","data":[149,100,211,200,180,152,117,100,67,232,101,232,66,238,76,109,246,183,225,14]},"announce":[],"urlList":[]}}