{"title":"En.el.Vientre.Materno[documental][dvdrip][spanish]","uid":6218185,"size":721348608,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:95bee79ac09131d89940620f73233ecd9fa8fbfa&amp;dn=En.el.Vientre.Materno%5Bdocumental%5D%5Bdvdrip%5D%5Bspanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"furtaperas","files":-1,"time":1299237460,"description":"Ã‚Â¿En quÃƒÂ© consiste el documental?\n\nEl punto de partida han sido ecografÃƒÂ­as en tres y cuatro dimensiones, ya disponibles en hospitales pero jamÃƒÂ¡s mostradas en televisiÃƒÂ³n. Estas imÃƒÂ¡genes han sido tratadas a travÃƒÂ©s del ordenador con las ÃƒÂºltimas tÃƒÂ©cnicas y son resultados de una mezcla veraz de realidad y recreaciÃƒÂ³n.\n\nSe ve el momento de la concepciÃƒÂ³n, el desarrollo del cerebro y cÃƒÂ³mo comienza a latir espontÃƒÂ¡neamente el corazÃƒÂ³n. TambiÃƒÂ©n, cÃƒÂ³mo un feto de 11 semanas se golpea a sÃƒÂ­ mismo, o que a las 24 semanas ya abre y cierra los ojos, saca la lengua y tiene su primer ataque de hipo. Ya en su ÃƒÂºltimo trimestre, vemos su habilidad para percibir sonidos, cÃƒÂ³mo sueÃƒÂ±a...\n\n&quot;En el vientre materno&quot; inicia su viaje en el momento de la concepciÃƒÂ³n; por medio de imÃƒÂ¡genes generadas por ordenador se acompaÃƒÂ±a el recorrido del blastocito (embriÃƒÂ³n de pequeÃƒÂ±o tamaÃƒÂ±o), desde la trompa de Falopio hasta el ÃƒÂºtero, donde comienza a tejer las primeras cÃƒÂ©lulas nerviosas.\n\nEl documental regresa al interior del seno materno unas semanas mÃƒÂ¡s tarde para mostrar los cambios que se han producido y, asÃƒÂ­, veremos el primer desarrollo del cerebro y la espina dorsal y asistiremos al momento de formaciÃƒÂ³n del corazÃƒÂ³n humano, una masa muscular que comienza a latir de manera espontÃƒÂ¡nea.\n\nEl reportaje tambiÃƒÂ©n se ocupa de los embarazos complicados, como el caso de un feto de 26 semanas que serÃƒÂ¡ operado en el ÃƒÂºtero para corregirle una malformaciÃƒÂ³n de la cavidad del diafragma que podrÃƒÂ­a ocasionarle graves daÃƒÂ±os en el desarrollo de sus pulmones y muy poco margen de supervivencia tras el nacimiento.\n\nEsta operaciÃƒÂ³n se filmÃƒÂ³ ÃƒÂ­ntegramente para el documental gracias a la introducciÃƒÂ³n de una minicÃƒÂ¡mara de alta definiciÃƒÂ³n en el abdomen de la madre.","torrent":{"xt":"urn:btih:95bee79ac09131d89940620f73233ecd9fa8fbfa","amp;dn":"En.el.Vientre.Materno%5Bdocumental%5D%5Bdvdrip%5D%5Bspanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95bee79ac09131d89940620f73233ecd9fa8fbfa","infoHashBuffer":{"type":"Buffer","data":[149,190,231,154,192,145,49,216,153,64,98,15,115,35,62,205,159,168,251,250]},"announce":[],"urlList":[]}}