{"title":"Talking to Crazy (2015).pdf Gooner","uid":13826961,"size":4322609,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:961cdfe256509a82233133e15bbec0e412aa2f88&amp;dn=Talking+to+Crazy+%282015%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1457700250,"description":"Talking to Crazy - How to Deal with the Irrational and Impossible People in Your Life (2015).pdf Gooner\r\n\r\nPublisher: AMACOM (October 15, 2015)\r\nLanguage: English\r\nISBN-10: 0814436366\r\nISBN-13: 978-0814436363\r\n\r\nLet's face it, we all know people who are irrational. No matter how hard you try to reason with them, it never works. So what's the solution? How do you talk to someone who's out of control? What can you do with a boss who bullies, a spouse who yells, or a friend who frequently bursts into tears? In his book, &quot;Just Listen, &quot; Mark Goulston shared his bestselling formula for getting through to the resistant people in your life. Now, in his breakthrough new book &quot;Talking to Crazy,&quot; he brings his communication magic to the most difficult group of all--the downright irrational. As a psychiatrist, Goulston has seen his share of crazy and he knows from experience that you can't simply argue it away. The key to handling irrational people is to learn to lean into the crazy--to empathize with it. That radically changes the dynamic and transforms you from a threat into an ally. &quot;Talking to Crazy&quot; explains this counterintuitive Sanity Cycle and reveals: Why people act the way they do - How instinctive responses can exacerbate the situation--and what to do instead - When to confront a problem and when to walk away - How to use a range of proven techniques including Time Travel, the Fish-bowl, and the Belly Roll - And much more You can't reason with unreasonable people--but you can reach them. This powerful and practical book shows you how","torrent":{"xt":"urn:btih:961cdfe256509a82233133e15bbec0e412aa2f88","amp;dn":"Talking+to+Crazy+%282015%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"961cdfe256509a82233133e15bbec0e412aa2f88","infoHashBuffer":{"type":"Buffer","data":[150,28,223,226,86,80,154,130,35,49,51,225,91,190,192,228,18,170,47,136]},"announce":[],"urlList":[]}}