{"title":"Russian Circles Discography [320 kbps] {100.XY}","uid":8299974,"size":421929477,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:962f4f3506adafdddf410150d2c63f711b727490&amp;dn=Russian+Circles+Discography+%5B320+kbps%5D+%7B100.XY%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"100.XY","files":-1,"time":1364245316,"description":"Russian Circles is a three piece instrumental rock/metal band from Chicago. Russian Circles play instrumental, sprawling music which runs the gamut of heavy discordant metal, to soft delicate passages. They are also known for their energetic live shows. Mostly headlining now, in their earlier days they toured with the likes of Boris, Isis, Red Sparowes, Minus the Bear, Daughters, Coheed &amp; Cambria, Mono, and Pelican as well as appearances at the 2006 SXSW, and 2009's Bonnaroo. They were also the opening band for Tool while playing their first tour in the United Kingdom in 2007. Their name is taken from a drill exercise used in the game of ice hockey.\nFormed in late 2004 by guitarist Mike Sullivan and bassist Colin DeKuiper (both formerly of instrumental band Dakota/Dakota), they quickly recruited drummer Dave Turncrantz, formerly of St. Louis band Riddle of Steel.\nIn the autumn of 2007, it was announced that the band had parted ways with Colin DeKuiper. As a result, the bass tracks on their second album, titled Station, were handled by ex-Botch/These Arms Are Snakes bass player Brian Cook. The group's third full-length, Geneva, was released on October 20, 2009 and reached No. 24 on the Billboard Heatseekers chart.\nIn 2011, Russian Circles signed to Sargent House who had previously only exclusively released the band's albums on limited edition vinyl. Their fourth studio album Empros was released on October 25, 2011. A supporting tour with Deafheaven followed the release\n\n\nCountry: USA (Chicago)\nGenre: instrumental rock / post-metal / post-rock\nQuality: 320 kbps\n\nAlbum List:\n(2006) Russian Circles - Enter\n(2008) Russian Circles - Station\n(2009) Russian Circles - Geneva\n(2011) Russian Circles - Empros\n","torrent":{"xt":"urn:btih:962f4f3506adafdddf410150d2c63f711b727490","amp;dn":"Russian+Circles+Discography+%5B320+kbps%5D+%7B100.XY%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"962f4f3506adafdddf410150d2c63f711b727490","infoHashBuffer":{"type":"Buffer","data":[150,47,79,53,6,173,175,221,223,65,1,80,210,198,63,113,27,114,116,144]},"announce":[],"urlList":[]}}