{"title":"Troppo Forte - Carlo Verdone.avi","uid":4378180,"size":1061364884,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9633267a05f64fdf720639c3df674da461f519eb&amp;dn=Troppo+Forte+-+Carlo+Verdone.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"fabio_che","files":1,"time":1220519485,"description":"Trama\n\nOscar Pettinari ÃƒÂ¨ un bravo giovanottone, grosso e vociante quanto ÃƒÂ¨ semplice e mite. Suggestionato dalle immagini di Stallone e di Rambo, si ÃƒÂ¨ messo in testa di fare il cascatore. A capo di una banda di borgatari romani, tutti in sella alle loro amatissime moto, Oscar cerca di farsi un sia pur modesto nome nel mondo della celluloide. Ma il suo viso da &quot;buono&quot; ÃƒÂ¨ troppo in contrasto con i giubbotti tutti borchie e la benda nera sulla fronte. Mal consigliato da un azzeccagarbugli che circola nei viali di CinecittÃƒÂ , Oscar si getta con la moto contro la Rolls Royce di un produttore americano, confidando in indennizzi e scritture. La macchina, perÃƒÂ², ÃƒÂ¨ guidata da Nancy, la giovane diva del film in cantiere la quale, lievemente ferita al volto nell&amp;#039;incidente, perde il ruolo ed il contratto. Mentre il produttore parte per affari a Londra, Oscar ospita la donna nel suo modestissimo alloggio di periferia, la nutre e la assiste e lei, senza un soldo in tasca, spreca bigliettoni in telefonate oltre Oceano, cercando aiuto nell&amp;#039;intento di riprendere il lavoro. Ad Oscar premono invece i cinque milioni di indennizzo che, a dire dell&amp;#039;avvocato chiacchierone, il produttore dovrÃƒÂ  pur dargli. Per raggiungere lo scopo desiderato, lo sfortunato Oscar dovrÃƒÂ  incappare in varie avventure, impegnandosi in una spericolata gara motociclistica nella zona fluviale di Roma (la vincerÃƒÂ , ma sarÃƒÂ  contestato e picchiato dalla cricca di Murena, il bullo perdente) e lottando contro le lusinghe ed i cavilli del produttore americano suddetto che, rientrato a Roma, sta per offrirgli un buon contratto. Ma, al momento della firma, l&amp;#039;onnipresente e frenetico avvocato piomba sul suo cliente e lo dissuade facendogli balenare il miraggio di ottenere ancora piÃƒÂ¹ quattrini, per lasciarlo infine piÃƒÂ¹ bastonato che mai. Lo stesso avvocato altri non ÃƒÂ¨ che un povero folle, del quale due vecchie sorelle ben conoscono le allucinazioni e le imprese sotto mentite spoglie (di volta in volta, egli ÃƒÂ¨ legale, veterinario, coreografo ed altro ancora). Intanto Nancy ÃƒÂ¨ raggiunta a Roma dal marito e ripartirÃƒÂ  per gli Stati Uniti, dove l&amp;#039;aspettano la casa, una bambina e la rinuncia ai propri sogni di celebritÃƒÂ . Non restano al povero Oscar che il ricordo di quella graziosa aspirante-diva e la speranza che, finalmente, il cinema si accorga delle sue capacitÃƒÂ  di &quot;stuntman&quot; tutto fare. Di male, in ogni caso, se ne potrÃƒÂ  fare un po&amp;#039; di meno poichÃƒÂ©, per ascoltare quel matto di avvocato e rendere piÃƒÂ¹ pesante il conto da presentare al produttore americano, gli ÃƒÂ¨ stata pure asportata la milza...","torrent":{"xt":"urn:btih:9633267a05f64fdf720639c3df674da461f519eb","amp;dn":"Troppo+Forte+-+Carlo+Verdone.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9633267a05f64fdf720639c3df674da461f519eb","infoHashBuffer":{"type":"Buffer","data":[150,51,38,122,5,246,79,223,114,6,57,195,223,103,77,164,97,245,25,235]},"announce":[],"urlList":[]}}