{"title":"Samsara Blues Experiment-Live At Rockpalast 320k mp3  ak2013","uid":10526668,"size":191960699,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9672a88f94b1df2391f5d4f25f52912d394096a3&amp;dn=Samsara+Blues+Experiment-Live+At+Rockpalast+320k+mp3++ak2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"analogkid6103","files":9,"time":1405053433,"description":"Samsara Blues Experiment-Live At Rockpalast 320k mp3  ak2013 What we got........Samsara Blues Experiment is a German band that was founded by Christian Peters, after his exit as a guitarist at Terraplane, in the summer of 2007.\n\nIn the fall of 2008, Richard Behrens found himself in Berlin by the current line with Hans Eiselt on second guitar, on bass and drummer Thomas Vedder, all of which already played in numerous underground bands and are still active. The musical style of samsara blues experiment consists of a mixture of stoner rock , psychedelic rock and folk influences, which, above all, the influence of Indian raga music has to be mentioned.\n\nAfter publication of the first demos, the band played several concerts in Germany, on the west coast of the U.S.  , Italy  , Austria, the Netherlands and Belgium  , such as on the Yellow Stick Festival 2009 in Geel .  Finally, the debut album &quot;Long Distance Trip&quot; at World In Sound Records / In March 2010, Rough Trade released.  In 2010, the band was, among other on scene festivals such as the Burg-Herzberg Festival  , the Yellow Stock  and the Stoned From The Underground Festival  to see.\n\n2011 followed by other European tours and a further appearance at the Roadburn Festival with &quot;Revelation &amp; Mystery&quot;, the second album. Also at World In Sound / Rough Trade released the band a little straighter, less psychedelic direction was received it and was like, among others praised Rock Hard in the national press. 2012 there was a re-release of &quot;USA demo&quot; CD Cover Design with neuaufbereitetem at the newly founded by Christian Peters Electric Magic Label Records. This was followed by more concerts in South and East Europe, including headlining Robust festival in Kiev. In October of the same year Samsara Blues Experiment played on the WDR Rockpalast Crossroads Festival in Bonn.\n\nIn spring 2013 the band's Rockpalast concert released on CD by Electric Magic Records. On 14 November 2013, the band put their third studio album &quot;Waiting For The Flood&quot; by which was also re-released on Electric Magic Records. As both predecessor was the album that has four long tracks with a total length of almost 50 minutes, recorded at Big Snuff Studio in Berlin by bassist Richard Behrens and produced. The cover artwork was done by the Polish artist Zdzislaw Beksinski. So thats there story so far Im liking this band. So get it ........","torrent":{"xt":"urn:btih:9672a88f94b1df2391f5d4f25f52912d394096a3","amp;dn":"Samsara+Blues+Experiment-Live+At+Rockpalast+320k+mp3++ak2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9672a88f94b1df2391f5d4f25f52912d394096a3","infoHashBuffer":{"type":"Buffer","data":[150,114,168,143,148,177,223,35,145,245,212,242,95,82,145,45,57,64,150,163]},"announce":[],"urlList":[]}}