{"title":"Reaching Down the Rabbit Hole- Allan Ropper (Neurology) [StormRG","uid":11511703,"size":2067798,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:969024196f1013dbb3264eafce5f84b7bcd74866&amp;dn=Reaching+Down+the+Rabbit+Hole-+Allan+Ropper+%28Neurology%29+%5BStormRG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"0xmovva","files":4,"time":1416407985,"description":"TITLE/EDITION Reaching Down the Rabbit Hole: Extraordinary Journeys into the Human Brain \nAuthor: Allan Ropper (Author), Brian David Burrell (Author)\nPrint Length: 272 pages\nPublisher: Atlantic Books (October 2, 2014)\nLanguage: English\nHardback ISBN: 978 1 782 39547 8\nTrade Paperback ISBN: 978 1 782 39548 5\nEBook ISBN: 978 1 782 39549 2\nASIN: B00LRHW99U\nFormat: Retail PDF\nNOTE: this is the standalone ebook and may not include access codes that come packaged with the bound book\n\n___________________________________________________________________________________\n\n\nWhat is it like to try to heal the body when the mind is under attack? In this gripping and illuminating book, Dr Allan Ropper reveals the extraordinary stories behind some of the life-altering afflictions that he and his staff are confronted with at the Neurology Unit of Harvard's Brigham and Women's Hospital.\n\nNeurologists diagnose and treat serious illnesses of the brain by combining the hard science of medical knowledge with the art of intuitive reasoning. The unique challenge they face is that their primary sources of information - the patients' brains - are quite often altered, sometimes bizarrely, as a result of disease. Like Alice in Wonderland, Dr Ropper inhabits a place where absurdities abound:\n\nÂ· A sportsman who starts spouting gibberish;\n\nÂ· An undergraduate who suddenly becomes psychotic;\n\nÂ· A salesman who drives around and around a roundabout, unable to get off;\n\nÂ· A child molester who, after falling on the ice, is left with a brain that is very much dead inside a body that is very much alive;\n\nÂ· A figure skater whose body has become a ticking time-bomb;\n\nÂ· A mother who has to decide whether a life locked inside her own head is worth living.\n\nHow does one begin to treat such cases, to counsel people whose lives may be changed forever? How does one train the next generation of clinicians to deal with the moral and medical aspects of brain disease? Dr Ropper answers these questions by taking the reader into a world where lives and minds hang in the balance","torrent":{"xt":"urn:btih:969024196f1013dbb3264eafce5f84b7bcd74866","amp;dn":"Reaching+Down+the+Rabbit+Hole-+Allan+Ropper+%28Neurology%29+%5BStormRG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"969024196f1013dbb3264eafce5f84b7bcd74866","infoHashBuffer":{"type":"Buffer","data":[150,144,36,25,111,16,19,219,179,38,78,175,206,95,132,183,188,215,72,102]},"announce":[],"urlList":[]}}