{"title":"Space Jam - Motion Picture Soundtrack 320cbr (Big Papi) 1996 Rap","uid":9438225,"size":154409524,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:970c3f19c4e90442b880dd93e1e9360370d1d408&amp;dn=Space+Jam+-+Motion+Picture+Soundtrack+320cbr+%28Big+Papi%29+1996+Rap&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":9,"uploader":"Big-Papi","files":-1,"time":1388946505,"description":"Source:  1996 CD\n\nSpace Jam - Motion Picture Soundtrack 320cbr (Big Papi) 1996 Rap Hip Hop Warner Bros\n\n\n\nBy Anthony Rupert\nWhen I first heard that there was a new movie called Space Jam starring Michael Jordan and Bugs Bunny, I was like, &quot;Huh?&quot; I wasn't really interested in seeing it (it turns out the movie IS pretty good), but I heard from my friends that the soundtrack is pretty decent. I listened to it, and they were right.\nThe soundtrack seems to be PG-rated (if THAT), and it's a good thing because the movie is like that too. But another thing is that it seems to be targeted toward the high school audience (I was 15 when this came out), so if you're over 18, don't expect to be bumping this in your car or anything. This isn't to say the soundtrack is bad. There are great songs like R. Kelly's &quot;I Believe I Can Fly&quot;, Monica's &quot;For You I Will&quot;, and D'Angelo's &quot;I Found My Smile Again&quot;. All-4-One also shows up to sing &quot;I Turn To You&quot;, which most people probably didn't know was recorded before Christina Aguilera's 2000 #3 hit. I like Christina's rendition better, but this version is still good.\n\nSince Space Jam is about basketball, it wouldn't be right not to have some energetic tracks on here. B-Real, Busta Rhymes, Coolio, LL Cool J and Method Man bring us The Monstars' Anthem (the Monstars were the opposing team in the movie), otherwise known as &quot;Hit `Em High&quot;. And the title track, performed by Quad City DJs, is decent, but all their songs sound the same to me.\n\nThe last song is the humorous &quot;Buggin'&quot; as performed by Bugs Bunny (and was written by Jay-Z, I must add). Bugs and the other characters are voiced by Billy West (best known as the voice of the Honey Nut Cheerios bee), but at the end of the song it sounds like he's getting lazy with the voice (of Bugs, anyway). And I'm not exactly sure why Robin S. (of &quot;Show Me Love&quot; fame) is on here, but her &quot;Givin' U All That I've Got&quot; sounds like her other songs too. But regardless, this soundtrack was a perfect match for the movie. I don't really listen to it that much now, but it's still great.","torrent":{"xt":"urn:btih:970c3f19c4e90442b880dd93e1e9360370d1d408","amp;dn":"Space+Jam+-+Motion+Picture+Soundtrack+320cbr+%28Big+Papi%29+1996+Rap","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"970c3f19c4e90442b880dd93e1e9360370d1d408","infoHashBuffer":{"type":"Buffer","data":[151,12,63,25,196,233,4,66,184,128,221,147,225,233,54,3,112,209,212,8]},"announce":[],"urlList":[]}}