{"title":"The L Word - Season 4 (gremster)","uid":4225743,"size":4400442925,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:97b4cc0f81584bd71a22c11d023b07811c54e1fb&amp;dn=The+L+Word+-+Season+4+%28gremster%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":3,"uploader":"gremster","files":13,"time":1212814433,"description":"Season 4, Episode 1: Legend in the Making\nOriginal Air Date: 7 January 2007\nIn the aftermath of the events in Canada, Bette is on the run her infant daughter, Angelica, while a vengeful Tina tries to track them down. However, a serious intervention from Joyce Wischnia makes them re-think their situation for baby Angelica&amp;#039;s sake. Shane returns to Los Angeles after her abortive wedding to Carmen and reverts back to her old bad habits of drinking and drugs while staying at the debauched Cherri Jaffe&amp;#039;s beach house. Later, Shane gets a surprise visit from her father&amp;#039;s wife/stepmother Carla. Meanwhile, Helena tries to get used to living without her mother&amp;#039;s money with Alice&amp;#039;s help. Max attends a support group for her/his latest sexual orientation, while Kit has trouble with her pregnancy and must struggle with a hard decision for an abortion with Angus&amp;#039;s support. Also, Jenny&amp;#039;s semi-autobiographical book finally gets published and she has a book signing at the Planet with Claude in attendance, and gets a surprise when her former flame, Marina Ferrer, also shows up.\n\n\nSeason 4, Episode 2: Livin&amp;#039; La Vida Loca\nOriginal Air Date: 14 January 2007\nAlice meets Papi, a very sexually aggressive Latina woman who lights up on The Chart even more than Shane, with over 1,000 conquests, and she shows Alice her &amp;#039;magic&amp;#039; ability to seduce women. Meanwhile, Jenny is interviewed by a gay writer, named Stacey Merkin, for research for her new book. Bette starts her new job as the dean of California Art College and meets her new boss, Phyllis Kroll, who later has some surprising news for her. Bette also has a meeting of minds with Nadia, a student who charms her into hiring her as her teaching assistant. Tina is forced by her pompous new boss, Aaron, to fire Helena from the studio. Homeless, Helena asks to stay with Alice until she can find a place of her own. Shane is stuck babysitting her nine-year-old half-brother, Shay, after he is abandoned by his mother, and he rapidly grows alienated with Shane&amp;#039;s indifference to his presence. Also, Max&amp;#039;s boss sets him up on a date with his daughter Brooke, a straight woman who is not aware of her former gender.\n\n\nSeason 4, Episode 3: Lassoed\nOriginal Air Date: 21 January 2007\nTina throws a party for the girls at hers and Henry&amp;#039;s house, but the ladies do not mingle well with Tina&amp;#039;s new conservative and straight friends. Kit holds a Western-themed party at the Planet, while Bette&amp;#039;s boss, Phyllis, arrives wanting a part of the action after she comes out to Bette. After meeting the girls for the first time, Shane takes an instant dislike to Papi, while Phyllis develops an attraction to Alice. Meanwhile, a penniless Helena begins looking for a job in which Shane gives her one at WAX as a receptionist. But Helena continues to have problems adjusting to the blue-collared working world. Angus gets some good news over a record deal, but later becomes deflated when his band drops him. Shane tries to get Shay accepted into a local elementary school despite his lack of paperwork. Elsewhere, Max continues hiding his true sexual gender from Brooke. At California Art College, Bette&amp;#039;s teaching assistant, Nadia, begins having romantic feelings for her and Bette eventually throws herself into an ill-advised affair. Also, a revenge-seeking Jenny tries to dig up dirt on the journalist who panned her book.\n\n\nSeason 4, Episode 4: Layup\nOriginal Air Date: 28 January 2007\nBette deals with the consequences after controversial artwork by the deaf and liberal Jodi Lerner upsets a potential university donor. Bette also tells her T.A., Nadia, to call it quits because their affair could jeopardize both of their careers. Meanwhile, Papi challenges Alice and the rest of the girls to a grudge basketball game. On the court, Alice, Jenny, the overweight and out-of-shape Kit, and the others reject Tina, who ends up playing for Papi&amp;#039;s team. Bette also fears for the worst after learning that her boss, Phyllis, and Alice are secretly dating. Elsewhere, Max reveals his gender secret to Brooke, who predictably responds negatively. After Jenny&amp;#039;s book fails from the single bad review, she embarks on a twisted quest to get back at the journalist that panned her by targeting her girlfriend, Lindsey, who works in a veterinary hospital and using her sociopath skills of manipulation to play on her sympathies. Angus has a run-in with baby Angelia&amp;#039;s new au par French nanny, Hazel. Shane has a meeting of minds with Paige Sobel, the mother of one of Shay&amp;#039;s classmate&amp;#039;s. Soon, Shane is out of $5,000 after Shay breaks his arm. With no medical insurance, Shane swallows her pride and self-esteem by modeling for a men&amp;#039;s underwear design.\n\n\nSeason 4, Episode 5: Lez Girls\nOriginal Air Date: 4 February 2007\nBette decides to break up with Nadia by telling her that their forbidden romance could jeopardize both of their careers. Meanwhile, Helena tries to cater to a party that Phyllis throws at her house, while she continues to have her own steamy affair with Alice. But later, Alice ends it with Phyllis after meeting her husband, Leonard. Alice also gets upset by one of Jenny&amp;#039;s short stories, titled &amp;#039;Lez Girls&amp;#039; which gets published in &amp;#039;The New Yorker&amp;#039; magazine. Bette struggles with her growing feelings for Jodi. Max also fears for his job after his breakup, but good luck still stays with him. In the meantime, Jenny continues her deranged quest to destroy Stacy Merkin by going after her girlfriend Lindsey, and fueling the conflict between them. Tina and Henry catch Angus in a compromising position with their nanny Hazel. But when Tina confides in Bette about it, she persuades her not to tell Kit to avoid hurting her feelings. Also, Shane continues to keep Paige company over them babysitting for Shay and Jarrod.\n\n\nSeason 4, Episode 6: Luck Be a Lady\nOriginal Air Date: 11 February 2007\nControl freak Bette enjoys her new romance with Jodi while at the same time, she clashes with Tina over Angelica&amp;#039;s preschool choices, and weathers the fallout over Alice&amp;#039;s breakup with Phyllis thinking that it could affect her job. Bette also confronts Angus over his infidelity and persuades him to end his tryst with Hazel. Meanwhile, Papi and her gruff friends teach Helena and Alice to how to play poker. Shane is invited to a movie premiere to promote her underwear ad while she also tells Jarod&amp;#039;s mother, Paige, that she not interested in a romance between them. At the party, Alice strikes up a talk with Papi&amp;#039;s friend Tasha Williams, a U.S. Military servicewoman. Helena also faces off against high-roller Catherine Rothburg in a all-out poker game. Elsewhere, Jenny&amp;#039;s evil quest to get even with Stacy finally reaches it&amp;#039;s climax when Jenny lures Stacy away from Lindsey in order to seduce her and hoping Stacy will find out. Also, Max fears his co-workers will learn his/her gender secret when he goes up against an office supervisor who sexually discriminates against a female co-workers.\n\n\nSeason 4, Episode 7: Lesson Number One\nOriginal Air Date: 18 February 2007\nHelena struggles to find a way to pay off pay her $50,000 poker debt to Catherine, who gives her an option out: an all-out, one-on-one card game of strip gin rummy to erase Helena&amp;#039;s debit. Tina approaches Jenny with an offer by her studio boss to film one of Jenny&amp;#039;s stories into a movie. Meanwhile, Bette&amp;#039;s new relationship with Jodi heats up and they both end up getting the task of consoling the grieving Phyllis over her break-up with Alice. Elsewhere, Tasha has troubles letting go of the past during her tour of duty in Iraq, and pushes Papi away who offers her sympathy. Alice then takes it upon herself to visit Tasha at the military base where she is stationed, and both decide to give their growing romance a chance. Max becomes more uncomfortable with his co-workers who mistakenly think that that he is gay instead of a transsexual. Kit accidentally learns about Angus infidelity after Tina inadvertently tips her off about it. Also, Shane and Paige grow even more closer when they visit Shay and Jarod&amp;#039;s elementary school to hold a talk about tolerance of peoples sexual orientation.\n\n\nSeason 4, Episode 8: Lexington and Concord\nOriginal Air Date: 25 February 2007\nA heated argument over politics as well as the issue of race turns into passion for both Alice and Tasha who finally consummate their growing romance. Shane and Paige grow closer leading to consummate their romance... in the front seat of Shane&amp;#039;s car. Kit has a public breakdown during a stage act at the Planet and she exposes Angus for his infidelity. Afterwards, Papi takes Kit out to drown her sorrows at a salsa nightclub. Meanwhile, Tina gets introduced to Jodi by Bette, while both of them have a meeting with Jenny&amp;#039;s new pompous film agents. Elsewhere, Helena falls deeply into the debauched gambling profession under the sinister Catherine Rothburg&amp;#039;s iron fist and lusty advances. Also, Max meets with Grace, an investor interested in purchasing Alice&amp;#039;s website.\n\n\nSeason 4, Episode 9: Lacy Lilting Lyrics\nOriginal Air Date: 4 March 2007\nJenny and Tina look for the right movie director for Jenny&amp;#039;s screenplay, but they soon butt heads over creative differences and their directors view of how to film the project. Later Jenny gets a surprise when Marina shows up waiting a singing part in a proposed musical version of the movie. Meanwhile, Phyllis&amp;#039; husband, Leonard, drops by unannounced at Alice&amp;#039;s place interrupting her and Tasha&amp;#039;s romantic morning-after to unload on them about his midlife problems, while Helena and Papi also drop by to offer their sympathy. Meanwhile, Bette is falling hard for Jodi and lets her emotions and jealousy interfere with her work when she spots Jodi with her ex-partner Amy, a fellow deaf student. Kit manages to crack through Papi&amp;#039;s hard emotional outer shell... with unexpected consequences. Also, Shane&amp;#039;s father, Gabriel, arrives back in town wanting to take Shay with him back to Portland, and Max learns that his mother has died from a brief bout with cancer.\n\n\nSeason 4, Episode 10: Little Boy Blue\nOriginal Air Date: 11 March 2007\nKit&amp;#039;s break-up with Angus causes to relapse into drinking. Meanwhile, Bette introduces Jodi to the rest of the girls at a dinner party at her house. But Bette&amp;#039;s controlling and bossy attitude doesn&amp;#039;t sit well with Jodi, or anyone else. Jenny and Tina finally agree on hiring a director, the lesbian feminist Kate Arden, who becomes interested in Tina. Catherine and Helena take Alice, Tasha, Jenny, Shane, Papi, and Kit out to the racetrack to bet on horse racing, and Helena ends up losing over $100,000 of Catherine&amp;#039;s money by betting on the wrong horse. Shane tries to numb her loss of Shay by bonding more with his friend Jarod, while Paige looks on incredulously. Tasha becomes more uncomfortable about being seen in public with Alice. Elsewhere, Grace accompanies Max to his hometown for his mother&amp;#039;s funeral where he instantly clashes with his estranged, bigoted father over Max/Moria&amp;#039;s strong decision for the gender change.\n\n\nSeason 4, Episode 11: Literary License to Kill\nOriginal Air Date: 18 March 2007\nIn aftermath of the disastrous get-together dinner, Bette finds out that Jodi has been offered a job at an art center on the East Coast and she coldly pushes Bette away. In the meantime, Phyllis talks with Leonard and their daughter, Molly, about her coming out. Tasha&amp;#039;s memories of her service in Iraq continue to haunt her, and she ordered by her commanding officer to keep her sexual orientation a secret. While Tina and Kate Arden continue to talk about the movie project, Bette becomes angered by a description of herself in Jenny&amp;#039;s book. Meanwhile, Shane plans a surprise birthday for Paige by inviting her and Jarod to the Planet to see Alison Goldfrapp perform. Helena is kicked out of her hotel suite, and Max comes to a decision regarding his job when he quits and escalates his romance with Grace. Kit continues to treat Angus coldly while further sliding into drinking, despite Papi&amp;#039;s persuasion to stop. Also, Tina has a serious talk with Henry about how emotionally distant they have become recently.\n\n\nSeason 4, Episode 12: Long Time Coming\nOriginal Air Date: 25 March 2007\nPaige decides it&amp;#039;s time to confess the truth to her son, Jared, about her romance with Shane. When Jared reacts negatively, Shane tries consider a more permanent solution by considering buying a house so they all can live together. Alice has a hard time accepting that Tasha is heading back to Iraq for another tour of duty and feels betrayed that Tasha never revealed her intentions of returning to war before allowing Alice to fall in love with her. Helena looks for a way out from the evil Catherine&amp;#039;s financial clutches and seizes an opportunity (with both hands) to get out of the gambling high life... by stealing all of Catherine&amp;#039;s ill-gotten cash and splitting town. Papi helps spearhead a beach side going away party for Tasha. Bette gets a heaping dose of honesty from Tina when she looks to her for advice on wooing back Jodi who&amp;#039;s left for upstate New York, which leads Bette to ask Alice and Shane for help to construct a large artwork to win Jodi back. Tina returns to the lesbian fold and Kate Arden let&amp;#039;s her know she&amp;#039;s interested, but Tina has eyes for someone else: Bette. Phyllis gets more than legal advice from Joyce Wischnia when she pursues a divorce. Fearing that the mentally unbalanced, sociopath Jenny may cause the studio to pull out of producing &amp;#039;Lez Girls,&amp;#039; Tina and Kate Arden unwisely decide to exclude her from a meeting with executives. But Jenny uncovers their plans and barges in the meeting anyhow, and apparently ruins the whole deal. But later, Kate has a surprise for Jenny by firing Jenny and hiring the vindictive Stacey Merkin to take over the screen writing for the movie. Also, Max decides to go to San Francisco to get his final gender change surgery underway, and Kit slowly becomes warmer to Angus once again.\n","torrent":{"xt":"urn:btih:97b4cc0f81584bd71a22c11d023b07811c54e1fb","amp;dn":"The+L+Word+-+Season+4+%28gremster%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97b4cc0f81584bd71a22c11d023b07811c54e1fb","infoHashBuffer":{"type":"Buffer","data":[151,180,204,15,129,88,75,215,26,34,193,29,2,59,7,129,28,84,225,251]},"announce":[],"urlList":[]}}