{"title":"Getting Started with Laravel 4 - Packt (2014) PDF - GOLU","uid":10357104,"size":1661175,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9832819ffb4cfb782e5be7998de6d936637c6628&amp;dn=Getting+Started+with+Laravel+4+-+Packt+%282014%29+PDF+-+GOLU&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"GOLU","files":-1,"time":1402759013,"description":"Publisher: Packt Publishing (January 20, 2014)\nLanguage: English\nISBN-10: 1783287039\nISBN-13: 978-1783287031\n\nDescription:\nPHP powers many of the largest websites on the planet. Yet, even though it was specifically created for the Web, its shortcomings never cease to frustrate developers. This is where a tool like Laravel comes in. Rather than reinventing the wheel, Laravel reuses tried and tested components and principles and bundles them to form a cohesive whole and makes PHP development enjoyable again.\n\nGetting Started with Laravel 4 is a practical and concise introduction to the Laravel PHP framework. It covers its fundamental concepts and presents the many features that will boost your productivity when developing web applications. After introducing the key concepts and installing Composer, you will build a CRUD application and add more features to it in each successive chapter.\n\nThis book introduces you to a different and more enjoyable way of writing PHP applications. You will start by learning about the key principles and the same development practices that Laravel encourages. Then, in subsequent chapters, you will create and successively add more features to a web application.\n\nYou will learn how to use the arsenal of tools at your disposal and probably pick up some useful techniques along the way. Indeed, everything you will learn in this book is highly transferrable and applicable to other MVC frameworks. Laravel's routing mechanism, templating language, and object-relational mapper will have no more secrets for you. You will learn how to authenticate users, write tests, and create command line utilities that interact with your application with disconcerting ease. In addition to this, you will probably be surprised by the simplicity and expressiveness of your code.\n\n\n\n*Keep Learning and help us to share the knowledge across the World.\n tweet us @teamGOLU","torrent":{"xt":"urn:btih:9832819ffb4cfb782e5be7998de6d936637c6628","amp;dn":"Getting+Started+with+Laravel+4+-+Packt+%282014%29+PDF+-+GOLU","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9832819ffb4cfb782e5be7998de6d936637c6628","infoHashBuffer":{"type":"Buffer","data":[152,50,129,159,251,76,251,120,46,91,231,153,141,230,217,54,99,124,102,40]},"announce":[],"urlList":[]}}