{"title":"T.G.British.Bake.Off-S07E07.-.Extra.Slice-S03E07--w.subs-540p","uid":15980208,"size":1098018879,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:98679becec11cb8972589afefb77ea422dc42df7&amp;dn=T.G.British.Bake.Off-S07E07.-.Extra.Slice-S03E07--w.subs-540p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":8,"uploader":"uggauga","files":4,"time":1475887310,"description":"The Great British Bake Off - S07E07\r\n&amp;\r\nThe Great British Bake Off: An Extra Slice - S03E07\r\n\r\nBBC (2016)\r\n \nhttp://www.bbc.co.uk/programmes/b07r2pr0 \nhttp://www.bbc.co.uk/programmes/b07r1ff2\r\n\r\n_______________________________________\r\n\r\n960x540 resolution - MP4 files\r\n\r\nVideo Codec h.264\r\nAudio Codec AAC\r\n\r\nWith subtitles - Enjoy !!\r\n_______________________________________\r\n\r\nDessert Week\r\nThe Great British Bake Off, Series 7 Episode 7 of 11\r\nWeek seven of The Great British Bake Off is Dessert Week - three sweet challenges which will mean a bitter end for one of the six remaining bakers as they battle for a place in the quarter-final.\r\nFor starters the bakers face a sweetly filled signature challenge that has them rolling out their skills to impress Mary and Paul.\r\nAnd if that wasn't enough, the technical challenge is one of the toughest of the series so far, which layers on the pressure as the bakers are tested on a tricky French dessert.\r\nSue heads to Paris for a lesson on the history of praline and nibbles on a few of these nutty delicacies.\r\nAnd finally there is a multi-bake mini-showstopper that is a bit of a mousse marathon. But which of the bakers will impress Mary and Paul enough to earn their place in the quarter-final, and which baker will be hanging up their apron and heading home?\r\n\r\nEpisode 7\r\nThe Great British Bake Off: An Extra Slice, Series 3\r\nIt is dessert week in the Great British Bake Off tent and just six bakers remain.\r\nJoining host Jo Brand in the An Extra Slice studio are three celebrity Bake Off fans - double Olympic silver medalist Rebecca James, Crème de la Crème judge Cherish Finden and comedian Chris Addison. Jo and her guests dissect the latest goings on in the tent, taste the desserts the studio audience have brought along and look at pictures of viewer bakes from home, from the incredible to the frankly inedible. And Jo interviews the latest baker to leave the tent and reveals unseen footage from the BBC One show.\r\nWhat do the panel think of the bakers' attempts at this week's sweet signature? Did the right baker come top in the French dessert technical? And whose multi-bake mousse shone in the showstopper?\r\nThe Great British Bake Off: An Extra Slice - when one helping of Bake Off just isn't enough","torrent":{"xt":"urn:btih:98679becec11cb8972589afefb77ea422dc42df7","amp;dn":"T.G.British.Bake.Off-S07E07.-.Extra.Slice-S03E07--w.subs-540p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98679becec11cb8972589afefb77ea422dc42df7","infoHashBuffer":{"type":"Buffer","data":[152,103,155,236,236,17,203,137,114,88,154,254,251,119,234,66,45,196,45,247]},"announce":[],"urlList":[]}}