{"title":"Guitar FX BOX 2.6","uid":3922147,"size":1239053,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:988a289ffa747bf123f7d44ed595d18f88c312f7&amp;dn=Guitar+FX+BOX+2.6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"electroacoustic","files":3,"time":1196878097,"description":"You are looking for a real-time sound (guitar/voice) processor? You need one with very low I/O latency? And to contain excellent quality effects (REAL effects - not just some simple time delay effects like echo, chorus, flanger)? And that is easy to use, and small for download? And that is very affordable? Well, you\\&amp;#039;ve come to the right place!!!\n\nWhat does Guitar FX Box do?\n\nJust plug your guitar into the sound card input, start Guitar FX BOX and your guitar will scream and sing like you are using expensive analog effect pedals. You can apply a wide range of high quality effects to guitar, voice and other inputs. This high quality sound processing program is acting just like a good collection of guitar effects pedals. You can use several of them at the same time, even all if you need so.\n\nGuitar FX BOX does REALLY real-time DSP. Signal is sampled from sound card input, processed and then send to the output with VERY LOW LATENCY. It\\&amp;#039;s NOT like all those \\&quot;real-time\\&quot; DirectX plugins which outputs signal whole second or more after they received it. I/O delay with Guitar FX BOX is extremely low, virtually undetectable! This is achieved using DirectSound (or WDM streaming) for fast access to the hardware (sound card) and fast DSP algorithms optimized for real-time processing. Through DirectSound, latency is about 20ms with most sound cards, or even less. When WDM streaming driver is used, latency can go as low as 5ms! Nevertheless, exact total i/o latency still depends on hardware/drivers.\n\nWith program panel very descriptive, user interface intuitive and friendly, this is ultimate application for real-time effects processing. Any program option is just one or two mouse clicks away.\n\nEverything is real-time, every slider move results in instant change of produced sound.\n\nThe \\&quot;BOX\\&quot; currently contains these high quality effects:\nOverdrive/Distortion, Echo, Reverb, Chorus, Wah-wah (AutoWah &amp; EnvelopeWah), Pitch shifter, Tremolo, I/O Bass/Mid/Treble EQ controls, Compression and Phaser. Also, handy guitar tuner included.","torrent":{"xt":"urn:btih:988a289ffa747bf123f7d44ed595d18f88c312f7","amp;dn":"Guitar+FX+BOX+2.6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"988a289ffa747bf123f7d44ed595d18f88c312f7","infoHashBuffer":{"type":"Buffer","data":[152,138,40,159,250,116,123,241,35,247,212,78,213,149,209,143,136,195,18,247]},"announce":[],"urlList":[]}}