{"title":"Powderfinger - Discography","uid":6449351,"size":1029221175,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:98ba3994039ad0a8dd10c741ff88c159eccd8e9d&amp;dn=Powderfinger+-+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":5,"uploader":"piratetorrent1989","files":148,"time":1307366777,"description":"Powderfinger was an Australian rock band that formed in Brisbane in 1989. From 1992 until their break-up the band line-up consisted of vocalist Bernard Fanning, guitarists Darren Middleton and Ian Haug, bassist John Collins, and drummer Jon Coghill.\n\nPowderfinger became a commercial success with their third studio album Internationalist in 1998. The followed up that success with several hit singles and award-winning works, earning a total of eighteen ARIA Awards and making them the most awarded band behind Silverchair. Numerous Powderfinger albums have reached multiple-platinum status, as well as top 5 rankings in the weekly Australian music charts. Odyssey Number Five, Powderfinger's most successful album earned over eight platinum certifications and ARIA Awards in five different categories.\n\nAfter the release of their first DVD These Days: Live in Concert and a &quot;best of&quot; release, Powderfinger announced a hiatus in 2005. The announcement of a two month-long nationwide tour with Silverchair titled Across the Great Divide followed the release of their sixth studio album, Dream Days at the Hotel Existence in June 2007.\n\nPowderfinger was actively involved in philanthropic causes. In 2005, they performed at a WaveAid concert in Sydney, to help raise funds for areas affected by the 2004 Indian Ocean earthquake. Another performance at the Sydney Opera House in October 2007 raised funds for breast cancer victims and their families. The aim of their recent Across the Great Divide tour was to promote the efforts of Reconciliation Australia, and to promote awareness of the gap in life expectancy between Indigenous and non-Indigenous children.\n\nOn the morning of Friday 9 April 2010 Powderfinger announced at a press conference that they would be breaking-up after their &quot;Sunsets&quot; tour, saying it would be their last ever as the band had musically said everything they wanted to say. On 13 November 2010, Powderfinger played their last concert as a band, signifying their departure and the splitting of Powderfinger.","torrent":{"xt":"urn:btih:98ba3994039ad0a8dd10c741ff88c159eccd8e9d","amp;dn":"Powderfinger+-+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98ba3994039ad0a8dd10c741ff88c159eccd8e9d","infoHashBuffer":{"type":"Buffer","data":[152,186,57,148,3,154,208,168,221,16,199,65,255,136,193,89,236,205,142,157]},"announce":[],"urlList":[]}}