{"title":"Feed Zone Portables: A Cookbook Of On-The-Go Food For Athletes -","uid":11588474,"size":11700682,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:98c03ff7572485c345784ad7fee6b54f4ea36636&amp;dn=Feed+Zone+Portables%3A+A+Cookbook+Of+On-The-Go+Food+For+Athletes+-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"MentalZero","files":-1,"time":1417200723,"description":"When Dr. Allen Lim left the lab to work with pro cyclists, he found athletes weary of processed bars and gels and the same old pasta. So Lim joined professional chef Biju Thomas to make eating delicious and practical. Their groundbreaking Feed Zone Cookbook brought the favourite recipes of the pros to everyday athletes. In their new cookbook Feed Zone Portables, Chef Biju and Dr. Lim offer 75 all-new portable food recipes for cyclists, runners, triathletes, mountain bikers, climbers, hikers, and backpackers. Each real food recipe is simple, delicious, easy to make - and ready to go on your next ride, run, climb, or hike. Feed Zone Portables keeps all the most popular features of The Feed Zone Cookbook including quick and easy recipes for athletes, beautiful full-colour photographs of every dish, complete nutrition data, tips on why these are the best foods for athletes, and time-saving ways on how to cook real food every day. Try out new rice cakes, two-bite pies, griddle cakes, waffles, baked eggs, sticky bites, rice balls, paninis, cakes, and cookies. Wherever you go, these real foods will nourish your best performance","torrent":{"xt":"urn:btih:98c03ff7572485c345784ad7fee6b54f4ea36636","amp;dn":"Feed+Zone+Portables%3A+A+Cookbook+Of+On-The-Go+Food+For+Athletes+-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98c03ff7572485c345784ad7fee6b54f4ea36636","infoHashBuffer":{"type":"Buffer","data":[152,192,63,247,87,36,133,195,69,120,74,215,254,230,181,79,78,163,102,54]},"announce":[],"urlList":[]}}