{"title":"Sexually Broken--Stunning Veruca James utterly destroyed by cock","uid":10811354,"size":978016451,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:98e1e54a147a830799eacc2f157288e369eb795f&amp;dn=Sexually+Broken--Stunning+Veruca+James+utterly+destroyed+by+cock&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":4,"uploader":"merzedes","files":-1,"time":1408433191,"description":"\nStunning Veruca James utterly destroyed by cock, brutal pounding, epic deepthroat, multiple orgasms! | Veruca James | Jack Hammer | Matt Williams\n\nAugust 18, 2014\n\n\nHigh MP4 only.\n\n\nToday we happily welcome back the stunning Veruca James. We keep inviting her back because of her genuine love and enthusiasm of sex and bondage. This is not not some bored starlet coasting through for a paycheck, Veruca James is a sexual animal that needs to be unleashed. It shows in her eyes and eager holes.\n\nStarting off with our pale starlet bound and blindfolded in a brutal strappado that perfectly showcases her flawless ass, Veruca is ripe for the plucking. All we have to to is walk up and walk right in. Which is exactly what we do. There are no panties as a barrier, that cunt is open for access. One after another the hard dicks make full use of her tight holes. 10 inches of BBC reshape her tight pussy as she repeatedly cums, revealing the slut that she is.\n\nAs fun as that pussy is, we want full access to all those holes, and we take Veruca out of the strappado and drop her to her knees. Veruca is at the top 1 percent of deepthroaters out there today, and we make full use of that well trained throat. She does not disappoint. She makes all 10 inches of BBC disappear like a magician does a rabbit. We rip off the blindfold so that we can see those big eyes as she services our cock.\n\nTime for the destruction. We quickly bind her into a wooden bondage device that exposes both ends for a merciless dicking down. And then it is just a matter of unleashing the floodgates. Both cocks attempt to meet in the middle. Veruca is fucked without mercy, completely restrained and unable to escape the dick. It does the trick. Veruca is destroyed, reduced to a twitching drooling puddle of porn starlet. The look of utter abandon is reward enough and why we keep inviting her back. Can you blame us? \n \nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2014/08_18vjames7/SexuallyBroken--Stunning-Veruca-James-utterly-destroyed-by-cock-brutal-pounding-epic-deepthroat-multiple-orgasms.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2014/08_18vjames7/SexuallyBroken--Stunning-Veruca-James-utterly-destroyed-by-cock-brutal-pounding-epic-deepthroat-multiple-orgasms.php&lt;/a&gt;\n\n15 000 Femdom/BDSM/Fetish torrentuploads in the box, no reason to stop now is there ? :)\n\nJust keep on leaving us the nice comments below and we are happy :)\n\n\nAny Questions ?? Read our FAQ!!\n   &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)\n\n\n","torrent":{"xt":"urn:btih:98e1e54a147a830799eacc2f157288e369eb795f","amp;dn":"Sexually+Broken--Stunning+Veruca+James+utterly+destroyed+by+cock","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98e1e54a147a830799eacc2f157288e369eb795f","infoHashBuffer":{"type":"Buffer","data":[152,225,229,74,20,122,131,7,153,234,204,47,21,114,136,227,105,235,121,95]},"announce":[],"urlList":[]}}