{"title":"Assassins Creed 2 Launcher (Crack)","uid":5500416,"size":4383498,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9910eda95fe031b2cd933ed352ad9d5356274ffc&amp;dn=Assassins+Creed+2+Launcher+%28Crack%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"MartanElite","files":1,"time":1271464924,"description":"This is a laucher for Assassins Creed II. It's almost like a crack. It has an auto updater too!\n\nF.A.Q.\n\nQ: What's it's main goal?\nA: The main goal of this application is to make the whole process of playing the non-legit AC2 more user-friendly and closer to one-click.\n\nQ: What does it do?\nA: As soon as this application is launched it will automatically detect your AC2 and Ubisoft Game Launcher installation folders, download a newer modified version of UGL, which will connect to a server provided with the latest values instead of Ubisoft's, letting you play the game freely without having to run a server locally, change hosts and stuff. Now if the launcher doesn't detect an active internet connection or detects that the server is offline, it will launch a server locally so that you can still play.\n\nQ: Ubisoft Game Launcher asks for a username and password. What do I do?\nA: You can login with any username/password combination.\n\nQ: Ubisoft Game Launcher asks for a serial number. What should I write?\nA: Close it and launch my launcher again.\n\nQ: When Leonardo fixes my blade the game freezes. What should I do?\nA: The game doesn't freeze. You must just press &quot;2&quot;.\n\nQ: What if you release a newer version of your application? Do I have to download it again?\nA: No, when a newer version is available the application will prompt you to download it.\n\nQ: But what if I launch AC2 without your Launcher? Will it update to the latest legit version - making it unplayable?\nA: No, as soon as my launcher is launched one time with an active internet connection it will download a modified version of UGL, which will only auto-update from my server.\n\nQ: What if my internet disconnects while I'm in-game?\nA: The game will display a &quot;Lost Network Connection&quot; message. As soon as internet connection is regained the game will reconnect to the server and will let you continue the game.\n\nQ: It says that I don't have Assassin's Creed II installed while I have it.\nA: First of all make sure that it is INSTALLED and not copied from another computer. Also if you are under Windows 7 or Vista try running the launcher as an Administrator.\n\nQ: While I was in-game a &quot;Lost Network Connection&quot; message appeared while I still had internet. What now?\nA: This usually happens when the server restarts (every 2-6 hours). The game should automatically reconnect after 2-10 seconds. If it hasn't reconnected after 30 seconds it means that the server is offline, in which case you must close the game and restart the launcher (sad I know).\n\nQ: Ok, the game disconnected and then reconnected but the message appeared for about 5 more times. Should I worry about it?\nA: No. This usually happens when the server restarts and more that 100 clients are connecting at the same time. These messages should disappear after 10-30 seconds.\n\nQ: Are you freaking stupid? We don't need a replacement to ubisoft's servers. We need an one-click offline crack!@%^!\nA: First of all, a central server that a lot users can connect and play at the same time is more convenient to almost everyone. Secondly, this is why the app has an offline/local mode. Thirdly, if you don't like it don't use it...\n\nScreenshots: &lt;a href=&quot;\nhttp://n0.pointlimit.com/images/ac2screen1.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://n0.pointlimit.com/images/ac2screen1.png&lt;/a&gt; &lt;a href=&quot;\nhttp://n0.pointlimit.com/images/ac2screen2.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://n0.pointlimit.com/images/ac2screen2.png&lt;/a&gt; &lt;a href=&quot;\nhttp://n0.pointlimit.com/images/ac2screen3.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://n0.pointlimit.com/images/ac2screen3.png&lt;/a&gt; &lt;a href=&quot;\nhttp://n0.pointlimit.com/images/ac2screen4.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://n0.pointlimit.com/images/ac2screen4.png&lt;/a&gt;\n\n\n\nCredits:\nNoFaTe - Application Creator, Server Modification, Server Hosting\nDormine - Server Creator\nCS.RIN.RU Community - Latest Values","torrent":{"xt":"urn:btih:9910eda95fe031b2cd933ed352ad9d5356274ffc","amp;dn":"Assassins+Creed+2+Launcher+%28Crack%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9910eda95fe031b2cd933ed352ad9d5356274ffc","infoHashBuffer":{"type":"Buffer","data":[153,16,237,169,95,224,49,178,205,147,62,211,82,173,157,83,86,39,79,252]},"announce":[],"urlList":[]}}