{"title":"P90Xtrem- Extreme Home Fitness Exercise Complete Workout","uid":7962613,"size":4704689089,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:994089fc157c8bd12e39daf58c8ca3164dbb8182&amp;dn=P90Xtrem-+Extreme+Home+Fitness+Exercise+Complete+Workout&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":2,"uploader":"metequila","files":61,"time":1356620168,"description":"[img]//kastatic.com/i2/users/93e06d9bf9e5877da18bbc3647a45886.jpg[/img]P90X, or Power 90 Extreme, is a home exercise system developed by Tony Horton in conjunction with Beachbody CEO Carl Daikeler, Beachbody Fitness Advisor Steve Edwards, nutritionist Carrie Wyatt, Creative Director Ned Farr, and workout video director Mason Bendewald of MEGA MACE productions. It claims to significantly improve physical fitness in 90 days through a rigorous segmented training program combined with a nutrition and dietary supplement plan.\n \nP90X's advertising emphasizes &quot;muscle confusion&quot;, a method of cross-training and periodization achieved through switching the order of exercises and incorporating new and varied movements. Muscle confusion supposedly prevents the body from adapting to exercises over time, resulting in continual improvement without plateaus.\nP90X is a 90-day program that combines a variety of exercise techniques including strength training, cardio, yoga, plyometrics, and stretching. The program consists of a nutrition guide, fitness plan, calendar and series of DVD videos featuring Horton as instructor assisted by several male and female fitness models who demonstrate a variety of techniques. For workouts that require weights, for example, one of the models demonstrates the exercise using elastic resistance bands. The models also demonstrate some moves at lower and/or higher levels of intensity. P90X provides a fitness test to determine if the program is suitable for an individual.","torrent":{"xt":"urn:btih:994089fc157c8bd12e39daf58c8ca3164dbb8182","amp;dn":"P90Xtrem-+Extreme+Home+Fitness+Exercise+Complete+Workout","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"994089fc157c8bd12e39daf58c8ca3164dbb8182","infoHashBuffer":{"type":"Buffer","data":[153,64,137,252,21,124,139,209,46,57,218,245,140,140,163,22,77,187,129,130]},"announce":[],"urlList":[]}}