{"title":"Hugh Laurie - Discography (2011 - 2013) {FLAC} vtwin88cube","uid":8797606,"size":817859368,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:99464eae70c8eef15f5e52fbb825da6dead2ebec&amp;dn=Hugh+Laurie+-+Discography+%282011+-+2013%29+%7BFLAC%7D+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"vtwin88cube","files":-1,"time":1376110916,"description":"\n\n\nHugh Laurie\nDiscography (2011 - 2013)\n\n\n\n\nallmusic.com...\n\nA household name in both the U.K. and U.S. thanks to his long-standing 30-year comedy career and more recent starring role in medical drama House, multi-talented Hugh Laurie is also lesser-known as a versatile and accomplished self-taught musician. Born James Hugh Calum Laurie, in Oxford, 1959, he was raised in the Scottish Presbyterian Church before attending prestigious Eton College and later Cambridge University, where he graduated with a degree in archaeology and social anthropology. During his studies, he became the President of the famous amateur theatrical society, Footlights, where he was introduced to future comedy partner Stephen Fry. The duo first found success when they wrote the Perrier Award-winning revue, The Cellar Tapes, and after appearing together on The Young Ones, sketch show Alfresco, and most famously, Blackadder, they formed a working relationship which spanned almost a decade on shows including A Bit of Fry &amp; Laurie and Jeeves and Wooster. In the mid-'90s, Laurie embarked on a Hollywood career, starring in 101 Dalmations, three Stuart Little movies, and the remake of Flight of the Phoenix, but it wasn't until 2004, when he landed the lead role of grumpy physician Dr. Gregory House, in Fox series House, that he began to receive world-wide recognition, earning several Golden Globe and Screen Actors Guild awards and the accolade of the highest-paid actor in a TV drama. But throughout his career, Laurie had also regularly displayed his musical talents, which included playing the guitar, drums, harmonica, piano, and saxophone. As well as showcasing his skills in House and his guest host slots on Saturday Night Live, he played the keyboards in Los Angeles charity rock group Band from TV and performed piano duties on &quot;If I Can't Have You,&quot; a track from Meat Loaf's 2010 album, Hang Cool Teddy Bear. In the same year, he signed a deal with Warner Bros, where he recorded a New Orleans blues-influenced album featuring guest collaborations with Tom Jones, Irma Thomas, and Dr. John. Produced by Joe Henry (Elvis Costello), Let Them Talk was released in 2011 and it performed remarkably well, topping the Billboard blues charts in the US, going gold in the UK and making its mark in various European and South American countries. Two years later, Laurie reteamed with producer Henry for a second album called Didn't It Rain. \n\n\nAudio Quality:\t\tFLAC (Lossless)\n\n\nLet Them Talk (Limited Edition) (2011)\n\n01.St. James Infirmary\n02.You Don't Know My Mind\n03.Six Cold Feet\n04.Buddy Bolden's Blues\n05.Battle Of Jericho\n06.After You've Gone\n07.Swanee River\n08.The Whale Has Swallowed Me\n09.John Henry\n10.Police Dog Blues\n11.Tipitina\n12.Winin' Boy Blues\n13.They're Red Hot\n14.Baby, Please Make A Change\n15.Let Them Talk\n16.Guess I'm A Fool (Bonus Track)\n17.It Ain't Necessarily So (Bonus Track)\n18.Lowdown, Worried And Blue (Bonus Track)\n\nLabel:\t\t\tWarner U.K.\nCatalog:\t\t2564672943\n\n\n\n\nDidn't It Rain (Deluxe Edition) (2013)\n\n01.The St. Louis Blues\n02.Junkers Blues\n03.Kiss Of Fire\n04.Vicksburg Blues\n05.The Weed Smoker's Dream\n06.Wild Honey\n07.Send Me To The 'Lectric Chair\n08.Evenin'\n09.Didn't It Rain\n10.Careless Love\n11.One For My Baby\n12.I Hate A Man Like You\n13.Changes\n14.Unchain My Heart (Bonus Track)\n15.Yeh Yeh (Live) (Bonus Track)\n\nLabel:\t\t\tWarner U.K.\nCatalog:\t\t25646453764\n\n\n\n\n\n\nThanks for Seeding\nEnjoy...","torrent":{"xt":"urn:btih:99464eae70c8eef15f5e52fbb825da6dead2ebec","amp;dn":"Hugh+Laurie+-+Discography+%282011+-+2013%29+%7BFLAC%7D+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99464eae70c8eef15f5e52fbb825da6dead2ebec","infoHashBuffer":{"type":"Buffer","data":[153,70,78,174,112,200,238,241,95,94,82,251,184,37,218,109,234,210,235,236]},"announce":[],"urlList":[]}}