{"title":"Lords.of.Football-RELOADED","uid":8345442,"size":3086813488,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9a1aabca284d5ba316e93778ab793bc7309de60a&amp;dn=Lords.of.Football-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":2,"uploader":"Mr.Stifmeister","files":-1,"time":1365190403,"description":"\n                                      nERv\n\n\n                      Lords of Football (c) Fish Eagle\n\n      04/2013 :..... RELEASE.DATE .. PROTECTION .......: Steam\n            1 :.......... DISC(S) .. GAME.TYPE ........: Simulation, Sports\n\n\nLords of Football is a whole new sports lifestyle simulator, played in God\nMode.The everyday routine of football is brought to life, simulating\nfootballers' training to improve their skills and all the drama and real-life\ndistractions that unfold during a normal season. With easy drag-and-drop\nnavigation and by learning each footballer's personality, you must oversee\nall your footballers and resources to bring the team up to international\ncompetition level. The game takes place in an immersive 3D world with a\ncustomisable team, and rewards success with club upgrades to expand this\nexciting, vibrant football simulation.KEY FEATURES:Genre defining  A football\nlifestyle simulation played with an easy drag and drop God Mode style\ninterface. It crosses genres to bring you a new football experience,\ninvolving you in both the match and the personal lives of your footballers.\nThis is unique, a game like no other!Matches - Give match commands to your\nfootballers in a way unlike any other football game. Your team's ability and\nperformance will not only depend on your tactical strategy but also on how\nwell you look after them on and off the pitch. Play in a real-time 3D\nfootball world  Explore and interact in a full 3D real-time environment where\nyou can unlock upgrades that change, improve and expand your world.\nPersonalities - Each footballer has his own unique personality and distinct\nbehaviour. They will react in different ways to events that take place within\nthe world, as well as your choices having a direct effect on their mood, for\nbetter or worse. Off-pitch activities - Interact with and affect the personal\nlives of your footballers. Keep them happy with fun free time activities in\nthe pub, club and restaurant while avoiding negative addictions and bad\nhabits.Training and drills - A new level of interaction is available during\nthe training phase by offering a customisable 3D space, assigning drills or\nclosely examining each footballer's performance in real time.Customisation\nWith the ability to configure every aspect of your team's appearance\nname, playing kit, logo and even individual footballers' names  you have the\nability to live your football dream and run your very own club.\n\nFeatures\n* Genre defining  A football lifestyle simulation played with an easy drag\n  and drop God Mode style interface. It crosses genres to bring you a new\n  football experience, involving you in both the match and the personal\n  lives of your footballers. This is unique, a game like no other!\n* Play in a real-time 3D football world  Explore and interact in a full 3D\n  real-time environment where you can unlock upgrades that change, improve\n  and expand your world.\n* Off-pitch activities - Interact with and affect the personal lives of\n  your footballers. Keep them happy with fun free time activities in the\n  pub, club and restaurant while avoiding negative addictions and bad\n  habits.\n\n\n1. Unrar.\n2. Burn or mount the image.\n3. Install the game.\n4. Copy over the cracked content from the /Crack directory on the image to\n   your game install directory.\n5. Play the game.\n6. Support the software developers. If you like this game, BUY IT!\n","torrent":{"xt":"urn:btih:9a1aabca284d5ba316e93778ab793bc7309de60a","amp;dn":"Lords.of.Football-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a1aabca284d5ba316e93778ab793bc7309de60a","infoHashBuffer":{"type":"Buffer","data":[154,26,171,202,40,77,91,163,22,233,55,120,171,121,59,199,48,157,230,10]},"announce":[],"urlList":[]}}