{"title":"Karl Taylor - Travel &amp; Landscape Photography","uid":6479910,"size":734714113,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:9a88dca3543323604f60361e9be9f8f104178a91&amp;dn=Karl+Taylor+-+Travel+%26+Landscape+Photography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"liabub","files":2,"time":1308473651,"description":"[size=7]    Uncover the Techniques Professionals Rely On to Capture Stunning Scenes [/size]\n\n[float=right][img=&quot;Travel &amp; Landscape Photography&quot;]http://iwannafile.com/img_store/0/42/28/79.jpg[/img][/float]\n\nIn this exciting program Karl Taylor takes you on an incredible photographic tour of Paris and shows you the techniques applied to capture stunning travel images. Karl also goes head to head with international award winning landscape photographer Nick DesprÃƒÂ©s in a landscape shootout that shows you step by step techniques for capturing breathtaking images.\n[b]On this DVD you will learn[/b]:\n\n    [list=1]\n[*]Cityscapes\n[*]    Make capturing inspiring cityscapes second nature! With a few simple techniques you will be able to create images that are more eye-catching than you had imagined.\n[*]    Neutral Density Graduated Filters\n[*]    Learn about the pro photographers secret weapon. See as Karl demonstrates exactly how, why and when to use these image enhancing essentials!\n[*]    Planning your Images\n[*]    Getting that great shot is not all about point and shoot, Karl explains how planning and researching your location can help you get that winning shot.\n[*]    Waiting for the Right Light\n[*]    Timing is everything, too early and the light is not right, too late and the light has gone. Discover the magic moment for a range of different photographic situations that will help give your shots that professional edge!\n[*]    Night Cityscapes\n[*]    Capturing night scenes requires a different discipline and knowledge. In this program Karl tackles several night scene situations and shows you how to capture an incredible shot every time. Discover the necessary tools and tips to help you get that shot.\n[*]    Landscape Photography\n[*]    Karl goes head to head in a shoot out with international and award winning landscape photographer Nick DesprÃƒÂ©s. See how their varied shooting styles yield different results from the same location. Plus, Karl takes you step by step through his techniques for shooting inspiring landscapes.\n[*]    Polarizing Filters\n[*]    What are they, and what are they good for? This essential piece of kit for the Pro photographer can transform an image but you have to know when and how to use them.\n[*]    Long Exposures\n[*]    Add mystery and depth to your images with this simple technique. Discover how capturing extended periods of time will give your images an enchanted quality.\n[*]    Photojournalistic Style\n[*]    Black and white, street and city photography! Learn how being quick on your feet and ready to grab that spontaneous moment is essential to this particular genre.\n[*]    Gallery Critique\n[*]    Learn from the Pros as Karl and Nick discuss and look through some of NickÃ‚Â¹s award winning work and discover what makes a really eye-catching shot.\n[/list]\n\n[b]Features of this DVD:[/b]\n\n    [list=1]\n[*]Featuring International Award Winning Landscape Photographer Nick DesprÃƒÂ©s\n[*]    85 minutes run time\n[*]    16:9 wide screen\n[*]    PAL (Standard) or NTSC (N. America, Japan) formats\n[/list]\n","torrent":{"xt":"urn:btih:9a88dca3543323604f60361e9be9f8f104178a91","amp;dn":"Karl+Taylor+-+Travel+%26+Landscape+Photography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a88dca3543323604f60361e9be9f8f104178a91","infoHashBuffer":{"type":"Buffer","data":[154,136,220,163,84,51,35,96,79,96,54,30,155,233,248,241,4,23,138,145]},"announce":[],"urlList":[]}}