{"title":"BladeRunner-FinalCut.BDRip-(Mkv.H264@DTrHD])([AC3-5.1)-US-FR.mkv","uid":6840598,"size":6101062407,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:9a89b7920437900741ede09141f2359093db925a&amp;dn=BladeRunner-FinalCut.BDRip-%28Mkv.H264%40DTrHD%5D%29%28%5BAC3-5.1%29-US-FR.mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"Tyr3ll","files":-1,"time":1322150635,"description":"Here we are\nWell bringing you now a new excellent and superb copy of Blade Runner Final cut\nas BDRip.\nAs usual my choice has been ported to convert all in :\n\nConstruction :\n\nSource : BD &quot;Blade Runner-Final Cut&quot;\nversion : 2 Disc-Special Edition\n1 BD/1 DVD\n\nCodec used : generic MKV.H264-original audio.\ntype : BDRip_HD High resolution \nconverted with DVDFab Qt 8.3.2.0 retail with Cuda video processing acceleration.\nCPU/GPU used : Phenom2 X4 965 AM3/NVidia 480 GTX)\n\nAnd as usual also you will have two possible spoken languages.\n\nChannel 1 : English Dolby TrueHD\nChannel 2: French Dolby AC3-5.1\nAll subtitles have been completely removed anyway.\n\nScreen resolution is : 1280 x 534\n\nWithout pretention i can say you it is an awesome quality copy in any way.\nResult is excellent and quality is superb anyway.\nhowever as it has been converted in mkv.h264 it might not work with/on certain players.\nRuns absolutely very nicely on vlc media player 1.2.0pre1 git :)\nVideo and sound Quality are really very very pleasant.\nA good opportunity to rediscovering this very original futuristic movie.\nChannel 1 english spoken language is the best as it is in Dolby TrueHD\nAnd sound is really boosted and amazing aswell.\nChannel 2 is a bit less good than the first,of course,less boosted but still very fine also.\nA must have for all real fans of this movie as i am myself aswell.\nBeware : it is a large file and big torrent : 5,68 Go...\nWill need few strong seeders anyway.\nDon't miss this excellent copy,you won't regret it,trust me,you can believe me !\n______________________________________\n\nThe movie :\n\nBlade Runner (1982) /  Final Cut (2007) BD/DVD collector edition\n\nTime :   117 min  -  Drama | Sci-Fi | Thriller\n\nshort history :\nDeckard, a blade runner, has to track down and terminate 4 replicants who hijacked a ship in space and have returned to earth seeking their maker.\n \n\nDirector: \nRidley Scott\n\n Writers: \nHampton Fancher (screenplay), David Webb Peoples (screenplay), and 1 more credit Ã‚Â»\n \nStars:\n Harrison Ford, Rutger Hauer and Sean Young \n\nCritics and audiences didn't care for it in 1982, but Ridley Scott's Blade Runner has since risen from cult object to classic of postmodern science fiction. A dystopian view of the future as a decaying, nostalgia-ridden junk culture, it features enormous neon billboards, ad blimps, and soaring Mayan temple-esque skyscrapers, evoking an infernal consumer society divided between those divinely living in the clouds and the multi-cultural exploited masses inhabiting the permanently dank streets. Only the robot &quot;skin job&quot; replicants understand the value of life and freedom. As Deckard's search for the replicants becomes a philosophical rumination on man, machine, and life, Blade Runner's striking production design and visual effects (supervised by FX maestro Douglas Trumbull) underline the cost to humanity of technology-obsessed late capitalism. Blade Runner's increasing stature merited the 10th anniversary release of the &quot;Director's Cut,&quot; which rendered the film even more evocatively ambiguous by adding a brief unicorn dream and eliminating the studio-mandated voice-over narration and tacked-on &quot;happy&quot; ending. ~ Lucia Bozzola, Rovi .\n\nlearn more here : &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0083658/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0083658/&lt;/a&gt;\n_____________________________________\n\nSeed asap with me as long as you can,please !\nWill probably take a certain time for you to get as my up speed is of 1 meg max.\nBe patient so !\nBtw,Transmission and libTorrent will be only accepted as fast peers.\nOthervise if you are running slow use KTorrent instead,please !!!\nARES client is formaly forbidden as it is crap and really really too slow.\nTransmission torrent client miss of big flexibility and the lack is terrific,really !\nPlease,i need to get and know few feedback and opinion from your part about this last one.\nThis will permit me to know if i do right or not then.\nTy for understanding\n...\nEnjoy and best regards","torrent":{"xt":"urn:btih:9a89b7920437900741ede09141f2359093db925a","amp;dn":"BladeRunner-FinalCut.BDRip-%28Mkv.H264%40DTrHD%5D%29%28%5BAC3-5.1%29-US-FR.mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a89b7920437900741ede09141f2359093db925a","infoHashBuffer":{"type":"Buffer","data":[154,137,183,146,4,55,144,7,65,237,224,145,65,242,53,144,147,219,146,90]},"announce":[],"urlList":[]}}