{"title":"Mac OS X 10.7 Lion (Final Retail)","uid":6688033,"size":3758642390,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:9a91e80f9ef0d12476eff2e22857296ed82d6439&amp;dn=Mac+OS+X+10.7+Lion+%28Final+Retail%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"FatFreddy347","files":-1,"time":1316482287,"description":"Apple\n\nMac OS X 10.7 Lion\n\nBuild: 11A511 &quot;Golden Master&quot;\n\n\nOS X Lion is the next major release of OS X, the world's most advanced desktop operating system. It includes over 250 new features that will transform how you interact with your Mac.  Tap, swipe, and scroll your way through your apps using fluid Multi-Touch gestures that make everything you do feel more natural and direct. Full-screen apps take advantage of every pixel of your display and perfect for reading email, surfing the web, or browsing photos. Launchpad gives you instant access to all the apps on your Mac in a stunning new layout where you can quickly find any app and open it with a single click. And Mission Control brings together ExposÃƒÂ©, full-screen apps, Dashboard, and Spaces in one unified experience. With a gesture, your desktop zooms out, displaying a bird's-eye view of everything running on your Mac and making it easy to navigate anywhere with a click.\n\nMulti-Touch gestures\n- Fluid and realistic animations make gestures feel natural and direct. \n- Tap or pinch to zoom in on text and images.\n- Swipe left or right to move from one page to another in an app or switch from one full-screen app to another.\n- Swipe up to enter Mission Control.\n- Pinch to access Launchpad.\n\nFull-screen apps\n- A new full-screen button takes an app window full screen. \n- Run multiple full-screen apps at the same time.\n- Switch between full-screen apps and your desktop with a gesture.\n- Apps stay full screen when you switch to another app.\n- OS X Lion includes full-screen Mail, Safari, Preview, iCal, FaceTime, Dashboard, Screen Sharing, and Photo Booth.\n\nMission Control\n- Brings together ExposÃƒÂ©, full-screen apps, Dashboard, and desktop spaces. \n- Gives you a bird's-eye view of everything running on your Mac, allowing you to navigate anywhere with a click.\n- ExposÃƒÂ© view shows all open windows on your desktop grouped by application. \n- Create and organize desktop spaces in Mission Control.\n\nLaunchpad\n- A new home for all the apps on your Mac.\n- Apps downloaded from the Mac App Store automatically appear in Launchpad.\n- Launchpad automatically adds pages to accommodate all your apps.\n- Apps can be organized on multiple pages and grouped in folders. \n\nMail\n- The widescreen layout displays the message list and selected email side by side in full-height columns. \n- The favorites bar gives you one-click access to your favorite mail folders.\n- Search suggestions dynamically present the best matches for your search.\n- Search tokens help refine search results based on people, subjects, mailboxes, dates, and attachments.\n- Conversations automatically groups related messages, displaying them in chronological order and hiding repetitive quoted text.\n\nOther great Lion features\n- Auto Save automatically saves your changes as you go, so you never have to worry about losing your work.\n- Versions keeps a history of your document as you work and presents it in a timeline you can browse.\n- Resume reopens an app exactly as you left it.\n- AirDrop is the simplest way to send files to anyone around you, wirelessly and no setup or special settings required.\n- Reading List in Safari lets you easily save web pages to read or browse later.\n\nSome features require an Apple ID and/or compatible Internet access; additional fees and terms apply.\n\nSome features require apps developed to work with Lion.\n\nGestures require a Multi-Touch trackpad or Magic Mouse (some gestures are not available on Magic Mouse).\n\nAirDrop is supported on the following Mac models: MacBook Pro (late 2008 or newer), MacBook Air (late 2010 or newer), MacBook (late 2008 or newer), iMac (early 2009 or newer), Mac mini (mid 2010 or newer), Mac Pro (early 2009 with AirPort Extreme card and mid 2010 or newer).\n\nBuild Number 11A511 Downloaded from Mac App Store!\n\n  &lt;a href=&quot;\nhttp://www.apple.com/macosx/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.apple.com/macosx/&lt;/a&gt;","torrent":{"xt":"urn:btih:9a91e80f9ef0d12476eff2e22857296ed82d6439","amp;dn":"Mac+OS+X+10.7+Lion+%28Final+Retail%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a91e80f9ef0d12476eff2e22857296ed82d6439","infoHashBuffer":{"type":"Buffer","data":[154,145,232,15,158,240,209,36,118,239,242,226,40,87,41,110,216,45,100,57]},"announce":[],"urlList":[]}}