{"title":"Keith Jarrett and Charlie Haden - 2010 - Jasmine (24 44.1) FLAC","uid":8547101,"size":536968001,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9ad026c863bfd886b8ee5fb9b824705f1472e75e&amp;dn=Keith+Jarrett+and+Charlie+Haden+-+2010+-+Jasmine+%2824+44.1%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"eika256","files":-1,"time":1370551065,"description":"Keith Jarrett &amp; Charlie Haden - 2010 - Jasmine (24 bit 44.1 KHz HDTracks)\n\nThe reason to mention the &quot;particulars&quot; of this document of informal sessions is because Keith Jarrett went to the trouble of doing so in his liner notes: they came about in the aftermath of him and Charlie Haden playing together during a documentary film about Haden. The duo, who hadn't played together in over 30 years, got along famously and decided to do some further recording in Jarrett's home studio without an end result in mind. The tapes sat -- though were discussed often -- for three years before a decision was made to release them. Jarrett used his home Steinway instead of his usual concert Boisendorfer. The more immediate, present sound of the former piano makes for something less dynamic than his live performances. And here, with the sheer natural grace and unhurried elegance of Haden's earthy bass playing, that is a great thing. Jasmine is love songs; most are standards. Haden not only supports but solos a great deal. Picking out highlights on this eight-song, hour-long set is difficult because the dry warmth of these performances is multiplied by deeply intuitive listening and the near symbiotic, telepathic nature of the playing. The entire proceeding flows seamlessly. The depth of emotion in Peggy Lee's and Victor Young's &quot;Where Can I Go Without You&quot; opens the world of the bereft lover -- and Haden's solo seems to make her/him speak. Jarrett's intro to &quot;I'm Gonna Laugh You Right Out of My Life,&quot; by Cy Coleman and Joseph McCarthy, reveals in its lyric just how woefully ironic this tune is. The loss and reverie steeped in false bravado are expressed in Jarrett's arpeggios and underscored by Haden's emphasis on single notes during the changes and a deep woody tone he gets in the combination of skeletal flourishes during Jarrett's solo. On the surface it might seem that the inclusion of Joe Sample's &quot;One Day I'll Fly Away&quot; is an odd inclusion; yet it acts on some level as the hinge piece for the set. Its simplicity and sparseness are offset by the profound lyricism Jarrett imbues it with. Haden asserts, quietly of course, that the complex emotions in the tune go beyond any language -- other than music's -- to express. After a devastatingly sad reading Gordon Jenkins' &quot;Goodbye&quot; with Jarrett at his most poignant and clean, a brief reading of Jerome Kern's and Oscar Hammerstein's &quot;Don't Ever Leave Me&quot; closes the set. The way it's played, this tune is not a plea, but a poetically uttered assertion between lovers. Jasmine is, ultimately, jazz distilled to its most essential; it not only expresses emotion and beauty, but discovers them in every moment of its performance. (AllMusic)\n\nTrack list:\n01 - For All We Know\n02 - Where Can I Go Without You\n03 - No Moon At All\n04 - One Day I'll Fly Away\n05 - I'm Gonna Laugh You Right Out Of My Life\n06 - Body And Soul\n07 - Goodbye\n08 - Don't Ever Leave Me\n\nEnjoy and share!","torrent":{"xt":"urn:btih:9ad026c863bfd886b8ee5fb9b824705f1472e75e","amp;dn":"Keith+Jarrett+and+Charlie+Haden+-+2010+-+Jasmine+%2824+44.1%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ad026c863bfd886b8ee5fb9b824705f1472e75e","infoHashBuffer":{"type":"Buffer","data":[154,208,38,200,99,191,216,134,184,238,95,185,184,36,112,95,20,114,231,94]},"announce":[],"urlList":[]}}