{"title":"Vampire Academy Series Audiobooks (1-6) by Richelle Mead","uid":14188463,"size":2087370801,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9b055d65e8f011a4f28e6d803b9c3f4df5f56f09&amp;dn=Vampire+Academy+Series+Audiobooks+%281-6%29+by+Richelle+Mead&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":3,"uploader":"yousef86","files":37,"time":1459865153,"description":"Vampire Academy (Vampire Academy Book 1) by Richelle Mead\r\nEnglish | MP3 64kbps CBR | 08:55:07 | ASIN: B0017182R4 | 245 MB\r\nGenre: Fantasy, Romance | Narrator: Stephanie Wolfe\r\n\r\n\r\nONLY A TRUE BEST FRIEND CAN PROTECT YOU FROM YOUR IMMORTAL ENEMIES...\r\n\r\nLissa Dragomir is a Moroi princess: a mortal vampire with a rare gift for harnessing the earth's magic. She must be protected at all times from Strigoi; the fiercest vampires - the ones who never die. The powerful blend of human and vampire blood that flows through Rose Hathaway, Lissa's best friend, makes her a dhampir. Rose is dedicated to a dangerous life of protecting Lissa from the Strigoi, who are hell-bent on making Lissa one of them.\r\n\r\nAfter two years of freedom, Rose and Lissa are caught and dragged back to St. Vladimir's Academy, a school for vampire royalty and their guardians-to-be, hidden in the deep forests of Montana. But inside the iron gates, life is even more fraught with danger... and the Strigoi are always close by.\r\n\r\nRose and Lissa must navigate their dangerous world, confront the temptations of forbidden love, and never once let their guard down, lest the evil undead make Lissa one of them forever...\r\n\r\n\r\n\r\nFrostbite (Vampire Academy Book 2) by Richelle Mead\r\nEnglish | MP3 64kbps CBR | 08:47:59 | ASIN: B001IMTL7C | 241 MB\r\nGenre: Fantasy, Romance | Narrator: Khristine Hvam\r\n\r\n\r\nRose loves Dimitri, Dimitri might love Tasha, and Mason would die to be with Rose...\r\n\r\nIt’s winter break at St. Vladimir’s, but Rose is feeling anything but festive. A massive Strigoi attack has put the school on high alert, and now the Academy’s crawling with Guardians—including Rose’s hard-hitting mother, Janine Hathaway. And if hand-to-hand combat with her mom wasn’t bad enough, Rose’s tutor Dimitri has his eye on someone else, her friend Mason’s got a huge crush on her, and Rose keeps getting stuck in Lissa’s head while she’s making out with her boyfriend, Christian! The Strigoi are closing in, and the Academy’s not taking any risks... This year, St. Vlad’s annual holiday ski trip is mandatory.\r\n\r\nBut the glittering winter landscape and the posh Idaho resort only create the illusion of safety. When three friends run away in an offensive move against the deadly Strigoi, Rose must join forces with Christian to rescue them. But heroism rarely comes without a price...\r\n\r\n\r\n\r\nShadow Kiss (Vampire Academy Book 3) by Richelle Mead\r\nEnglish | MP3 64kbps CBR | 11:56:04 | ASIN: B001RMWBAC | 327 MB\r\nGenre: Fantasy, Romance | Narrator: Khristine Hvam\r\n\r\n\r\nIt's springtime at St. Vladimir's Academy, and Rose Hathaway is this close to graduation. Since making her first Strigoi kills, Rose hasn't been feeling quite right. She's having dark thoughts, behaving erratically, and worst of all... might be seeing ghosts.\r\n\r\nAs Rose questions her sanity, new complications arise. Lissa has begun experimenting with her magic once more, their enemy Victor Dashkov might be set free, and Rose's forbidden relationship with Dimitri is starting to heat up again. But when a deadly threat no one saw coming changes their entire world, Rose must put her own life on the line - and choose between the two people she loves most.\r\n\r\n\r\n\r\nBlood Promise (Vampire Academy Book 4) by Richelle Mead\r\nEnglish | MP3 64 CBR | 13:06:11 | ASIN: B003KWL5XG | 360 MB\r\nGenre: Fantasy, Romance | Narrator: Emily Shaffer\r\n\r\n\r\nThe recent Strigoi attack at St. Vladimir’s Academy was the deadliest ever in the school’s history, claiming the lives of Moroi students, teachers, and guardians alike. Even worse, the Strigoi took some of their victims with them... including Dimitri.He’d rather die than be one of them, and now Rose must abandon her best friend, Lissa—the one she has sworn to protect no matter what—and keep the promise Dimitri begged her to make long ago. But with everything at stake, how can she possibly destroy the person she loves most?\r\n\r\n\r\n\r\nSpirit Bound (Vampire Academy Book 5) by Richelle Mead\r\nEnglish | MP3 64-71kbps VBR | 13:11:15 | ASIN: B003MY7RFW | 380 MB\r\nGenre: Fantasy, Romance | Narrator: Emily Shaffer\r\n\r\n\r\nAfter a long and heartbreaking journey to Dimitri’s birthplace in Siberia, Rose Hathaway has finally returned to St. Vladimir’s—and to her best friend, Lissa. It is nearly graduation, and the girls can’t wait for their real lives beyond the Academy’s iron gates to begin. But Rose’s heart still aches for Dimitri, and she knows he’s out there, somewhere.\r\n\r\n\r\n\r\nLast Sacrifice (Vampire Academy Book 6) by Richelle Mead\r\nEnglish | MP3 56-58kbps VBR | 17:36:57 | ASIN: B004FHXTRK | 434 MB\r\nGenre: Fantasy, Romance | Narrator: Emily Shaffer\r\n\r\n\r\nMurder. Love. Jealousy. And the ultimate betrayal. Now, with Rose on trial for her life and Lissa first in line for the Royal Crown, nothing will ever be the same between them","torrent":{"xt":"urn:btih:9b055d65e8f011a4f28e6d803b9c3f4df5f56f09","amp;dn":"Vampire+Academy+Series+Audiobooks+%281-6%29+by+Richelle+Mead","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b055d65e8f011a4f28e6d803b9c3f4df5f56f09","infoHashBuffer":{"type":"Buffer","data":[155,5,93,101,232,240,17,164,242,142,109,128,59,156,63,77,245,245,111,9]},"announce":[],"urlList":[]}}