{"title":"CHILD 44 - Tom Rob Smith. Read by Dennis Boutsikaris {FerraBit}","uid":5292394,"size":534406532,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9bca6ee4f0b69d88102dab104f7a60c2df0d966c&amp;dn=CHILD+44+-+Tom+Rob+Smith.+Read+by+Dennis+Boutsikaris+%7BFerraBit%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"FerraBit","files":-1,"time":1263937931,"description":"CHILD 44 by Tom Rob Smith (2008)\n\nRead by . . : Dennis Boutsikaris\nPublisher . : Hachette Audio (2008) \nISBN . . . .: ISBN-10:  160024159X ISBN-13: 9781600241598\nFormat . . .: MP3.  141 tracks, 508 MB\nBitrate . . : ~90 kbps (iTunes 9, VBR, mono, 44 kHz)\nSource . . .: 11 CDs (12.5 hours)\nGenre . . . : Fiction, Suspense\nUnabridged .: Unabridged\n\nNicely tagged and labeled, some CD tracks combined, cover scan included. \n\nThanks for sharing &amp; caring.\nCheers, FerraBit\nJanuary 2010\n\nLinks:\n &lt;a href=&quot; http://en.wikipedia.org/wiki/Tom_Rob_Smith&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://en.wikipedia.org/wiki/Tom_Rob_Smith&lt;/a&gt;\n\nOriginally posted:      &lt;a href=&quot;\nhttp://thepiratebay.se/user/FerraBit,&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/FerraBit,&lt;/a&gt; TPB, Demonoid\nPlease present your library card, and comment me some loving.\n______________________________________\n\nFrom Hachette Audio:\n\nIt is a society that is, officially, a paradise. Superior to the decadent West, Stalin's Soviet Union is a haven for its citizens, providing for all of their needs: education, health care, security. In exchange, all that is required is their hard work, and their loyalty and faith to the Soviet State.\n\nLeo Demidov knows this better than most. A rising, prominent oficer in the State Security force, Leo is a former war hero whose only ambition is to serve his country. To defend this workers' paradise--and to guarantee a secure life for his parents, and for his wife, Raisa--Leo has spent his career guarding against threats to the State. Ideological crimes--crimes of thought, crimes of disloyalty, crimes against the revolution--are forcefully suppressed, without question. \n\nAnd then the impossible happens. A different kind of criminal--a murderer--is on the loose, killing at will. At the same time, Leo finds himself demoted and denounced by his enemies, all but sentenced to death. The only way to salvage what remains of his life is to uncover this criminal. But in a society that is officially paradise, it's a crime against the state to suggest that a murderer--much less a serial killer--is in their midst. To save his life and the lives of his family, Leo must confront the vast resources and reach of the security forces with only Raisa remaining at his side, to find and stop a criminal that the State won't admit even exists.\n - - -\n\nFrom Wiki:\n\nTom Rob Smith ... His first novel, Child 44, about a series of child murders in Stalinist Russia, appeared in early 2008 and was translated into 17 languages. It was awarded the 2008 Ian Fleming Steel Dagger for Best Thriller of the year by the Crime Writer's Association. It was recently a Barnes &amp; Noble recommended book. On July 29, 2008 the book was named on the long list for the 2008 Man Booker Prize. In November 2008, he was nominated for the 2008 Costa First Novel Award (former Whitbread). In July 2009 he won the Waverton Good Read Award for first novels with Child 44.\nThe follow-up to Child 44, The Secret Speech was published in April 2009.","torrent":{"xt":"urn:btih:9bca6ee4f0b69d88102dab104f7a60c2df0d966c","amp;dn":"CHILD+44+-+Tom+Rob+Smith.+Read+by+Dennis+Boutsikaris+%7BFerraBit%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9bca6ee4f0b69d88102dab104f7a60c2df0d966c","infoHashBuffer":{"type":"Buffer","data":[155,202,110,228,240,182,157,136,16,45,171,16,79,122,96,194,223,13,150,108]},"announce":[],"urlList":[]}}