{"title":"CompTIA Linux Plus  Study Guide 2013","uid":8685586,"size":14755059,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9bd46ec300066b41495fac974370b48203f1078a&amp;dn=CompTIA+Linux+Plus++Study+Guide+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"d347hBy73","files":-1,"time":1373793915,"description":"CompTIA Linux+ Study Guide: Exams LX0-101 and LX0-102, 2nd Edition\n\n648 pages\nJanuary 2013\nFormat: PDF, EPUB\n\nFor practice exams, flash cards, etc. try this link: http://as.wiley.com/WileyCDA/WileyTitle/productCd-1118531744,miniSiteCd-SYBEX,descCd-DOWNLOAD.html\n\nThe Best Test Prep for the CompTIA Linux+ Powered By LPI Exams\n\nOne of Sybexs most popular certification Study Guides, CompTIA Linux+ Study Guide, Second Edition thoroughly prepares candidates for the CompTIA Linux+ Powered by LPI exams (LX0-101 and LX0-102). In addition to full coverage of all exam objectives for both exams, chapter review questions, and hands-on exercises, this CompTIA Authorized courseware also includes access to a great set of Linux-, Mac-, and Windows-compatible online test-prep tools. Author Roderick W. Smith, CompTIA Linux+, LPIC-1, LPIC-2, is a Linux networking expert who gives candidates the authoritative instruction and review they need.\n\nProvides full coverage of all exam objectives for the CompTIA Linux+ Powered by LPI exams ((LX0-101 and LX0-102)\nIncludes challenging review questions, hands-on exercises, and real-world scenarios that put the information in the context of real job roles\nProvides access to a Linux-, Mac-, and Windows-compatible custom test engine, with hundreds of sample questions and flashcards\nCovers essential topics, such as system architecture, installation, GNU and Unix commands, filesystems and filesystem hierarchy, shells, scripting, data management, networking fundamentals, security, and more \n\nCompTIA Linux+ Study Guide, Second Edition is what you need for top-notch preparation for the CompTIA Linux+ Powered by LPI certification exams.\n\n\n\n\n\n","torrent":{"xt":"urn:btih:9bd46ec300066b41495fac974370b48203f1078a","amp;dn":"CompTIA+Linux+Plus++Study+Guide+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9bd46ec300066b41495fac974370b48203f1078a","infoHashBuffer":{"type":"Buffer","data":[155,212,110,195,0,6,107,65,73,95,172,151,67,112,180,130,3,241,7,138]},"announce":[],"urlList":[]}}