{"title":"Developing Mobile Web ArcGIS Applications - Matthew Sheehan","uid":11819281,"size":10610190,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9c093bec4d02c3a7aaa793e79297e781e3c589bc&amp;dn=Developing+Mobile+Web+ArcGIS+Applications+-+Matthew+Sheehan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1429222206,"description":"Learn to build your own engaging and immersive geographic applications with ArcGIS\n\nAbout This Book\n\n* Create multi-utility apps for mobiles using ArcGIS Server quickly and easily\n* Start with the basics and move through to creating advanced mobile ArcGIS apps\n* Plenty of development tips accompanying links to functional maps to help you as you learn\n\nThis guide is invaluable to those just starting out with GIS development but will also benefit GIS professionals wishing to expand their development skills to include mobile apps.\n\nIn Detail\n\nThrough this practical and accessible guide, you will learn how to build mobile applications using ArcGIS Server from scratch. You will start by covering the differences between mobile web and traditional web development. Factors such as the range of devices, design and layout, functionality, and performance considerations all make mobile development unique.\n\nYou will then move on to cover key JavaScript frameworks and libraries for mobile development and cover important structures and concepts including Dojo, responsive design, and the geolocation API, walking through developing your first ArcGIS mobile application in the process. Screenshots, tips, and code are provided clearly throughout to help you through the development process.\n\nFinishing with advanced topics and best practices such as ArcGIS online and PhoneGap, you will finish the book with a complete mobile application and a solid foundation to develop mobile ArcGIS apps","torrent":{"xt":"urn:btih:9c093bec4d02c3a7aaa793e79297e781e3c589bc","amp;dn":"Developing+Mobile+Web+ArcGIS+Applications+-+Matthew+Sheehan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c093bec4d02c3a7aaa793e79297e781e3c589bc","infoHashBuffer":{"type":"Buffer","data":[156,9,59,236,77,2,195,167,170,167,147,231,146,151,231,129,227,197,137,188]},"announce":[],"urlList":[]}}