{"title":"The Adventures of Ichabod and Mr. Toad (1949)","uid":5322414,"size":935849672,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9c1410f82e0e72bc5a226102dddc1d6b3112b813&amp;dn=The+Adventures+of+Ichabod+and+Mr.+Toad+%281949%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"InternetNinjacy","files":-1,"time":1264905400,"description":"The Adventures of Ichabod and Mr. Toad is an animated feature produced by Walt Disney and released to theaters on October 5, 1949 by RKO Radio Pictures. It is the eleventh animated feature in the Walt Disney Animated Classics series, and the final of the six package films produced by Disney, following Saludos Amigos, The Three Caballeros, Make Mine Music, Fun and Fancy Free, and Melody Time.\n\nFirstly, Enjoy the movie. But on a related note, if anyone has ever been to Disney World in Florida you may know that there used to be a ride called, &quot;Mr. Toad's Wild Ride.&quot; Disney closed the ride and replaced it a few years ago. There is an online petition  to get the ride brought back to Disney World.\n\nNow, normally petitions like that don't do anything, but this time might be different. Disney World is increasing the size of Fantasyland, (which is where the ride used to be) and it is reasonably possible for the ride to be reconstructed. \n\nThe website doesn't require you to sign in or anything like that. It just asks you to sign. That being said, you can sign it as many times as you like (though you have to use different names otherwise it won't really count towards the petition's 500 mark.\n\nIf you enjoyed the ride, or this movie, or just want to do me a favor because you downloaded my movie then please spam the website and sign the petition as many times as you can. Obviously, common sense dictates that you should just randomly open links, but I'd like to think I'm relatively trustworthy. Most of the accounts I have on various websites are &quot;Trusted&quot; or otherwise approved of by the site. If you're really worried then don't go to the URL but I'd hope reputation would be enough for you to believe me.\n\nOnline Petition URL: http://hkisam.fatcow.com/2201.html\nMr. Toad's Wild Ride Wiki: http://en.wikipedia.org/wiki/Mr._Toad%27s_Wild_Ride#Magic_Kingdom_version\nPiratebay URL: http://thepiratebay.se/user/InternetNinjacy (With Trusted Status)\nKickasstorrents Url: http://www.kickasstorrents.com/user/Tomsninjaclan/ (With Verified Uploader Status)\nSeedpeer Url:","torrent":{"xt":"urn:btih:9c1410f82e0e72bc5a226102dddc1d6b3112b813","amp;dn":"The+Adventures+of+Ichabod+and+Mr.+Toad+%281949%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c1410f82e0e72bc5a226102dddc1d6b3112b813","infoHashBuffer":{"type":"Buffer","data":[156,20,16,248,46,14,114,188,90,34,97,2,221,220,29,107,49,18,184,19]},"announce":[],"urlList":[]}}