{"title":"Resolume Arena v5.0.2 OS X [dada]","uid":13972876,"size":1200934789,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:9c4a43f728071a97dcb9d4ec2101d44204497724&amp;dn=Resolume+Arena+v5.0.2+OS+X+%5Bdada%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"future-dada","files":4,"time":1458629542,"description":"Resolume Arena v5.0.2 OS X [dada]\r\n1.14 GB\r\n------------------------------------------------------------------------------------- \nhttps://resolume.com/\r\n-------------------------------------------------------------------------------------\r\nWe're proud to present to you: Resolume Arena 5.0. This new major release focusses on video mapping in Arena. It brings zooming. Undo/redo. Slice masking. Poly slices. DMX fixture output. BlackMagic capture device output. Spout. And much much more, read the full release notes on the blog.\r\n\r\nIt’s been 4 years since we introduced Resolume Avenue &amp; Arena 4. In those 4 years we released many many updates which brought a lot of improvements, effects and new features. It was time for something new, and we are proud to present to you: Resolume Arena 5.\r\n\r\nWe looked at the most important features that needed to be improved and this was clearly video mapping in Arena. Video mapping has taken the world by storm the past few years. We wanted to make this even easier and even more flexible with Resolume Arena 5. With Arena you can take on any size mapping project. Projecting on DJ booths and cars and buildings, as well as pixel mapping giant stages like Ultra. Projection mapping has gone from an artsy curiosity to a requirement in the toolbox of all VJ's.\r\n\r\nZoooooomin\r\nWith stages becoming bigger and LED resolutions going up it’s now easier to get everything pixel perfect by zooming in to your slices as far you need to make the final adjustment.\r\n\r\nUndo (yes really)\r\nIn the advanced output you can now undo (and redo) all your actions. This is incredibly handy because video mapping can become quite complex and is not always an exact science. Sometimes you need to fiddle the sliders until it’s pixel perfect. You can now work on a complex mapping with the ease of mind that you can always go back in time, like Doc &amp; Marty.\r\n\r\nPolygon slices (poly what?)\r\nThis new way of video mapping is so innovative we even had to think of a name for it ;-) We’re calling them Poly Slices. Draw any shape you want and then warp each individual point. Triangles were just the beginning, young grasshopper\r\n\r\nSnapping\r\nSlices and points will jump into place when they get close enough. So you don't need to find that sweet spot twice.\r\n\r\nSlice masks\r\nYou can now apply a mask to one specific slice by using the new input masking. You can even draw your own shape from scratch.\r\n-------------------------------------------------------------------------------------\r\nDo not make money with this software...\r\n\r\nRemember to BUY the stuff if you USE it.\r\n-------------------------------------------------------------------------------------\r\nfuture-dada\r\n-------------------------------------------------------------------------------------\r\ndemonoid.pw\r\n1337x.to\r\nkat.cr\r\nthepiratebay.se\r\nflashtorrents.org\r\nbtstor.cc\r\n-------------------------------------------------------------------------------------\r\nMMXVI (03)","torrent":{"xt":"urn:btih:9c4a43f728071a97dcb9d4ec2101d44204497724","amp;dn":"Resolume+Arena+v5.0.2+OS+X+%5Bdada%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c4a43f728071a97dcb9d4ec2101d44204497724","infoHashBuffer":{"type":"Buffer","data":[156,74,67,247,40,7,26,151,220,185,212,236,33,1,212,66,4,73,119,36]},"announce":[],"urlList":[]}}