{"title":"The Suffering - PC","uid":4465358,"size":1355029513,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9cd449dcb284631ae85e92893c0c5f818461182c&amp;dn=The+Suffering+-+PC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"akhiugo","files":1,"time":1224889030,"description":"Traverse the intense and shocking world of a maximum security penitentiary in the role of Torque, an inmate accused of a brutal crime he may or may not have committed.  Trapped in this ghastly environment and beset by horrific creatures, Torque is constantly challenged to stay alive and wield all manner of weapons in his fight to escape the nightmare that has been unleashed on Abbott Penitentiary.\n\nThe Suffering is the first action game to combine intense pulse pounding combat with the chills and thrills of an ultra-mature and disturbing horror story. \n\nFull 3D camera engine intensifies the action as you explore a maximum security prison in 3rd and 1st person perspectives. \nChannel Torque's rage and transform into a hideous beast to battle monsters in hand-to-hand combat. \n\nThe Suffering changes depending on how you play-experience the adventure multiple times and witness three different endings. \n9 gritty and terrifying levels-transverse indoor and outdoor terrain and horror lurking in every dark corner. \n\nAmazing character morphing effect-fills your rage meter and transform into a hideous and powerful creature. \nOver 10 deadly weapons from the shiv to the flamethrower to help you survive this nightmare. \n\nA dozen horrific monsters-each representing the means of execution that befell them-stalk your every move. \nBlood and gore galore, dripping, pooling and splattering every level of your frightening journey. \n\nInteract with hardened criminals featuring advanced AI; garner their assistance or end their life on your path to freedom-it's your choice.\n \n3 distinct endings depending on how you play the game. Are you a cold-blooded killer, a man wrongfully accused or something else? \n\nIntricate levels featuring moveable and destructible environments. \n &lt;a href=&quot;\nhttp://thesuffering.midway.com/site.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thesuffering.midway.com/site.html&lt;/a&gt;\n\n\n* PLEASE HELP BY SEEDING BACK AT LEAST WHAT YOU DOWNLOAD.","torrent":{"xt":"urn:btih:9cd449dcb284631ae85e92893c0c5f818461182c","amp;dn":"The+Suffering+-+PC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9cd449dcb284631ae85e92893c0c5f818461182c","infoHashBuffer":{"type":"Buffer","data":[156,212,73,220,178,132,99,26,232,94,146,137,60,12,95,129,132,97,24,44]},"announce":[],"urlList":[]}}