{"title":"Britney Spears Greatest Hits: My Prerogative (CD Rip)","uid":9687085,"size":163780349,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9d1b8a5a5585766a3ddcf224c6ff9c6187932f05&amp;dn=Britney+Spears+Greatest+Hits%3A+My+Prerogative+%28CD+Rip%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"MusicFanatic98","files":-1,"time":1393789405,"description":"Greatest Hits: My Prerogative is the first greatest hits album of American singer Britney Spears. It was released on November 1, 2004 by Jive Records. The compilation was released in two different formats, a standard edition and a limited edition containing a bonus disc with remixes. A compilation DVD of the same name was released to accompany the audio versions. The album includes three new tracks, a cover of Bobby Brown's &quot;My Prerogative&quot;, &quot;Do Somethin'&quot; and &quot;(I've Just Begun) Having My Fun&quot;, which was released digitally in August 2004. Critics gave Greatest Hits: My Prerogative mixed reviews. Some felt that it was an accurate portrayal of Spears as the defining figure of American pop culture, while others stated that she did not have enough material for a compilation and also deemed it as premature.\nGreatest Hits: My Prerogative debuted at the top of the charts in Ireland and Japan, and the top ten in other fourteen countries, including Australia, Canada, Norway, Sweden, the United Kingdom and the United States. Greatest Hits: My Prerogative has sold 5 million copies worldwide. The title track was released as the first single from the album. It went on to peak at number one in Ireland, Italy, Finland and Norway, and reached the top ten in another fourteen countries. &quot;Do Somethin'&quot; was released as the second single from the album.","torrent":{"xt":"urn:btih:9d1b8a5a5585766a3ddcf224c6ff9c6187932f05","amp;dn":"Britney+Spears+Greatest+Hits%3A+My+Prerogative+%28CD+Rip%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d1b8a5a5585766a3ddcf224c6ff9c6187932f05","infoHashBuffer":{"type":"Buffer","data":[157,27,138,90,85,133,118,106,61,220,242,36,198,255,156,97,135,147,47,5]},"announce":[],"urlList":[]}}