{"title":"Taylor Dayne - Greatest Hits 320cbr (Big Papi)","uid":9496874,"size":137450042,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9d91f8962802dcc3eb26c9474c76a83b2ac03bdd&amp;dn=Taylor+Dayne+-+Greatest+Hits+320cbr+%28Big+Papi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":2,"uploader":"Big-Papi","files":-1,"time":1390137109,"description":"Source: CD\n\n\nBy A Customer\nDriven by Ric Wake's production, Taylor Dayne emerged as a top performer in the late eighties. Her soulful voice soared over sparkling pop songs, programmed to become hits. With a careful selection of club friendly dance and consumable ballads Taylor was soon catapulted into stardom. Her albums `Tell It To My Heart' and `Can't Fight Fate' both went double platinum and spawned eight US top ten hits - a remarkable achievement.\n\nIt can safely be said that this `greatest hits' set was issued much too soon. The compilation has little to offer to those who own some of her earlier albums, as there are no new recordings included. The `new' tracks are a remix of `Tell It To My Heart' + plus two remixes of `Say A Prayer', a song taken from her third album `Soul Dancing'. The resulting 11 tracks are those `greatest hits'.\n\nThe album includes five ballads, most notably `I'll Always Love You' and `Love Will Lead You Back'. `I'll Be Your Shelter' and `Heart Of Stone' are also still pleasant pop songs. `Send Me A Lover' is one of her less known songs, which is a shame, because it's a stunning composition and Taylor is much more in control of her vocal instrument - making it the strongest ballad on here. It is arguably the strongest moment of this collection.\n\nYet, Taylor is also known for her radio-friendly popdance. `Tell It To My Heart' dominates, both in the original version and the even more uptempo T-empo remix. Other songs, such as `Prove Your Love', are perhaps a bit too much throwaway pop, . Pleasant exceptions are the hardhitting `Ill Wait' and her credible rendition of Barry White's `Can't Get Enough Of Your Love'.\n\nTaylor Dayne's `Greatest Hits' is a pleasant album, which brings back memories of her glory days. It's still a premature compilation which doesn't add a lot if you already her other albums. However, if you don't, this release is the perfect document to those irresistible hits of the past.","torrent":{"xt":"urn:btih:9d91f8962802dcc3eb26c9474c76a83b2ac03bdd","amp;dn":"Taylor+Dayne+-+Greatest+Hits+320cbr+%28Big+Papi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d91f8962802dcc3eb26c9474c76a83b2ac03bdd","infoHashBuffer":{"type":"Buffer","data":[157,145,248,150,40,2,220,195,235,38,201,71,76,118,168,59,42,192,59,221]},"announce":[],"urlList":[]}}