{"title":"How Jesus Became God - Bart Ehrman  (2014 - Retail epub)","uid":11677280,"size":1007098,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9df6d358d9e37bb9637090a4f6ade17b565274f2&amp;dn=How+Jesus+Became+God+-+Bart+Ehrman++%282014+-+Retail+epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"davieboy1966","files":4,"time":1422923943,"description":"Books : Biography : English\n\nRetail epub and mobi.\n\n\nNew York Times bestselling author and Bible expert Bart Ehrman reveals how Jesus's divinity became dogma in the first few centuries of the early church.\n\nThe claim at the heart of the Christian faith is that Jesus of Nazareth was, and is, God. But this is not what the original disciples believed during Jesus's lifetime - and it is not what Jesus claimed about himself. How Jesus Became God tells the story of an idea that shaped Christianity, and of the evolution of a belief that looked very different in the fourth century than it did in the first.\n\nA master explainer of Christian history, texts, and traditions, Ehrman reveals how an apocalyptic prophet from the backwaters of rural Galilee crucified for crimes against the state came to be thought of as equal with the one God Almighty, Creator of all things. But how did he move from being a Jewish prophet to being God? In a book that took eight years to research and write, Ehrman sketches Jesus's transformation from a human prophet to the Son of God exalted to divine status at his resurrection. Only when some of Jesus's followers had visions of him after his death - alive again - did anyone come to think that he, the prophet from Galilee, had become God. And what they meant by that was not at all what people mean today.\n\nWritten for secular historians of religion and believers alike, How Jesus Became God will engage anyone interested in the historical developments that led to the affirmation at the heart of Christianity: Jesus was, and is, God.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:9df6d358d9e37bb9637090a4f6ade17b565274f2","amp;dn":"How+Jesus+Became+God+-+Bart+Ehrman++%282014+-+Retail+epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9df6d358d9e37bb9637090a4f6ade17b565274f2","infoHashBuffer":{"type":"Buffer","data":[157,246,211,88,217,227,123,185,99,112,144,164,246,173,225,123,86,82,116,242]},"announce":[],"urlList":[]}}