{"title":"Windows 7 PRO 32bits [ORIGINAL][Spanish]","uid":5146137,"size":2447534388,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9df70b258a4b8005192a35514ce998de29a606e5&amp;dn=Windows+7+PRO+32bits+%5BORIGINAL%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"zurera","files":2,"time":1257269115,"description":"El desarrollo de este sistema operativo comenzÃƒÂ³ inmediatamente despuÃƒÂ©s del lanzamiento de Windows Vista. El 20 de julio de 2007, se revelÃƒÂ³ que este sistema operativo es llamado internamente por Microsoft como la versiÃƒÂ³n &quot;7&quot;. Hasta el momento, la compaÃƒÂ±ÃƒÂ­a declarÃƒÂ³ que Windows 7 tendrÃƒÂ¡ soporte para plataformas de 32 bits y 64 bits,[7] aunque la versiÃƒÂ³n para servidor (que sucederÃƒÂ­a a Windows Server 2008) serÃƒÂ¡ exclusivamente de 64 bits.\n\nEl 13 de octubre de 2008 fue anunciado que &quot;Windows 7&quot; ademÃƒÂ¡s de haber sido uno de los tantos nombres cÃƒÂ³digo, serÃƒÂ­a el nombre oficial de este nuevo sistema operativo. Mike Nash dijo que esto se debÃƒÂ­a a que con Windows 7 se &quot;apunta a la simplicidad, y el nombre debe reflejarlo&quot;.\n\nYa para el 7 de enero de 2009, la versiÃƒÂ³n beta se publicÃƒÂ³ para suscriptores de Technet y MSDN. El 9 de enero, se habilitÃƒÂ³ brevemente al pÃƒÂºblico general mediante descarga directa en la pÃƒÂ¡gina oficial, pero hubo problemas con los servidores que obligaron a retirar la posibilidad de descarga hasta horas mÃƒÂ¡s tarde despuÃƒÂ©s de aÃƒÂ±adir mÃƒÂ¡s servidores y, ademÃƒÂ¡s, cambiaron el lÃƒÂ­mite de 2,5 millones de personas como disculpa por el problema del retraso, el nuevo lÃƒÂ­mite fue hasta el 10 de febrero del 2009.\n\nEl 5 de mayo se liberÃƒÂ³ la versiÃƒÂ³n Release Candidate en 5 idiomas, entre ellos el espaÃƒÂ±ol. Estuvo disponible para descarga hasta el 20 de agosto de 2009.\n\nEl 2 de junio Microsoft anunciÃƒÂ³ que la salida mundial de Windows 7 tendrÃƒÂ­a lugar el 22 de octubre.\n\nEl 24 de julio, los directvos de Microsoft, Steve Ballmer y Steven Sinofsky anunciaron la finalizaciÃƒÂ³n del proceso de desarrollo con la compilaciÃƒÂ³n de la versiÃƒÂ³n RTM, destinada a la distribuciÃƒÂ³n de Windows.\n\nOtro asunto presente en el desarrollo de este sistema, gracias a los comentarios de los usuarios, fue el minimizar la intrusiÃƒÂ³n habilitando la personalizaciÃƒÂ³n del Control de Cuentas de Usuario, ya que ÃƒÂ©ste fue considerado como molesto en Windows Vista debido a sus constantes alertas en simples acciones, como el mantenimiento usando funciones propias del equipo.\n\nWindows 7 incluye numerosas actualizaciones, entre las que se encuentran avances en reconocimiento de voz, tÃƒÂ¡ctil y escritura, soporte para discos virtuales, mejor desempeÃƒÂ±o en procesadores multi-nÃƒÂºcleo, mejor arranque y mejoras en el nÃƒÂºcleo.\nWindows Explorer [editar]\n\n    * Bibliotecas: Las &quot;Bibliotecas&quot; son carpetas virtuales que agregan el contenido de varias carpetas y las muestran en una sola. Por ejemplo las carpetas agregadas en la librerÃƒÂ­a &quot;VÃƒÂ­deos&quot; por defecto son: &quot;VÃƒÂ­deos Personales&quot; (antes &quot;Mis VÃƒÂ­deos&quot;) y &quot;VÃƒÂ­deos PÃƒÂºblicos&quot; aunque se pueden agregar mÃƒÂ¡s manualmente. Sirven para clasificar los diferentes tipos de archivos (Documentos, MÃƒÂºsica, VÃƒÂ­deos, Fotos).\n\n    * Aero Shake Cuando se tiene varias ventanas abiertas, al seleccionar una y agitarla, las otras ventanas abiertas se minimizan, al repetir esta acciÃƒÂ³n, las ventanas vuelven a su ubicaciÃƒÂ³n anterior.\n\n    * La barra lateral de Windows o mÃƒÂ¡s conocida como Windows Sidebar se ha eliminado y ahora los gadgets pueden ubicarse libremente en cualquier lugar del escritorio.\n\n=== Barra de tareas ===\n\n    * La barra de tareas fue rediseÃƒÂ±ada haciÃƒÂ©ndola mÃƒÂ¡s ancha y los botones de las ventanas ya no traen texto, sino ÃƒÂºnicamente el icono de la aplicaciÃƒÂ³n. Estos cambios se hacen para mejorar el desempeÃƒÂ±o en sistemas de pantalla tÃƒÂ¡ctil. Los ÃƒÂ­conos se han integrado con el inicio rÃƒÂ¡pido, y ahora las ventanas abiertas se muestran agrupadas en ese ÃƒÂºnico icono con un borde indicando que estÃƒÂ¡n abiertas. Los accesos directos sin abrir no tienen un borde.\n\n    * Aero Peek: Las previsualizaciones incluÃƒÂ­das desde Windows Vista se han mejorado pasando a ser mÃƒÂ¡s interactivas y ÃƒÂºtiles. Cuando se posa el mouse sobre una aplicaciÃƒÂ³n abierta ÃƒÂ©ste muestra una previsualizaciÃƒÂ³n de la ventana donde muestra el nombre, la previsualizaciÃƒÂ³n y la opciÃƒÂ³n de cerrarla, ademÃƒÂ¡s, si se pone el ratÃƒÂ³n sobre la previsualizaciÃƒÂ³n, se obtiene una mirada a pantalla completa y al quitarlo se regresa al punto anterior. AdemÃƒÂ¡s se incorporÃƒÂ³ esta misma caracterÃƒÂ­stica a Windows Flip.\n\n    * Jump List: Haciendo clic derecho a cualquier aplicaciÃƒÂ³n de la barra de tareas aparece una &quot;Jump List&quot; (Lista de saltos) en donde se pueden hacer tareas sencillas de acuerdo a la aplicaciÃƒÂ³n, por ejemplo, abrir documentos recientes de Office, abrir pestaÃƒÂ±as recientes de Internet Explorer, escoger listas de reproducciÃƒÂ³n en el Media Player, cambiar el estado en Windows Live Messenger, etc.\n\n    * Barra Mostrar Escritorio: Esta nueva barra trae un pequeÃƒÂ±o rectÃƒÂ¡ngulo en la esquina derecha que reemplaza el icono en inicio rÃƒÂ¡pido de versiones anteriores. Este nuevo &quot;rectÃƒÂ¡ngulo&quot; permite que al poner el puntero sobre ÃƒÂ©l, haga que las ventanas se pongan 100% transparentes, esto sirve para poder ver el escritorio de manera rÃƒÂ¡pida, ver gadgets u otras cosas, o tambiÃƒÂ©n simplemente se le puede dar clic y minimizar todas las ventanas.\n\nMultimedia\n\nWindows 7 incluye consigo Windows Media Center y Windows Media Player 12.\nInterfaz \n\nEl equipo de desarrollo de la interfaz Ribbon de Microsoft Office 2007 formÃƒÂ³ parte activa en el rediseÃƒÂ±o de algunos programas y caracterÃƒÂ­sticas de Windows 7, incluyendo dicha interfaz en las herramientas Paint y Wordpad.\nMultitÃƒÂ¡ctil\n\nEl 27 de mayo de 2008, Steve Ballmer y Bill Gates en la conferencia &quot;D6: All Things Digital&quot; dieron a conocer la nueva interfaz multitÃƒÂ¡ctil llamÃƒÂ¡ndola &quot;sÃƒÂ³lo una pequeÃƒÂ±a parte&quot; de lo que vendrÃƒÂ¡ con Windows 7. MÃƒÂ¡s tarde Julie Larson Green, vicepresidente corporativa, mostrÃƒÂ³ posibles usos, como hacer dibujos en Paint, agrandar o reducir fotos y recorrer un mapa en Internet, arrastrar y abrir elementos, simplemente con toques en la pantalla.\n\n\n\nWindows 7 permite integrarse con la nueva versiÃƒÂ³n Windows Virtual PC, que permite ejecutar un equipo virtual Windows XP en forma transparente para el usuario (la aplicaciÃƒÂ³n dentro de la mÃƒÂ¡quina virtualizada se ve como otra opciÃƒÂ³n en el menÃƒÂº de Windows 7 y su ejecuciÃƒÂ³n es directa, sin pasar por el menÃƒÂº de inicio del XP virtualizado). Si bien Microsoft ya habÃƒÂ­a liberado MED-V dentro de su paquete MDOP que cumple la misma funciÃƒÂ³n en entornos Hyper-V, esta es una soluciÃƒÂ³n orientada a usuarios avanzados y pequeÃƒÂ±as empresas que no necesitan de herramientas para administraciÃƒÂ³n centralizada. Esta funcionalidad se debe descargar de forma independiente en el sitio de Microsoft (aunque sÃƒÂ³lo corresponde a las ediciones Professional, Ultimate y Enterprise de Windows 7). Asimismo, el modo XP requiere de procesadores con capacidad de virtualizaciÃƒÂ³n, a diferencia del tradicional Virtual PC 2007 o Virtual PC 2008.\nOtras caracterÃƒÂ­sticas \n\nMicrosoft ha decidido no incluir los programas Windows Mail, Windows Movie Maker y Windows Photo Gallery en Windows 7, poniÃƒÂ©ndolos a disposiciÃƒÂ³n a modo de descarga en el conocido paquete de servicios en red, Windows Live Essentials. Esto se ha decidido para facilitar las actualizaciones de estos programas, aligerar el sistema operativo, dejar escoger al usuario las aplicaciones que quiere tener en su equipo y evitar futuras demandas por monopolio.\nRequisitos de hardware\n\nA finales de abril del 2009 Microsoft dio a conocer los requerimientos finales de Windows 7.\nRequisitos de hardware mÃƒÂ­nimos recomendados para Windows 7 Arquitectura 32 bits \t64 bits\nProcesador \t1 GHz\nMemoria RAM \t1 GB de RAM \t2 GB de RAM\nTarjeta grÃƒÂ¡fica \tDispositivo de grÃƒÂ¡ficos DirectX 9 con soporte de controladores WDDM 1.0 (para Windows Aero)\nDisco duro \t16 GB de espacio libre \t20 GB de espacio libre\nUnidad ÃƒÂ³ptica \tDVD-R/RW","torrent":{"xt":"urn:btih:9df70b258a4b8005192a35514ce998de29a606e5","amp;dn":"Windows+7+PRO+32bits+%5BORIGINAL%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9df70b258a4b8005192a35514ce998de29a606e5","infoHashBuffer":{"type":"Buffer","data":[157,247,11,37,138,75,128,5,25,42,53,81,76,233,152,222,41,166,6,229]},"announce":[],"urlList":[]}}