{"title":"Stardew Valley (GOG)","uid":13685786,"size":354296909,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9fd1c52c15d92c6a0757e6eaa2cd28651c418689&amp;dn=Stardew+Valley+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"mercs215","files":2,"time":1456546822,"description":"Install instructions:\r\n- Run &quot;setup_stardew_valley_2.0.0.2.exe&quot;\r\n- Play\r\nPLEASE REMEMBER TO SEED, MANY OTHERS WANT THIS! :)\r\nIf you like this game, support the developers and BUY IT!\r\n\r\nTitle: STARDEW VALLEY\r\nGenre: Simulation - Role-playing - Managerial\r\nWorks on: Windows (7, 8, 10)\r\nLanguages: Text only: English\r\nFeatures: single-player\r\nReleased: Feruary 26, 2016\r\nSize: 337.9 MB\r\nCompany: ConcernedApe / ConcernedApe \r\nStore page: https://www.gog.com/game/stardew_valley\r\n\r\nAbout:\r\nYou’ve inherited your grandfather’s old farm plot in Stardew Valley. Armed with hand-me-down tools and a few coins, you set out to begin your new life. Can you learn to live off the land and turn these overgrown fields into a thriving home? It won’t be easy. Ever since Joja Corporation came to town, the old ways of life have all but disappeared. The community center, once the town’s most vibrant hub of activity, now lies in shambles. But the valley seems full of opportunity. With a little dedication, you might just be the one to restore Stardew Valley to greatness!\r\nTurn your overgrown field into a lively farm! Raise animals, grow crops, start an orchard, craft useful machines, and more! You'll have plenty of space to create the farm of your dreams.\r\nImprove your skills over time. As you make your way from a struggling greenhorn to a master farmer, you'll level up in 5 different areas: farming, mining, combat, fishing, and foraging. As you progress, you'll learn new cooking and crafting recipes, unlock new areas to explore, and customize your skills by choosing from a variety of professions.\r\nBecome part of the local community. With over 30 unique characters living in Stardew Valley, you won't have a problem finding new friends! Each person has their own daily schedule, birthday, unique mini-cutscenes, and new things to say throughout the week and year. As you make friends with them, they will open up to you, ask you for help with their personal troubles, or tell you their secrets! Take part in seasonal festivals such as the luau, haunted maze, and feast of the winter star.\r\n\r\nMinimum system requirements - Windows: 7 / 8 / 10\r\nProcessor: 2 Ghz\r\nMemory: 2 GB RAM\r\nGraphics: 256 MB video memory, shader model 3.0+\r\nDirectX: Version 10\r\nStorage: 500 MB available space","torrent":{"xt":"urn:btih:9fd1c52c15d92c6a0757e6eaa2cd28651c418689","amp;dn":"Stardew+Valley+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9fd1c52c15d92c6a0757e6eaa2cd28651c418689","infoHashBuffer":{"type":"Buffer","data":[159,209,197,44,21,217,44,106,7,87,230,234,162,205,40,101,28,65,134,137]},"announce":[],"urlList":[]}}