{"title":"ABC of Urology, 3E [PDF] [StormRG]","uid":11008260,"size":216536779,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9ff4cd07f11608526814058411a3173909c62f08&amp;dn=ABC+of+Urology%2C+3E+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"0xmovva","files":2,"time":1410287170,"description":"Author: Chris Dawson (Author), Janine Nethercliffe (Author)\nPaperback: 88 pages\nPublisher: BMJ Books; 3 edition (June 5, 2012)\nLanguage: English\nISBN-10: 0470657170\nISBN-13: 978-0470657171\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n______________________________________________________________________________\n\n\nThe ABC of Urology provides a comprehensive review of current practice in urology and is a structured and practical guide to the diagnosis, treatment and management of the most common urological conditions. This new third edition has been fully revised and expanded with additional chapters and improved coverage of renal and testis cancer, management of haematuria, laparoscopy, trauma and new urological advances. Prostate, bladder, renal and penile cancers are also covered in detail and new techniques and procedures for safer and effective treatment options are featured.\nThe ABC of Urology is the ideal reference for general practitioners and general practitioner trainees, junior doctors and practice nurses, medical students and all primary health care professionals working to provide the best possible care for patients with urological conditions.","torrent":{"xt":"urn:btih:9ff4cd07f11608526814058411a3173909c62f08","amp;dn":"ABC+of+Urology%2C+3E+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ff4cd07f11608526814058411a3173909c62f08","infoHashBuffer":{"type":"Buffer","data":[159,244,205,7,241,22,8,82,104,20,5,132,17,163,23,57,9,198,47,8]},"announce":[],"urlList":[]}}