{"title":"Star Wars 3 - The Revenge of the Sith (2005)(ENG NL SUBS)vlinder","uid":6004863,"size":4509379865,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:a0b84917dd3bb2ecdc28df9e02abcb252d3d12c8&amp;dn=Star+Wars+3+-+The+Revenge+of+the+Sith+%282005%29%28ENG+NL+SUBS%29vlinder&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"Vlinder2","files":-1,"time":1291289491,"description":"Star Wars 3 - The Revenge of the Sith (2005)      \n\n \n  Verenigde Staten\nScience-Fiction / Fantasy\n140 minuten\n\ngeregisseerd door George Lucas\nmet Hayden Christensen, Ewan McGregor en Natalie Portman\n\nDe Clone Wars razen naar hun hoogtepunt als Kanselier Palpatine wordt ontvoerd door General Grievous, een inmiddels bekende Jedi-doder. Anakin Skywalker en Obi-Wan Kenobi strijden als broers in dit gevecht om hem te redden en ze gaan een laatste confrontatie aan met de leider van de seperatisten, Count Dooku. Maar als de Jedi Council eindelijk een manier heeft gevonden om de Clone Wars tot een einde te brengen en de vrede in het melkwegstelsel te herstellen, houden ze er geen rekening mee dat Anakin zich langzaam tegen de Jedi Council keert als hij een keuze moet maken tussen Obi-Wan en zijn heimelijke vrouw PadmÃƒÂ©, die hij in een visioen heeft zien sterven. De mysterieuze Sith Lord Darth Sidious slaat voor een laatste keer hard toe en alle gebeurtenissen leiden naar de eerste Star Wars film uit 1977 als George Lucas het laatste hoofdstuk in zijn verhaal afsluit.\n \n &lt;a href=&quot; http://www.moviemeter.nl/film/5924&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.moviemeter.nl/film/5924&lt;/a&gt;\n \n\nEnglish\n\nIt is three years after the Clone Wars. The leader of the droid army, General Grievous, has captured Chancellor Palpatine on board his ship, the Invisible Hand. Jedi Master Obi-Wan Kenobi and Jedi Knight Anakin Skywalker must fly through Coruscant safely, and enter the Invisible Hand so that they can rescue the captive Chancellor. Just when Palpatine is about to be released, Count Dooku shows up. Obi-Wan and Anakin both battle it out with him, but Obi-Wan ends up unconscious. Anakin slices off his head and kills him. Anakin carries Obi-Wan, and Palpatine follows him. They meet General Grievous face to face, and Anakin tries to fly the last half of the ship so that they can safely land on Coruscant. Later, Palpatine starts acting strange, constantly manipulating Anakin into believing that the Jedi Council is against him. Eventually, it is found out that he is the Dark Lord of the Sith. Jedi Master Mace Windu fights him... \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0121766/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0121766/&lt;/a&gt;\n\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5\nAudio: English\nMenu : Yes \nBron : Retail pal\nWidth : 720 pixels\nHeight : 576 pixels\nDisplay aspect ratio : 16/9\n \nOndertitels : Dutch, English\n \nGenre : Science Fiction\n \nTBS","torrent":{"xt":"urn:btih:a0b84917dd3bb2ecdc28df9e02abcb252d3d12c8","amp;dn":"Star+Wars+3+-+The+Revenge+of+the+Sith+%282005%29%28ENG+NL+SUBS%29vlinder","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0b84917dd3bb2ecdc28df9e02abcb252d3d12c8","infoHashBuffer":{"type":"Buffer","data":[160,184,73,23,221,59,178,236,220,40,223,158,2,171,203,37,45,61,18,200]},"announce":[],"urlList":[]}}