{"title":"FastPictureViewer Professional Edition v1.9 build 358","uid":15565509,"size":76963015,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a17b5d99e9d53f69e13b54f651db94a983376afe&amp;dn=FastPictureViewer+Professional+Edition+v1.9+build+358&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"LxByte","files":2,"time":1471191419,"description":"FastPictureViewer Professional Edition v1.9 build 358\r\n\r\nFastPictureViewer Pro, the fastest image viewer, EVER.\r\n\r\nDesigned for photographers. Built for speed. Runs on Windows 10, Windows 8.x, Windows 7, Windows Vista and Windows XP.\r\n\r\nSave time: preview, cull and rate pictures faster than ever before!\r\n\r\nFastPictureViewer Professional Highlights:\r\n\r\nFastest raw image viewer ever. Period. Native 64-bit suppport, multi-processing and GPU-acceleration all contribute to the unparallel speed of FPV Pro.\r\nExport/publish all supported image formats as JPEG, to local devices (USB key, hard disk) or photo-sharing sites like SmugMug, Zenfolio or PhotoShelter.\r\nInstant zooming to 100% view, for quick sharpness checks: just click on the image to zoom-in, release the move to get back. Fastest and best in industry!\r\nReal-time RGB histogram, EXIF shooting data, color eyedropper with shadow/highlights and Adobe XMP Rating/Label/Urgency gadgets.\r\nInstantaneous, single-keystroke copy/move of your &quot;keepers&quot; to a preset folder (background copy/move) - just press K to keep an image.\r\nRules-based, scriptable batch copy, move, delete, save-for-web automation, multi-threaded parallel execution. Flexible file management!\r\nInstantaneous display of the next image in line (when computer resources allows) through speculative image pre-loading and in-memory caching.\r\nInstant industry-standard Adobe XMP compatible rating and tagging, embedded in standard formats (JPG, JPEG-XR, TIFF) or in external XMP sidecars.\r\nFast tethered shooting through the standard MTP/PTP protocol: tether a Nikon D700, D800, D3S, D3X, D4 in 64 bit, today, storing pictures on CF card too.\r\nSupports most common image formats. Special raster formats like OpenEXR, DDS, PNM, J2K are supported through separately installable image codecs.\r\nSupports RAW formats, from 460+ digital cameras models, incl. EOS 1D X, D4/D800/J1/V1 and many more.\r\nProfessional color management, with ICC v2 and v4 profiles. Profiled monitor support. Supports Canon Kyuanos color engine on Vista and Windows 7.\r\nSlickest, most uncluttered user interface in industry including a borderless, true 100% full screen mode: focus on your images!\r\nIntegration with Windows 7 (Taskbar Jump List) and Windows Vista (thumbnail cache, &quot;Browse with...&quot; shell folder extension). Enables Explorer thumbnails.\r\nNative 64-bit and 32-bit editions for Windows 8.x Desktop, Windows 7, Windows Vista, XP SP3 and XP64, multi-core and multi-processor enabled to take full advantage of modern computer hardware, with optional Direct3D GPU acceleration: FPV Pro absolutely flies on 2012 hardware and will squeeze every last bits of your computer's performance.\r\n\r\nOfficial Website: http://www.fastpictureviewer.com/","torrent":{"xt":"urn:btih:a17b5d99e9d53f69e13b54f651db94a983376afe","amp;dn":"FastPictureViewer+Professional+Edition+v1.9+build+358","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a17b5d99e9d53f69e13b54f651db94a983376afe","infoHashBuffer":{"type":"Buffer","data":[161,123,93,153,233,213,63,105,225,59,84,246,81,219,148,169,131,55,106,254]},"announce":[],"urlList":[]}}