{"title":"How I Made $2,000,000 In The Stock Market","uid":4746534,"size":3835372,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a1edff12a93ca31d3a0d3c7b64482acb8ef3367c&amp;dn=How+I+Made+%242%2C000%2C000+In+The+Stock+Market&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":6,"uploader":"VasiaZozulia","files":1,"time":1235915529,"description":"Nicolas Darvas wrote &quot;How I Made $2,000,000 in the Stock Market&quot; in 1960, shortly after he had made over $2,000,000 trading stocks in a little over 18 months. But the story starts in 1952, when Darvas, a ballroom dancer by profession, acquired his first stock in a Canadian mining company almost inadvertently. He sold it at a profit, and he was hooked. But Darvas knew nothing about the stock market. He learned everything the hard way, and that's what makes this book interesting. Darvas is a colorful, overbearing, but frank character, and he takes us through his quest to figure out how to make money in the stock market step by painful step. \nDarvas divides his learning experience into 4 parts. At first he was &quot;The Gambler&quot;, acting on tips and impulses. That failed. Then he got serious and became &quot;The Fundamentalist&quot;, reading annual reports, listening to analysts, and investing accordingly. That failed. So he became &quot;The Technician&quot;, developing his own method of anticipating a rise in stock price, which he called &quot;box theory&quot;. He wasn't losing much money, but he wasn't making much either. Finally Darvas devised a method of predicting stock price movement that incorporated all of his hard-learned lessons. He became &quot;The Techno-Fundamentalist&quot;. He selected stocks based on earning prospects for their sector, but bought the leaders in their sector only when price movement looked promising according to his box theory.\n","torrent":{"xt":"urn:btih:a1edff12a93ca31d3a0d3c7b64482acb8ef3367c","amp;dn":"How+I+Made+%242%2C000%2C000+In+The+Stock+Market","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1edff12a93ca31d3a0d3c7b64482acb8ef3367c","infoHashBuffer":{"type":"Buffer","data":[161,237,255,18,169,60,163,29,58,13,60,123,100,72,42,203,142,243,54,124]},"announce":[],"urlList":[]}}