{"title":"Wild Fermentation: Flavor, Nutrition of Live-Culture Foods","uid":7809368,"size":1542279,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a20229eaeff40d599339cafe8e46742a093b29d5&amp;dn=Wild+Fermentation%3A+Flavor%2C+Nutrition+of+Live-Culture+Foods&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1352485353,"description":"Wild Fermentation: The Flavor, Nutrition, and Craft of Live-Culture Foods by Sandor Ellix Katz\nChelsea Green Publishing | 2003 | ISBN: 1931498237 | English | 200 pages | EPUB \n\nBread. Cheese. Wine. Beer. Coffee. Chocolate. Most people consume fermented foods and drinks every day. For thousands of years, humans have enjoyed the distinctive flavors and nutrition resulting from the transformative power of microscopic bacteria and fungi. Wild Fermentation: The Flavor, Nutrition, and Craft of Live-Culture Foods is the first cookbook to widely explore the culinary magic of fermentation.&quot;Fermentation has been an important journey of discovery for me,&quot; writes author Sandor Ellix Katz. &quot;I invite you to join me along this effervescent path, well trodden for thousands of years yet largely forgotten in our time and place, bypassed by the superhighway of industrial food production.&quot; The flavours of fermentation are compelling and complex, quite literally alive. This book takes readers on a whirlwind trip through the wide world of fermentation, providing readers with basic and delicious recipes-some familiar, others exotic-that are easy to make at home.","torrent":{"xt":"urn:btih:a20229eaeff40d599339cafe8e46742a093b29d5","amp;dn":"Wild+Fermentation%3A+Flavor%2C+Nutrition+of+Live-Culture+Foods","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a20229eaeff40d599339cafe8e46742a093b29d5","infoHashBuffer":{"type":"Buffer","data":[162,2,41,234,239,244,13,89,147,57,202,254,142,70,116,42,9,59,41,213]},"announce":[],"urlList":[]}}