{"title":"Grand Theft Auto (GTA): San Andreas - Winter Came [PC]","uid":5412809,"size":1296855176,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a219d669a5346e48f4b7fae57682a856af610b68&amp;dn=Grand+Theft+Auto+%28GTA%29%3A+San+Andreas+-+Winter+Came+%5BPC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"thenoobish","files":1,"time":1267805665,"description":"GTA San Andreas - Winter Came\nRelease: 2009\nGenre: GTA\nDeveloper: Rockstar North\nPublisher: Rockstar Games\nWeb Developer: www.gtasanandreas.com\nLanguage: English\nPlatform: Vista/XP/2000/2003, 32-bit and 64-bit.\nSystem requirements: Minimum requirements: CPU 1 GHz, 256 Mb, 64 Mb Video\nRecommended requirements: CPU 1,5 GHz, 512 Mb, 128 Mb Video\nDescription: And so we uproar in Sanya in the summer we have become accustomed to the field of the sun and rain !!!!!\nBut winter came snowfalls and blizzards! Frost bound the road! All perishli on winter tires! Well, and CJ, too, does not sleep, he wore a jacket pants!\nIn the game you can control the weather nazhmesh ctrl +!!!! Once go a little snow nazhmesh two go snowfall nazhmesh third time will be a storm and the fourth and will not speak!\nExtras. Information: Another CJ learned to fly a jump and then you press the button before he flies faster to fly on the button n (the current rate of vsee not to cut his head on the osfalt and then perish!! slowly fly button G!! and still in the woods covered in snow bred monsters like kinkonga are friendly but if you touch them they will attack you! so if you want to make trouble take the armor!! in Sanaa you can ride a submarine! just Put out away from shore and type ctrl s! ! and you will control the submarine dive down arrow up arrow vverz and the rest as the car can still shoot torpedoes! Another such FENXKI is click on the number 3 or 4 you have a list of cars to choose space! Izvenyayus for the mistakes I is just tired very probably nemereno errors in the text!!","torrent":{"xt":"urn:btih:a219d669a5346e48f4b7fae57682a856af610b68","amp;dn":"Grand+Theft+Auto+%28GTA%29%3A+San+Andreas+-+Winter+Came+%5BPC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a219d669a5346e48f4b7fae57682a856af610b68","infoHashBuffer":{"type":"Buffer","data":[162,25,214,105,165,52,110,72,244,183,250,229,118,130,168,86,175,97,11,104]},"announce":[],"urlList":[]}}