{"title":"The Facts on File Encyclopedia of Word and Phrase Origins.pdf","uid":10405522,"size":10747920,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a2230713a969f5a9f19efe51723b4170e9757ec1&amp;dn=The+Facts+on+File+Encyclopedia+of+Word+and+Phrase+Origins.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":2,"uploader":"ZamKhan","files":1,"time":1403450603,"description":"The most comprehensive single-volume reference of its kind, The Facts On File Encyclopedia of Word and Phrase Origins, Fourth Edition has been completely updated and expanded and now contains definitions and origins of more than 15,000 words and expressions. This encyclopedia features anecdotes and information on the development of a wide range of words, including slang, proverbs, animal and plant names, place names, nicknames, historical expressions, foreign language expressions, and phrases from literature. The emphasis throughout is on words and expressions whose origins are not adequately explained, or not addressed at all, in standard dictionaries. Approximately 2,500 new entries have been added to this edition, ranging from Aardsma to zounds.\n\nMore than 15,000 entries over 2,000 of which are new to this edition provide information and anecdotes on the origin and development of a wide range of words and phrases, including:\nFellini named the hyperactive photographer in La Dolce Vita Signor Paparazzo, after the Italian slang for mosquito, which lead to the popularity of the term, paparazzi.\n\nArgentina takes its name from the Latin argentum meaning silver. Legend says that llamas grazing on Mount Posi in 1545 uprooted some shrubbery, beneath which was a vein of silver ore.\n\nConjurer's assistants in the 17th century would eat toads so the magicians could demonstrate their miraculous healing powers. The assistants came to be known as &quot;toad eaters,&quot; which became our modern insult, &quot;toady.","torrent":{"xt":"urn:btih:a2230713a969f5a9f19efe51723b4170e9757ec1","amp;dn":"The+Facts+on+File+Encyclopedia+of+Word+and+Phrase+Origins.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2230713a969f5a9f19efe51723b4170e9757ec1","infoHashBuffer":{"type":"Buffer","data":[162,35,7,19,169,105,245,169,241,158,254,81,114,59,65,112,233,117,126,193]},"announce":[],"urlList":[]}}