{"title":"Aqueous Systems at Elevated Temperatures and Pressures","uid":15910798,"size":7829365,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a2f5542c86edc985ae7a44c7e9beea729180b424&amp;dn=Aqueous+Systems+at+Elevated+Temperatures+and+Pressures&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"clouderone","files":1,"time":1475112931,"description":"Aqueous Systems at Elevated Temperatures and Pressures - D.A. Palmer et al. (Elsevier, 2004).pdf\r\n\r\nThe International Association for the Properties of Water and Steam (IAPWS) has produced this book in order to provide an accessible, up-to-date overview of important aspects of the physical chemistry of aqueous systems at high temperatures and pressures. These systems are central to many areas of scientific study and industrial application, including electric power generation, industrial steam systems, hydrothermal processing of materials, geochemistry, and environmental applications. The authors’ goal is to present the material at a level that serves both the graduate student seeking to learn the state of the art, and also the industrial engineer or chemist seeking to develop additional expertise or to find the data needed to solve a specific problem.\r\n\r\nThe wide range of people for whom this topic is important provides a challenge. Advanced work in this area is distributed among physical chemists, chemical engineers, geochemists, and other specialists, who may not be aware of parallel work by those outside their own specialty. The particular aspects of high-temperature aqueous physical chemistry of interest to one industry may be irrelevant to another; yet another industry might need the same basic information but in a very different form.\r\n\r\n\r\nTo serve all these constituencies, the book includes several chapters that cover the foundational thermophysical properties (such as gas solubility, phase behavior, thermodynamic properties of solutes, and transport properties) that are of interest across numerous applications. The presentation of these topics is intended to be accessible to readers from a variety of backgrounds. Other chapters address fundamental areas of more specialized interest, such as critical phenomena and molecular-level solution structure. Several chapters are more application-oriented, addressing areas such as power-cycle chemistry and hydrothermal synthesis. As befits the variety of interests addressed, some chapters provide more theoretical guidance while others, such as those on acid/base equilibria and the solubilities of metal oxides and hydroxides, emphasize experimental techniques and data analysis.\r\n\r\n- Covers both the theory and applications of all Hydrothermal solutions \r\n- Provides an accessible, up-to-date overview of important aspects of the physical chemistry of aqueous systems at high temperatures and pressures\r\n- The presentation of the book is understandable to readers from a variety of backgrounds","torrent":{"xt":"urn:btih:a2f5542c86edc985ae7a44c7e9beea729180b424","amp;dn":"Aqueous+Systems+at+Elevated+Temperatures+and+Pressures","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2f5542c86edc985ae7a44c7e9beea729180b424","infoHashBuffer":{"type":"Buffer","data":[162,245,84,44,134,237,201,133,174,122,68,199,233,190,234,114,145,128,180,36]},"announce":[],"urlList":[]}}