{"title":"Android Gameboy (Color) Emulator + 2054 ROMs","uid":13689640,"size":593836264,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:a3198878f1307f8d892fc90c9480b3ca307b411b&amp;dn=Android+Gameboy+%28Color%29+Emulator+%2B+2054+ROMs&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":2,"uploader":"Androider","files":2,"time":1456586085,"description":"My OldBoy! is a full-featured and super-fast emulator to run Game Boy and Game Boy Color games on the broadest range of Android devices, from very low-end phones to modern tablets. \r\n\r\nIt emulates accurately almost every aspect of the real hardware. Special features including link cable, rumble, and tilt sensor are also supported. You can also make your GB games colorful by selecting a custom palette.\r\n\r\nOf course it does not just emulate the hardware. Thanks to the save state system, you can save progress at any time and return back to it instantly. \r\n\r\nAnd while enabling fast-forward in game, you can quickly skip to the part of the game you are mostly interested in.\r\n\r\n• Fastest emulation using ARM assembly code. Easily get to 60 FPS without frame skips even on very low-end devices.\r\n• Very good game compatibility.\r\n• Saves your battery as much as possible.\r\n• Link cable emulation either on the same device, or across devices over Bluetooth or Wi-Fi, running at decent speed.\r\n• Tilt sensor and rumble emulation through your Android's hardware sensors and vibrator!\r\n• Enter multilined GameShark/GameGenie cheat codes and enable/disable them on the fly while the game is running.\r\n• IPS/UPS ROM patching\r\n• Fast-forward to skip long stories, as well as slow down games to get past a level you cannot in normal speed. Depending on your hardware, it can run as fast as 50x normal speed.\r\n• OpenGL rendering backend, as well as normal rendering on devices without a GPU.\r\n• Cool video filters through the support of GLSL shaders.\r\n• Save games at any time with screenshot.\r\n• On-screen keypad (multi-touch requires Android 2.0 or later), as well as shortcut buttons such as load/save.\r\n• A very powerful screen layout editor, with which you can define the position and size for each of the on-screen controls, as well as for the game video.\r\n• External controllers support, through either the Android native way or input method.\r\n• Well-designed user interface. Seamlessly integrated with the latest Android.\r\n• Create and switch to different screen-layout and key-mapping profiles.\r\n• Create shortcuts to easily launch your favorite games from your desktop.\r\n\r\nWhat's New:\r\n\r\n• [core] Support 8-Mbytes games.\r\n• [core] Fixed crash when SP moves across different memory regions with PUSH/POP.\r\n• Various UI fixes/improvements.\r\n\r\nMore Info:\r\n \nhttps://play.google.com/store/apps/details?id=com.fastemulator.gbc","torrent":{"xt":"urn:btih:a3198878f1307f8d892fc90c9480b3ca307b411b","amp;dn":"Android+Gameboy+%28Color%29+Emulator+%2B+2054+ROMs","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3198878f1307f8d892fc90c9480b3ca307b411b","infoHashBuffer":{"type":"Buffer","data":[163,25,136,120,241,48,127,141,137,47,201,12,148,128,179,202,48,123,65,27]},"announce":[],"urlList":[]}}