{"title":"Boys on Film 10 (2013) DVD RIP","uid":9763989,"size":1073438417,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a3b0dcd0048b302e013d9eb0dc49fe4dad9bbcec&amp;dn=Boys+on+Film+10+%282013%29+DVD+RIP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":2,"uploader":"jmanwf","files":-1,"time":1394856363,"description":"BLINDERS - Dir. Jacob Brown (USA) 10mins 2011\nOne night a young couple (Enter The Void s Nathaniel Brown &amp; Byrdie Bell) visit a bar one where they meet a young creature of a boy (Luke Worrall). This boy possesses an otherworldly physical beauty that could attract anyone; man or woman. And indeed, the young lovers are attracted, one more so than the other. What does this chance meeting mean for their relationship?\n\nA STABLE FOR DISABLED HORSES- Dir. Fabio Youniss (UK)  2012\nWhen Kanoute decides to move back to Norway his best friend Benny throws him a surprise party a party just for two. It soon becomes apparent that Benny has a secret that he has to get off his chest before Kanoute leaves, but is it a secret Kanoute wants to hear?\n\nLITTLE GAY BOY, CHRIST IS DEAD IN FRECH WITH HARDCODED ENGLISH SUBTITLES - Dir. Antony Hickling, Amaury Grisel (FRANCE) 30mins 2012\nJean Christophe dreams of becoming an international model, but in reality lives with his mother, an English prostitute in Paris. Over the course of one unusual day, JC endures a series of abusive encounters that will change him forever. His youthful innocence is changed to hardened experience as his dreams are destroyed by those around him.\n\nBOYS VILLAGE - Dir. Till Kleinert (UK/Germany)  2011\nThe Boys' Village was once a holiday home for coalminers' sons, boasting a pool, sports yards and even a chapel of its own. Not much remains of its former glory, though. Shattered glass and debris are all over the place; graffiti on the walls. There are countless trap falls and opportunities for injury. This is a parent's nightmare and yet it can be heaven on earth for a certain kind of child. It more or less is for Kevin. He has been 11 years old for quite some time now. Has it been years or decades?\n\nHEADLONG ( IN FRENCH WITH ENGLISH SUBTITLES NOT HARDCODED ) - Dir. Lukas Shont (Belgium)  2012\nOn the night of a dance competition a young ballet dancer (Jelle Florizoone - North Sea Texas) is in a foreign place. He finds himself alone in his hotel room and when this emptiness overpowers him, he meets a stranger that could change everything (Thomas Coumans - North Sea Texas).\n\nYEAH KOWALSKI! - Dir. Evan Robert (USA)  2011\nGabe Kowalski is a late bloomer and all-around misfit whose dad still cuts his hair. When Gabe s anonymous question about his still smooth armpits is selected to be read aloud in sex-ed class, Gabe goes to great lengths to impress his classmate crush, Shane, at Penny Foster s birthday party.\n\nINFLATABLE SWAMP - Dir. William Feroldi (UK)  2010\nMatt, a gay man in his late 20s, navigates the lonely intersection of carnal sex and human closeness. With the arrival of Luke, a new man in his life, he finds a way to reconcile pleasures of the flesh with the new aroused imperatives of the heart. INFLATABLE SWAMP is an unusual exploration of gay male psychical intimacy.\n\nTEENS LIKE PHIL - Dir. Dominic Haxton &amp; David Rosler (USA)2012\nPhil, a shy, insecure teenager growing up in an affluent American suburb, is trapped in the painful throes of adolescence and the internalised struggle in coming to terms with his sexuality. At his elite private school, Phil is bullied by Adam, his former friend and love interest. Adam frequently lashes out against Phil and enjoys humiliating him in the locker room. When Phil can no longer tolerate the situation he takes drastic action to bring it to an end. ","torrent":{"xt":"urn:btih:a3b0dcd0048b302e013d9eb0dc49fe4dad9bbcec","amp;dn":"Boys+on+Film+10+%282013%29+DVD+RIP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3b0dcd0048b302e013d9eb0dc49fe4dad9bbcec","infoHashBuffer":{"type":"Buffer","data":[163,176,220,208,4,139,48,46,1,61,158,176,220,73,254,77,173,155,188,236]},"announce":[],"urlList":[]}}