{"title":"Breverton's Complete Herbal - A Book of Remarkable Plants","uid":9682208,"size":4873605,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a424f73212fcf21bcda974cef46b296d4df6e4dd&amp;dn=Breverton%27s+Complete+Herbal+-+A+Book+of+Remarkable+Plants&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"AtomTPB","files":1,"time":1393683104,"description":"Pages: 384 pages\nPublished: September 1, 2011\nLanguage: English\nISBN-10: 0857383361\nISBN-13: 978-0857383365\nFormat: EPUB\n\n\nNicholas Culpeper's The English Physitian: or an Astrologo-physical Discourse of the Vulgar Herbs of This Nation is more commonly known as Culpeper's Complete Herbal. It was first printed in September 1653 (Culpeper died in January 1654) and immediately became a classic reference that is as fascinating today as it was over 350 years ago. Breverton's Complete Herbal is a reworking of Culpeper's classic text for a modern day audience. Arranged alphabetically, this book describes over 250 herbs and spices as well as feature entries on scented herb/medicinal gardens, the great herbalists and New World Herbs not included in Culpepper's original text. Each entry provides a description of the herb: its appearance and botanical features, a brief history of its uses in medicine, dyeing and cuisine to bizarre remedies and concoctions designed to get rid of all manner of real and imaginary ailements. As informative as it is entertaining, this incredibly diverse compendium contains just about everything you'll ever need to know about the properties and provenance of herbs and spices of the world. From amara dulcis to yarrow, all-heal to viper's bugloss, Breverton's Complete Herbal is a modern day treasury of over 250 herbs and their uses.","torrent":{"xt":"urn:btih:a424f73212fcf21bcda974cef46b296d4df6e4dd","amp;dn":"Breverton%27s+Complete+Herbal+-+A+Book+of+Remarkable+Plants","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a424f73212fcf21bcda974cef46b296d4df6e4dd","infoHashBuffer":{"type":"Buffer","data":[164,36,247,50,18,252,242,27,205,169,116,206,244,107,41,109,77,246,228,221]},"announce":[],"urlList":[]}}