{"title":"Burn Math Class (2016).epub Gooner","uid":15014629,"size":34675466,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a4657cfa6760de5da6181222cbc141999c5a00b3&amp;dn=Burn+Math+Class+%282016%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1466445698,"description":"Burn Math Class - And Reinvent Mathematics for Yourself (2016).epub Gooner\r\n\r\nPublisher: Basic Civitas Books (2016)\r\nLanguage: English\r\nISBN-10: 0465053734\r\nISBN-13: 978-0465053735\r\n\r\nForget everything you've been taught about math. In &quot;Burn Math Class,&quot; Jason Wilkes takes the traditional approach to how we learn math with its unwelcoming textbooks, unexplained rules, and authoritarian assertions and sets it on fire. Focusing on how mathematics is created rather than on mathematical facts, Wilkes teaches the subject in a way that requires no memorization and no prior knowledge beyond addition and multiplication. \r\n\r\nFrom these simple foundations, &quot;Burn Math Class&quot; shows how mathematics can be (re)invented from scratch without preexisting textbooks and courses. We can discover math on our own through experimentation and failure, without appealing to any outside authority. When math is created free from arcane notations and pretentious jargon that hide the simplicity of mathematical concepts, it can be understood organically and it becomes fun! Following this unconventional approach, &quot;Burn Math Class&quot; leads the reader from the basics of elementary arithmetic to various advanced topics, such as time-dilation in special relativity, Taylor series, and calculus in infinite-dimensional spaces. Along the way, Wilkes argues that orthodox mathematics education has been teaching the subject backward: calculus belongs &quot;before&quot; many of its so-called prerequisites, and those prerequisites cannot be fully understood without calculus. Like the smartest, craziest teacher you've ever had, Wilkes guides you on an adventure in mathematical creation that will radically change the way you think about math. Revealing the beauty and simplicity of this timeless subject, &quot;Burn Math Class&quot; turns everything that seems difficult about mathematics upside down and sideways until you understand just how easy math can be.&quot;","torrent":{"xt":"urn:btih:a4657cfa6760de5da6181222cbc141999c5a00b3","amp;dn":"Burn+Math+Class+%282016%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4657cfa6760de5da6181222cbc141999c5a00b3","infoHashBuffer":{"type":"Buffer","data":[164,101,124,250,103,96,222,93,166,24,18,34,203,193,65,153,156,90,0,179]},"announce":[],"urlList":[]}}