{"title":"Power Electronics Handbook by Muhammad H. Rashid","uid":10884992,"size":25700768,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a4d55b468b7ddb67c5ac8fdec301fda8439a3724&amp;dn=Power+Electronics+Handbook+by+Muhammad+H.+Rashid&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"thilanga123","files":4,"time":1409070264,"description":"Publisher: Academic Press\nNumber Of Pages: 1000\nPublication Date: 2001-08-24\nSales Rank: 613920\nISBN / ASIN: 0125816502\nEAN: 9780125816502\nBinding: Hardcover\nManufacturer: Academic Press\n\nPower electronics is a broad subject that deals with every aspect of electronic systems and devices. Any computer, machine, controller, game, etc., that is available today is dependent on the power electronics in those systems and devices to operate. Power electronics systems deal with the process of converting electrical power from one form to another. Power Electronics Handbook is specifically designed for the professional engineer in industry and includes contributions of over 60 authors primarily from industry.\n\nPower electronics is most frequently thought of because of its importance in supplying and converting an uninterruptable power supply to computers. The growth in computational power, communications applications, data storage, and memory systems has put the common layperson directly in contact with power engineering devices and challenges such as surge protectors and power failures. However, the field of power electronics is involved in all electronic devices and sytems. Examples include residential (refrigeration, heating, *****ng, audio/video), commercial (lighting, office equipment, elevators), industrial (pumps, compressors, fans, robots, lasers, welding), transportation (automotive electronics, electric trains, battery chargers), and telecommunications (battery chargers, power supplies).\n\nAll engineers involved with system and device design must deal with the fundamentals and advances of power electronics. This Handbook is the result of an intensive search to develop a new major reference for this large professional market. All aspects of AC and DC power conversion are addressed and there is an emphasis on the design process throughout as well as safety and reliability. This is the most comprehensive treatment of all aspects of power electronics ever presented in one volume at such a reasonable price.\n\n* Provides a comprehensive treatment of all aspects of power electronics including both traditional topics and new advancements\n\n* Gives special attention to the actual design process as well as inherent safety and reliability issues\n\n* Includes an in-depth study of the operation, analysis, and design of various power converters\n\n* Covers the characteristics of modern power semiconductor devices, which are used as switches to perform the power conversions from ac-dc, dc-dc, dc-ac, and ac-ac\n","torrent":{"xt":"urn:btih:a4d55b468b7ddb67c5ac8fdec301fda8439a3724","amp;dn":"Power+Electronics+Handbook+by+Muhammad+H.+Rashid","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4d55b468b7ddb67c5ac8fdec301fda8439a3724","infoHashBuffer":{"type":"Buffer","data":[164,213,91,70,139,125,219,103,197,172,143,222,195,1,253,168,67,154,55,36]},"announce":[],"urlList":[]}}