{"title":"Wynton Marsalis - He And She (2009) [mp3@200]","uid":4853027,"size":107757837,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a52846c516e21973ec2b26790b57a1b29472da1e&amp;dn=Wynton+Marsalis+-+He+And+She+%282009%29+%5Bmp3%40200%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"zibbik","files":24,"time":1239950834,"description":"Artist: Wynton Marsalis\nTitle Of Album: He And She\nYear Of Release: 2009\nGenre: Jazz\nQuality: Mp3\nBitrate: ~200 kbps VBR\nTotal Time: 74:56 min\n\nTracklist:\n--------------\n01. Wynton Marsalis - Poem 1 (0:12)\n02. Wynton Marsalis - School Boy (6:48)\n03. Wynton Marsalis - Poem 2 (0:27)\n04. Wynton Marsalis - The Sun And The Moon (6:31)\n05. Wynton Marsalis - Poem 3 (0:10)\n06. Wynton Marsalis - Sassy (5:17)\n07. Wynton Marsalis - Poem 4 (0:16)\n08. Wynton Marsalis - Fears (3:31)\n09. Wynton Marsalis - Poem 5 (0:16)\n10. Wynton Marsalis - The Razor Rim (12:05)\n11. Wynton Marsalis - Poem 6 (1:01)\n12. Wynton Marsalis - Zero (2:17)\n13. Wynton Marsalis - Poem 7 (0:36)\n14. Wynton Marsalis - First Crush (1:52)\n15. Wynton Marsalis - First Slow Dance (4:37)\n16. Wynton Marsalis - First Kiss (3:21)\n17. Wynton Marsalis - First Time (4:47)\n18. Wynton Marsalis - Poem 8 (1:06)\n19. Wynton Marsalis - Girls! (5:46)\n20. Wynton Marsalis - Poem 9 (0:59)\n21. Wynton Marsalis - A Train, A Banjo, And A Chicken Wing (8:12)\n22. Wynton Marsalis - He And She (5:00)\n\n\nWynton Marsalis, ever the protagonist and explorer, brings his love of the spoken word and the adolescent relations of the male and female persuasion during He and She, a collection of instrumental mainstream jazz pieces with poetry as preludes. Inspired by the tone of the Jon Hendricks epic Evolution of the Blues Song, Marsalis uses math equations, the sun and the moon, and the budding affection of youth to frame his music -- mostly jazz waltzes -- into thematic conclusions based on getting along, and why the genders think differently. New pianist Dan Nimmer is a welcome addition to the quintet, while drummer Ali Jackson really shines and reliable saxophonist Walter Blanding asserts his increasing powers. Where the concept of these recordings is somewhat static and the music predictable according to the previous precepts of the trumpeter/composer, there's a lot to listen to and enjoy, even a bit of stepping out from the hard bop to post-bop comfort zone Marsalis has been mired in for over two decades. &quot;School Boy&quot; reverts to the old-timey vintage stride-infused sound the trumpeter occasionally taps upon, &quot;Fears&quot; is actually a free-form-based piece driven by the bass of Carlos Henr?quez, &quot;Zero&quot; floats on the wings of birds, and &quot;A Train, a Banjo and a Chicken Wing&quot; is a typical bluesy, plodding, New Orleans late-night stalk taken in carefully calculated, not giant steps. Of the waltzes, &quot;The Sun and the Moon&quot; is evocative via Nimmer's tinkling piano with muted trumpet and tenor sax, &quot;Sassy&quot; features the stop-start techniques Marsalis has always favored with Blanding's tenor morphing into furious soprano sax, and &quot;Girls&quot; is pretty and innocent as you'd expect. There's a four-part suite dedicated to autobiographical schoolboy firsts, with &quot;First Crush&quot; a near bolero with distinct fluid dynamics, &quot;First Slow Dance&quot; a melting, innocent tune parsed by Nimmer, &quot;First Kiss&quot; a counterpoint tangent, and &quot;First Time&quot; a definitive tango anchoring scattered and dizzying complex flurries of expansive emotionalism. Each poem tells its own story of youthful speculation, self-doubt, and realization, as you hear Marsalis talking about playful connections, &quot;riding the rim bare,&quot; &quot;everything and nothing,&quot; the madness of a young girl's developing misunderstood mind, and the variation of one-plus-one equations equaling two, three (you and me and us equals three), and zilch. On this return to simpler times and the childish wide-eyed beauty of youth, Marsalis has struck a chord with those awkward, precious times in a way that adults can appreciate. (c) Michael G. Nastos, All Music Guide\n\n\n","torrent":{"xt":"urn:btih:a52846c516e21973ec2b26790b57a1b29472da1e","amp;dn":"Wynton+Marsalis+-+He+And+She+%282009%29+%5Bmp3%40200%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a52846c516e21973ec2b26790b57a1b29472da1e","infoHashBuffer":{"type":"Buffer","data":[165,40,70,197,22,226,25,115,236,43,38,121,11,87,161,178,148,114,218,30]},"announce":[],"urlList":[]}}