{"title":"Earthing: The Most Important Health Discovery Ever?","uid":8528642,"size":3738010,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a5722437bee2823ae098fd9bd192fad2dbe3bdee&amp;dn=Earthing%3A+The+Most+Important+Health+Discovery+Ever%3F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1370047383,"description":"Clinton Ober, Stephen T. Sinatra, Martin Zucker - Earthing: The Most Important Health Discovery Ever?\nPublished: 2010-04-09 | ISBN: 1591202833 | EPUB + MOBI \n\n\nThe solution for chronic inflammation, regarded as the cause of most common modern diseases, has been identified! And it is not blueberries. It is something right beneath our feet-the Earth itself!\nThroughout most of evolution humans walked barefoot and slept on the ground, largely oblivious that the surface of the Earth contains limitless healing energy. Science has discovered this energy as free-flowing electrons constantly replenished by solar radiation and lightning. Few people know it, but the ground provides a subtle electric signal that maintains health and governs the intricate mechanisms that make our bodies work-just like plugging a lamp into a power socket makes it light up. Modern lifestyle, including the widespread use of insulative rubber or plastic-soled shoes, has disconnected us from this energy and, of course, we no longer sleep on the ground as we did in times past.\nEarthing introduces the planet's powerful, amazing, and overlooked natural healing energy and how people anywhere can readily connect to it. This eye-opening book describes how the physical disconnect with the Earth creates abnormal physiology and contributes to inflammation, pain, fatigue, stress, and poor sleep. By reconnecting to the Earth, symptoms are rapidly relieved and even eliminated and recovery from surgery, injury, and athletic overexertion is accelerated.\nThis never-before-told story-filled with fascinating research and real-life testimonials- chronicles a discovery with the potential to create a global health revolution.","torrent":{"xt":"urn:btih:a5722437bee2823ae098fd9bd192fad2dbe3bdee","amp;dn":"Earthing%3A+The+Most+Important+Health+Discovery+Ever%3F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5722437bee2823ae098fd9bd192fad2dbe3bdee","infoHashBuffer":{"type":"Buffer","data":[165,114,36,55,190,226,130,58,224,152,253,155,209,146,250,210,219,227,189,238]},"announce":[],"urlList":[]}}