{"title":"The Accidental tourist (1988) PAL to DivX (moviesbyrizzo)","uid":6539746,"size":1800478099,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a59baef58265a916ea5857162a4748e3e01a7f29&amp;dn=The+Accidental+tourist+%281988%29+PAL+to+DivX+%28moviesbyrizzo%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":2,"uploader":"moviesbyrizzo","files":-1,"time":1310601987,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0094606/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0094606/&lt;/a&gt;\n\nThis is a convert from a new PAL DVD just arrived in the mail. We hvent been\nable to source and HD/HDTV version as yet, however we will keep trying for you.\n\n720 X 576 video res at 1800k bitrate, 256k audio\n\nSubtitles on the disc were converted to SRT as best we could\n- only English French, Italian and Romanian subtitles were on the DVD\nWe tried to find others on the net, however there were no Scandinavian\nlanguage subtitles posted for this movie and what other language subs there\nwere to be found appear to be for some other version than the PAL DVD\nversion. The English template included could be converted to instantly\nprovide possibly usable subtitles for any other language supported for \ninstance by the free &quot;google translate&quot; facility on the net etc.\n\nThe accidental tourist is about misfits in our world that do \nnot relate to others too well in what would be normally healthy\nand fulfilling human interaction. Movie is based on American cultural\nfactors too.\n\nIt is in fact, contrary to the impression imparted by the advertising\nsurrounding this movie to point this out, however, it is actually\nth character played by William Hurt that seems most like-able\nand sincere in this tale.\n\nFor those of Genne Davis's character in this movie, there is much\nto say of a need to improve in such approaches as how to get a man\nto put your child into an expensive school for as many years as you\ncan commit him to doing so, rather than just for what he might\notherwise be willing to do, based on his own inclination of the moment.\n\nUltimately, the problem of dysfunctional personality types in our midst\nis best spoken to in looking at the character portrayal by Amy Wright.\nSome come to be formed to see the world as a mainly malicious place where\neveryone apparently enjoys or in any event seems to want to &quot;ruin your chances\nfor happiness&quot; in order to make the world an even place for those that have lost out along the way. How sad. The Personalysis theory speaks to those of what is known as &quot;a gren child condition&quot; for whom the world becomes a place of self\nfulfilling prophecies based on this world view formed within.\n\n\nMichael Rizzo Chessman\nmoviesbyrizzo\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:a59baef58265a916ea5857162a4748e3e01a7f29","amp;dn":"The+Accidental+tourist+%281988%29+PAL+to+DivX+%28moviesbyrizzo%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a59baef58265a916ea5857162a4748e3e01a7f29","infoHashBuffer":{"type":"Buffer","data":[165,155,174,245,130,101,169,22,234,88,87,22,42,71,72,227,224,26,127,41]},"announce":[],"urlList":[]}}