{"title":"Alan Watts | Zen Tales","uid":9599395,"size":61632685,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a5b55eeb87e5a6dc9399b2ce732034e1db342d13&amp;dn=Alan+Watts+%7C+Zen+Tales&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"Livsform","files":-1,"time":1392076096,"description":"*********************************\nPLEASE SEED!! SPREAD THE WISDOM!!\n*********************************\n\n\nThis torrent contains:\n\n*Zen Tales\n\n---\n\nAbout Alan Watts (from AlanWatts.com)\n\nEarly Years\nAlan Watts was born in London in January of 1915 at the start of the first World War. At a young age he became fascinated with the arts of the Far East, and by the time he was ten or eleven he began to read thriller stories by Sax Rohmer about about mysterious Oriental villains. This interest led him in turn to the works of Lafcadio Hern, Christmas Humphreys, and DT Suzuki, and by fourteen was writing on Eastern themes, and was published in the Journal of the London Buddhist Lodge before producing his first booklet on Zen in 1932.  He moved to New York in 1938 and then to Chicago where he served as an Episcopal priest for six years before leaving the Church. In 1950 he moved to upstate New York, and in late 1950 visited with Joseph Campbell and, composer John Cage, and Luisa Commaraswamy at his Millbrook farmhouse. Then in 1951 at the invitation of Frederic Spiegelberg he moved to San Francisco to teach at the Academy of Asian Studies.\n\nWorldview\n\nAlan Watts was profoundly influenced by the East Indian philosophies of Vedanta and Buddhism, and by Taoist thought, which is reflected in Zen poetry and the arts of China and Japan.  After leaving the Church he never became a member of  another organized religion, although he wrote and spoke extensively about Zen Buddhism, Hinduism, and Taoisim. Some American Buddhists criticized him for not sitting regularly in zazen, even though he recorded several guided meditations teaching a variety of mediation techniques. Alan Watts responded simply by saying: Î“Ã‡Â£A cat sits until it is done sitting, and then gets up, stretches, and walks away.Î“Ã‡Â¥\n1950s and early 60s\nAfter teaching at the Academy of Asian Studies in San Francisco he became Dean, and began to give regular radio talks on KPFA, the Berkeley free radio station. In 1957 he published his bestselling Way of Zen, and in 1958 returned to Europe where he met with CG Jung. He was an early subject in pioneering psychedelic trials, and after recording two seasons of the public television series Î“Ã‡Â£Eastern Wisdom and Modern LifeÎ“Ã‡Â¥ traveled to Japan several times in the early sixties. By the late sixties he had become a counter culture celebrity, and traveled widely to speak at \nuniversities and growth centers across the US and Europe.\n\nLater Years\n\nBy the early seventies Alan Watts had become a foremost interpreter of Eastern thought for the West, and was widely published in periodicals including Earth, Elle, Playboy, and Redbook. He appeared on CBS televisionÎ“Ã‡Ã–s Camera Three in 1969, and in 1971 he recorded a pilot for a new  show titled Î“Ã‡Â£A Conversation with MyselfÎ“Ã‡Â¥ for NET, the precursor to PBS.  When the series was not produced he recorded the shows in 1972 with his son Mark and his long-time audio archivist Henry Jacobs.  Overall Alan Watts developed an extensive audio library of nearly 400 talks and wrote more than 25  books during his lifetime, including his final volume, Tao; the Watercourse Way.  Alan died in his sleep in November of 1973 after returning from an intensive international lecture tour. A film on his life and works is currently in production.","torrent":{"xt":"urn:btih:a5b55eeb87e5a6dc9399b2ce732034e1db342d13","amp;dn":"Alan+Watts+%7C+Zen+Tales","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5b55eeb87e5a6dc9399b2ce732034e1db342d13","infoHashBuffer":{"type":"Buffer","data":[165,181,94,235,135,229,166,220,147,153,178,206,115,32,52,225,219,52,45,19]},"announce":[],"urlList":[]}}