{"title":"Amin Maalouf - Disordered World - Setting a New Course for the T","uid":15932185,"size":441459,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a5babd0429414632622c467e0d553a331bab368b&amp;dn=Amin+Maalouf+-+Disordered+World+-+Setting+a+New+Course+for+the+T&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"roflcopter2110","files":1,"time":1475367042,"description":"https://cdn.pximg.xyz/538bbc3c4facf38e563895ed67bba141.png\r\n \nhttp://boltimg.com/images/ffEx5.jpg\r\n\r\nAmin Maalouf - Disordered World - Setting a New Course for the Twenty-first Century - epub [TKRG]\r\n\r\nBorn into a Christian minority in Lebanon and since settled in France, acclaimed writer Amin Maalouf claims a unique position in global conversation. His first book, The Crusades through Arab Eyes, was a critical and commercial success and remains in print after 20 years. In Disordered World, Maalouf combines his command of history with a critical perspective on contemporary culture East and West-joining them with a fierce moral clarity and a fluid, propulsive style.\r\n\r\nIn this &quot;disordered world&quot; of ours, Maalouf argues, the human race faces any number of urgent threats: climate change, global financial crisis, humanitarian disasters. Yet these threats have not united us. In fact, tensions are rising between the Arab world and the West. This is not, Maalouf maintains, a &quot;clash of civilizations.&quot; We lack ideological debate because there seems to be no common ground on which to start discussion. Rather, our civilizations are exhausted, declined into moral incompetence. The West has betrayed its enlightenment values, even as it pushes democracy abroad. The Arab world, nostalgic for its golden era, has rushed toward radicalism. Maalouf eruditely examines a century of confrontations between our cultures, from the secularization of Turkey under Ataturk, through Nasser and the Suez Crisis, the Six Day War, the Camp David Accords and the assassination of Sadat, and the U.S. wars on Afghanistan and Iraq.\r\n\r\nWe keep adapting, Maalouf argues, our ancestral prejudices for contemporary scenarios. But in a voice that is intelligent, impassioned, and remarkably hopeful, Maalouf imagines that in the face of common challenges, we might just invent a new conception of the world we all share","torrent":{"xt":"urn:btih:a5babd0429414632622c467e0d553a331bab368b","amp;dn":"Amin+Maalouf+-+Disordered+World+-+Setting+a+New+Course+for+the+T","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5babd0429414632622c467e0d553a331bab368b","infoHashBuffer":{"type":"Buffer","data":[165,186,189,4,41,65,70,50,98,44,70,126,13,85,58,51,27,171,54,139]},"announce":[],"urlList":[]}}