{"title":"Shwayze - Shwayze Summer (2013) (256 Kbps)","uid":8694649,"size":81477383,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a6193612470bea00182c8f42942e05c1e74c1a82&amp;dn=Shwayze+-+Shwayze+Summer+%282013%29+%28256+Kbps%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"Nickers69","files":-1,"time":1373944795,"description":"=========================================================================\nYOU MUST BUY THIS!!! ITS FUCKING AWESOME!!!\n=========================================================================\n\n\nArtist : Shwayze \nTitle : Shwayze Summer \nRelease date : 07/14/2013 \nGenre : Hip-Hop/Rap\nBitrate: 256 Kbps\n\n\nTrackList:\n\n01 Love Is Overrated\n02 Girlfriend (feat. Paul Couture)\n03 How I Want It\n04 Good Lookin' Woman\n05 My Chick\n06 Kick It (feat. Ferrari Snowday)\n07 West Coast Party\n08 Ms. Fortune (feat. Devin K.)\n09 Better Than Most Loves (feat. The Cataracs)\n10 All I Know (feat. Tayyib Ali) \n11 See the Light (feat. Marco)\n12 Ghosts (feat. Austin Paul)\n13 Gold (feat. Eighty4 Fly)\n\n\nPlease support the artist, Nickers69\t\n\n\nHistory:\n\nAlthough the Jamie Kennedy movie Malibu's Most Wanted posited that the beachside Los Angeles suburb is so upper class and lily white that the only rappers it can produce are rich teenagers fronting gangsta poses, real-life Malibu resident Shwayze begs to differ. He's in touch enough with movie culture that his handle is a corruption of the surname of the star of Dirty Dancing and Roadhouse, and his musical mentor is Cisco Adler, son of multi-millionaire record producer Lou Adler, most notorious for a hugely unflattering nude photo widely circulated on the Internet while Adler was dating TV star Mischa Barton, as well as a stint on a short-lived VH1 reality series, The Rock Life. Shwayze claims to have grown up in a comparatively tough trailer park in one of Malibu's less prosperous neighborhoods. Born Aaron Smith in 1986, legend has it Shwayze was working as an assistant to his handyman grandfather in 2005 when he began an impromptu on-stage freestyle with a friend, drummer Alex Orbison, prior to a local gig by Orbison's band Whitestarr. Adler, Whitestarr's singer/songwriter, was impressed enough with the young rapper that he started collaborating with him. Co-writing the songs with Adler producing, the duo came up with a mellow, largely acoustic sound akin to a hip-hop Jack Johnson, far removed from the glammy Southern rock revivalism of Adler's own band. Shwayze signed to Geffen Records in 2007 and his self-titled debut album was released the following year, preceded by the single &quot;Don't Be Shy&quot; and followed by a stint on the 2008 Vans Warped Tour. A year later they returned with the electro-influenced album Let It Beat along with the single &quot;Get U Home.&quot;","torrent":{"xt":"urn:btih:a6193612470bea00182c8f42942e05c1e74c1a82","amp;dn":"Shwayze+-+Shwayze+Summer+%282013%29+%28256+Kbps%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6193612470bea00182c8f42942e05c1e74c1a82","infoHashBuffer":{"type":"Buffer","data":[166,25,54,18,71,11,234,0,24,44,143,66,148,46,5,193,231,76,26,130]},"announce":[],"urlList":[]}}