{"title":"BBC Revolution and Romance 3of3 1080p HDTV x264-MVGroup","uid":15512895,"size":1937118670,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:a6249705c8c85f2e16c3c54ae39c122e4b080851&amp;dn=BBC+Revolution+and+Romance+3of3+1080p+HDTV+x264-MVGroup&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":2,"uploader":"MVGroup","files":1,"time":1470672712,"description":"Revolution and Romance: Musical Masters of the 19th Century 3of3 Party Like It's 1899\r\n\r\nSuzy Klein explores the transformation of music in the 19th century. In an age of political and industrial revolution, she tells how music became the leading art form.\r\n\r\nPart 3: Party Like It's 1899\r\nMusic was both transformed and transformative in the 19th century. It burst out of court, church and tavern into the world and became a universal soundscape, transcending language and borders. This revolution was made possible by economic and social change and, as Suzy Klein explains in the final programme, by a technological revolution.\r\n\r\nThe 19th century witnessed advances in communication that made the world a smaller place. People could travel by train and steamship with ease across the globe. At the close of the century hundreds of thousands came to the great Paris Exposition of 1889 - the centenary of the French Revolution - to witness the latest inventions and marvel at the strange cultures that came to make music in the temporary halls and theatres that crowded on the Champ de Mars.\r\n\r\nThey heard the music of the orient; they listened to recording devices; they saw the future. Composers such as Claude Debussy were profoundly influenced by the sounds of the east, in particular the Balinese gamelan. With its non-European harmony and rhythm, such music offered western composers exciting new musical horizons and a way to innovate and escape from the high romanticism of Richard Wagner.\r\n\r\nBut it was not only the music of the east that inspired the new composers. Developments in manufacturing were changing instruments and creating new ones - exemplified by the saxophone. Suzy witnesses a 'battle of the bands' in which the new and versatile instrument demonstrates its capabilities and - for the luddites - its threatening versatility. And in the spirit of the new age she makes her first recording on a vintage phonograph, one of the earliest recording machines. To our ears they may lack quality, but they were mind-blowing to those who first heard them - and they presaged a new future of recorded music that is still with us today.\r\n\r\nTechnical Spec\r\nVideo Codec: x264 CABAC   \r\nVideo Bitrate: CRF 21 (~4007Kbps)\r\nVideo Resolution: 1920x1080\r\nVideo Aspect Ratio: 16:9\r\nFrames Rate: 25 FPS\r\nAudio Codec: AAC-LC\r\nAudio Bitrate: Q=0.47 VBR 48KHz (~128Kbps)\r\nAudio Channels: 2\r\nRun-Time: 59 mins\r\nNumber Of Parts: 3\r\nPart Size: 1.71 GB (average)\r\nSource: HDTV\r\nSubtitles: Merged","torrent":{"xt":"urn:btih:a6249705c8c85f2e16c3c54ae39c122e4b080851","amp;dn":"BBC+Revolution+and+Romance+3of3+1080p+HDTV+x264-MVGroup","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6249705c8c85f2e16c3c54ae39c122e4b080851","infoHashBuffer":{"type":"Buffer","data":[166,36,151,5,200,200,95,46,22,195,197,74,227,156,18,46,75,8,8,81]},"announce":[],"urlList":[]}}