{"title":"DnD DM 3.5e Essentials---Dungeons and Dragons Dungeon Master 3.5","uid":6380269,"size":3285573951,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a71872bc032a13e832aa823bd079ab4daa5545fa&amp;dn=DnD+DM+3.5e+Essentials---Dungeons+and+Dragons+Dungeon+Master+3.5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":2,"uploader":"kyrillos27","files":1,"time":1305006546,"description":"DnD DM 3.5e Essentials---Dungeons and Dragons Dungeon Master 3.5 Essentials\n\nWelcome,\nDMs,\nGMs,\nPotentials of the above,\nPlayers,\nFriends,\nand others,\n\n\n\nI hope you enjoy this. This is a compilation of software that I have found that is vital to my DMing. All of these\nare previously torrented, but I've put them together specifically for all of you. \n\nAn overview:\n\nBooks:      These are from a huge torrent, all on the 3.0 and 3.5 system.\nCC3:        Campaign Cartographer 3. Do a google search on campaign cartographer 3 video tutorials. Very powerful\n            software.\nD&amp;D eTools: Produced by Wizards in conjunction  with Fluid Software, this is a great piece of software. It takes\n            care of all character creation, as well as random monster, character, ect. generation. It's very easy to \n\t    use, and I recommend at least taking a few moments to install the main program, labeled Full Program.\n\t    It's very nice stuff, encompassing all the feats, the AC, bonuses, skills, ect. Very neat stuff.\nFantasy Grounds II: This is the crowning achievement of the torrent, as it is very powerful stuff. It is tabletop\n \t    software, allowing you to construct your stories perfectly. Let me go over some of the features that \n            and paint you a picture of how I use it.\n\t\t\tEveryone brings a laptop. They already have a character stored in their local directory\n\t\t\t\t(We usually use eTools to make the character first then port the info over)\n\t\t\tWe start the story, I narrate stuff, all rolls are made on the chat window.\n\t\t\tAll the rolls are a click away, whether it be a skill check, attack, or damage.\n\t\t\tThere is a great combat tracker and mapping system.\n\t\t\tAny image can be a map. The grid can be laid with Fantasy grounds, characters are\n\t\t\t\tlocked to the grid.\n\t\t\tA fog of war can be used on the map.\n\n\nAll in all, a wonderful compilation of software.\n\nInstall notes:\n\nBooks: No install, just read.\nCC3:    Run the reg file. CC3 is best used on WIN XP computers. I couldn't get it to work properly on my Win 7 Ult 64\n\t\tbit. Reading around the interwebz, I found out about this being a known issue. I recommend getting\n\t\ta very cheap hard drive and using that as your Win XP drive. It's very easy to hook up a new hard\n\t\tdrive, consider it a learning experience. Download Win XP torrent on whatever.\n        Reg file merged to the reg? Excellent! \n        Make Folder ProFantasy in Program files\n        Move the file to C:\\Program Files\\ProFantasy\n        It's ready to go.\neTools: Install the Full Program. Install the others as desired. I also have Core Rules Bundled installed.\n        Thats it, there is no more cracking.\nFGII:   This one will be a bit odd.\n\tGo to the RegKey folder.\n\tR-Click on the appropriate FGII.reg and edit it.\n\tChange the License Key to whatever you want it to be, adhering to the format provided. (i.e. replace all the \n\t\tx's but keep the dashes every fifth letter)\n\nNote: In FGII, please don't use the d20 ruleset, use the d20-jpg ruleset. You may not know what I mean right now,\n\tbut you will when it is installed. If it isn't installed correctly, player portraits won't show up\n\tcorrectly when you create a local character. \n\n\n\nBrought to you by Skeleton Key Studios. \nSAMPNMDJB1","torrent":{"xt":"urn:btih:a71872bc032a13e832aa823bd079ab4daa5545fa","amp;dn":"DnD+DM+3.5e+Essentials---Dungeons+and+Dragons+Dungeon+Master+3.5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a71872bc032a13e832aa823bd079ab4daa5545fa","infoHashBuffer":{"type":"Buffer","data":[167,24,114,188,3,42,19,232,50,170,130,59,208,121,171,77,170,85,69,250]},"announce":[],"urlList":[]}}