{"title":"Le.Avventure.Di.Pinocchio.1972.XviD.ITA.Mp3-[WiNetwork-bt]","uid":5337429,"size":1274397696,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a7797adf398f52fa4068722b3815b761d56ec6d8&amp;dn=Le.Avventure.Di.Pinocchio.1972.XviD.ITA.Mp3-%5BWiNetwork-bt%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"gf-2008","files":-1,"time":1265364621,"description":".: Trama :.\n\nCome nel celebre romanzo, vi si narrano le disavventure del famoso burattino, anche se, a differenza della versione letteraria, nello sceneggiato Pinocchio ÃƒÂ¨ impersonato da un bambino vero, che solo in alcuni punti si ritrasforma in un burattino.\n\nCon un ciocco di legno parlante regalatogli da Mastro Ciliegia (Ugo D'Alessio), il falegname Geppetto (Nino Manfredi), si costruisce un burattino animato, che chiama Pinocchio. Durante la notte, nei panni di una fata, la moglie del falegname (Gina Lollobrigida), rimasto vedovo e solo, propone al burattino un patto preciso: quello di farlo diventare un bambino (Andrea Balestri).\n\nMa, travolto dalla sua smania di vivere liberamente la sua avventura umana, Pinocchio dimentica spesso la sua gratitudine per Geppetto: al termine della sua prima giornata, si trova giÃƒÂ  tramutato di nuovo in un burattino di legno e con i piedi bruciati; poi, avendo marinato la scuola per il Teatro dei Burattini, finisce tra le mani del terribile Mangiafoco (Lionel Stander). Quest'ultimo, dopo il pietoso intervento della Fata, gli regala cinque zecchini d'oro da portare a Geppetto, ma, avendo ceduto alle lusinghe di Gatto e Volpe (Franco Franchi e Ciccio Ingrassia), Pinocchio rischierebbe di perdere il denaro e la vita, se, all'ultimo momento, non intervenisse, ancora una volta, la Fata.\n\n\n\n.: Crediti :.\n\nNazionalitÃƒÂ : Italia\nAnno: 1972\nGenere: Fantasy\nRegia: Luigi Comencini\nProduzione: RAI, ORTF, Bavaria Film, Cinepat, San Paulo\nDistribuzione: 20th Century Fox\nData di uscita: 8 aprile 1972\nCast: Andrea Balestri; Nino Manfredi; Gina Lollobrigida; Franco Franchi; Ciccio Ingrassia; Vittorio De Sica; Lionel Stander; Ugo D'Alessio; Domenico Santoro; Bruno Bassi; Maria La Nocca; Mario Ercolani; Carmine Torre; Piero Gentili; Mimmo Olivierie; Paola Natale; Gioviano Bachini; Orazio Orlando; Mario Narcisi; Vera Druidi; Orlando D'Ubaldo; Antonio Danesi; Mario Scaccia; Jacques Herlin; Natale Siddi; Simone Santo; Enzo Cannavale; Zoe Incrocci; Furio Meniconi; Giuseppe Caffarelli; Caliano Sbarra; Pino Ferrara; Fredo Pistoni; Clara Colosimo; Carlo Bagno; Nerina Montagnani; Luciano De Ritis; Siria Betti; Nazzareno Caldarellie; Ferdinando Murolo; Luigi Leoni; Pietro Fuselli; Riccardo Billi; Mario Adorf; Mario Colombaionio; Willy Semmelrogge\n\n\n\n\n\n\n\n\n\nvisita WiNetwork-bt\n &lt;a href=&quot;\nhttp://www.google.com/search?hl=it&amp;q=winetwork-bt&amp;btnG=Cerca&amp;lr=&amp;aq=f&amp;oq=&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.google.com/search?hl=it&amp;q=winetwork-bt&amp;btnG=Cerca&amp;lr=&amp;aq=f&amp;oq=&lt;/a&gt;\n","torrent":{"xt":"urn:btih:a7797adf398f52fa4068722b3815b761d56ec6d8","amp;dn":"Le.Avventure.Di.Pinocchio.1972.XviD.ITA.Mp3-%5BWiNetwork-bt%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7797adf398f52fa4068722b3815b761d56ec6d8","infoHashBuffer":{"type":"Buffer","data":[167,121,122,223,57,143,82,250,64,104,114,43,56,21,183,97,213,110,198,216]},"announce":[],"urlList":[]}}