{"title":"Batman Arkham Origins-RELOADED","uid":9092993,"size":19788455936,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a7d14468593f9f288815cc059563d211565ef153&amp;dn=Batman+Arkham+Origins-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":7,"uploader":"extremezone","files":-1,"time":1382639397,"description":" &lt;a href=&quot;http://img593.imageshack.us/img593/9915/18d8.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://img593.imageshack.us/img593/9915/18d8.jpg&lt;/a&gt;\n\nScreens:\n &lt;a href=&quot;\nhttp://img543.imageshack.us/img543/9339/7s99.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img543.imageshack.us/img543/9339/7s99.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img823.imageshack.us/img823/9726/5pqs.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img823.imageshack.us/img823/9726/5pqs.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img132.imageshack.us/img132/8937/1ipg.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img132.imageshack.us/img132/8937/1ipg.jpg&lt;/a&gt;\n\nBatman Arkham Origins-RELOADED\nBatman: Arkham Origins (c) WB Games\n10/2013 :..... RELEASE.DATE .. PROTECTION .......: Steam\n1 :.......... DISC(S) .. GAME.TYPE ........: Action\n\nBatman: Arkham Origins is the next installment in the blockbuster Batman:\nArkham videogame franchise. Developed by WB Games Montr al, the game\nfeatures an expanded Gotham City and introduces an original prequel\nstoryline set several years before the events of Batman: Arkham Asylum and\nBatman: Arkham City, the first two critically acclaimed games of the\nfranchise. Taking place before the rise of Gotham City s most dangerous\ncriminals, the game showcases a young and unrefined Batman as he faces a\ndefining moment in his early career as a crime fighter that sets his path\nto becoming the Dark Knight.\n\nFeatures:\n\n- The Arkham Story Begins: Batman: Arkham Origins features a pivotal tale\nset on Christmas Eve where Batman is hunted by eight of the deadliest\nassassins from the DC Comics Universe. Players become an early-career\nBatman as he encounters for the first time many of the characters that\nshape his future.\n\n- Enhanced Detective Mode: Think like Batman with an all-new Case File\nsystem that allows players to analyze seemingly impossible-to-solve crime\nreconstructions in real time. Combining Batman's cowl sensors with the\nBatcomputer, players can digitally recreate crimes and study detailed\nsimulation of the act as it happened.\n\n- Gotham City will learn to fear Batman: Take back the sprawling streets of\nGotham years before its transformation into Arkham City. Glide above or\nbattle your way through new and ever more dangerous districts in the quest\nfor justice. Prevent crimes in progress, take down gangs of violent new\ncriminals and explore deadly new locations, from the impoverished streets\nto the penthouses of Gotham's wealthy.\n\n- Gotham's Most Wanted: The city streets are filled with more than just\nBlack Mask's assassins. Locate and take down Gotham's most violent and\ndangerous criminals to earn unique upgrades.\n\n- Lethal New Enemies: Fight new foes such as the Armored Enforcer, the\nMartial Artist and more   each of which challenge players to approach\nBatman's FreeFlow Combat scenarios in different ways. Classic FreeFlow\ncombat is expanded with every new opponent   and with Batman's abilities\nto engage them.\n\n- New Gadgets: Utilize Batman's signature gadgets or take advantage of\npowerful new additions such as the Remote Claw, the Concussion Detonator\nand more. Use the Remote Claw to create new routes by deploying strategic\ntightropes or directly attack enemies by stringing them up from vantage\npoints. Ready the Concussion Detonator to stun and disorient groups of\nopponents in close combat.\n\n- New and Familiar Characters: Experience a fresh take on iconic Batman\ncharacters including Black Mask, Penguin, Deathstroke, Bane, Deadshot,\nAnarky, Captain Gordon, The Joker, Copperhead, Firefly and others yet to\nbe revealed.\n\n- New Online Mode: Play online with friends and foes in 3v3v2 gameplay\nthat blends traditional Arkham gameplay with third-person shooter\nmechanics. Hunt as Batman or Robin against the most challenging opponents\nyet   friends and other gamers online   or take a walk on the dark side as\na Super-Villain Elite and be part of The Joker or Bane's gang. Gamers\nplaying as a Super-Villain Elite will also have a chance to seize control\nof either The Joker or Bane for a limited amount of time.\n\n2. Burn or mount the image.\n3. Install the game.\n4. Copy over the cracked content from the /Crack directory on the image to\nyour game &lt;install&gt; directory\n5. Play the game.\n6. Support the software developers. If you like this game, BUY IT!\n\nNote: We need anything you can offer as early releases,seedboxes,links,accounts,etc\nplease contact us on piratepedia[@]gmail.com or our website torentz 3xforum ro\nSeed Stats: 20-400 GiB at aprox 10 MiB/sec/20 slots per torrent\n\nBatman Arkham Origins-RELOADED Torrent Free Download\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/extremezone/0/7/0&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/extremezone/0/7/0&lt;/a&gt;\n\nHow To Get Your MAXSPEED (uTorrent)\n\nTorrent Client - Preferences - Bandwidth - Number of connections - Set aprox. 500 for each \nTorrent Client - Preferences - BiTorrent - Protocol Encryption - Forced\nBandwidth Allocation - High (Set download/upload limit - Unlimited)\nStop Other Active Torrents - Start downloading and wait for connections.\nEnjoy and Seed for at least 1:1 ratio. Don't forget to say thanks/leave reviews.\nFor more info,crack only,PATCH,serial,keygen,trainers,CRACKFIX,UPDATES,\nsystem requirements,cheats,NFO,gameplay trailers,free downloads,\npc iso,demos,screenshots,visit some RELEASE SITES or official web pages. \nIF the game does not work for you then update drivers, directX, components\nas netframework/redist files/etc, run as administrator, change compatibility\nmode, block/disable access to internet, copy crack/overwrite, other tweaks,etc\nSearch on scene release websites for any future updates/working status/etc and \nother quality filesharing sites or just use this - other torrent search functions\nStop using stupid av's as AVG reporting false positive viruses-disable or use ESET","torrent":{"xt":"urn:btih:a7d14468593f9f288815cc059563d211565ef153","amp;dn":"Batman+Arkham+Origins-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7d14468593f9f288815cc059563d211565ef153","infoHashBuffer":{"type":"Buffer","data":[167,209,68,104,89,63,159,40,136,21,204,5,149,99,210,17,86,94,241,83]},"announce":[],"urlList":[]}}