{"title":"City of Fallen Angels: The Mortal Instruments, Book 4","uid":8868720,"size":728989749,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a88d6855d11e991345f2175737c403b8c028e204&amp;dn=City+of+Fallen+Angels%3A+The+Mortal+Instruments%2C+Book+4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"Audio023","files":-1,"time":1377995615,"description":"Unabridged\n128 kbps\nChapterized\n\nThe Mortal War is over, and sixteen-year-old Clary Fray is back home in New York, excited about all the possibilities before her. She's training to become a Shadowhunter and to use her unique power. Her mother is getting married to the love of her life. Downworlders and Shadowhunters are at peace at last. And - most importantly of all - she can finally call Jace her boyfriend.\n\nBut nothing comes without a price.\n\nSomeone is murdering Shadowhunters who used to be in Valentine's Circle, provoking tensions between Downworlders and Shadowhunters that could lead to a second bloody war. Clary's best friend, Simon, can't help her. His mother just found out that he's a vampire and now he's homeless. Everywhere he turns, someone wants him on their side - along with the power of the curse that's wrecking his life. And they're willing to do anything to get what they want. At the same time he's dating two beautiful, dangerous girls - neither of whom knows about the other one.\n\nWhen Jace begins to pull away from Clary without explaining why, she is forced to delve into the heart of a mystery whose solution reveals her worst nightmare: She herself has set in motion a terrible chain of events that could lead to her losing everything she loves. Even Jace.\n\nLove. Blood. Betrayal. Revenge. The stakes are higher than ever in City of Fallen Angels.","torrent":{"xt":"urn:btih:a88d6855d11e991345f2175737c403b8c028e204","amp;dn":"City+of+Fallen+Angels%3A+The+Mortal+Instruments%2C+Book+4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a88d6855d11e991345f2175737c403b8c028e204","infoHashBuffer":{"type":"Buffer","data":[168,141,104,85,209,30,153,19,69,242,23,87,55,196,3,184,192,40,226,4]},"announce":[],"urlList":[]}}