{"title":"Microsoft Toolkit 2.5.2","uid":10587873,"size":51553280,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a920f9ae74a65a24057a2395f261dab965459a77&amp;dn=Microsoft+Toolkit+2.5.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"flau_bert","files":-1,"time":1405770740,"description":"================\n[INFO:]\n================\nMicrosoft Toolkit 2.5.2 | 49.1 MB\n\nMicrosoft Toolkit - Official KMS Solution for Microsoft Products. This is a set of tools and functions for managing licensing, deploying, and activating Microsoft Office and Windows.\n\nAll output from these functions is displayed in the Information Console. All functions are run in the background\nand the GUI is disabled to prevent running multiple functions, as they could conflict or cause damage if run concurrently.\nSettings:\nMicrosoft Toolkit Settings\nKMS Options Tab:\nKMS Server/Port To Use: Allows you to set what KMS server and port should be used when attempting KMS activation. Unless you have a real KMS server or a network host running a KMS Emulator or Server you will want this set to 127.0.0.2. Whatever the numerical box says will be the used port. KMSEmulator will use this port but it must be open on your PC, or the process using it may be terminated.\nNOTE: The Office KMS Server/Port is used when activating Office based products and Windows KMS Server/Port when activating Windows based products.\n\nKMS PID To Use: Allows you to set what KMS Extended PID should be used by KMSEmulator when attempting KMS activation.\nChanging the PID can help fix persistent KMS activation failure or KMS failing Genuine Validation, but in most cases you want to leave this alone.\nYou can pass a valid KMS PID, the string DefaultKMSPID to use a hardcoded default, or RandomKMSPID to generate a random string matching the KMS PID format.\nNOTE: The Office PID is used when activating Office based products and Windows PID when activating Windows based products.\nNOTE: You cannot change the KMS PID used for KMS Activation for KMS Servers. If a KMS Server fails Genuine Validation, this Setting will not help.\n\nActivate Using KMS Emulator: Uses KMS Emulator to perform KMS activation. Unless you have a real KMS server or a network host running a KMS Emulator or Server you will want this enabled.\n\nDelete KMS Host/Port After Run: Removes the KMS server name and port from the registry after KMS activation.\n\nForce Open KMS Port By Terminating Processes: Kill any processes using the KMS Port so you can run KMS Emulator on that port.\nNOTE: This is only performed if KMS Activation fails, allowing KMS Emulator to silently fail and a KMS Server Virtual Machine to be used.\n\nKMS Server Service Tab:\nKMS Port To Use: Allows you to set what KMS Port the KMS Server Service will listen on. Any clients using this service must use this KMS Port.\nKMS PID To Use: Allows you to set what KMS Extended PID should be used by this service when sending KMS activation responses to KMS Client applications.\nYou can pass a valid KMS PID, the string DefaultKMSPID to use a hardcoded default, or RandomKMSPID to generate a random string matching the KMS PID format.\nForce Open KMS Port By Terminating Processes: Kill any processes using the KMS Port so you can run KMS Server Service on that port.\n\nLicense Display Tab:\nShow CMID: Shows your KMS Client Machine ID. You won't have one if you aren't using KMS and haven't requested activation.\nShow Unlicenses: Shows ALL possible product keys you can install, not just the ones you have installed. Showing this helps in troubleshooting.\n\nPaths Tab:\nAutoKMS: Choose where AutoKMS will be installed.\nAutoRearm: Choose where AutoRearm will be installed.\nKMS Server Service: Choose where KMS Server Service will be installed.\nLicense Backups: Choose where License Backups will be saved.\n\nThe Microsoft Office Setup Customization Functions (Customize Setup Tab), AutoKMS Uninstaller (if AutoKMS is installed),\nAutoRearm Uninstaller (if AutoRearm is installed), Office Uninstaller and Product Key Checker work even if Microsoft Office\nor Windows is not installed/supported. For information about individual functions, see the program readme.\n\nRequirements:\nMicrosoft .NET Framework 4.0 or 4.5 (Not 3.5)\nMicrosoft Office 2010 or Later for Office Toolkit Support\nWindows Vista or Later for Windows Toolkit Support\n\nMicrosoft Toolkit Changelog:\n2.5.2\n-Added Label to show Microsoft Office Setup Version and Architecture on Customize Setup tab.\n-Added more checks to Add Languages and do better filtering of Language Packs.\n-AutoKMS no longer attempts activation/displays error when there are no KMS keys installed.\n-AutoKMS skips running if a BSOD occurred within 30 minutes of the last Scheduled Task run.\n-Fixed Customize Setup failing if file extensions were not lowercase.\n-Scheduled Tasks now retain their last run date.\n-Updated TAP Driver.\n\nNOTE: Keygens, patches, Activators, Cracks, Loaders etc. are always scanned with Kaspersky Internet Security 2014 Latest Version to Avoid Virus\n  issues.\n\n","torrent":{"xt":"urn:btih:a920f9ae74a65a24057a2395f261dab965459a77","amp;dn":"Microsoft+Toolkit+2.5.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a920f9ae74a65a24057a2395f261dab965459a77","infoHashBuffer":{"type":"Buffer","data":[169,32,249,174,116,166,90,36,5,122,35,149,242,97,218,185,101,69,154,119]},"announce":[],"urlList":[]}}