{"title":"AC/DC - Dirty Deeds Done Dirt Cheap [320k MP3]","uid":10337357,"size":151495015,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a994304e7c4a69331ed88bb1551a87070d455cf8&amp;dn=AC%2FDC+-+Dirty+Deeds+Done+Dirt+Cheap+%5B320k+MP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":2,"uploader":"smbdownload","files":-1,"time":1402493683,"description":"Dirty Deeds Done Dirt Cheap is the third studio album by Australian hard rock band AC/DC, released in 1976. All songs were written by Angus Young, Malcolm Young and Bon Scott.\n\nIt was originally released in Australia on Albert Productions on 20 September 1976. A modified international edition was later released on Atlantic Records on 17 December 1976. It was finally released in the US on 27 March 1981.\n\nOverview\n\nFollowing up on the preceding Australian album, 1975's T.N.T., AC/DC delivered another recording with a number of fan-favourite songs, including the title track, &quot;Squealer&quot;, &quot;Problem Child&quot; and others. Dirty Deeds Done Dirt Cheap also contains some controversial lyrics. For example &quot;Big Balls&quot; lyrics uses double entendres, referring the title phrase to costume parties and to testicles.\n\nThe single &quot;Jailbreak&quot; preceded the album's release in Australia and the UK. After the album's release, the single for &quot;Dirty Deeds Done Dirt Cheap&quot; was released in Australia in September 1976, in the UK in December 1976, and in the US in April 1981 (when the album was finally released there).\n\nDirty Deeds Done Dirt Cheap also led to more AC/DC appearances on Australia's Countdown music programme, following those in support of High Voltage and T.N.T. These appearances included a live performance of the album's title track, as well as a music video for &quot;Jailbreak&quot;. \n\nA song titled &quot;I'm a Rebel&quot; was recorded during this album's sessions in 1976, with music and lyrics written by Angus and Malcolm Young's older brother, Alex Young. This song was never released by AC/DC and remains in Albert Productions' vaults. German band Accept later released it as a single and named their second album after the song.\n\nAC/DC's record label at the time, Albert Productions, was not happy with the album's vocals and production. According to bassist Mark Evans, the band's manager Michael Browning told him he assumed Bon Scott would be fired as a result.\n\nThe international edition of Dirty Deeds Done Dirt Cheap, released on 17 December 1976, is considerably different from the original Australian edition, and features a different cover and track order. It was not released in the US until 27 March 1981.\n\nOn this album, the singles &quot;R.I.P. (Rock in Peace)&quot; and &quot;Jailbreak&quot; (featured on the Australian version) were replaced by &quot;Rocker&quot; (from T.N.T.) and &quot;Love at First Feel&quot;, the latter being one of only two tracks from international AC/DC albums not available on the band's Australian albums. (The other is &quot;Cold Hearted Man&quot;, released on European pressings of Powerage.) Conversely, several songs available on Australian AC/DC albums did not see overseas release until more than thirty years later. However, &quot;Love at First Feel&quot; was released in Australia as a single in January 1977.\n\nThough the international album was released by Atlantic Records in Europe in 1976, it was not picked up for a US release at the time. Following the American success of Highway to Hell in late 1979, copies of the album began to appear as imports in the US. Some of these imports were the original Australian edition on Albert Productions. However, Atlantic also pressed the international version in Australia, and many of these copies were also exported to the US. Strong demand for both import versions in the wake of the even greater success of Back in Black eventually led the US division of Atlantic to finally authorize an official US release in April 1981, which went straight to #3 on the Billboard album charts.\n\nTwo songs on the international album were edited from the full length versions on the original Australian album. The full length &quot;Dirty Deeds...&quot; has the title of the song chanted four times starting at 3:09, but on the edited version the chant is heard only twice. &quot;Ain't No Fun...&quot; lasted 7:29 on the Australian album but was faded out early to 6:57 on the international version. This means they trim off the Chuck Berry licks and title chanting to the end. However, both these full length versions were restored on the 1994 Atco Records remastered CD of the international album. The most recent 2003 CD edition by Epic Records goes back to the edited versions, as originally on the 1976 and 1981 international vinyl editions. The uncut versions of both songs were released on the 2009 box set Backtracks.\n\nOn the original version of &quot;Rocker&quot;, included on the Australian T.N.T. album, the song lasts 2:55 and cuts out abruptly as the guitar riff hits its peak. Conversely, all international editions of the &quot;Dirty Deeds&quot; album have a slightly shorter version where the song fades out at 2:50 before the cut. &quot;Squealer&quot; appears to be longer by thirteen seconds on the international version; this is due to it having a bumper of silence at the end, as it is the final track on the record. &quot;Ride On&quot; has a four second difference (longer on the international version) which appears to be from a minor speed issue, although the last guitar slide can be heard better on the shorter Australian version. \n\nThe Australian version of the album was briefly released in the UK, but only on the original vinyl pressings in that country.\n\n&quot;Jailbreak&quot; was included on AC/DC's '74 Jailbreak EP, released in October 1984 in the United States, Canada, and Japan.\n\n&quot;R.I.P. (Rock in Peace)&quot; finally saw international release as part of Backtracks.\n\nTrack Listing [320k MP3]\n\n1. \t&quot;Dirty Deeds Done Dirt Cheap&quot;   \t3:52\n2. \t&quot;Love at First Feel&quot;   \t3:12\n3. \t&quot;Big Balls&quot;   \t2:38\n4. \t&quot;Rocker&quot;   \t2:50\n5. \t&quot;Problem Child&quot;   \t5:46\n6. \t&quot;There's Gonna Be Some Rockin'&quot;   \t3:18\n7. \t&quot;Ain't No Fun (Waiting 'Round to Be a Millionaire)&quot;   \t6:54\n8. \t&quot;Ride On&quot;   \t5:53\n9. \t&quot;Squealer&quot;   \t5:10\n\nOdds And Sods\n\n1. \t&quot;Jailbreak&quot;   \t4:40\n2. \t&quot;Rocker [Australian Version]&quot;   \t2:55\n3. \t&quot;Dirty Deeds Done Dirt Cheap [Australian Version]&quot;   \t4:13\n4. \t&quot;Ain't No Fun [Waiting...] [Australian Version]&quot;   \t7:31\n5. \t&quot;R.I.P. [Rock In Peace]&quot;   \t3:35     ","torrent":{"xt":"urn:btih:a994304e7c4a69331ed88bb1551a87070d455cf8","amp;dn":"AC%2FDC+-+Dirty+Deeds+Done+Dirt+Cheap+%5B320k+MP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a994304e7c4a69331ed88bb1551a87070d455cf8","infoHashBuffer":{"type":"Buffer","data":[169,148,48,78,124,74,105,51,30,216,139,177,85,26,135,7,13,69,92,248]},"announce":[],"urlList":[]}}