{"title":"Charlie Parker Complete Jazz At Massey Hall(jazz)(mp3@320)[roger","uid":6911359,"size":175711268,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a9d804a62615c61acac8fae8bcf29239719ed04e&amp;dn=Charlie+Parker+Complete+Jazz+At+Massey+Hall%28jazz%29%28mp3%40320%29%5Broger&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"rogercc1","files":14,"time":1324831695,"description":"CHARLIE PARKER  COMPLETE JAZZ AT  MASSEY HALL\nLabel Jazz Factory \nReleased: 2004\nFormat: Mp3@320 CBR\n\n\nOne of the most memorable live recordings in jazz history, featuring Dizzy Gillespie, Bud Powell, Charles Mingus and Max Roach. This phenomenal edition includes all of the original tracks recorded by The Quintet at Toronto's Massey Hall, without the Mingus, overdubbed bass added later.\n\n\nJazz at Massey Hall is a live performance by &quot;The Quintet&quot; given on 15 May 1953 at Massey Hall in Toronto. The quintet was composed of several leading 'modern' players of the day: Dizzy Gillespie, Charlie Parker, Bud Powell, Charles Mingus, and Max Roach. It was the only time that the five men recorded together as a unit, and it was the last recorded meeting of Parker and Gillespie. \nParker played a Grafton saxophone on this date; he could not be listed on the original album cover for contractual reasons, so was billed as &quot;Charlie Chan&quot; (an allusion to the fictional detective and to Parker's wife Chan). The record was originally issued on Mingus's label Debut, from a recording made by the Toronto New Jazz Society (Dick Wattam, Alan Scharf, Roger Feather, Boyd Raeburn and Arthur Granatstein). Mingus took the recording to New York where he and Max Roach dubbed in the bass lines, which were under-recorded on most of the tunes, and exchanged Mingus soloing on &quot;All the Things You Are.&quot;\nThe original plan was for the Jazz Society and the musicians to share the profits from the recording. However, owing to a boxing prize fight between Rocky Marciano and Jersey Joe Walcott taking place simultaneouly, the audience was so small that the Society was unable to pay the musicians' fees. The musicians were all given NSF checks, and only Parker was able to actually cash his; Gillespie complained that he did not receive his fee &quot;for years and years&quot;.\n\nTracklist: \n01. Perdido (8:16) \n02. Salt Peanuts (7:38) \n03. All The Things You Are (7:14) \n04. 52nd Street Theme (0:43) \n05. Drum Conversation (4:38) \n06. Cherokee (4:56) \n07. Embraceable You (4:25) \n08. Hallelujah (Jubilee) (4:01) \n09. Sure Thing (2:13) \n10. Lullaby Of Birdland (2:34) \n11. I've Got You Under My Skin (3:02) \n12. Wee (Allen's Alley) (6:47) \n13. Hot House (9:10) \n14. A Night In Tunisia (7:34)\n\n\nPersonnel: Charlie Parker (vocals, alto saxophone); Dizzy Gillespie (vocals, trumpet); Bud Powell (piano); Max Roach (drums).\n","torrent":{"xt":"urn:btih:a9d804a62615c61acac8fae8bcf29239719ed04e","amp;dn":"Charlie+Parker+Complete+Jazz+At+Massey+Hall%28jazz%29%28mp3%40320%29%5Broger","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9d804a62615c61acac8fae8bcf29239719ed04e","infoHashBuffer":{"type":"Buffer","data":[169,216,4,166,38,21,198,26,202,200,250,232,188,242,146,57,113,158,208,78]},"announce":[],"urlList":[]}}