{"title":"Book Collection of Nicholas Sparks [MU]","uid":8196124,"size":23016630,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a9ffb5c0ad12907d1f2d4761116f423b6134b879&amp;dn=Book+Collection+of+Nicholas+Sparks+%5BMU%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"Max-Upload","files":51,"time":1361916777,"description":"Contains Book Collection of Nicholas Sparks in PDF, EPUB and MOBI format. \n\nFor ebook devices use an ebook converter like: \nHamster Ebook Converter- http://www.hamstersoft.com/free-ebook-converter \nCalibre- http://calibre-ebook.com/download \n\n1996 - 'The Notebook'\nThe Notebook is about a man who reads to an old woman he visits from a faded notebook that tells the story of a couple who are separated by World War II, then passionately reunited years later.\n\n1998 - 'Message in a Bottle'\nMessage in a Bottle is about a woman who finds a love letter in a bottle and becomes determined to track down the author.\n\n1999 - 'A Walk to Remember'\nA Walk to Remember is the story of a popular guy who is forced to tutor a plain girl from a poor school.\n\n2000 - 'The Rescue'\nA mom with a speech delayed son moves to a new town, and shortly after gets into an accident. The Rescue follows her relationship with the volunteer fireman who helped her.\n\n2001 - 'A Bend in the Road'\nA Bend in the Road is a love story between a police officer and a school teacher.\n\n2002 - 'Nights is Rodanthe'\nNights in Rodanthe is about a woman who is tending a friend's inn for the weekend in order to escape problems in her life, and meets a man going through his own crisis of conscience, who is the only guest at the inn\n\n2003 - 'The Guardian'\nThe Guardian starts with Julie Barenson receiving a Great Dane pup that her husband arranged to arrive on Christmas Eve before he died of a brain tumor. New men enter Julie's life, and the dog helps her determine who is worthy of her affection\n\n2004 - 'The Wedding'\nThe Wedding is the sequel to The Notebook. The Wedding focuses on Allie and Noah Calhoun's oldest daughter, Jane, and her husband, Wilson as they approach their 30th wedding anniversary. Jane and Wilson's daughter asks if she can have her wedding on their anniversary, and Wilson works hard to please his daughter and make up for years of neglect to his wife.\n\n2004 - 'Three Weeks with My Brother' - co-author: Micah Sparks\nThis memoir, Sparks' first nonfiction book, chronicles a three week trip around the world that he took with his brother, Micah. The brothers, then 37 and 38 years old, are the only surviving members of their family. Three Weeks with My Brother works through the untimely deaths of their parents and siblings and tells the story of their family.\n\n2005 - 'True Believer'\nTrue Believer is the story of a scientist who comes to a small town to disprove claims that ghosts are appearing and ends up falling in love with the granddaughter of the town psychic.\n\n2005 - 'At First Sight'\nAt First Sight is the sequel to True Believer.\n\n2006 - 'Dear John'\nDear John is a love story about an army sergeant who falls in love shortly before 9/11.\n\n2007 - 'The Choice'\nThe Choice is about a bachelor who has no desire to meet a woman, but ends up falling for one who has a boyfriend already.\n\n2008 - 'The Lucky One'\nLucky One is the story of a man who finds a photograph of a smiling woman. When he thinks the photo is bringing him luck, he tries to find the woman in the picture.\n\n2009 - 'The Last Song'\nWhen Veronica Miller's parents divorce and her dad moves from New York City to Wilmington, NC, she becomes angry and estranged from both of them. Two years after the divorce, Veronica's mother decides that she wants her to spend the whole summer with her father in Wilmington. This summer is the backdrop for another Nicholas Sparks tear-jerking, heart-rending family drama -- The Last Song.\n\n2010 - 'Safe Haven'\nSafe Haven is about a woman who moves to a small North Carolina town to escape her past. She must decide whether she can take the risk of new relationship or whether she must keep herself safe.\n\n2011 - 'The Best of Me'\nThe Best of Me is about two high school sweethearts who are reunited when they return home for a mentor's funeral.\n\nSeed and Enjoy!","torrent":{"xt":"urn:btih:a9ffb5c0ad12907d1f2d4761116f423b6134b879","amp;dn":"Book+Collection+of+Nicholas+Sparks+%5BMU%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9ffb5c0ad12907d1f2d4761116f423b6134b879","infoHashBuffer":{"type":"Buffer","data":[169,255,181,192,173,18,144,125,31,45,71,97,17,111,66,59,97,52,184,121]},"announce":[],"urlList":[]}}