{"title":"Folx Pro 4.0 [Mac Os X] [coque599]","uid":11689064,"size":20608449,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:aa9585d2ab96d2de0522cb76285a4b53a34ada67&amp;dn=Folx+Pro+4.0+%5BMac+Os+X%5D+%5Bcoque599%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"coque599","files":1,"time":1423436355,"description":"Folx combines two functionalities: download manager and torrent client.\n\nFolx makes downloading extremely easy: just open the page with the file to be downloaded, click the link in your browser and Folx will start the download for you. The application splits the file being downloaded in up to ten threads, thus significantly increasing the download speed. Its auto resume option comes handy when the downloading gets interrupted. You can also assign a tag or a few to the downloaded content for accurate and easy search through the downloaded files. You can optimize traffic allocation between different applications by regulating manually the download and upload speed.\n\nFolx is also available as PRO version. It brings such handy features as splitting the downloads in up to 10 threads which speeds up the download process; scheduling the download tasks according to your convenience; smart speed adjustment option (download speed will be adjusted automatically whenever you need to use Internet traffic to run other applications), iTunes integration and searching the web for torrents directly from Folx.\n\nWhat's New\nVersion 4.0:\nAdded: magnet links support\nAdded: possibility to download movies from YouTube in various formats and quality, as well as just the sound, if you do not need the movie itself\nMuch improved: torrents download\nFixed: Folx Agent icon is now adaptive to Status bar color scheme\nFixed: incorrect display of files names in File Manager on Retina displays\nFixed: blinking icon issue in the list of completed tasks\nFixed: issue when Folx started a download from the start in case the torrent file was previously relocated\nFixed: erroneous torrent files download from thepiratebay.cr and kickass.so\n\nRequirements\nIntel, 64-bit processor\nOS X 10.7 or late\n\nSeed And Enjoy\nIf you like my work vote it good","torrent":{"xt":"urn:btih:aa9585d2ab96d2de0522cb76285a4b53a34ada67","amp;dn":"Folx+Pro+4.0+%5BMac+Os+X%5D+%5Bcoque599%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa9585d2ab96d2de0522cb76285a4b53a34ada67","infoHashBuffer":{"type":"Buffer","data":[170,149,133,210,171,150,210,222,5,34,203,118,40,90,75,83,163,74,218,103]},"announce":[],"urlList":[]}}