{"title":"The Gastrointestinal System at a Glance, 2E [PDF] [StormRG]","uid":10939704,"size":48536285,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aba572d09c4d50f715b103cda3e0c5b324b3066d&amp;dn=The+Gastrointestinal+System+at+a+Glance%2C+2E+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"0xmovva","files":2,"time":1409443312,"description":"Author: Satish Keshav (Author), Adam Bailey (Author)\nPaperback: 120 pages\nPublisher: Wiley-Blackwell; 2 edition (November 5, 2012)\nLanguage: English\nISBN-10: 1405150912\nISBN-13: 978-1405150910\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n__________________________________________________________________________________\n\n\nThis concise introduction to the gastrointestinal system encapsulates the fundamental facts and principles of this rapidly growing and changing specialty. Written by experienced clinicians and teachers, the text covers the basic concepts of both the science surrounding the gastrointestinal system and the basics of clinical practice in an accessible, lucid format.\n\nNow fully supported by a companion website at www.ataglanceseries.com/gastro containing interactive MCQs and downloadable digital flashcards, The Gastrointestinal System at a Glance is the ideal revision aid for medical and allied health students, and provides valuable insight for anyone seeking a comprehensive and concise guide to this subject area.\n\nFully revised and updated to include further coverage of diagnostic and therapeutic endoscopy, revised liver chapters and a new chapter on embryology\nNow in full colour throughout\nSupported by a companion website containing interactive self-assessment and digital flashcards - perfect for both study and revision\nProvides an integrated approach to both the basic and clinical science of this core specialty","torrent":{"xt":"urn:btih:aba572d09c4d50f715b103cda3e0c5b324b3066d","amp;dn":"The+Gastrointestinal+System+at+a+Glance%2C+2E+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aba572d09c4d50f715b103cda3e0c5b324b3066d","infoHashBuffer":{"type":"Buffer","data":[171,165,114,208,156,77,80,247,21,177,3,205,163,224,197,179,36,179,6,109]},"announce":[],"urlList":[]}}