{"title":"Grow What You Eat, Eat What You Grow - Randy Shore","uid":11885291,"size":14353238,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:abab43cecb831386871b3ebe1f767459fe983d16&amp;dn=Grow+What+You+Eat%2C+Eat+What+You+Grow+-+Randy+Shore&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":2,"uploader":"Mohammad_AT","files":3,"time":1430818762,"description":"Randy Shore's father and grandfather grew up on farms, yet he didn't even know how to grow a radish. Author of &quot;The Green Man&quot; column in the Vancouver Sun, he spent five years teaching himself how to grow food for his family and then how to use the resulting bounty to create imaginative and nourishing meals the year round. In Grow What You Eat, Eat What You Grow, Randy reveals the secrets to creating and maintaining a fully functioning vegetable garden, from how to make your own fertilizer to precise instructions on how best to grow specific produce; he also offers advice for those with balcony or container gardens and others who live in small urban spaces. He then shows how to showcase your bounty with delicious, nutrient-packed recipes (both vegetarian and not), including instructions on canning, pickling, and curing, proving how easy and fulfilling it is to be a self-reliant expert in your garden and your kitchen.\n\nGrow What You Eat is equal parts a cookbook, gardening book, personal journal, and passionate treatise on the art of eating and living sustainably. In his quest for self-sufficiency, improved health, and a better environment, Randy Shore resurrects an old-school way of cooking that is natural, nutritious, and delicious","torrent":{"xt":"urn:btih:abab43cecb831386871b3ebe1f767459fe983d16","amp;dn":"Grow+What+You+Eat%2C+Eat+What+You+Grow+-+Randy+Shore","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abab43cecb831386871b3ebe1f767459fe983d16","infoHashBuffer":{"type":"Buffer","data":[171,171,67,206,203,131,19,134,135,27,62,190,31,118,116,89,254,152,61,22]},"announce":[],"urlList":[]}}