{"title":"Brian Wilson - SMiLE","uid":3279197,"size":66828148,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:abe811f6a18d2a8b131b98356f238bfeebe5943b&amp;dn=Brian+Wilson+-+SMiLE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"KingStar","files":18,"time":1106185783,"description":"The white whale of '60s record-making, the Beach Boys' aborted SMiLE album gradually gained a legend that not only inflated its rumored importance and complexity, but gave credence to an odd notion -- that completing it, then or ever, was impossible. In truth, SMiLE should have been released and forgotten, reissued and reappraised, and finally remastered for the digital era and ushered into the rock canon ever since Brian Wilson halted work on it in May 1967 (after an exhausting 85 recording sessions). Instead, it languished in the vaults and remained the perfect record -- perfect, of course, because it had never been finished. Reports that the recording of &quot;Mrs. O'Leary's Cow&quot; had caused a nearby building to burn down and whispers of &quot;inappropriate music&quot; gave it the character of a monster, one that cursed all those who approached it and claimed the heart and mind of its major participant. Wilson's love of &quot;feels&quot; -- short passages of cyclical music that could be overdubbed and rearranged countless times -- had made 1966's &quot;Good Vibrations&quot; the ultimate pocket symphony, but had also quickly spiralled into the instability that consumed him during its follow-up, &quot;Heroes and Villains,&quot; projected to be the centerpiece of SMiLE.","torrent":{"xt":"urn:btih:abe811f6a18d2a8b131b98356f238bfeebe5943b","amp;dn":"Brian+Wilson+-+SMiLE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abe811f6a18d2a8b131b98356f238bfeebe5943b","infoHashBuffer":{"type":"Buffer","data":[171,232,17,246,161,141,42,139,19,27,152,53,111,35,139,254,235,229,148,59]},"announce":[],"urlList":[]}}