{"title":"Mirai Nikki (Complete 1-26) HD Version - Sylant","uid":7204992,"size":6879156500,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:abf63b95ec01a6bbe2000c2df0d3949ef900b787&amp;dn=Mirai+Nikki+%28Complete+1-26%29+HD+Version+-+Sylant&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":8,"uploader":"sylant","files":-1,"time":1335061526,"description":"Yukiteru &quot;Yuki&quot; Amano is a loner who spends most of his time writing a diary on his cell phone or talking with his imaginary friends Deus Ex Machina, the God of Time and Space, and Muru Muru, Deus's servant. One day, Deus gives Yuki a special diary, mentioning something about a game. Strangely, Yuki's new diary has entries in it spanning the next 90 days--entries about the future that come unnervingly true. Deus, the not-so-imaginary God of Time and Space, then forces Yuki to participate in a battle royal with eleven other people, each of whom also has a diary that can predict the future in some unique way. The rules of this &quot;Diary Game&quot; are simple: the contestants must try to find and kill all the other contestants before the world ends on Day 90, and only the last one standing can prevent the Apocalypse and become the new God of Time and Space.\n\n\n\nThis is all 10bit anime meaning HD versions and super high quality. The fansubs are done by a group called GotWoot and if you like this quality then check out their website. All episodes have been sorted and named. It is a really clean torrent like all of my packages. Enjoy....\n\nPlease make sure to seed as much as possible and please comment and rate the video. The first thing to do before watching is to take 5 minutes to read the readme file, which has no advertisements or things you have to do or pay for. Enjoy and have fun.\n\nYou will really like this anime if you are into time paradox, dark, suspense, and violence. It will surely suprise you by the end.\n\n\nThanks for the download... Sylant","torrent":{"xt":"urn:btih:abf63b95ec01a6bbe2000c2df0d3949ef900b787","amp;dn":"Mirai+Nikki+%28Complete+1-26%29+HD+Version+-+Sylant","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abf63b95ec01a6bbe2000c2df0d3949ef900b787","infoHashBuffer":{"type":"Buffer","data":[171,246,59,149,236,1,166,187,226,0,12,45,240,211,148,158,249,0,183,135]},"announce":[],"urlList":[]}}