{"title":"The Kooks - 2008 - Konk - [EAC - FLAC]","uid":5923779,"size":316764955,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ac3c0c7da0fd2aa9c9498e98fbdd1fde45b6f8ee&amp;dn=The+Kooks+-+2008+-+Konk+-+%5BEAC+-+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"bludStain","files":-1,"time":1288483323,"description":"The Kooks - 2008 - Konk - [EAC - FLAC]\n\nReview by Jo-Ann Greene\n\nThe Kooks' debut album, Inside In/Inside Out, was a sleeper success story, going on to sell a whopping two million copies. It was a fabulous set, but their follow-up, Konk, wipes the floor with it. The title takes its name from Ray Davies' studio, where the quartet recorded most of the set. This direct connection to Britain's past obviously inspired the band to new heights, because the Kooks and this album are positively electrifying. Across a dozen songs (plus a hidden track), the quartet explores pop and rock in all their glory, with every number set apart from its neighbor in sound and feel. The Kooks wanted each song to be &quot;its own little world,&quot; and they've succeeded brilliantly. Singer and rhythm guitarist Luke Pritchard is on fire throughout, a bundle of barely contained emotional energy. Vocally he's an amorphous mass of influences -- Phil Lynott, Steve Marriott, Brett Anderson, David Bowie, even Van Morrison among them -- but bar the occasional inflection, he rarely channels any of them directly, capturing instead their spirit and soul. Musically, his guitar adds a decided bounce to everything he plays, even on the most downbeat numbers. His performances are magnificent, but even so, Konk belongs to lead guitarist Hugh Harris, who swaggers like an epic hero right across this set. He struts out like Achilles onto the plains of Troy on the infectious '60s pop/rocking album-opener, &quot;See the Sun.&quot; His leads are absolutely incendiary on &quot;Do You Wanna&quot; while adding subtle shades of color to the crash-and-bash &quot;Always Where I Need to Be,&quot; and they're positively joyous on the bright, bouncy Beatlesque &quot;Mr. Maker&quot; and utterly irrepressible on the pop/rock perfection of &quot;Down to the Market.&quot; Harris' show-stopper, though, is &quot;Shine On,&quot; a midtempo '60s-tinged number that pushes the band into new territory, and Pritchard to new heights as well. The guitarist's work on the power ballad &quot;Sway&quot; is equally superb, and showcases his most emotive work. The members of the band's rhythm section are no slackers either -- drummer Paul Garred brings to mind a more disciplined Keith Moon, while bassist Max Rafferty is the Kooks' linchpin with his wonderfully understated work. The album sounds phenomenal, with producer Tony Hoffer giving the entire set a warm glow that heightens the band's retro elements. That glow turns luminous on &quot;One Last Time,&quot; an acoustic-styled ballad with all the majesty of Green Day's &quot;Good Riddance (Time of Your Life),&quot; and burns just as brightly on the sway-along &quot;Stormy Weather.&quot; Everything about this album shouts masterpiece, a set that will thrill listeners for years, nay decades, to come.\n\n\nTracks\n01  -  See the Sun - Garred, Pritchard \t3:36\n02  -  Always Where I Need to Be - Pritchard \t2:41\n03  -  Mr. Maker - Pritchard \t3:00\n04  -  Do You Wanna - Pritchard \t4:06\n05  -  Cap - Garred, Harris, Pritchard \t4:00\n06  -  Love It All - Pritchard, Rafferty \t2:50\n07  -  Stormy Weather - Pritchard \t4:01\n08  -  Sway - Pritchard \t3:36\n09  -  Shine On - Pritchard \t3:14\n10  -  Down to the Market - Pritchard \t2:27\n11  -  One Last Time - Pritchard \t2:38\n12  -  Tick of Time - Pritchard \t4:25\n13  -  All Over Town - Pritchard \t3:18\n\n","torrent":{"xt":"urn:btih:ac3c0c7da0fd2aa9c9498e98fbdd1fde45b6f8ee","amp;dn":"The+Kooks+-+2008+-+Konk+-+%5BEAC+-+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac3c0c7da0fd2aa9c9498e98fbdd1fde45b6f8ee","infoHashBuffer":{"type":"Buffer","data":[172,60,12,125,160,253,42,169,201,73,142,152,251,221,31,222,69,182,248,238]},"announce":[],"urlList":[]}}