{"title":"Evil.BBW.Gold.2.Special.Anal.Edition.XXX.DVDRip.x264-Jiggly","uid":8136192,"size":2003823503,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:aca10e0b5c5853621836802ce3f46fad219d891a&amp;dn=Evil.BBW.Gold.2.Special.Anal.Edition.XXX.DVDRip.x264-Jiggly&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"chkm8te","files":1,"time":1360713994,"description":"Evil.BBW.Gold.2.Special.Anal.Edition.XXX.DVDRip.x264-Jiggly\n\nStarring : Buxom Bella, Christian, Eliza Allure, Kelly Shibari, Klaudia Kelly, Mazzaratie Monica, Sean Michaels, Star Staxx \n\nPorn adventurer Joey Silvera tips the scales in favor of fleshy filth in &quot;Evil BBW Gold # 2.&quot; The veteran pervert captures a bevy of big, beautiful women (BBWs) in five scenes of plus-sized eroticism starring curvaceous, jiggling sex-hungry sluts! Roly-poly redhead Eliza Allure, dolled up in sexy stockings and heels, uses her all-natural heft and giant titties to please muscular stud Christian. Eliza hungrily swallows his massive cock and takes a passionate butt-fuck while using a vibrating wand to buzz herself to climax. Sweet Asian BBW princess Kelly Shibari and full-figured Buxom Bella enjoy some hot Sapphic ass play with various anal toys, including a strap-on dildo, in a mountainous session of big lesbian sensuality. Super-cute blonde Monica Mazzaratie has the kind of colossal, booming ass that should be a national monument. Her enormous buttocks wobble with pleasure as Monica rides a hard cock and laps up a creamy load of splooge. Thick, fleshy Klaudia Kelly enjoys an interracial interlude with Sean Michaels' giant black dick. The pale, insatiable cutie has her fine, phat ass invaded, sucks his pole ass-to-mouth and swigs a mess of hot cum. Finally, adorable plumper Star Staxx enjoys an orgasmic scene of backdoor intimacy. Her pretty face gets mouth-fucked and her cunt royally reamed till she ejaculates girl-juice! With over three hours of huge fun, this is a visual feast for devotees of voluptuous, bountiful beauties. Ready for a heavy trip? &quot;Evil BBW Gold # 2&quot; is worth its weight in luxurious lady flesh. \n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=22mx0bbl8n6aq4nem9d7.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=22mx0bbl8n6aq4nem9d7.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=8nhg0om8i38m12l9gq78.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=8nhg0om8i38m12l9gq78.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:aca10e0b5c5853621836802ce3f46fad219d891a","amp;dn":"Evil.BBW.Gold.2.Special.Anal.Edition.XXX.DVDRip.x264-Jiggly","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aca10e0b5c5853621836802ce3f46fad219d891a","infoHashBuffer":{"type":"Buffer","data":[172,161,14,11,92,88,83,98,24,54,128,44,227,244,111,173,33,157,137,26]},"announce":[],"urlList":[]}}