{"title":"Grim Dawn v.0.2.9.7(b21) Cracked-3DM","uid":11148030,"size":1637771074,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ad3763d515ccfdb17c772bf78a9587b8823c167b&amp;dn=Grim+Dawn+v.0.2.9.7%28b21%29+Cracked-3DM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"Nimbleton","files":-1,"time":1412290426,"description":"Grim Dawn v.0.2.9.7(b21) Cracked-3DM\n\nExtract 7zip &amp; play!\n\n\nv0.2.9.7 (b21)\n\n[Major New Features]\n\n    The Arcanist Mastery is now available. New and existing characters can now select this mastery in order to become masters of the Aether and the arcane arts.\n    Two new item types have been introduced: Scepters and Daggers. These implements have served sorcerers in the pursuit of the arcane for centuries and will provide powerful new options for adventurous spellcasters.\n    Steam Trading Cards and Badges have been implemented. Collect them all and unlock sweet Grim Dawn backgrounds for your Steam profile!\n\n\n[Art]\n\n    Minor tweaks to HUD art\n    Updated the visual on the Ground Stomp skill\n    Fixed a mesh and bitmap assignment error for Herald's Mask\n    The Party Widget UI element has been overhauled with animated portraits\n\n\n[Animation]\n\n    Updated the animation interrupt timing on the double and triple shots while dual wielding guns. This should alleviate the feeling of &quot;being rooted&quot;.\n    Fixed a bug where the Female PC's version of the Gunslinger's Jacket was appearing offset on the character when equipped\n\n\n[Tech]\n\n    An Exit to Desktop option has been added to the Game Menu\n    Updated Life Leech on the Character Sheet to split up into Main-hand and Off-hand values\n    Pet bonuses now update correctly from any friendly buffs\n    Item set defensive bonuses are now added to Armor Rating display on Character Sheet\n    Swapping weapon sets no longer allows you to build up +Skill bonuses to infinity\n    Skills that don't do damage can no longer trigger criticals\n    Increased delay in between skill cooldown VO messages\n    Skill cooldown text message added at the top of the screen\n    New quickbar skill is now available: &quot;Move To&quot;. Move To can be assigned to any quickbar slot, including the mouse buttons. While using Move To, your character will ignore hostiles. If used on the left mouse button, Move To will still interact with breakables and interactive objects such as chests and doors.\n    The default weapon attack skill is now available for all quickbar slots\n    Fixed greatest monster killed showing up as &quot;tag not found&quot;.\n    Crafting UI item tooltip rollovers are no longer docked on the left side, causing the UI to be covered on smaller resolutions.\n    Relics are now sorted by their quality tier in the Crafting UI.\n    Lore Notes are now organized by Act in the Lore Journal\n\n\n[Game]\n\n    Ulgrim's soup now restores some constitution once per game session. Gotta ration after all.\n    The Gates of Anguish will now only unlock if Grand Priest Zarthuzellan is dead\n    Darius Cronley now obeys level limits similarly to other bosses (ex. Warden), making his max level on Normal difficulty 39\n    Projectile Traps in the Steps of Torment now fire more slowly, but do more damage with each shot\n\n\n[Itemization]\n\n    Scepters and Daggers are now available for caster builds. These weapons have lower base damage, but the damage is magic-based instead of physical. They also have an increased chance of generating with % damage suffixes.\n    Items that previously showed &quot;tag not found&quot; should now properly grant bonuses to Arcanist Skills. New Magic affixes with Arcanist skills have been added.\n    Adjusted the distribution of components generated from Dismantling and improved the drop rate of components from dismantling Rare and Epic items\n    Added 22 new Epic Scepters and Daggers\n    Added a new Epic Mace: Bonesnap Gavel, level 14, intended for physical damage builds\n    Added two new Epic amulets: Bladeward's Courage and Shard of Menhir, level 15 and 35 respectively. These amulets are intended for physical and/or tanky builds.\n    The Herald's Protector has been renamed to Sparkbolt Arbalest. It is no longer part of the Herald's Regalia set. Its stats have been slightly updated.\n    The Herald's Regalia set is now a 3-piece set. Its 10% Total Speed set bonus has been removed.\n    Updated stats on Herald's Ward. With the % Total Speed bonus gone from the set bonus, this amulet now grants a small amount of it.\n    Updated the stats on the Brimstone set. It now provides a little more % fire damage.\n    Increased the level requirement on Warmaster's Pride to 25 and adjusted its stats slightly\n    Increased the level requirement of Leander Greene's Handcannon to 23, stats adjusted to match\n    Increased the level requirement of The Slugger to 20, stats adjusted to match\n    Increased the level requirement of Dementia to 22, stats adjusted to match\n    Increased the level requirement of Malformed Effigy to 24, stats adjusted to match\n    Increased the level requirement of Nether Crown to 24, stats adjusted to match\n    Added 4 new magic suffixes to support Burn, Frostburn, Electrocute and Trauma.\n    Updated the visuals on several Component skills, including differentiating the tier 1 and tier 2 levels (ex. Fireblast I and Fireblast II)\n    Updated the component skills Lightning Strike and Slam to be a little more distinct from each other, beside damage types\n    Increased the damage on the component skills Ice Spike, Fireblast and Poison Bomb\n    Updated the component skill Chaos Bolt with a new visual and a more chaotic results\n    Updated the component skill Decapitate to instead sweep in an arc to damage up to 3 enemies, damage and cooldown adjusted\n    The component skill Demonfire has been renamed to Demon's Breath. It is now a wave attack similar to Forcewave. Stats adjusted.\n    Increased the damage output of the Blighted Rift Scourge summon. Its acid spit now also has a small area of effect, improving its ability to hit enemies.\n    8 new blueprints have been added for the creation of various Scepters and Daggers\n    Reduced the amount of % Attack Damage Converted to Health that can appear on Relics\n    Consumables now have a 1 second cooldown, allowing you to stack the effects of different Consumables together\n    The Sazalar's Harbinger summon's cooldown now scales with the item level of the Monster Infrequent.\n\n\n[Class &amp; Skills]\n\n    The Arcanist Mastery is now available.\n    Updated toggled skill mods to have Reserved Energy that scales with rank.\n\n\nSoldier\n\n    Menhir's Will %life and regen now start a little lower and scale faster in the early levels to provide more reward for further investment in the skill.\n    Military conditioning provides 2% more life bonus by max level. \n\n\nDemolitionist\n\n    Increased the explosion radius of Stun Jacks to 1.5. The Quick Jacks transmuter now reduces the explosion radius, but also decreases the projectile spread.\n    Blast Shield was reworked based on player complaints that it was frustrating having to continually recast it to ensure it was active and providing it's benefits. Now Blast Shield is a stand-alone passively activated skill that turns on when fire damage is taken, absorbing the fire damage from the initial hit and all following attacks until it's shield is used up. It then goes into cooldown, after which it resets and is ready to trigger again once fire damage is taken.\n    A new skill named &quot;Flame Touched&quot; has been created using some of the bonuses previously on Blast Shield. The passive skill Unquenchable Flame has been absorbed into it, to provide a modifier. Since these new skills are all built from the database records of the previous skills, players won't lose any skill points, they will just show up in the new skills.\n    As Flame Touched now provides a %fire dmg bonus, the damage scaling on Firestrike has been adjusted to balance things out. Investment in both skills should be a net increase though for Firestrike and other fire-based skills but paced out a little more gradually.\n    Blackwater Cocktail modifier Intense Heat has been renamed to Demon Fire and the additional fire damage converted to chaos to encourage more cross-mastery synergy. To compensate for the reduced benefit from +%Fire within the mastery, the base damage levels are a little higher.\n    Splinter renamed to Brimstone and pierce converted to chaos dmg to promote more cross-mastery synergy. The skill has also been moved to tier 9 so as to better pace out investment.\n    Based on the way Ulzuin's Chosen and Ulzuin's Wrath work, we realized that the %fire retaliation and % fire damage bonuses, respectively, on the skills were not actually affecting anything, so they have been removed. Ulzuin's Chosen is now also positioned next to the skills it affects in the mastery.\n\n\nOccultist\n\n    Reduced the total damage modifier on Fevered Rage to 50%\n    Removed the damage reduction from the Pox modifier Wasting\n\n\nNightblade\n\n    Adusted the cooldown decrease with level on Blade Barrier so that the min is now 15s.\n    Shifted damage penalties on frenetic throw\n    Adjusted the behavior of the Blade Spirit so it more aggressively seeks out enemies, thus ensuring that they are within range of its slicing and dicing aura","torrent":{"xt":"urn:btih:ad3763d515ccfdb17c772bf78a9587b8823c167b","amp;dn":"Grim+Dawn+v.0.2.9.7%28b21%29+Cracked-3DM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad3763d515ccfdb17c772bf78a9587b8823c167b","infoHashBuffer":{"type":"Buffer","data":[173,55,99,213,21,204,253,177,124,119,43,247,138,149,135,184,130,60,22,123]},"announce":[],"urlList":[]}}