{"title":"TTC - The Story of Human Language","uid":11144734,"size":263227390,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ada236a7cd60181f6c9e689acd6640d8404b3b64&amp;dn=TTC+-+The+Story+of+Human+Language&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":2,"uploader":"suncasa","files":3,"time":1412237409,"description":"Publisher's Summary\n\nLanguage defines us as a species, placing humans head and shoulders above even the most proficient animal communicators. But it also beguiles us with its endless mysteries, allowing us to ponder why different languages emerged, why there isn't simply a single language, how languages change over time and whether that's good or bad, and how languages die out and become extinct. Now you can explore all of these questions and more in an in-depth series of 36 lectures from one of America's leading linguists.\nYou'll be witness to the development of human language, learning how a single tongue spoken 150,000 years ago evolved into the estimated 6,000 languages used around the world today and gaining an appreciation of the remarkable ways in which one language sheds light on another.\nThe many fascinating topics you examine in these lectures include: the intriguing evidence that links a specific gene to the ability to use language; the specific mechanisms responsible for language change; language families and the heated debate over the first language; the phenomenon of language mixture; why some languages develop more grammatical machinery than they actually need; the famous hypothesis that says our grammars channel how we think; artificial languages, including Esperanto and sign languages for the deaf; and how word histories reflect the phenomena of language change and mixture worldwide.\nDisclaimer: Please note that this recording may include references to supplemental texts or print references that are not essential to the program and not supplied with your purchase.\nÂ©2004 The Teaching Company, LLC (P)2004 The Great Courses","torrent":{"xt":"urn:btih:ada236a7cd60181f6c9e689acd6640d8404b3b64","amp;dn":"TTC+-+The+Story+of+Human+Language","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ada236a7cd60181f6c9e689acd6640d8404b3b64","infoHashBuffer":{"type":"Buffer","data":[173,162,54,167,205,96,24,31,108,158,104,154,205,102,64,216,64,75,59,100]},"announce":[],"urlList":[]}}