{"title":"[SoM]Corvo Rosso non avrai il mio scalpo[DvdRip-DivX5-Mp3-Ita]","uid":4388741,"size":726900736,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ae4dd8adaf96187f7e3f4b24bc5272e7d432cbc7&amp;dn=%5BSoM%5DCorvo+Rosso+non+avrai+il+mio+scalpo%5BDvdRip-DivX5-Mp3-Ita%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"mitimex","files":1,"time":1221058104,"description":"Veterano della Guerra messicano-statunitense (1846-48), Jeremiah Johnson cerca rifugio nel West. Intende intraprendere la vita di un mountain man o trapper, che vive tra le montagne dell'ovest cacciando animali per mezzo di trappole. In inverno ha difficoltÃƒÆ’Ã‚Â  a sopravvivere ed ha un breve incontro con Mano Che Segna Rosso (Paints His Shirt Red nella versione americana), un nativo americano capo della tribÃƒÆ’Ã‚Â¹ dei Corvi (o Crows). \nSi incontra poi con l'anziano ed eccentrico &quot;Artiglio d'orso&quot; Chris Lapp (&quot;So chi sei; sei lo stesso pellegrino idiota che sento da venti giorni e annuso da tre!&quot;), che lo accoglie e gli fa da maestro su come vivere nelle montagne e dopo aver imparato le abilitÃƒÆ’Ã‚Â  necessarie per sopravvivere tra le montagne, Johnson parte per conto suo.\nNei suoi viaggi si imbatte in una piccola capanna, i cui abitanti sono stati attaccati dai guerrieri Piedi Neri: soltanto una donna e suo figlio, un ragazzo taciturno, sono sopravvissuti. La donna, impazzita dal dolore, obbliga Johnson ad adottare suo figlio. \nAvvicinato dagli Indiani cristianizzati Teste Piatte, lo accolgono come ospite d'onore per le sue audaci imprese. Quando Johnson dÃƒÆ’Ã‚Â  al capo gli scalpi e i cavalli dei Piedi Neri (i loro mortali nemici), quest'ultimo secondo l'usanza delle Teste Piatte si trova obbligato a ricambiare con un dono ancora piÃƒÆ’Ã‚Â¹ grande, cosÃƒÆ’Ã‚Â¬ il capo tribÃƒÆ’Ã‚Â¹ dÃƒÆ’Ã‚Â  sua figlia Cigno Pazzo (Swan nella versione americana) in matrimonio ad un riluttante Johnson. Dopo la cerimonia nuziale, Caleb e Cigno Pazzo proseguono il viaggio nelle lande solitarie.\nJohnson, con l'aiuto del ragazzo e della sua nuova moglie, individua un luogo adatto per costruire una capanna e stabilirvisi come una famiglia. Con il tempo i tre sviluppano affetto l'uno per l'altro e Johnson e Cigno Pazzo si innamorano.\nObbligato ad a aiutare un plotone dell'Esercito, che gli chiede di guidare una spedizione di soccorso ad un gruppo di carri coperti sperduti, Johnson li guida attraverso un cimitero dei Corvi, luogo tabÃƒÆ’Ã‚Â¹ per gli estranei. Considerando la violazione del terreno sacro come un oltraggio da parte di Johnson, la tribÃƒÆ’Ã‚Â¹ dei Corvi per rappresaglia invia un gruppo di guerrieri ad uccidere Cigno Pazzo e Caleb.\nDopo aver bruciato la sua capanna con le spoglie di Cigno pazzo e Caleb, Johnson si mette alla ricerca del gruppo che ha ucciso la sua famiglia e li uccide tutti tranne uno, un grasso guerriero intona il suo canto della morte quando si rende conto di non poter sfuggire a Johnson. Johnson lo lascia vivere, e quest'ultimo racconta poi alla sua tribÃƒÆ’Ã‚Â¹ la storia dell'uccisore selvaggio, che si sparge ben presto in tutta la regione. Johnson viene ora lanciato in una sanguinosa faida con il popolo Crow. La tribÃƒÆ’Ã‚Â¹ invia i suoi migliori guerrieri, uno alla volta, per ingaggiare battaglia con Johnson, ma questi li sconfigge ripetutamente. La sua leggenda cresce e i Corvi arrivano a rispettarlo per la sua abilitÃƒÆ’Ã‚Â , la sua audacia e la sua tenacia, come anche per l'onore da lui dimostrato.\nLa scena finale ÃƒÆ’Ã‚Â¨ un incontro con Mano Che Segna Rosso, il nemico giurato di Johnson e la forza che sta dietro agli attacchi contro Johnson. A parecchie centinaia di metri di distanza, Johnson allunga la mano per prendere il fucile per quello che pensa sarÃƒÆ’Ã‚Â  un duello finale. Mano Che Segna Rosso invece alza il braccio, con il palmo aperto, in un gesto di pace che Johnson ricambia, chiudendo il film.\n","torrent":{"xt":"urn:btih:ae4dd8adaf96187f7e3f4b24bc5272e7d432cbc7","amp;dn":"%5BSoM%5DCorvo+Rosso+non+avrai+il+mio+scalpo%5BDvdRip-DivX5-Mp3-Ita%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae4dd8adaf96187f7e3f4b24bc5272e7d432cbc7","infoHashBuffer":{"type":"Buffer","data":[174,77,216,173,175,150,24,127,126,63,75,36,188,82,114,231,212,50,203,199]},"announce":[],"urlList":[]}}