{"title":"Classic TV Serials: The Complete 'Yes, Prime Minister'","uid":4392258,"size":2936014895,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ae92fdf9f65627077aba1730f79eb4ac2f9ea704&amp;dn=Classic+TV+Serials%3A+The+Complete+%5C%27Yes%2C+Prime+Minister%5C%27&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":2,"uploader":"dnayak","files":17,"time":1221241599,"description":"Classic TV Serials: The Complete 'Yes, Prime Minister' (Seasons One and Two) \n\nYes, Prime Minister is the sequel to Yes Minister. It ran from 1986 to 1988. \n\nVideo size: 512x384 \nAudio: 32000hz, 16bps, 2ch \n\n\nSeries One (1986) \n01. The Grand Design - With his finger now on the nuclear button, Hacker plans his first act as Prime Minister to be a radical new defence policy. \n\n02. The Ministerial Broadcast - Hacker is groomed for his first television broadcast as PM, but Sir Humphrey is more concerned with the content. \n\n03. The Smoke Screen - Hacker uses his Health Minister's plan to eliminate smoking as a bluff against the Treasury. \n\n04. The Key - The PM decides to clip Sir Humphrey's wings when he engages in a territorial battle with Hacker's political advisor. \n\n05. A Real Partnership - Sir Humphrey has to get through a civil service pay claim while at the same time discrediting its proposer. \n\n06. A Victory for Democracy - Hacker has difficulty discovering if the Foreign Office is there to carry out government policy or vice versa. \n\n07. The Bishop's Gambit - A troubled British nurse in Qumran and a vacant bishopric combine to provide an opportunity for Sir Humphrey. \n\n08. One of Us - The former head of MI5 is revealed to be a spy (despite Sir Humphrey clearing him), while a dog strays on to Salisbury Plain. \n\n\nSeries Two (1987ÃƒÂ¢??88) \n01. Man Overboard - Sir Humphrey fights the Employment Secretary's plan to relocate service personnel by casting doubt over the Minister's loyalty. \n\n02. Official Secrets - Hacker's attempt to suppress an unflattering chapter of his predecessor's memoirs is leaked to the press. \n\n03. A Diplomatic Incident - The death of Hacker's predecessor provides a chance for some negotiations with the French over the Channel Tunnel at his state funeral. \n\n04. A Conflict of Interest - Hacker can avoid a City scandal if he appoints a Bank of England Governor whose honesty isn't beyond reproach. \n\n05. Power to the People - Sir Humphrey and the leader of Houndsworth Council become strange bedfellows when Hacker tries to reform local government. \n\n06. The Patron of the Arts - Hacker's invitation to the British Theatre Awards dinner becomes a hot potato when the size of the Arts Council grant is revealed. \n\n07. The National Education Service - When the Department of Education and Science stands in the way of reform, Hacker decides to abolish it. \n\n08. The Tangled Web - When Hacker unwittingly lies to the House of Commons he is helped by Sir Humphrey's unfortunate indiscretion. \n\n[Wikipedia] \n\nRelated Torrents:\nYes Minister, Season One - http://thepiratebay.se/torrent/4375323/Classic_TV_Serials__Yes_Minister__Season_One\n\nYes Minister, Season Two - http://thepiratebay.se/torrent/4375328/Classic_TV_Serials__Yes_Minister__Season_Two\n\nYes Minister, Season Three - http://thepiratebay.se/torrent/4383804/Classic_TV_Serials__Yes_Minister__Season_Three__amp__Special_Episode \n\nEnjoy! and please SEED!! Thanks.\n\nMy other torrents: http://thepiratebay.se/user/dnayak/","torrent":{"xt":"urn:btih:ae92fdf9f65627077aba1730f79eb4ac2f9ea704","amp;dn":"Classic+TV+Serials%3A+The+Complete+%5C%27Yes%2C+Prime+Minister%5C%27","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae92fdf9f65627077aba1730f79eb4ac2f9ea704","infoHashBuffer":{"type":"Buffer","data":[174,146,253,249,246,86,39,7,122,186,23,48,247,158,180,172,47,158,167,4]},"announce":[],"urlList":[]}}