{"title":"Corel Draw X4 Graphics Suite Multilanguage","uid":5203514,"size":342497046,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:aeb637a868f836c0e5fd6e87650a22009e761efa&amp;dn=Corel+Draw+X4+Graphics+Suite+Multilanguage&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"alemaoPS","files":4,"time":1260232626,"description":"O CorelDRAW Graphics Suite X4 veio com tudo para aprimorar o desenvolvimento de projetos grÃƒÂ¡ficos. Seguindo a linha das versÃƒÂµes anteriores, esta suÃƒÂ­te de aplicativos grÃƒÂ¡ficos permite tanto designers, quanto usuÃƒÂ¡rios comuns, aperfeiÃƒÂ§oarem a produÃƒÂ§ÃƒÂ£o de seus trabalhos e obterem excelentes resultados. A nova versÃƒÂ£o traz uma sÃƒÂ©rie de novidades e melhorias, tornando o uso do software uma verdadeira experiÃƒÂªncia.\n\nAs mudanÃƒÂ§as podem ser notadas logo de inÃƒÂ­cio. A interface estÃƒÂ¡ mais simples e mais versÃƒÂ¡til, as ferramentas receberam legendas e podem facilmente serem transformadas em caixas independentes com apenas o clicar e arrastar (drag n drop) do mouse. A suÃƒÂ­te traz os mesmos aplicativos da versÃƒÂ£o anterior, com apenas uma novidade: o Duplexing Wizard, um assistente para impressÃƒÂµes frente e verso.\n\nO CorelDRAW\n\nO aplicativo principal do pacote ÃƒÂ© um dos mais utilizados do mundo para a criaÃƒÂ§ÃƒÂ£o de grÃƒÂ¡ficos vetoriais. Embora seja uma ferramenta profissional, sua praticidade de uso permite que iniciantes desenvolvam trabalhos de qualidade sem maiores dificuldades. Oferece uma quantidade enorme de recursos e ferramentas, dando mais liberdade e suporte durante a elaboraÃƒÂ§ÃƒÂ£o de projetos.\n\nMais liberdade com as camadas\n\nAgora vocÃƒÂª poderÃƒÂ¡ controlar e editar as camadas independentemente para cada pÃƒÂ¡gina do seu documento. Linhas guia poderÃƒÂ£o ser adicionadas para uma pÃƒÂ¡gina em especial ou no documento inteiro.\n\nTabelas interativas\n\nCriar tabelas no CorelDRAW ficou muito mais fÃƒÂ¡cil. A nova ferramenta Table Tool permite criar tabelas de maneira interativa e rÃƒÂ¡pida. Assim, vocÃƒÂª pode criar layouts estruturados com imagens e textos, editar cÃƒÂ©lulas da tabela e adaptÃƒÂ¡-la ao estilo desejado.\n\nNovidades para os textos\n\nRecebeu uma imagem e nÃƒÂ£o conseguiu identificar a fonte utilizada? Um recurso prÃƒÂ¡tico do CorelDRAW coleta uma amostra do texto e o envia para o portal WhatTheFont.com para identificÃƒÂ¡-la. Infelizmente, o serviÃƒÂ§o encontra-se apenas em inglÃƒÂªs. As outras novidades sÃƒÂ£o: o espelhamento de textos interativo e o suporte aprimorado de aspas, adaptando-as conforme o idioma utilizado.\n\nAprimoramentos que nÃƒÂ£o acabam mais!\n\nA nova versÃƒÂ£o oferece suporte a uma maior quantidade de formatos, incluindo arquivos do Adobe Illustrator CS3 e do Adobe Photoshop CS3. Recebeu mais de 4 mil cliparts, uma sÃƒÂ©rie de fontes novas, um buscador avanÃƒÂ§ado de imagens e suporte a arquivos RAW. Para completar, o PowerTrace, recurso para a vetorizaÃƒÂ§ÃƒÂ£o de imagens, tambÃƒÂ©m teve melhorias.\n\nNome: Corel Draw X4 Graphics Suite Multilanguage\nFunÃƒÂ§ÃƒÂ£o: Editor de Imagens\nFabricante: Corel\nSistema Operacional: Windows XP/Vista/2000/2003\nIdioma(s): PortuguÃƒÂªs\nTamanho: 327 Mb\n\nConfiguraÃƒÂ§ÃƒÂ£o Minima:\n\nProcessador 1.2GHZ\n512MB RAM\nHD 10GB\n\nTORRENT = PROGRAMA + KEY","torrent":{"xt":"urn:btih:aeb637a868f836c0e5fd6e87650a22009e761efa","amp;dn":"Corel+Draw+X4+Graphics+Suite+Multilanguage","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aeb637a868f836c0e5fd6e87650a22009e761efa","infoHashBuffer":{"type":"Buffer","data":[174,182,55,168,104,248,54,192,229,253,110,135,101,10,34,0,158,118,30,250]},"announce":[],"urlList":[]}}