{"title":"Air Display v1.5.3","uid":8683701,"size":1239959,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:af7fb208ab3a02721ab3cf4a19d108931e77568d&amp;dn=Air+Display+v1.5.3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"Androider","files":-1,"time":1373750007,"description":"\nEver wish you had an extra display for your Mac or Windows computer? There's an app for that. With Air Display, you can use your Android screen as a wireless display, to extend your computer desktop. In order for Air Display to work, your computer and Android device must be connected to the same Wi-Fi network.\n\nLike a wired monitor, Air Display works in two ways:\n\n(1) Extend your computer screen onto a second screen, or\n(2) Mirror the contents of your computer screen onto your Android screen.\n\nAir Display's performance is extremely responsive, employing a unique dynamic compression algorithm. On a typical Wi-Fi network, mouse cursor refreshes are indistinguishable from a wired mouse. \n\nAir Display works in both landscape and portrait configurations. Just rotate your screen, and it automatically reconfigures. Air Display makes a laptop much more useful by increasing its usable screen size.\n\nAir Display not only gives you a wireless computer screen extender or mirror, but also works as a tablet input device. You can use your finger to draw directly on the screen's surface. Try it with a calculator, painting tool, or music control surface. \n\nSimple gestures allow you to operate the right mouse button and scroll wheel. When you rotate the screen, or disconnect and reconnect, your windows are automatically repositioned appropriately, so you don't have to drag them back to the Android screen.\n\nSome great uses for Air Display include:\n\n- Fill your Air Display screen with your utility apps such as iChat, Mail, iCal, and Calculator.\n- Graphic design: Make Photoshop and Illustrator usable on your laptop by putting your tool palettes on the Android screen.\n- Music: Use your Android screen as a wireless control surface for Logic or Pro Tools.\n- Programming: Use the extra display area for such auxiliary development tools as Console, Terminal, and the Debugger.\n- Business: Move all of your iWork and Office palettes and inspector windows onto Air Display, and let your document fill the screen.\n\nOn first launch, Air Display presents easy instructions for downloading and installing the free companion support software for your desktop computer.\n\nMacintosh compatibility: Air Display requires Mac OS X 10.6 (Snow Leopard) or later, on an Intel CPU. Both 32-Bit and 64-Bit systems are supported.\n\nWindows compatibility: Air Display requires Windows XP (32-bit only), Vista or 7 (32-bit or 64-bit) and Windows 8. Windows 7 Starter edition is not supported. Aero and DirectX will be disabled while connected to Air Display, and re-enabled upon disconnection.\n\nWhat's in this version:\n\n- Support for Ice Cream Sandwich and Jelly Bean (Android 4.x).\n- Fixes black screen on connection.\n- Stability improvements, fixed several crashes.\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.avatron.airdisplay&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.avatron.airdisplay&lt;/a&gt;\n","torrent":{"xt":"urn:btih:af7fb208ab3a02721ab3cf4a19d108931e77568d","amp;dn":"Air+Display+v1.5.3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af7fb208ab3a02721ab3cf4a19d108931e77568d","infoHashBuffer":{"type":"Buffer","data":[175,127,178,8,171,58,2,114,26,179,207,74,25,209,8,147,30,119,86,141]},"announce":[],"urlList":[]}}