{"title":"BackTrack 5 Wireless Penetration Testing Beginner's Guide[Nepste","uid":7498131,"size":17398572,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:af9d78b884c745b2217fa781ed5f28fc42022a3b&amp;dn=BackTrack+5+Wireless+Penetration+Testing+Beginner%27s+Guide%5BNepste&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":2,"uploader":"NepsterJay","files":1,"time":1343938167,"description":"Book Description:\nWritten in Packt's Beginner's Guide format, you can easily grasp the concepts and understand the techniques to perform wireless attacks in your lab. Every new attack is described in the form of a lab exercise with rich illustrations of all the steps associated. You will practically implement various attacks as you go along. If you are an IT security professional or a security consultant who wants to get started with wireless testing with Backtrack, or just plain inquisitive about wireless security and hacking, then this book is for you. The book assumes that you have familiarity with Backtrack and basic wireless concepts.\n\nAbout the Author:\nVivek Ramachandran is a world renowned security researcher and evangelist. He is the discoverer of the wireless &quot;Caffe Latte Attack&quot; and has delivered presentations in world renowned Information Security conferences such as Defcon and Toorcon in the US. His discoveries and talks have been widely quoted by the International media including - BBC Online, Network World, The Register, Mac World, Computer Online and others.\n\nIn 2006, Microsoft declared Vivek as one of the winners of the Microsoft Security Shootout Contest held in India among an estimated 65,000 participants. In 2005, he was awarded a team achievement award by Cisco Systems for his work in the 802.1x and Port Security modules.\n\nHe is well known in the hacking and security community as the founder of SecurityTube.net , a free video based computer security education portal which gets an estimated 100,000 monthly visitors.\n\nVivek is also an accomplished trainer and travels around the world conducting workshops and training sessions for corporates and students. He holds a degree in B.Tech from IIT Guwahati and acts as an advisor to the computer science department's Security Lab.\n\nProduct Details\nPaperback: 220 pages\nPublisher: Packt Publishing (September 9, 2011)\nLanguage: English\nISBN-10: 1849515581\nISBN-13: 978-1849515580","torrent":{"xt":"urn:btih:af9d78b884c745b2217fa781ed5f28fc42022a3b","amp;dn":"BackTrack+5+Wireless+Penetration+Testing+Beginner%27s+Guide%5BNepste","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af9d78b884c745b2217fa781ed5f28fc42022a3b","infoHashBuffer":{"type":"Buffer","data":[175,157,120,184,132,199,69,178,33,127,167,129,237,95,40,252,66,2,42,59]},"announce":[],"urlList":[]}}