{"title":"Deathride: Hitler vs Stalin, The Eastern Front, 1941-1945","uid":15810997,"size":869018,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:afe524d6b4c1c86aba2bfcc72b126a17bfc68a71&amp;dn=Deathride%3A+Hitler+vs+Stalin%2C+The+Eastern+Front%2C+1941-1945&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"marty14","files":1,"time":1473635467,"description":"Deathride: Hitler vs Stalin, The Eastern Front, 1941-1945 - John Mosier [epub]\r\n\r\nThe German invasion of the Soviet Union on June 22, 1941, began a war that lasted nearly four years and created by far the bloodiest theater in World War II. In the conventional narrative of this war, Hitler was defeated by Stalin because, like Napoleon, he underestimated the size and resources of his enemy. In fact, says historian John Mosier, Hitler came very close to winning and lost only because of the intervention of the western Allies. Stalin’s great triumph was not winning the war, but establishing the prevailing interpretation of the war. The Great Patriotic War, as it is known in Russia, would eventually prove fatal, setting in motion events that would culminate in the collapse of the Soviet Union.\r\n\r\nDeathride argues that the Soviet losses in World War II were unsustainable and would eventually have led to defeat. The Soviet Union had only twice the population of Germany at the time, but it was suffering a casualty rate more than two and a half times the German rate. Because Stalin had a notorious habit of imprisoning or killing anyone who brought him bad news (and often their families as well), Soviet battlefield reports were fantasies, and the battle plans Soviet generals developed seldom responded to actual circumstances. In this respect the Soviets waged war as they did everything else: through propaganda rather than actual achievement. What saved Stalin was the Allied decision to open the Mediterranean theater. Once the Allies threatened Italy, Hitler was forced to withdraw his best troops from the eastern front and redeploy them. In addition, the Allies provided heavy vehicles that the Soviets desperately needed and were unable to manufacture themselves. It was not the resources of the Soviet Union that defeated Hitler but the resources of the West. \r\n\r\nIn this provocative revisionist analysis of the war between Hitler and Stalin, Mosier provides a dramatic, vigorous narrative of events as he shows how most previous histories accepted Stalin’s lies and distortions to produce a false sense of Soviet triumph. Deathride is the real story of the Eastern Front, fresh and different from what we thought we knew","torrent":{"xt":"urn:btih:afe524d6b4c1c86aba2bfcc72b126a17bfc68a71","amp;dn":"Deathride%3A+Hitler+vs+Stalin%2C+The+Eastern+Front%2C+1941-1945","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"afe524d6b4c1c86aba2bfcc72b126a17bfc68a71","infoHashBuffer":{"type":"Buffer","data":[175,229,36,214,180,193,200,106,186,43,252,199,43,18,106,23,191,198,138,113]},"announce":[],"urlList":[]}}