{"title":"Factorio 0.11.18 32&amp;64","uid":11757458,"size":305371301,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b0561ac99bd4e035ac7bc577a64c073271154828&amp;dn=Factorio+0.11.18+32%26amp%3B64&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"Asayhem","files":2,"time":1426457941,"description":"0.11.18 change notes:\n\nFeatures:\n\nBlueprints can be built over things marked for deconstruction.\nBlueprints can be force placed using alternative build mode (shift click).\n\n\nBalancing:\n\nIncreased the cargo wagon inventory size (20-&gt;30).\nIncreased the crafting cost of the cargo wagon and locomotive.\n\n\nBugfixes:\n\nFixed save corruption (rare probability) related to rendering alerts and saving the map.\nFixed crash in map editor when changing / setting assembling machine recipe.\nFixed desync loop when changing player force via script - in PvP mod for instance.\nAdded explaining text for the second new hope campaign supplies objectives. (that the car supplies count only the user is in the car)\nThe flamethrower fluid input order is the same as before, so it matches the refinery outputs.\nFixed clearing the cursor while attempting to repair something.\nFixed that changing force of roboport (in map editor or by a script) didn't update the connections properly.\nRoboports now behave correctly when teleported using scripts.\nFixed that some of the technology icons were scaled down in the technology selection.\nFixed that the Not minable checkbox was set based on the Indestructible value in the map editor.\nFixed that the two way signals weren't possible to build on diagonal rails.\nFixed copy-paste for Cargo wagons not activating inserters.\nFixed copy-paste for entities with inventory limits not copying the limit.\nFixed that the &quot;Electric demand satisfaction&quot; label was not translatable.\nRemoving and merging the locomotive of a train without any additional locomotives doesn't clear the schedule anymore.\nThe line height in the debug info is dependent on the scale, so they don't overlap or take too much space on different scales.\nFixed &quot;Trying to make chunk at unreasonable position&quot; caused by some vehicle collisions.\nFixed weird behaviour and bad damage calculations when colliding with multiple objects while in a car or tank.\n\n\nChanges:\n\nSmall change of collision box of curved rail, so the underground belts can be built on one additional particular position.\nCar and tank movement should be better. Tank should no longer get stuck. Tank can now destroy objects by accelerating into them even when standing still.\n\nScripting:\n\nFixed that non valid require did crash the game instead of giving proper error message.\nSetting technology as finished using the script also fires the ontechnologyresearched event.\nOrder to chart a big area doesn't slow the game horribly anymore.\nAdded onresourcedepleted - called when a resource is depleted to its minimum yield or 0. Passes the resource entity as event.entity.\nCar prototype now uses &quot;energy_per_hit_point&quot; instead of &quot;crash_damage_multiplier&quot;, consistent with train prototypes.\n\n\nModding:\n\nMoved the player hit tint color into the player prototype","torrent":{"xt":"urn:btih:b0561ac99bd4e035ac7bc577a64c073271154828","amp;dn":"Factorio+0.11.18+32%26amp%3B64","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0561ac99bd4e035ac7bc577a64c073271154828","infoHashBuffer":{"type":"Buffer","data":[176,86,26,201,155,212,224,53,172,123,197,119,166,76,7,50,113,21,72,40]},"announce":[],"urlList":[]}}