{"title":"David S  Landes - The Wealth and Poverty of Nations: Why Some Ar","uid":5149997,"size":14076636,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b0808dd1cb7cba57c960e4e2e697098143664bc6&amp;dn=David+S++Landes+-+The+Wealth+and+Poverty+of+Nations%3A+Why+Some+Ar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"profdreamer","files":1,"time":1257466305,"description":"David S  Landes - The Wealth and Poverty of Nations: Why Some Are So Rich and Some So Poor, PDF, 13.4 MB\n\nThis could be called the economic &quot;Guns, Germs and Steel&quot;. Why some countries made it big while others are still dirt-poor.\n\n\n****************\n\nFrom Publishers Weekly\nLandes (Revolution in Time), Harvard professor emeritus of history, undertakes an economic and cultural history of the world during the past five centuries. His well-written, sometimes witty analysis is the kind of work one wants to pause over and reflect upon at each chapter before moving ahead. Landes's principal argument is that the richest nations continue to prosper while poorer nations lag behind because of their relative ability or inability to exploit science, technology and economic opportunity. In every case?from ancient China to modern Japan?he maintains this is largely the result of national attitudes about a myriad of cultural factors. Landes traces the story of England's industrial revolution and America's system of mass production as indicators of the West's superiority over the rest of the world. Some of his historical illustrations are thought-provoking: for example, the importance of air conditioning to the development of the New South in the U.S. and the impact of a lifetime of eating with chopsticks on the manual dexterity of Asia's microprocessing workers. Most of all, Landes stresses the importance of cultural values, such as a predisposition for hard work, open-mindedness and a commitment to democracy, in determining a nation's course toward wealth and power. ","torrent":{"xt":"urn:btih:b0808dd1cb7cba57c960e4e2e697098143664bc6","amp;dn":"David+S++Landes+-+The+Wealth+and+Poverty+of+Nations%3A+Why+Some+Ar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0808dd1cb7cba57c960e4e2e697098143664bc6","infoHashBuffer":{"type":"Buffer","data":[176,128,141,209,203,124,186,87,201,96,228,226,230,151,9,129,67,102,75,198]},"announce":[],"urlList":[]}}