{"title":"The How of Happiness:  Approach  Getting the Life You Want","uid":8339285,"size":15365256,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b0b646b2342fa2af41ffdf054028eea6774e662a&amp;dn=The+How+of+Happiness%3A++Approach++Getting+the+Life+You+Want&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1365050788,"description":"Sonja Lyubomirsky, &quot;The How of Happiness: A Scientific Approach to Getting the Life You Want&quot;\nEnglish | 2007-12-27 | ISBN: 159420148X | 384 pages | PDF | 12,4 MB\n\nYou can change your personal capacity for happiness. Research psychologist Sonja Lyubomirsky's pioneering concept of the 40% solution shows you how\nDrawing on her own groundbreaking research with thousands of men and women, research psychologist and University of California professor of psychology Sonja Lyubomirsky has pioneered a detailed yet easy-to-follow plan to increase happiness in our day-to-day lives-in the short term and over the long term.\n\nThe How of Happiness is a different kind of happiness book, one that offers a comprehensive guide to understanding what happiness is, and isn't, and what can be done to bring us all closer to the happy life we envision for ourselves. Using more than a dozen uniquely formulated happiness-increasing strategies, The How of Happiness offers a new and potentially life- changing way to understand our innate potential for joy and happiness as well as our ability to sustain it in our lives.\n\nBeginning with a short diagnostic quiz that helps readers to first quantify and then to understand what she describes as their &quot;happiness set point,&quot; Lyubomirsky reveals that this set point determines just 50 percent of happiness while a mere 10 percent can be attributed to differences in life circumstances or situations. This leaves a startling, and startlingly underdeveloped, 40 percent of our capacity for happiness within our power to change.","torrent":{"xt":"urn:btih:b0b646b2342fa2af41ffdf054028eea6774e662a","amp;dn":"The+How+of+Happiness%3A++Approach++Getting+the+Life+You+Want","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0b646b2342fa2af41ffdf054028eea6774e662a","infoHashBuffer":{"type":"Buffer","data":[176,182,70,178,52,47,162,175,65,255,223,5,64,40,238,166,119,78,102,42]},"announce":[],"urlList":[]}}