{"title":"Kings of Leon - Only By The Night 2008 [FLAC] - Kitlope","uid":5542139,"size":282996178,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b0c685c9e1b5477f8710ec4c3b7c8d2bde4bff15&amp;dn=Kings+of+Leon+-+Only+By+The+Night+2008+%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"Kitlope","files":14,"time":1273267995,"description":"PC Software: Windows 7 Ultimate Build 7600 \nFile Type: FLAC Compression 6\nCd Hardware: Plextor PX-716SA \nPlextor Firmware: 1.11 (Final)\nCd Software: Exact Audio Copy V0.99 prebeta 5\nEAC Log: Yes\nEAC Cue Sheet: Yes\nTracker(s):http://tracker.openbittorrent.com/announce;\nTorrent Hash: B0C685C9E1B5477F8710EC4C3B7C8D2BDE4BFF15\nFile Size: 269.88 MB\nYear: 2008\nLabel: RCA\nCatalog #: 88697-32712-2\n\n\nPlease help seed these FLACs! \n\n\n\n\n\n\nFrom Wiki:\n\n\nKings of Leon is an American alternative rock group that formed in Nashville, Tennessee, United States in 1999, consisting of brothers Anthony Caleb Followill (lead vocals, rhythm guitar), Ivan Nathan Followill (drums, percussion, backing vocals) and Michael Jared Followill (bass, backing vocals), with their cousin Cameron Matthew Followill (lead guitar, backing vocals). Each member of the family group is known by his middle name (second given name) as opposed to his first given name.[1]\n\nThe band's early music was an upbeat blend of southern rock and blues influences but the band has gradually expanded their sound to include a variety of genres and a more alternative rock or arena rock sound. Kings of Leon achieved initial success in the United Kingdom with nine Top 40 singles, two BRIT Awards in 2008, and all three of the band's albums at the time peaking in the top five of the UK Albums Chart. Their third album Because of the Times also reached the #1 spot. After the release of Only by the Night in September 2008 they finally achieved chart success in their native United States. The singles &quot;Sex on Fire&quot;, &quot;Use Somebody&quot; and &quot;Notion&quot; all peaked at #1 on the Hot Modern Rock Tracks. The album itself was their first ever platinum-selling album in the United States. It was the best selling album of 2008 in Australia, being certified nine-times Platinum. \n\n\n\n\n\n\nOnly By The Night 2008\n\n\nOnly by the Night is the fourth studio album by American rock band Kings of Leon, released worldwide in September 2008. Writing for the band's fourth album commenced just days after the release of their third, Because of the Times. The album was recorded by producers Angelo Petraglia and Jacquire King through February 2008 in Nashville's Blackbird Studios.\n\nOnly by the Night experienced remarkable commercial success, peaking inside the top 10 of over 10 different countries. The album was certified the best-selling album in Australia, certified nine times platinum. It also went on to be the Highest selling album of 2008 in Australia and the third best selling album of 2008 in the UK also winning two Brit Awards.[1] Furthermore, two singles from the album have found high chartings, &quot;Sex on Fire&quot; coming in at number one in Ireland, the UK, Australia, and on the United States' Hot Modern Rock Tracks, and at number two in New Zealand. The album's second single &quot;Use Somebody&quot; also charted at number two in the UK, and at number two in Australia, along with being the bands first top 10 hit in the U.S. The album was nominated for Best Rock Album at the 51st Grammy Awards with the song &quot;Sex on Fire&quot; receiving two nominations itself.[2]\n\n&quot;Sex on Fire&quot; came number one in the Triple J Hottest 100, 2008, &quot;Use Somebody&quot; number three, &quot;Closer&quot; number 24 and &quot;Crawl&quot; number 70.\n\nIn September 2007, lead singer Caleb Followill confirmed to NME that tracks were already being worked on for a fourth album,[3] only a few days after the release of the band's third album, Because of the Times. Recording began in February 2008 in Nashville's Blackbird Studios. On June 23, 2008, the release date of September 22, 2008 was set, and also the new title was announced.\n\n&quot;Crawl&quot; was released via the band's website as a free download for a short time, although it was not the first proper single. The first single &quot;Sex on Fire&quot;, was released on 15 September 2008. The same day, music website Last.fm was the first to make the entire album available for streaming.[4] The music video for &quot;Sex on Fire&quot; was later made available to stream on their website andchannel. The song &quot;Use Somebody&quot; was announced as the second single, which was released in December 2008. The song was a massive hit in the United States, peaking at #4 on the Billboard Hot 100, and was a hit in the UK, Australia and several other countries. The third single released from the album was &quot;Revelry&quot;, released on 2 March 2009.\n\n&quot;Notion&quot; is the fourth single from the album. The video was released on June 1 and the song appear on radios on June 29.[5] The song has been another success from the group, peaking at #1 on the Billboard Alternative Songs.\n\nIn Australia, the song &quot;Manhattan&quot; was released to radio as the fourth single. The song spent four weeks on the singles chart and peaked at number 38[6] and reached number two on the National Airplay Chart.[7] The song has also had heavy rotation on UK radio station's such as Xfm.\n\nThe album was met with mixed reviews. Metacritic's average rating settled on a 63/100,[8] counting a drastic range of ratings between North America and UK press. The U.S. online publications Pitchfork Media, PopMatters and JustPressPlay gave the album a 3.8/10, 2/10 and 4/10 respectively, while the album received ratings of 5/5 and 4.5/5 from the UK's The Observer and Virgin Media. Record sales showed it chasing Coldplay's Viva la Vida or Death and All His Friends for the fastest selling album of the year in Ireland and the UK.[9]\n\nOnly by the Night received a nomination for Best Rock Album at the 51st Grammy Awards with the single &quot;Sex on Fire&quot; receiving two nominations for Best Rock Performance by a Duo or Group with Vocal and Best Rock Song.[2] &quot;Sex on Fire&quot; was awarded with the Grammy for Best Rock Performance by a Duo or Group with Vocals on February 8.\n\nAt the 52nd Grammy Awards the song &quot;Use Somebody&quot; won the Record of the Year, Best Rock Song and the Best Rock Performance by a Duo or Group with Vocal.\n\nThe album was also awarded &quot;2008 Album of the Year&quot; by the UK's Q Magazine,[10] as well as Rolling Stone voting it as the 20th best album out of their top 50 Best Albums of 2008.[11] The album was also awarded Best International Album at the BRIT Awards and the Juno Awards.\n\nAt the end of September 2008, the album entered the UK Albums Chart at number one, with first week sales of over 220,000 copies.[12] In February 2009, it was announced that Only by the Night is currently the biggest selling digital album of all-time in the UK, surpassing Amy Winehouse's Back to Black. The album managed three separate number one runs over two years, achieving 5x Platinum BPI certification with sales of over 1.5 millions . In the UK, Only By The Night has spent over a year in the charts, without dropping out of the top 22. Sales for 2008 was 1,181,640 and a similar level of 1,078,555 for 2009.[13]\n\nIn Australia, the album has been certified 8x Platinum, selling over 560,000 copies.[14] The album was the highest selling album of 2008 in Australia.[15] The album has also been a hit in New Zealand, spending over thirty consecutive weeks in the top ten, including nine non-consecutive weeks at number one. It finished 2008 as the second highest selling album and has been certified 4x Platinum by RIANZ.[16]\n\nIn South Africa, the album climbed to a peak of #2 being kept off the top spot by the South African release of Now That's What I Call Music! 50.[17]\n\nIn the U.S. the album debuted at number five on the Billboard 200, but fell to twenty the following week. It then dropped as low as seventy-eight, but then gradually moved back up the chart. After almost fifty weeks on the chart, the album actually managed to beat its debut position, peaking at #4. It has also managed to achieve a platinum certification, and has sold over 1,867,317 copies in the U.S.[18]. Worldwide sales of the album exceed 6.2 million copies, according to a press release for their 2010 summer gig at Hyde Park which will see the band play to its largest headlining audience of 65,000 in London.[19]\n\nIFPI cetifications Only by the night in Europe is 3 times platinum.\n\n\n\n\n\nTracks:\n\n1.\t&quot;Closer&quot;  \n2.\t&quot;Crawl&quot;  \n3.\t&quot;Sex on Fire&quot;  \n4.\t&quot;Use Somebody&quot;  \n5.\t&quot;Manhattan&quot;  \n6.\t&quot;Revelry&quot;  \n7.\t&quot;17&quot;  \n8.\t&quot;Notion&quot;  \n9.\t&quot;I Want You&quot;  \n10.\t&quot;Be Somebody&quot;  \n11.\t&quot;Cold Desert&quot;  \n\n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:b0c685c9e1b5477f8710ec4c3b7c8d2bde4bff15","amp;dn":"Kings+of+Leon+-+Only+By+The+Night+2008+%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0c685c9e1b5477f8710ec4c3b7c8d2bde4bff15","infoHashBuffer":{"type":"Buffer","data":[176,198,133,201,225,181,71,127,135,16,236,76,59,124,141,43,222,75,255,21]},"announce":[],"urlList":[]}}