{"title":"Orchestral Tools - Berlin Woodwinds [KONTAKT]","uid":8960674,"size":57271472128,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b0eb2427aa342d16a9bd4234d9bf7e7437e22d26&amp;dn=Orchestral+Tools+-+Berlin+Woodwinds+%5BKONTAKT%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":8,"uploader":"NewSky006","files":-1,"time":1380104055,"description":"Torrent Info:\n==============\n\nThis is not my own torrent!\n\n\nTorrent Contents:\n==================\n\n1 ISO file, containing a Kontakt library\n\n\nInstallation:\n==============\n\nMount or extract the ISO, then add the mounted/extracted folder as a library to (cracked) Kontakt.\n\n\nProduct Info:\n==============\n\nBerlin Woodwinds is the first sample library to offer a complete orchestral woodwind section allowing the composer to write for up to woodwinds in 2s (meaning 2 flutes, 2 oboes, 2 clarinets and 2 bassoons), with doubles (Piccolo and English horn). Theres also a third flute. BWW is different from other libraries where at most 2 flutes or 2 oboes might have been recorded, but not multiple players to create a complete symphonic section. Previously, if you wanted two of anything, you would either have to use the transposition trick with one instrument to create the second, or use the same instrument from a different library and hoped they matched in stage position and room sound.\n\nFull details Orchestral Tools Berlin Woodwinds V1.1 KONTAKT and get links download please reading below.\nBWWs approach eliminates this time consuming action.\n\nFrom a writing/production perspective, its not just that you have multiple players per woodwind family, its that you have totally different players within each woodwind family. As you play though each family (flutes, oboes, clarinet, bassoon) you hear how different one player sounds from another on the same instrument! And for me, this is a good thing because if youre doing a piece with one just one flute, for example, you can now audition to see which player performs the part the best for overall sound and for blending with whatever string and brass libraries youre now using.\n\nThus, BWW offers a decided writing/production advantage thats worth your consideration.\n\nInstrumentation\nThere are three flutes allowing for an expanded section, plus piccolo.\n\nThere two oboes plus English horn.\n\nThere are two clarinets, three clarinets recorded in unison, but no bass clarinet.\n\nThere are two independent bassoons, but no contrabassoon.\n\nTherefore, to complete the BWW woodwind section, a bass clarinet (usually doubled by Clarinet 2) and contrabassoon (usually doubled by Bassoon 2) are needed. My understanding is that these two instruments are being recorded in September 2012. Meanwhile, if you have the full version of Kontakt, youll find a lite version of a bass clarinet and contrabassoon in the Factory Library.\n\nThat said, in terms of orchestral writing, whats been recorded is more than adequate for most writing situations. Woodwind sections do expand to woods in 3s (Wagner, John Williams) and 4s (Mahler). If extras are needed, one can use the transpose trick (for oboe, clarinet or bassoon), reinsert a BWW instrument for the third part, or use an instrument from another library.\n\nI should point out that many of the woodwind combinations outlined in Professional Orchestration 2B, Orchestrating the Melody With the Woodwind and Brass Sections, are totally doable with BWW.\n\nTrue Legato for all instruments and ensembles\nPowerful 8x RR Staccato and Staccatissimo Patches\nPlayable Runs\nDIVISI with 2nd and up to 3rd instruments\nTrills Orchestrator with up to never before recorded 5th trills\nRUNS BUILDER\nUp to 3 different vibrato styles\nControllable key and wind noises\nARTICULATIONS PERFORMER: Switch and x-fade through the articulations and create your custom keyswitch sets!\n100 GB of samples (53 GB compressed)\n24Bit / 48KHz Patches\nWorks with the free Kontakt Player 5 or Kontakt 5","torrent":{"xt":"urn:btih:b0eb2427aa342d16a9bd4234d9bf7e7437e22d26","amp;dn":"Orchestral+Tools+-+Berlin+Woodwinds+%5BKONTAKT%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0eb2427aa342d16a9bd4234d9bf7e7437e22d26","infoHashBuffer":{"type":"Buffer","data":[176,235,36,39,170,52,45,22,169,189,66,52,217,191,126,116,55,226,45,38]},"announce":[],"urlList":[]}}