{"title":"The Very Best of the Spinners 320cbr 1994 R&amp;B Soul ","uid":9474956,"size":95876064,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b1863dac400fa39eb22d2f2998526b2eec4d98f4&amp;dn=The+Very+Best+of+the+Spinners+320cbr+1994+R%26amp%3BB+Soul+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"Big-Papi","files":-1,"time":1389669354,"description":"Source: 1994 CD\n\nThe Very Best of the Spinners 320cbr (Big Papi) 1994 R&amp;B Soul \n\n\n\n\nBy Paul Tognetti VINE VOICE\nOriginally known as The Detroit Spinners, this group was discovered by Moonglows great Harvey Fuqua around 1960. In fact their very first release &quot;Thats What Girls Are Made For&quot; (sadly not included in this collection) was done in The Moonglows style. The Spinners were signed by Berry Gordy in the early 60's but struggled mightily to find their sound. They released a dozen or so singles before finally hitting paydirt in 1970 with &quot;It's A Shame&quot;. Convinced that the group needed to go in an entirely different direction, good friend Aretha Franklin convinced they to leave Motown and sign with Atlantic Records where she introduced them to producer Thom Bell. This was a match made in heaven. And the rest is history.\n\nOver the next dozen years or so The Spinners would place about two dozen songs on Billboards Hot 100. Of these, seven made the Top Ten including the 1974 number one smash with Dionne Warwick &quot;Then Came You&quot;. The Spinners turned out to be one the most consistant chart performers of the decade. This superb collection from Rhino records includes fifteen of the very best tracks including &quot;It's A Shame&quot;, &quot;Could It Be I'm Falling In Love&quot;, &quot;The Rubberband Man&quot; and two medleys from the early 80's &quot;Working My Way Back To You/Forgive Me Girl&quot; and &quot;Cupid/I've Loved You For A Long Time&quot;. But the entire CD is a delight and I don't believe there is a mediocre track on the disc. As per usual, Rhino has included a neat eight page booklet with the history of the group and photos.\n\nWhere are they now? According to their official website, The Spinners continue to perform in small venues around the country. Unfortunately, lead singer John Edwards fell ill in 2002. As a result, the group contacted their lead singer from the Motown days G.C. Cameron who agreed to rejoin the group after some 30 years. If you grew up in the 1970's &quot;The Very Best of The Spinners&quot; should be an essential part of your music collection. Very highly recommended!!!","torrent":{"xt":"urn:btih:b1863dac400fa39eb22d2f2998526b2eec4d98f4","amp;dn":"The+Very+Best+of+the+Spinners+320cbr+1994+R%26amp%3BB+Soul+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1863dac400fa39eb22d2f2998526b2eec4d98f4","infoHashBuffer":{"type":"Buffer","data":[177,134,61,172,64,15,163,158,178,45,47,41,152,82,107,46,236,77,152,244]},"announce":[],"urlList":[]}}