{"title":"Colleen Green - I Want to Grow Up [2015][FLAC]","uid":11693592,"size":263524478,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b1a2edc4faa06c6ddf28cea30a6a7f6e75886c2b&amp;dn=Colleen+Green+-+I+Want+to+Grow+Up+%5B2015%5D%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":3,"uploader":"SmashAndGrab","files":13,"time":1423624050,"description":"Colleen Green - I Want to Grow Up [2015][FLAC]\n\nReleased ................ 2015\nSource .................. CD\nGenre ................... Punk\nCodec ................... FLAC\nBit Depth ............... 16 bits\nSampling Rate ........... 44.1 KHz\nLog ..................... Yes\nCue ..................... Yes\n\n01 - I Want to Grow Up\n02 - Wild One\n03 - TV\n04 - Pay Attention\n05 - Deeper Than Love\n06 - Things That Are Bad for Me (Pt. I)\n07 - Things That Are Bad for Me (Pt. II)\n08 - Some People\n09 - Grind My Teeth\n10 - Whatever I Want\n\nAs a prospect it can be terrifying, sad, and worst of all, inevitable. But on I Want to Grow Up, her second album for Hardly Art, Colleen Green lets us know that we don't have to go it alone. This latest collection of songs follows a newly 30-year-old Green as she carefully navigates a minefield of emotion. Her firm belief in true love is challenged by the inner turmoil caused by entering modern adulthood, but that doesn't mean that her faith is defeated. With a nod to her heroes, sentimental SoCal punks The Descendents, Green too wonders what it will be like when she gets old. Throughout songs such as &quot;Some People,&quot; &quot;Deeper Than Love,&quot; and the illustrative title track, the listener has no choice but to feel the sympathetic growing pains of revelatory maturation and the anxieties that come along with it. Sonically the album is a major change for the LA-based songwriter, who has come to be known for her homemade recordings and merchandise. Her past offerings have been purely Green; testaments to her self-sufficiency and, perhaps, trepidation. This time, she's got a little help from her friends: the full band heard here includes JEFF the Brotherhood's Jake Orrall and Diarrhea Planet's Casey Weissbuch, who collaborated with Green over ten days at Sputnik Sound in Nashville, TN. I Want to Grow Up is an experience, not unlike life: questioning, learning, taking risks. And in true CG fashion, a quote from a beloved 90s film seems the perfect summation: &quot;Understanding is reached only after confrontation.&quot;","torrent":{"xt":"urn:btih:b1a2edc4faa06c6ddf28cea30a6a7f6e75886c2b","amp;dn":"Colleen+Green+-+I+Want+to+Grow+Up+%5B2015%5D%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1a2edc4faa06c6ddf28cea30a6a7f6e75886c2b","infoHashBuffer":{"type":"Buffer","data":[177,162,237,196,250,160,108,109,223,40,206,163,10,106,127,110,117,136,108,43]},"announce":[],"urlList":[]}}