{"title":"DISNEYS-THE LION KING TRILOGY-BOXSET IN XVID BY WINKER","uid":5310754,"size":2153751949,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b1a7daeaf42fea5d94e0541439e5efb3e058e402&amp;dn=DISNEYS-THE+LION+KING+TRILOGY-BOXSET+IN+XVID+BY+WINKER&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":2,"uploader":"alanwatson","files":-1,"time":1264552684,"description":"The Lion King:  Disney's epic coming-of-age saga tells of the love between a proud lion ruler, Mufasa and his son Simba - a naive and curious cub who &quot;just can't wait to be king.&quot; But Simba's envious Uncle Scar has other plans, and his scheming for the throne leads to Simba's exile from the kingdom he should rightfully rule. Befriended by the hilarious warthog, Pumbaa and his manic meerkat companion, Timon, Simba forgets his regal responsibilities and adopts a carefree lifestyle of &quot;Hakuna Matata.&quot;\n\nThe Lion King 2: Simba's Pride Kiara, Simba's playfully headstrong daughter and heir to the Pride Lands, is on the prowl for adventure. Escaping her bumbling baby-sitters Timon and Pumbaa, Kiara runs off to the Outlands, which are strictly off limits. There she meets the mischievous Kovu - a young cub chosen to walk in Scar's paw prints. The rift between the Outlanders and Simba's pride deepens as Kiara and Kovu's feeling for each other grow. But will love find a way to bring their very different worlds together as one?\n\nThe Lion King 3: Hakuna Matata Timon the meerkat and Pumbaa the warthog retell the story of The Lion King from their own unique perspective!","torrent":{"xt":"urn:btih:b1a7daeaf42fea5d94e0541439e5efb3e058e402","amp;dn":"DISNEYS-THE+LION+KING+TRILOGY-BOXSET+IN+XVID+BY+WINKER","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1a7daeaf42fea5d94e0541439e5efb3e058e402","infoHashBuffer":{"type":"Buffer","data":[177,167,218,234,244,47,234,93,148,224,84,20,57,229,239,179,224,88,228,2]},"announce":[],"urlList":[]}}