{"title":"Viking Age Yorkshire","uid":15749568,"size":1234534,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b1ade70427ab315b27c6025d4fc78fb9bc3b09c1&amp;dn=Viking+Age+Yorkshire&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"marty14","files":1,"time":1473016592,"description":"Viking Age Yorkshire - Matthew Townend [epub]\r\n\r\nIn 866, the city of York was captured by a ‘Great Army’ of Viking warriors. Ten years later, according to the Anglo-Saxon Chronicle, the Viking army made the transition from warfare to settlement, as their leader ‘shared out the land of the Northumbrians, and they proceeded to plough and to support themselves’. This conquest and settlement marked the beginning of two centuries of Scandinavian dominance in Yorkshire, a defining period in the county’s history. Viking kings reigned in York until 954, when the last Scandinavian ruler, Eric Bloodaxe, was driven out and killed. But even after Yorkshire had come under the rule of the southern kings of England, Scandinavian culture remained extremely strong, and imparted a distinctive and enduring character to the region.\r\n\r\nThis book offers the first full-length study of Yorkshire’s Viking centuries, from the fall of York to the Norman Conquest. It gives sustained attention not only to the written sources for the period, but also to the evidence of names, language, art, and archaeology, and it integrates these various sources to present a detailed reconstruction of life and politics in Viking Age Yorkshire, in both the city of York and the surrounding countryside – from the major upheavals of conquest and conversion to the complex issues of identity and assimilation.\r\n\r\nMatthew Townend is Reader in the Department of English and Related Literature, and Centre for Medieval Studies, University of York. His previous books include 'Language and History in Viking Age England' (2002) and 'The Vikings and Victorian Lakeland: the Norse medievalism of W.G. Collingwood and his contemporaries' (2009)","torrent":{"xt":"urn:btih:b1ade70427ab315b27c6025d4fc78fb9bc3b09c1","amp;dn":"Viking+Age+Yorkshire","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1ade70427ab315b27c6025d4fc78fb9bc3b09c1","infoHashBuffer":{"type":"Buffer","data":[177,173,231,4,39,171,49,91,39,198,2,93,79,199,143,185,188,59,9,193]},"announce":[],"urlList":[]}}