{"title":"Mortal Instruments Series by Cassandra Clare","uid":8122776,"size":2691549,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b1f76914d51e62baddbf13ca21a3db12f0b17547&amp;dn=Mortal+Instruments+Series+by+Cassandra+Clare&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"NewSky000","files":6,"time":1360428107,"description":"Title: Mortal Instruments Series\n\nAuthor: Cassandra Clare\n\nBook(s): 5\n\nFormat: eBook (.epub)\n\nAdditional Info: Readme File\n\n*Calibre is a great free tool for managing ebooks. Link: http://www.calibre-ebook.com/\n\nGenres: Fantasy, Paranormal, Romance, Adventure\n\nSummary:\n\nWhen fifteen-year-old Clary Fray heads out to the Pandemonium Club in New York City, she hardly expects to witness a murder -- much less a murder committed by three teenagers covered with strange tattoos and brandishing bizarre weapons. Then the body disappears into thin air. It's hard to call the police when the murderers are invisible to everyone else and when there is nothing -- not even a smear of blood -- to show that a boy has died. Or was he a boy?\n\nThis is Clary's first meeting with the Shadowhunters, warriors dedicated to ridding the earth of demons. It's also her first encounter with Jace, a Shadowhunter who looks a little like an angel and acts a lot like a jerk. Within twenty-four hours Clary is pulled into Jace's world with a vengeance, when her mother disappears and Clary herself is attacked by a demon. But why would demons be interested in ordinary mundanes like Clary and her mother? And how did Clary suddenly get the Sight? The Shadowhunters would like to know. . . . \n\nExotic and gritty, exhilarating and utterly gripping, Cassandra Clare's ferociously entertaining fantasy takes readers on a wild ride that they will never want to end. - Goodreads Summary of City of Bones (Mortal Instruments #1)\n\nNote: A great series to read, mainly for young adults. Now a major motion picture! And book 6 will be coming out soon, I'll be sure to get it!\n\nCompatibility: Most eReaders\n\nCovers: Yes\n\nMetadata: Yes\n\nAny requests? Concerns? Comments? Anything of the sort? Then plz view readme for support link.\n\n\nPlease seed and thanks for downloading!\n\n\n\nBy: MastermindTTA ~ Thanks for the support!","torrent":{"xt":"urn:btih:b1f76914d51e62baddbf13ca21a3db12f0b17547","amp;dn":"Mortal+Instruments+Series+by+Cassandra+Clare","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1f76914d51e62baddbf13ca21a3db12f0b17547","infoHashBuffer":{"type":"Buffer","data":[177,247,105,20,213,30,98,186,221,191,19,202,33,163,219,18,240,177,117,71]},"announce":[],"urlList":[]}}