{"title":"Metaphysics: Very Short Introduction (2012) epub","uid":9814098,"size":3890093,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b261dc0f8a18b3d1f92dbfe26ecbc64ed900db3d&amp;dn=Metaphysics%3A+Very+Short+Introduction+%282012%29+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"bookzilla","files":1,"time":1395595903,"description":"Metaphysics is traditionally one of the four main branches of philosophy, alongside ethics, logic and epistemology. It is an area that continues to attract and fascinate many people, even though it is generally thought to be highly complex and abstract. For some it is associated with the mystical or religious. For others it is known through the metaphysical poets who talk of love and spirituality. This Very Short Introduction goes right to the heart of the matter, getting to the basic and most important questions of metaphysical thought in order to understand the theory: What are objects? Do colors and shapes have some form of independent existence? Is the whole just a sum of the parts? What is it for one thing to cause another rather than just being associated with it? What is possible? Does time pass? By using simple questions to initiate thought about the basic issues around substance, properties, changes, causes, possibilities, time, personal identity, nothingness, and consciousness, Stephen Mumford provides a clear and down-to-earth path through this analytical tradition at the core of philosophical thought.\n","torrent":{"xt":"urn:btih:b261dc0f8a18b3d1f92dbfe26ecbc64ed900db3d","amp;dn":"Metaphysics%3A+Very+Short+Introduction+%282012%29+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b261dc0f8a18b3d1f92dbfe26ecbc64ed900db3d","infoHashBuffer":{"type":"Buffer","data":[178,97,220,15,138,24,179,209,249,45,191,226,110,203,198,78,217,0,219,61]},"announce":[],"urlList":[]}}