{"title":"The Politically Incorrect Guide to the Constitution - Kevin Gutz","uid":9441803,"size":5706612,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b262acae4b2112775b4997e66f9c8f43dc04b19f&amp;dn=The+Politically+Incorrect+Guide+to+the+Constitution+-+Kevin+Gutz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"420weedman","files":-1,"time":1389024114,"description":"The Constitution of the United States created a representative republic marked by federalism and the separation of powers. Yet numerous federal judges--led by the Supreme Court--have used the Constitution as a blank check to substitute their own views on hot-button issues such as abortion, capital punishment, and same sex marriage for perfectly constitutional laws enacted by We the People through our elected representatives. \nNow, The Politically Incorrect Guide(tm) to the Constitution shows that there is very little relationship between the Constitution as ratified by the thirteen original states more than two centuries ago and the &quot;constitutional law&quot; imposed upon us since then. Instead of the system of state-level decision makers and elected officials the Constitution was intended to create, judges have given us a highly centralized system in which bureaucrats and appointed--not elected--officials make most of the important policies. \nIn The Politically Incorrect Guide(tm) to the Constitution, Professor Kevin Gutzman, who holds advanced degrees in both law and American history: \n* explains how the Constitution was understood by the founders who wrote it and the people who ratified it * follows the Supreme Court as it uses the fig leaf of the Constitution to cover its naked usurpation of the rights and powers the Constitution explicitly reserves to the states and to the people * shows how we slid from the Constitution's republican federal government, with its very limited powers, to an unrepublican &quot;judgeocracy&quot; with limitless powers * reveals how huge swaths of American law and society were remade in the wake of Supreme Court rulings * reveals how the Fourteenth Amendment has been twisted to use the Bill of Rights as a check on state power instead of on federal power, as originally intended * exposes the radical inconsistency between &quot;constitutional law&quot; and the rule of law * contends that the judges who receive the most attention in history books are celebrated for acting against the Constitution rather than for it. \nAs Professor Gutzman shows, constitutional law is supposed to apply the Constitution's plain meaning to prevent judges, presidents, and congresses from overstepping their authority. If we want to return to the founding fathers' vision of the Republic, if we want the Constitution enforced in the way it was explained to the people at the time of its ratification, then we have to overcome the &quot;received wisdom&quot; about what constitutional law is. The Politically Incorrect Guide(tm) to the Constitution is an important step in that direction.","torrent":{"xt":"urn:btih:b262acae4b2112775b4997e66f9c8f43dc04b19f","amp;dn":"The+Politically+Incorrect+Guide+to+the+Constitution+-+Kevin+Gutz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b262acae4b2112775b4997e66f9c8f43dc04b19f","infoHashBuffer":{"type":"Buffer","data":[178,98,172,174,75,33,18,119,91,73,151,230,111,156,143,67,220,4,177,159]},"announce":[],"urlList":[]}}