{"title":"WILEY MEGAPROJECT MANAGEMENT LESSONS ON RISK AND PROJECT MANAGEM","uid":9523913,"size":3451345,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b2718d79cf6cd58de0fe72008ffb564c4ecde970&amp;dn=WILEY+MEGAPROJECT+MANAGEMENT+LESSONS+ON+RISK+AND+PROJECT+MANAGEM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":".SceNe.","files":2,"time":1390704153,"description":"RELEASE\n\nTITLE: MEGAPROJECT MANAGEMENT: LESSONS ON RISK AND PROJECT\nMANAGEMENT FROM THE BIG DIG\nPUBLISHER: WILEY LANGUAGE: ENGLISH\nLINK:RELEASE TYPE: RETAIL\nFORMAT: PDF RELEASE DATE: 2014.01.24\nISBN: 9781118115473 STORE DATE: 2013\nSAVED.MONEY: 82 DOLLAR DISKCOUNT: 01 x 05MB\nAUTHOR: VIRGINIA A. GREIMAN\n\nBOOK\n\nProject management lessons learned on the Big Dig, America's\nbiggest megaproject, by a core member responsible for its daily\noperations\n\nIn Megaproject Management, a central member of the Big Dig team\nreveals the numerous risks, challenges, and accomplishments of\nthe most complex urban infrastructure project in the history of\nthe United States. Drawing on personal experience and interviews\nwith project engineers, executive oversight commission officials\nand core managers, the author, a former deputy counsel and risk\nmanager for the Big Dig, develops new insights as she describes\nthe realities of day-to-day management of the project from a\nproject manager's perspective\nThe book incorporates both theory and practice and is therefore\nhighly recommended to policymakers, academics, and project\nmanagement practitioners. Focusing on lessons learned, this\ninsightful coursebook presents the Big Dig as a massive case\nstudy in the management of risk, cost, and schedule, particularly\nthe interrelation of technical, legal, political, and social\nfactors. It provides an analysis of the difficulties in managing\nmegaprojects during each phase and over the life span of the\nproject, while delivering useful lessons on why projects go wrong\nand what can be done to prevent project failure. It also offers\nnew ideas to enhance project management performance and\ninnovation in our global society\nThis unique guide: Defines megaproject characteristics and\nframeworks Reviews the Big Dig's history, stakeholders, and\ngovernance Examines the project's management scope, scheduling\nand cost management-including project delays and cost overruns\nAnalyzes the Big Dig's risk management and quality management\nReveals how to build a sustainable project through integration\nand change introduction","torrent":{"xt":"urn:btih:b2718d79cf6cd58de0fe72008ffb564c4ecde970","amp;dn":"WILEY+MEGAPROJECT+MANAGEMENT+LESSONS+ON+RISK+AND+PROJECT+MANAGEM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2718d79cf6cd58de0fe72008ffb564c4ecde970","infoHashBuffer":{"type":"Buffer","data":[178,113,141,121,207,108,213,141,224,254,114,0,143,251,86,76,78,205,233,112]},"announce":[],"urlList":[]}}