{"title":"Adobe Photoshop Lightroom 5 2 RC (x86/x64) Incl Keymaker-CORE","uid":8768737,"size":840774358,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b2bde7a1cfecc5aa3774a65d224ffa719b103914&amp;dn=Adobe+Photoshop+Lightroom+5+2+RC+%28x86%2Fx64%29+Incl+Keymaker-CORE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"AN0NYMOUS142857","files":2,"time":1375398467,"description":"\nAdobe Photoshop Lightroom 5 is the professional photographer s essential software, providing comprehensive set of digital photography tools, from powerfully simple one-click adjustments to cutting-edge advanced controls. It is easy to use application for adjusting, managing, and presenting large volumes of digital photographs. Organize, view, and make adjustments to video clips. Play and trim clips, extract still images from them, or adjust clips with the Quick Develop tool. Create images that inspire, inform, and delight. Create beautiful photo books from your images with a variety of easy-to-use templates included in Lightroom. Upload your book for printing with just a few clicks. Receive 20% off from Blurb on your first book created using Photoshop Lightroom. Bring out all the detail that your camera captures in dark shadows and bright highlights.\n\nAdobe Photoshop Lightroom lets create incredible images that move your audience. Experiment fearlessly with state-of-the-art nondestructive editing tools. Easily manage all your images. And showcase your work in elegant print layouts, slide shows, and web galleries, as well as on popular photo-sharing sites. All from within one fast, intuitive application.\n\nNow you have more power than ever before to create great images in challenging light. Find and group images by location, easily assign locations to images, or plot a photo journey. Automatically display location data from GPS-enabled cameras and camera phones.\n\nOrganize effortlessly\n  Automatically organize photos using Smart Collections\n  Work with high-quality previews of offline images from multiple libraries and drives\n  Automatically import and process high-volume shoots\n  Use custom keywords to organize photos Enhanced\n  Automatically rename files on import and convert to universal Digital Negative (DNG) format\n  Manage photos and volumes even when they re offline\n  Quickly find any photo with powerful sorting and filtering\n  Apply custom presets to images on import/export\n  Access and edit a comprehensive set of metadata fields\n  Browse groups, compare photos, and zoom in on details\n  Create virtual copies of photos to save hard-disk space\n\nCorrect, enhance, edit\n  Target specific areas of a photo for dodging and burning\n  Expand your workspace across multiple monitors\n  Enjoy state-of-the-art 64-bit memory handling\n  Tightly integrate with Adobe Photoshop\n  Easily compare before and after versions of photos\n  Precisely convert color to black and white\n  Eliminate dust, specks, and red eye\n  Retrace your editing steps to return to any version of a photo\n\nShowcase your talent\n  Easily transfer images to popular photo-sharing sites\n  Access a rich community of export plug-ins and web gallery styles at the Lightroom Exchange\n  Print more efficiently with flexible and customizable templates\n  Create web galleries with no coding required\n  Sharpen photos when you output to print or the web\n  Stamp your photos with metadata on output\n  Compose sophisticated slide shows with music\n\nChanges in Adobe Photoshop Lightroom 5:\n* Advanced Healing Brush   Easily remove objects and fix defects   even those with irregular shapes such as threads or lint with a single brush stroke. Take precise control over what s being removed as you make unwanted objects just disappear.\n* Upright   Straighten tilted images with a single click. Upright analyzes images and detects skewed horizontal or vertical lines. You choose one of four correction methods, and Upright can even straighten images where the horizon is hidden.\n* Radial Gradient   Lead your viewer s eye through your images with more flexibility and control. The radial gradient tool lets you create off-center vignette effects, or multiple vignette areas within a single image.\n* Offline editing with Smart Previews   Easily work with images without bringing your entire library with you. Just generate smaller stand-in files called Smart Previews. Make adjustments or metadata additions to Smart Previews and your changes will be automatically applied to the full-size originals later.\n* Video slideshow sharing   Easily share your work in elegant video slideshows. Combine still images, video clips, and music in creative HD videos that can be viewed on almost any computer or device.\n* Improved photo book creation   Create beautiful photo books from your images. Lightroom includes a variety of easy-to-use book templates, and now you can edit them to create a customized look. Upload your book for printing with just a few clicks.\n\nHomepage  &lt;a href=&quot; http://www.adobe.com/products/photoshop-lightroom.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.adobe.com/products/photoshop-lightroom.html&lt;/a&gt;\n","torrent":{"xt":"urn:btih:b2bde7a1cfecc5aa3774a65d224ffa719b103914","amp;dn":"Adobe+Photoshop+Lightroom+5+2+RC+%28x86%2Fx64%29+Incl+Keymaker-CORE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2bde7a1cfecc5aa3774a65d224ffa719b103914","infoHashBuffer":{"type":"Buffer","data":[178,189,231,161,207,236,197,170,55,116,166,93,34,79,250,113,155,16,57,20]},"announce":[],"urlList":[]}}