{"title":"Band of Horses - Everything All the Time 2006","uid":6995290,"size":265734406,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b30551c57d93facd325a68d7d8ca57c9d37036ab&amp;dn=Band+of+Horses+-+Everything+All+the+Time+2006&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"barber9","files":-1,"time":1327853740,"description":"Ben Bridwell (vocals, guitar) formed Band of Horses in 2004 after the break-up of his previous band, Carissa's Wierd, along with bassist Chris Early and drummer Tim Meinig. They were soon joined by former Carissa's Wierd bandleader Mat Brooke (guitar, vocals). The band initially received attention from Sub Pop after opening for Iron &amp; Wine during Seattle area shows. In 2005, the band released the Tour EP, which was sold at shows and on Sub Pop's website.\nTheir first full-length album, Everything All the Time, was recorded in 2005 with producer Phil Ek and released by Sub Pop on March 21, 2006. It features the band's original four-piece lineup, although both Tim Meinig and Sera Cahoone receive drumming credits. The album included new versions of five of the six songs from the Tour EP along with five brand new songs. It was a minor hit in Scandinavia, entering the lower reaches of the Sweden and Norway album charts. Ben Bridwell explained the sound of the album, 'I thought before recording that I really wanted an ELO-sounding record, with strings and keyboards and synths, but then, as we got closer to it, we wanted to take a more raw approach.'\nBridwell found that there was a personality clash between himself and Meinig and Early and the two left soon after the recording of the album. Ben explained his side of the story, 'All of a sudden I was with two guys I didn't really even know, they were nice guys, there just wasn't a personality match.' For the subsequent tour, Joe Arnone (guitar and keyboards), Rob Hampton (bass and guitar) and Creighton Barrett (drums) were brought in to play with Bridwell and Brooke.\nEverything All the Time's first single was The Funeral, which has been used in numerous television series, films, video games, and advertisements. On July 13, 2006, the band performed the song on the Late Show with David Letterman without Brooke, who had left the band. He subsequently formed Grand Archives, who have since signed to Sub Pop and released two albums. (wikipedia)\n\n- - -\n\nBand of Horses - Everything all the time 2006\n(Seattle, Wash. Sub Pop)\n\n 1. The first song \n 2. Wicked Gil \n 3. Our swords \n 4. The funeral \n 5. Part one \n 6. The great Salt Lake \n 7. Weed party \n 8. I go to the barn because I like the \n 9. Monsters \n10. St. Augustine\n","torrent":{"xt":"urn:btih:b30551c57d93facd325a68d7d8ca57c9d37036ab","amp;dn":"Band+of+Horses+-+Everything+All+the+Time+2006","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b30551c57d93facd325a68d7d8ca57c9d37036ab","infoHashBuffer":{"type":"Buffer","data":[179,5,81,197,125,147,250,205,50,90,104,215,216,202,87,201,211,112,54,171]},"announce":[],"urlList":[]}}