{"title":"FCO - Fundamental Chess Openings (gnv64)","uid":9873407,"size":30753898,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b443c20ac193668b1abb5ad75e4ef446756fbb6c&amp;dn=FCO+-+Fundamental+Chess+Openings+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"gnv65","files":-1,"time":1396448340,"description":"FCO: Fundamental Chess Openings \nby Paul Van Der Sterren\nGambit Publications | November 2009 | ISBN-10: 1906454132 | PDF | 448 pages | 29.3 mb\n\nAfter MCO, ECO and BCO you have the FCO !\n\n* The perfect survival guide to the chess openings\n* All openings covered\n* Detailed verbal explanations of plans for both sides\n* Up-to-date and featuring many tips and recommendations\n* Insights into the 'character' of each opening\n* Written by one of the world's foremost opening experts\n\nThe first moves of a chess game define the nature of the whole struggle, as both players stake their claim to the critical squares and start to develop their plans. It is essential to play purposefully and to avoid falling into traps or reaching a position that you don't understand.\nThis is not a book that provides masses of variations to memorize. Paul van der Sterren instead offers a wealth of ideas and explanation, together with the basic variations of each and every opening. This knowledge will equip players to succeed in the opening up to good club level, and provide a superb grounding in opening play on which to build a more sophisticated repertoire. The strategies he explains will, unlike ever-changing chess opening theory, remain valid as long as chess is played, and so the time spent studying this book will be rewarded many times over.\n\nAbout the Author\nGrandmaster Paul van der Sterren has won the Dutch Championship on two occasions, and in 1993 reached the Candidates stage of the World Chess Championship. He is an internationally renowned chess writer and editor: he was one of the founding editors of New in Chess, for whose Yearbooks he has contributed more than 150 opening surveys.","torrent":{"xt":"urn:btih:b443c20ac193668b1abb5ad75e4ef446756fbb6c","amp;dn":"FCO+-+Fundamental+Chess+Openings+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b443c20ac193668b1abb5ad75e4ef446756fbb6c","infoHashBuffer":{"type":"Buffer","data":[180,67,194,10,193,147,102,139,26,187,90,215,94,78,244,70,117,111,187,108]},"announce":[],"urlList":[]}}