{"title":"Tedeschi Trucks Band-Revelator-2011-404","uid":6497620,"size":112382864,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b5322bebfe9a5443c2b8f3fc9579957aa96afee7&amp;dn=Tedeschi+Trucks+Band-Revelator-2011-404&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"soupucia","files":-1,"time":1309129363,"description":"Artist: Tedeschi Trucks Band\nAlbum: Revelator\nBitrate: 243kbps avg\nQuality: EAC Secure Mode / LAME 3.98.4 / -V0 / 44.100Khz\nLabel: Sony Masterworks\nGenre: Rock\nSize: 112.14 megs\nPlayTime: 1h 01min 23sec total\nRip Date: 2011-06-26\nStore Date: 2011-06-07\n\nTrack List:\n--------\n01. Come See About Me                3:50\n02. Don't Let Me Slide               5:04\n03. Midnight In Harlem               5:53\n04. Bound For Glory                  5:31\n05. Simple Things                    4:46\n06. Until You Remember               6:13\n07. Ball And Chain                   3:57\n08. These Walls                      6:02\n09. Learn How To Love                4:25\n10. Shrimp And Grits                 1:47\n11. Love Has Something Else To Say   5:57\n12. Shelter                          7:58\n\nRelease Notes:\n--------\nRevelator is the long-awaited, song-oriented debut album by the husband-wife\nteam of singer/guitarist Susan Tedeschi and guitarist Derek Trucks. Filled with\nsmoky, blues-dipped rockers and heart-stilling ballads that show off,\nrespectively, the gutsier and softer side of Tedeschi's vocal ability, plus a\nseries of emotive, story-telling solos shaped by Trucks's uncanny agility on\nslide-guitar, Revelator also serves to introduce the couple s new, 11-piece\nensemble Tedeschi Trucks Band.\n\nA dramatic leap forward for two of the music world's most dynamic performers,\nRevelator is a confident yet unforced triumph offering a cohesive vision: an\nidyllic, musical world in which the echoes of so many great traditions Delta\nblues and Memphis soul, Sixties rock and Seventies funk organically flow\ntogether, blending with an entirely original, modern sensibility.\n\nIn addition to the combined weight of Tedeschi and Trucks's equally renowned\nabilities, Revelator benefits from an impressive circle of talent that the two\nbrought together. Trucks co-produced the album with multi-Grammy-winning\nengineer Jim Scott, whose genre-bending credits include popular albums by the\nDixie Chicks, Johnny Cash, and the Red Hot Chili Peppers. Both Tedeschi and\nTrucks co-wrote the album's twelve new songs with an impressive list of\nexperienced songwriters, including Jeff Trott, John Leventhal, David Ryan Harris\nand Sonya Kitchell; Gary Louris and Oliver Wood of the Jayhawks and the Wood\nBrothers, respectively; and old friends like guitarists Doyle Bramhall II and\nEric Krasno (of Soulive), and band members Mike Mattison, Kofi Burbridge and\nOteil Burbridge.\n\nMost notably, Revelator features the newly formed Tedeschi Trucks Band, an\neleven-member ensemble overflowing with talent and musical familiarity. Brothers\nOteil Burbridge (noted for his years as bassist with the Allman Brothers Band)\nand Kofi Burbridge (longtime keyboardist/flutist with The Derek Trucks Band)\nhave joined forces with a pair of drummers J. J. Johnson and Tyler Greenwell,\ntrumpeter Maurice Brown, tenor saxophonist Kebbi Williams, trombonist Saunders\nSermons, and harmony singers Mark Rivers and Mike Mattison. (Additionally, Ryan\nShaw and David Ryan Harris supplied harmony vocals to various tracks on the\nalbum, and Alam Khan adds his masterful sarod playing to &quot;These Walls&quot;.) The\nfact that this aggregation includes so many musicians related by experience and\nblood clearly adds to the notion of Revelator as a true group album, the product\nof a musical family.\n","torrent":{"xt":"urn:btih:b5322bebfe9a5443c2b8f3fc9579957aa96afee7","amp;dn":"Tedeschi+Trucks+Band-Revelator-2011-404","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5322bebfe9a5443c2b8f3fc9579957aa96afee7","infoHashBuffer":{"type":"Buffer","data":[181,50,43,235,254,154,84,67,194,184,243,252,149,121,149,122,169,106,254,231]},"announce":[],"urlList":[]}}