{"title":"Seasick Steve-4 albums","uid":4734357,"size":301839048,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b5f4247c7ed3ba335e60b774298f8a61d2e36b89&amp;dn=Seasick+Steve-4+albums&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"SecondOpinion","files":-1,"time":1235207793,"description":"((((((((((((((((((((((((   D..E..M..U..N..O..I..D   ))))))))))))))))))))))))\n\n\nI get all my releases from the above tracker follow the forwarded url to check out the latest zero day releases!!!!\n\n                          &lt;a href=&quot; http://www.btzip.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.btzip.com&lt;/a&gt;\n\n     [[[  another fine release by the D..E..M..U..N..O..I..D   Team   ]]]\n\n\n   .....................................INFO................................\n\nSteve Wold, commonly known as Seasick Steve (born c.1941), is an American bluesman, although he prefers to be called &quot;a song and dance man.&quot; He plays guitars (mostly personalized), and sings, usually about his early life living rough and doing casual work\nWhen Wold was four years old, his parents split up. His father played boogie piano and at five or six years old Wold tried to learn but couldn't. At age eight, he learned to play the guitar (he later found out that it was blues) from K. C. Douglas, who worked at his grandfather's garage. Douglas wrote the song &quot;Mercury Blues&quot; and used to play with Tommy Johnson\n]. Wold left home at 13 to avoid abuse at the hands of his stepfather, and spent many years living on the streets in the States. He used to travel long distances by hopping freight trains, looking for work as a farm labourer or in other seasonal jobs, often living as a hobo. At various times, Wold worked as a carnie, cowboy and a migrant worker.\nOf his time he once said:\nHobos are people who move around looking for work, tramps are people who move around but don't look for work, and bums are people who don't move and don't work. I've been all three. \n\nIn the sixties he started touring and performing with fellow blues musicians, and had friends in the music scene including Janis Joplin. \nIn the nineties he worked as a recording engineer and producer. During this time he worked with Modest Mouse producing several of their releases.\nWold travelled extensively, living in 56 different houses in the 25 years of marriage with his Norwegian wife, with whom he had five children. Recently, Wold has spent much time in Norway, after a heart attack made him consider staying in one place\nAfter moving to Norway, Wold came out with his first album, entitled &quot;Cheap&quot;, recorded with a Swedish band called The Level Devils as his rhythm section. His debut solo album, &quot;Dog House Music&quot; was released by Bronzerat on 26 November 2006.\nWold made his first UK television appearance on Jools Holland's 'Annual Hootenanny' BBC TV show (broadcast on New Year's Eve 2006) where he performed a live rendition of &quot;Dog House Boogie&quot; on the 'Three String Trance Wonder' and the 'Mississippi Drum Machine' (see below). After that show his popularity exploded, as he explained in an interview: \nI can't believe it, all of the sudden I'm like the cat's miaow!\nHe has been well received in the U.K, winning the 2007 MOJO Award for Best Breakthrough Act. In 2007 he was invited to a number of large UK festivals, which resulted in his playing the most UK festivals of any band in that year, and he also appeared on The Paul O'Grady Show.\nWold toured early in 2008, playing in a number of venues and festivals in the UK. He was joined by a drummer on stage, Dan Magnusson, who formerly played with his backing band, The Level Devils. KT Tunstall also dueted with Wold at one concert (Astoria, London, 24th January 2008). \nHe has performed on three UK tours so far (with a fourth planned for January 2009) being supported by Duke Garwood, The Sugars and Amy LaVere respectively. His latest tour started with a sold out show at the Royal Albert Hall.\nIn 2009, Wold was nominated for a Brit Award in the category of International Solo Male Artist, [9] thus becoming the oldest ever BRIT nominee. At the ceremony, Wold confirmed a rumoured recording collaboration with White Stripes/Raconteurs vocalist Jack White.[10] That same year, BBC 4 broadcast a documentary of Steve visiting the southern USA entitled Seasick Steve: Bringing It All Back Home.[11]\n\n","torrent":{"xt":"urn:btih:b5f4247c7ed3ba335e60b774298f8a61d2e36b89","amp;dn":"Seasick+Steve-4+albums","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5f4247c7ed3ba335e60b774298f8a61d2e36b89","infoHashBuffer":{"type":"Buffer","data":[181,244,36,124,126,211,186,51,94,96,183,116,41,143,138,97,210,227,107,137]},"announce":[],"urlList":[]}}