{"title":"Sleater-Kinney - Discography 1995-2005 [FLAC]","uid":9181797,"size":2102215370,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b6eb717b1c60ab400810ac20faab62a3cd74dbd5&amp;dn=Sleater-Kinney+-+Discography+1995-2005+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":5,"uploader":"rudown78","files":178,"time":1384237395,"description":"Sleater-Kinney - Discography 1995-2005 [FLAC]\n\n\nFormed in 1994 from the ashes of Heavens to Betsy and Excuse 17, a pair of groups that rode the first wave of the riot grrrl movement, Sleater- Kinney became one of the most important feminist punk rock bands of the '90s. Singer/guitarists Corin Tucker and Carrie Brownstein first met in 1992, when Tucker was one half of the duo Heavens to Betsy. Brownstein, a classically trained pianist, was so inspired by Tucker and other grrrl musicians like Bikini Kill and Bratmobile (not coincidentally Tucker's own influences) that she formed her own band, Excuse 17, a year later. Sleater-Kinney, which earned its name from a local freeway off-ramp, initially began as Tucker and Brownstein's side project. Things changed in late 1994, though, when Australia-born Lora MacFarlane signed on as the group's first permanent drummer. Over the course of the following two weeks, the trio recorded its self-titled 1995 debut for Chainsaw, a label run by Team Dresch bassist Donna Dresch.\n\nUpon its release, the album earned widespread acclaim for its visceral intensity as well as the group's passionate vocals, intricate melodies, and provocative, politically charged lyrics. With 1996's Call the Doctor, Sleater-Kinney garnered even greater media exposure and critical applause on the strength of their incisive rants against gender inequity, consumerism, and indie rock's male-dominated hierarchy. Their Kill Rock Stars label debut, Dig Me Out, recorded with new drummer Janet Weiss from Quasi, followed in 1997, and was again among the most acclaimed releases of its season; The Hot Rock appeared two years later, and in the spring of 2000, Sleater-Kinney resurfaced with All Hands on the Bad One.\n\nIn August 2002, the group returned with its most musically accomplished record to date, One Beat. Sleater-Kinney upped the ante again with 2005's The Woods, a powerful, inventive album that was released by Sub Pop, produced by Dave Fridmann, and inspired by, among other things, the political climate of the mid-2000s and the freedom of the improvised parts of their gigs supporting Pearl Jam on a 2003 tour. During the summer of 2006, though, the group announced they were going on an &quot;indefinite hiatus&quot; after finishing the remaining dates on their tour. Brownstein went on to create the Spells with Mary Timony, and Corin Tucker launched a solo career in 2010.\n\n\n1995 - Sleater-Kinney\n1996 - Call the Doctor\n1997 - Dig Me Out\n1999 - Get Up [EP]\n1999 - The Hot Rock\n2000 - All Hands on the Bad One\n2002 - One Beat\n2005 - The Woods\n\n\nAlbum artwork and rip logs are included. Enjoy!!!!!!!!!!!!!!!!!!!!!\n","torrent":{"xt":"urn:btih:b6eb717b1c60ab400810ac20faab62a3cd74dbd5","amp;dn":"Sleater-Kinney+-+Discography+1995-2005+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6eb717b1c60ab400810ac20faab62a3cd74dbd5","infoHashBuffer":{"type":"Buffer","data":[182,235,113,123,28,96,171,64,8,16,172,32,250,171,98,163,205,116,219,213]},"announce":[],"urlList":[]}}