{"title":"Mr. Death: The Rise and Fall of Fred A. Leuchter, Jr. (1999) Xvi","uid":3420466,"size":743910879,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b735b620a49ad8e32899a2477a3492b82e86d022&amp;dn=Mr.+Death%3A+The+Rise+and+Fall+of+Fred+A.+Leuchter%2C+Jr.+%281999%29+Xvi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"aniland","files":2,"time":1134428184,"description":"Directed by\nErrol Morris\n\nPlot Outline: A cinematic portrait of the life and career of the infamous American execution device designer and holocaust denier.\n\nPlot Synopsis: Documentary about Fred Leuchter, anengineer who became an expert on execution devices and was later hiredby revisionist historian Ernst Zundel to &quot;prove&quot; that there were no gaschambers at Auschwitz. Leuchter published a controversial reportconfirming Zundel's position, which ultimately ruined his own career.Most of the footage is of Leuchter, puttering around executionfacilities or chipping away at the walls of Auschwitz, but Morris alsointerviews various historians, associates, and neighbors.\n\nI have also included a pdf copy of The Leuchter Report.\n\nFor further reading on the subject of Holocaust revisionism, visit:\n\nwww.ihr.org\nwww.codoh.com\nwww.nazigassings.com\nwww.zundelsite.org\n\nPlease spare a thought for revisionist historians Ernst Zundel, David Irving, Germar Rudolph and others, presently imprisoned in Europe for what amounts to &quot;thought crimes&quot;, offering research and evidence that undermine the current version of The Holocaust.\n\nThe truth does not imprison people. We have a right to know what happened, and a duty to the memory of the dead, and to the legacy of the living to have an accurate account of these events.","torrent":{"xt":"urn:btih:b735b620a49ad8e32899a2477a3492b82e86d022","amp;dn":"Mr.+Death%3A+The+Rise+and+Fall+of+Fred+A.+Leuchter%2C+Jr.+%281999%29+Xvi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b735b620a49ad8e32899a2477a3492b82e86d022","infoHashBuffer":{"type":"Buffer","data":[183,53,182,32,164,154,216,227,40,153,162,71,122,52,146,184,46,134,208,34]},"announce":[],"urlList":[]}}