{"title":"A Great and Terrible King: Edward I and the Forging of Britain","uid":15789095,"size":843998,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b73afade9f98ac44027a2a3f490609323558237e&amp;dn=A+Great+and+Terrible+King%3A+Edward+I+and+the+Forging+of+Britain&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"marty14","files":1,"time":1473368120,"description":"A Great and Terrible King: Edward I and the Forging of Britain - Marc Morris [epub]\r\n\r\nThe first major biography of a truly formidable king, whose reign was one of the most dramatic and important of the entire Middle Ages, leading to war and conquest on an unprecedented scale.\r\n\r\nEdward I is familiar to millions as &quot;Longshanks,&quot; conqueror of Scotland and nemesis of Sir William Wallace (in &quot;Braveheart&quot;). Yet this story forms only the final chapter of the king's action-packed life. Earlier, Edward had defeated and killed the famous Simon de Montfort in battle; travelled to the Holy Land; conquered Wales, extinguishing forever its native rulers and constructing a magnificent chain of castles. He raised the greatest armies of the Middle Ages and summoned the largest parliaments; notoriously, he expelled all the Jews from his kingdom.The longest-lived of England's medieval kings, he fathered fifteen children with his first wife, Eleanor of Castile, and, after her death, he erected the Eleanor Crosses―the grandest funeral monuments ever fashioned for an English monarch.\r\n\r\nIn this book, Marc Morris examines afresh the forces that drove Edward throughout his relentless career: his character, his Christian faith, and his sense of England's destiny―a sense shaped in particular by the tales of the legendary King Arthur. He also explores the competing reasons that led Edward's opponents (including Robert Bruce) to resist him.\r\n\r\nThe result is a sweeping story, immaculately researched yet compellingly told, and a vivid picture of medieval Britain at the moment when its future was decided. 16 pages of color and B&amp;W photographs","torrent":{"xt":"urn:btih:b73afade9f98ac44027a2a3f490609323558237e","amp;dn":"A+Great+and+Terrible+King%3A+Edward+I+and+the+Forging+of+Britain","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b73afade9f98ac44027a2a3f490609323558237e","infoHashBuffer":{"type":"Buffer","data":[183,58,250,222,159,152,172,68,2,122,42,63,73,6,9,50,53,88,35,126]},"announce":[],"urlList":[]}}