{"title":"Brandon Sanderson - Shadows of Self (Mistborn #5)","uid":12555595,"size":189360757,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b8129c21d0bb40e46b1eaa1399cca3ca0c026493&amp;dn=Brandon+Sanderson+-+Shadows+of+Self+%28Mistborn+%235%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"Cybotage","files":28,"time":1444625488,"description":"\nThe New York Times best-selling author returns to the world of Mistborn with his first audiobook in the series since The Alloy of Law.\r\n\r\nWith The Alloy of Law, Brandon Sanderson surprised listeners with a New York Times best-selling spinoff of his Mistborn audiobooks, set after the action of the trilogy, in a period corresponding to late 19th-century America. The trilogy's heroes are now figures of myth and legend, even objects of religious veneration. They are succeeded by wonderful new characters, chief among them Waxillium Ladrian, known as Wax, hereditary lord of House Ladrian but also, until recently, a lawman in the ungoverned frontier region known as the Roughs. There he worked with his eccentric but effective buddy, Wayne. They are &quot;twinborn,&quot; meaning they are able to use both Allomantic and Feruchemical magic.\r\n\r\nShadows of Self shows Mistborn's society evolving as technology and magic mix, the economy grows, democracy contends with corruption, and religion becomes a growing cultural force, with four faiths competing for converts. This bustling, optimistic, but still shaky society now faces its first instance of terrorism, crimes intended to stir up labor strife and religious conflict. Wax and Wayne, assisted by the lovely, brilliant Marasi, must unravel the conspiracy before civil strife stops Scadrial's progress in its tracks. Shadows of Self will give fans of The Alloy of Law everything they've been hoping for and, this being a Brandon Sanderson audiobook, more - much more","torrent":{"xt":"urn:btih:b8129c21d0bb40e46b1eaa1399cca3ca0c026493","amp;dn":"Brandon+Sanderson+-+Shadows+of+Self+%28Mistborn+%235%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8129c21d0bb40e46b1eaa1399cca3ca0c026493","infoHashBuffer":{"type":"Buffer","data":[184,18,156,33,208,187,64,228,107,30,170,19,153,204,163,202,12,2,100,147]},"announce":[],"urlList":[]}}