{"title":"Pendragon - Men Who Climb Mountains mp3 (2014)","uid":11172909,"size":158385789,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b8a7a18ce2fd611382225010e7107152a4662827&amp;dn=Pendragon+-+Men+Who+Climb+Mountains+mp3+%282014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"analogkid6103","files":11,"time":1412723872,"description":"Pendragon are an English neo-progressive rock band established in 1978 in Stroud, Gloucestershire as Zeus Pendragon by guitarist and vocalist Nick Barrett. The Zeus was dropped before the band started recording as the members decided it was too long to look good on a T-shirt. There were a few personnel changes in the early days, but since 1986 the lineup has remained relatively stable (with only the drummer changing twice since then) and the band is still active as of 2014.\n\nThe band were active in the progressive rock revival spearheaded by the likes of Marillion, Pallas, Solstice and Twelfth Night in the early 1980s, and indeed (like their peers IQ) often appeared as support acts to Marillion and other major neo-prog bands, both on tours and at the famous Marquee venue which hosted many regular prog evenings. After their debut album, The Jewel, the band pursued a more commercial direction, documented in the Kowtow album and the Red Shoes and Saved By You EPs, but despite these efforts failed to break through to a mainstream audience.\n\nIn 1991 the band established their own label, Toff Records, and released the archival release The Rest of Pendragon, a collection of EP tracks, and the studio album The World, in which they returned to a more progressive style that the band would continue to develop over their next three studio albums, The Window of Life, The Masquerade Overture, and Not Of This World.\n\nFrom this point on their fortunes have improved, and whilst they are still relatively obscure in their home country they have a significant following in Europe; in particular, they have managed to develop a strong fanbase in Poland, and have both released at least one compilation specifically for the Polish market and recorded several live albums there.\n\nIn 2002 the band released Acoustically Challenged, documenting an &quot;unplugged&quot; session with a number of the band's songs retooled for acoustic instruments, which was originally broadcast on Radio 3 Warsaw. This was considered an unusual move for a prog rock band, since progressive rock tends to focus a lot on the use of electronic synthesisers and electric guitars; however, the melodic qualities of the band's compositions proved to be well-suited to an acoustic context, and the album was reasonably successful. This heralded a new willingness to experiment on the part of the band, following a run of studio albums all broadly in the same vein as &quot;The World&quot;. On 2005's Believe they took their music in a somewhat darker direction, causing a certain amount of controversy amongst their fans. 2008's Pure refined the style of Believe and was extremely well received by the progressive rock fandom, being voted Album of the Year 2008 on DPRP. On the community website progarchives.com Pure enjoyed the current &quot;most popular album&quot; spot for a period in 2008, and remains in the site's top 10 prog releases of 2008 (as voted by site users).\n\nRecently, Pendragon released a live album and DVD, Concerto Maximo, shot in Katowice, on 13 October 2008. It was filmed and edited by Metal Mind. It was released in several versions - a 2 CD release, featuring just the audio from the show, a DVD, featuring the full show, and a DVD and 2 CD special edition, which was limited to 1000 copies.\n\nIn October 2010, the band started recording the follow-up to their 2008 release Pure. The album is called Passion and was released in the spring of 2011. The successor of Passion should be out in 2014.\n\nIn April 2014 the band announced that have parted ways with drummer Scott Higham for &quot;personal reasons&quot;.\nimage\n\n\nDiscography\n\nThe Jewel (1985)\nKowtow (1988)\nThe World (1991)\nThe Window Of Life (1993)\nThe Masquerade Overture (1996)\nNot Of This World (2001)\nBelieve (2005)\nPure (2008)\nPassion (2011)\nMen Who Climb Mountains (2014)\n\n\n\nMen Who Climb Mountains (2014)\n\n\n\n01. Belle Ame 3:15\n02. Beautiful Soul 8:03\n03. Come Home Jack 10:51\n04. In Bardo 4:52\n05. Faces of Light 5:50\n06. Faces of Darkness 6:25\n07. For When the Zombies Come 7:33\n08. Explorers of the Infinite 11:09\n09. Netherworld 5:47\nGenre: Progressive\nSubgenre: Progressive Rock\nBitrate: 320 k\nSize: 151.05 MB\nShow/Hide Files:\n11 files\nAdded: 07/10/2014 ","torrent":{"xt":"urn:btih:b8a7a18ce2fd611382225010e7107152a4662827","amp;dn":"Pendragon+-+Men+Who+Climb+Mountains+mp3+%282014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8a7a18ce2fd611382225010e7107152a4662827","infoHashBuffer":{"type":"Buffer","data":[184,167,161,140,226,253,97,19,130,34,80,16,231,16,113,82,164,102,40,39]},"announce":[],"urlList":[]}}