{"title":"Rush - Moving Pictures [320k MP3]","uid":8631713,"size":97103494,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b8e1b262e84bd2ca941a78d65e777592bc119d25&amp;dn=Rush+-+Moving+Pictures+%5B320k+MP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"smbdownload","files":-1,"time":1372641102,"description":"Moving Pictures is the eighth studio album by Canadian rock band Rush. It was recorded and mixed from October to November 1980 at Le Studio located in Morin Heights, Quebec, Canada, and released on February 12, 1981.\n\nMoving Pictures became the band's biggest selling album in the US rising to #3 on the Billboard charts and remains the band's most popular and commercially successful studio recording to date. The album was one of the first to be certified multi-platinum by the RIAA upon establishment of the certification in October 1984, and eventually went quadruple platinum.\n\nFollowing the formula of their previous album, Permanent Waves, Moving Pictures follows a more radio-friendly format and includes several of the band's signature tracks, including the hits &quot;Tom Sawyer&quot; and &quot;Limelight&quot;, the FM rock radio standard, &quot;Red Barchetta&quot;, and the band's highly praised instrumental, &quot;YYZ&quot;.\n\nMoving Pictures is one of two Rush albums listed in 1001 Albums You Must Hear Before You Die (2112 is the other). Kerrang! magazine listed the album at #43 among the &quot;100 Greatest Heavy Metal Albums of All Time&quot;. In 2012, Moving Pictures was listed as the #10 'Your Favorite Prog Rock Albums of All Time' by Rolling Stone. \n\nThe album cover art is a visual pun of movers physically carrying paintings, while several songs from the album are connected to motion pictures, with &quot;moving pictures&quot; meaning movies. This second meaning is explicitly shown on the back of the album, where a movie crew is seen filming the scene from the front cover. A third meaning is taken from bystanders who are watching the movers and are visibly emotionally moved by the paintings, making them &quot;moving pictures&quot;.\n\nTrack Listing [Remastered] [320k MP3]\n\n1. \t&quot;Tom Sawyer&quot; (Peart and Pye Dubois) \t4:31\n2. \t&quot;Red Barchetta&quot;   \t6:10\n3. \t&quot;YYZ&quot; (Lee and Peart) (Instrumental) \t4:23\n4. \t&quot;Limelight&quot;   \t4:20\n5. \t&quot;The Camera Eye&quot;   \t11:01\n6. \t&quot;Witch Hunt&quot; (Part III of Fear) \t4:46\n7. \t&quot;Vital Signs&quot;   \t4:47","torrent":{"xt":"urn:btih:b8e1b262e84bd2ca941a78d65e777592bc119d25","amp;dn":"Rush+-+Moving+Pictures+%5B320k+MP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8e1b262e84bd2ca941a78d65e777592bc119d25","infoHashBuffer":{"type":"Buffer","data":[184,225,178,98,232,75,210,202,148,26,120,214,94,119,117,146,188,17,157,37]},"announce":[],"urlList":[]}}