{"title":"The Sixth Extinction by James Rollins (Retail - New Release) {Ro","uid":10748638,"size":1430371,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b903bd7936aaa753cfcf5f87d6370f3379848c25&amp;dn=The+Sixth+Extinction+by+James+Rollins+%28Retail+-+New+Release%29+%7BRo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"TheRose88","files":-1,"time":1407848963,"description":"Title: The Sixth Extinction (Sigma Force #10)\nAuthor: James Rollins\nPublished: Aug 12 2014\nPublisher: William Morrow\nISBN: 9780062194923\nFormat: Epub (Retail)\nLanguage: English\nGenres: Fiction, Adventure, Mystery, Thriller\n\n(*New Release*)\n\n\nIn a masterful epic that combines timeless mystery and ripped-from-the-headlines scientific intrigue, New York Times bestselling author James Rollins takes humankind to its endpoint, to a fate inscribed in rock and ice in an event known as\n\nTHE 6TH EXTINCTION\n\nLife always finds a way. . . .\n\nA military research station buried in the remote Sierra Nevada Mountains of Northern California broadcasts a frantic distress call that ends with a chilling order:\n&quot;This is sierra, victor, whiskey. There's been a breach. Failsafe initiated. No matter the outcome: Kill us . . . kill us all.&quot;\n\nThe site is part of TECOMM, the U.S. Army Test Command. When help arrives to investigate, they discover that everyone in the lab is dead--not just the scientists, but every living thing for fifty square miles is annihilated: every animal, plant, and insect, even bacteria. The land is completely sterile-- and the blight is spreading.\n\nOnly one team on earth has the scientific knowledge and military precision to handle this mission: Commander Gray Pierce and Sigma. The dead scientists were working on a secret project, researching radically different forms of life on Earth, life that could change our understanding of biology and humanity itself. But something set off an explosion in the lab, and now Sigma must contend with the apocalyptic aftermath.\n\nTo prevent the inevitable, they must decipher a futuristic threat that rises out of the distant past--a time when Antarctica was green and life on Earth was balanced on a knife's edge. Following a fascinating trail of clues buried in an ancient map rescued from the lost Library of Alexandria, Sigma will make a shocking discovery involving a prehistoric continent and a new form of life and death buried under miles of ice. Gray Pierce and his dedicated team must race through eons of time and across distant continents to decipher millennia-old secrets out of the frozen past and untangle mysteries buried deep in the darkest jungles of today, as they face their greatest challenge yet: stopping the Sixth Extinction--the end of humankind.\nBut is it already too late?\n\nThe Sixth Extinction combines pulsating adventure, intriguing history, and cutting-edge advances in science and technology in a thrilling white-knuckle ride that delivers as only James Rollins can.\n\n","torrent":{"xt":"urn:btih:b903bd7936aaa753cfcf5f87d6370f3379848c25","amp;dn":"The+Sixth+Extinction+by+James+Rollins+%28Retail+-+New+Release%29+%7BRo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b903bd7936aaa753cfcf5f87d6370f3379848c25","infoHashBuffer":{"type":"Buffer","data":[185,3,189,121,54,170,167,83,207,207,95,135,214,55,15,51,121,132,140,37]},"announce":[],"urlList":[]}}