{"title":"Warner Bros. Sound Effects Library (1400+ Sound FX) [RH]","uid":4880624,"size":203896705,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:b9132df9661094fa922c3def42b9d649b697cf46&amp;dn=Warner+Bros.+Sound+Effects+Library+%281400%2B+Sound+FX%29+%5BRH%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"RobbingHood","files":3,"time":1241369255,"description":"\n\n\n    .-.________                                                     ________.-.\n---( )_)_______)       The Warner Bros. Sound Effects Library      (_______(_( )---\n  (    ()___)                                                         (___()    )\n       ()__)                                                           (__()\n--(___()_)                                                               (_()___)--\n\n\n&lt;---------------------------------------------------------------------------------&gt;\n SPONSORED LINK                    SPONSORED LINK                   SPONSORED LINK\n ^^^^^^^^^^^^^^                    ^^^^^^^^^^^^^^                   ^^^^^^^^^^^^^^\n&lt;---------------------------------------------------------------------------------&gt;\n\nWarner Bros. Support Website for all (illegal) Warner Bros. Products: &lt;a href=&quot;\nhttp://www.warnerbros.com/main/help/customer_service.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.warnerbros.com/main/help/customer_service.html&lt;/a&gt;\n\nNOTE: Please do not forget to leave behind as much information as possible  \nabout where the product is from and about your personal identification data. \nYou'll then be contacted as soon as possible by the Warner Bros. Support Team! \n\n\nThank you for choosing Warner Bros.,\n\nThe Warner Bros. Support Team\n\n&lt;---------------------------------------------------------------------------------&gt;\n&lt;---------------------------------------------------------------------------------&gt;\n\n\n\n                       The Warner Bros. Sound Effects Library\n\n\n\nThe Warner Bros. Sound Effects Library\nMP3 - Sound Effects - 192 kbps - Joint Stereo\n\n\nNow, for the first time, Warner Bros. brings you, on 5 side-splitting CDs, \nover 1400 hilarious digitally remastered sound effects that have helped make \nWarner Bros. cartoons so unforgettable for so many years.\n\nEach authentic sound effect selected from the Warner Bros. sound department has \nbeen carefully restored to provide you with outstanding digital audio quality.\n\nNow you can offer your productions something very special with the famous and \nfamiliar sound clips associated with Warner Bros. - brought to you exclusively \nby Sound Ideas.\n\n\nContents:\n\nWB01 \nAirplanes, Bees, Birds, Cats, Chickens, Dogs, Donkeys, Ducks, Elephants, \nFarm Sounds, Horses, Monsters, Pigs, Pigeons, Sheep, Archery, Autos, Bells, \nBoings, Bonks, Bounces, Bubbles, Chatter, Crackles, Crashes, Creaks, Cymbals, \nDoors, Drums.\n\n\nWB02 \nElectricity, Falls, Footsteps, Gongs, Hits, Hops, Horns, Howls, Knocks, \nLightning, Morse Code, Motors, Accordions, Fantasies, Pianos, Vibraphones, \nViolins, Xylophones, Panting, Pile Drivers, Plops, Plunger, Pops, Pumps, \nPunctures, Radios, Ratchets, Rattles, Saws, Sci Fi Sounds, Scrapes, Sirens, \nSkids, Slides, Smashes, Snaps, Splats, Spray, Sputs, Swallows.\n\n\nWB03 \nSqueaks, Squirts, Stretches, Swimming, Swishes, Suction, Tears, Teeth, \nTelephones, Tightropes, Trains, Twangs, Vacuums, Washboards, Water Sounds, \nWhips, Whistles, Whizzes, Windows, Wipes, Wobbles, Woodpeckers, Zips, Blows, \nBreathing, Crowds, Cries, Gargles, Growls, Grunts, Gulps, Hiccups, Kisses, \nLaughter, Razzberries, Screams, Sighs, Sneezes, Sniffs, Snores, Spits, \nThroat Cuts, Whistles, Yawns, Yells.\n\n\nWB04 \nAirplanes, Bears, Fantasy Bees, Fantasy Birds, Creatures, Ducks, Balloons, \nBells, Boings, Glass Bottles, Bounces, Bone Breaks, Burp Bubbles, Gag Bubbles, \nLava Bubbles, Buzzes, Caverns, Coin Drops, Crackles, Crashes, Door Creaks, \nCrunches, Debris Falls, Drawbridges, Eating, Electricity, Electronic Sounds, \nEruptions, Explosions, Body Falls, Thin Bubbles, Fireworks, Flicks, Footsteps, \nGhosts, Heartbeats, Cardboard Hits, Metal Hits, Human Hits, Water Hits, \nWhap Hits, Wood Hits, Bulb Horns, Laboratory Sounds, Money Bags.\n\n\nWB05  \nMotors, Cartoon Peels, Pile Drivers, Pings, Poofs, Pouring from a Jug, Paper \nPunctures, Metal Rattles, Plastic Rattles, Wood Rattles, Cardboard Rips, \nRockslides, Metal Rolls, Rumbles &amp; Groans, Train Rumbles, Tube Rumbles, Saws, \nSci-Fi Sounds, Metal Scrapes, Scratches, Shakes, Slides, Balloon Spins, \nTube Spins, Winding Spins, Spooges, Glass Squeaks, Spin Squeaks, Water Squirts, \nSquishes, Plastic Stretches, Tube Stretches, Air Suction, Swishes, Swords, \nWater Cannons, Water Gurgles, Wind, Zips.\n\n\n\nMore info: &lt;a href=&quot;\nhttp://www.warnerbros.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.warnerbros.com/&lt;/a&gt;\n\n\n\n&lt;---------------------------------------------------------------------------------&gt;\n&lt;---------------------------------------------------------------------------------&gt;\n\n\n\n&gt;&gt;&gt;When using TPB please read these important notes: \n****************************************************\n\n01- Anti-malware apps may warn about keygens, patches, cracks etc because of \n    their capabilities (generating codes, etc). Sometimes also they're added to \n    the virus/spyware database and will be detected as malware. If not trusting \n    keygens, patches, cracks etc don't use them.\n\n02- Before running .exe-files, keygens, patches, cracks etc always check first \n    if they can be unpacked. Often some thirth party added a virus to the \n    original file, repacked it and uploaded it again.\n\n03- Letting antimalware-apps sending scanning-results to their companies can coz\n    keygens, patches, cracks etc being added to their virus-database.\n\n04- Firewalls which are set to automatically decide for connections will allow \n    connections for lots of apps &amp; MALWARE!. To avoid so firewalls should be set \n    to decide yourself which connection to allow or not.\n\n05- Usually (new) torrents with extreme many downloads &amp; seeders in a short time \n    are very suspicious! Torrents with a SKULL-logo are trusted.\n\n06- Some (frustrated) people use multiple accounts and post lots of FAKE comments \n    and/or files trying to spread confusion. Usually they NEVER seriously reply \n    on comments and don't have any torrent, or to look reliable just a few.\n\n07- Clicking on unknown links can coz malware being silently installed on a pc!\n  \n08- In general often there are more fake &amp; negative comments than reliable &amp; \n    positive comments.\n\n09- In some countries uploading/downloading copyright-protected material is \n    forbidden, but showing some appreciation to reliable uploaders is not.\n\n10- Posting FAKE comments &amp; uploads on TPB can result in getting banned from TPB!\n\n\nFor reporting bad or suspicious torrents:  &lt;a href=&quot;\nhttp://suprbay.org/forumdisplay.php?f=34&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://suprbay.org/forumdisplay.php?f=34&lt;/a&gt;\n\nFor visiting &quot;TPB's Most Ridiculous Comments&quot;:  &lt;a href=&quot;\nhttp://suprbay.org/showthread.php?t=30402&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://suprbay.org/showthread.php?t=30402&lt;/a&gt;\n\nFor visiting my account*:  &lt;a href=&quot;\nhttp://thepiratebay.se/user/RobbingHood/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/RobbingHood/&lt;/a&gt;\n\n*All torrents scanned with:\n1- Norton Internet Security  \n2- AVG Antivirus Pro  \n3- aVast! Antivirus AV Pro  \n4- Kaspersky AV Pro  \n5- NOD32 AV  \n\n...and also with most well known antispyware. Reported malware detected by \n   other anti-malware apps probably are false positives!\n\n\n&lt;---------------------------------------------------------------------------------&gt;\n\n\nTo the &quot;United Reliable Pirate Bay Users&quot;,\n\nNowadays a lot of PB members abuse their PB membership by intenionally posting \nfake comments &amp; files. Their meaning is just to spread confusion and try to \nfrustrate PB and it's users. And less downloaders = less seeders = less \ndownloadspeed etc etc. \n\nIt's in the benefit of PB and all reliable users to warn each other about people \nwho intenionally keep posting fake comments &amp; files. It's an easy answer against \nthose who intenionally keep posting fake comments &amp; files, which is a never \nending issue. \n\nWhen reporting errors or false positives just keep in mind that what goes up for \none does not always goes up for another. That's for both the working of an app \nand about false positives! Remember: whatever is said, say it constructive! \nLet's just try to help each other and PB by thinking about what's said &amp; posted. \nThings are all up to you, the &quot;United Reliable Pirate Bay Users&quot;!\n\n\nEnjoy The Pirate Bay\n                                         \n* Status torrent at sept 19 2008 - 02.35 CET: clean, tested &amp; working.","torrent":{"xt":"urn:btih:b9132df9661094fa922c3def42b9d649b697cf46","amp;dn":"Warner+Bros.+Sound+Effects+Library+%281400%2B+Sound+FX%29+%5BRH%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9132df9661094fa922c3def42b9d649b697cf46","infoHashBuffer":{"type":"Buffer","data":[185,19,45,249,102,16,148,250,146,44,61,239,66,185,214,73,182,151,207,70]},"announce":[],"urlList":[]}}