{"title":"Cognitive Science: Introduction to the Science of the Mind(2014)","uid":10116887,"size":10831778,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b91aa2839741035cd523f1751fd72116e559956f&amp;dn=Cognitive+Science%3A+Introduction+to+the+Science+of+the+Mind%282014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"bookzilla","files":1,"time":1399601089,"description":"Cognitive Science: An Introduction to the Science of the Mind 2nd ed\n\npdf\n\n\nCognitive Science combines the interdisciplinary streams of cognitive science into a unified narrative in an all-encompassing introduction to the field. This text presents cognitive science as a discipline in its own right, and teaches students to apply the techniques and theories of the cognitive scientist's 'toolkit' - the vast range of methods and tools that cognitive scientists use to study the mind. \n\n Thematically organized, rather than by separate disciplines, Cognitive Science underscores the problems and solutions of cognitive science, rather than those of the subjects that contribute to it - psychology, neuroscience, linguistics, etc. The generous use of examples, illustrations, and applications demonstrates how theory is applied to unlock the mysteries of the human mind. Drawing upon cutting-edge research, the text has been updated and enhanced to incorporate new studies and key experiments since the first edition. A new chapter on consciousness has also been added.","torrent":{"xt":"urn:btih:b91aa2839741035cd523f1751fd72116e559956f","amp;dn":"Cognitive+Science%3A+Introduction+to+the+Science+of+the+Mind%282014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b91aa2839741035cd523f1751fd72116e559956f","infoHashBuffer":{"type":"Buffer","data":[185,26,162,131,151,65,3,92,213,35,241,117,31,215,33,22,229,89,149,111]},"announce":[],"urlList":[]}}