{"title":"Give and Take: A Revolutionary Approach to Success","uid":8577806,"size":2040899,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b983de9c5539c8167bef87011ff9e32cdf6ce1bf&amp;dn=++Give+and+Take%3A+A+Revolutionary+Approach+to+Success&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1371323728,"description":"Author(s): \tAdam M. Grant Ph.D.\nPublisher: \tViking Adult\nDate: \t2013-04-09 \t\nFormat: \tPDF/EPUB \t\nLanguage: \tEnglish \t\nISBN10: \t0670026557\n\nFor generations, we have focused on the individual drivers of success: passion, hard work, talent, and luck. But today, success is increasingly dependent on how we interact with others. It turns out that at work, most people operate as either takers, matchers, or givers. Whereas takers strive to get as much as possible from others and matchers aim to trade evenly, givers are the rare breed of people who contribute to others without expecting anything in return.\nUsing his own pioneering research as Wharton's youngest tenured professor, Grant shows that these styles have a surprising impact on success. Although some givers get exploited and burn out, the rest achieve extraordinary results across a wide range of industries. Combining cutting-edge evidence with captivating stories, this landmark book shows how one of America's best networkers developed his connections, why the creative genius behind one of the most popular shows in television history toiled for years in anonymity, how a basketball executive responsible for multiple draft busts transformed his franchise into a winner, and how we could have anticipated Enron's demise four years before the company collapsed-without ever looking at a single number.","torrent":{"xt":"urn:btih:b983de9c5539c8167bef87011ff9e32cdf6ce1bf","amp;dn":"++Give+and+Take%3A+A+Revolutionary+Approach+to+Success","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b983de9c5539c8167bef87011ff9e32cdf6ce1bf","infoHashBuffer":{"type":"Buffer","data":[185,131,222,156,85,57,200,22,123,239,135,1,31,249,227,44,223,108,225,191]},"announce":[],"urlList":[]}}