{"title":"Tom Petty - The Very Best Of CDRip [Cov+CD][Bubanee]","uid":5125252,"size":132600150,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ba79a27623e9e9646143ba17edf9f41e7a0efa15&amp;dn=Tom+Petty+-+The+Very+Best+Of+CDRip+%5BCov%2BCD%5D%5BBubanee%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"bubanee","files":24,"time":1255576894,"description":"In this CDRip collection i have provided the Covers and CD JPegs [Pictures]\nAlong with EAC Log and M3U Playlist\nPlease SEED for others to Enjoy!\nCheers, Bubanee\n\nThe song titled.. Anything that's rock &amp; roll is in fact song 3 due to this being a UK Release.. this does not alter the actual listing in the torrent folder itself.. just whats written below, includes all other songs\n\n\n1. American Girl\n2. Breakdown\n3. Listen to Her Heart\n4. I Need to Know\n5. Refugee\n6. Don't Do Me Like That\n7. Even The Losers\n8. Here Comes My Girl\n9. The Waiting\n10. You Got Lucky\n11. Don't Come Around Here No More\n12. I Won't Back Down\n13. Runnin' Down A Dream\n14. Free Fallin'\n15. Learning to Fly\n16. Into the Great Wide Open\n17. Mary Jane's Last Dance\n18. Something In The Air\n\nTom Petty and the Heartbreakers are a Heartland rock band, most of whose members are from the United States of America. They were formed in 1976 by Tom Petty, Mike Campbell, and Benmont Tench, all of whom had been members of Mudcrutch. Petty and the Heartbreakers are known for hit singles such as &quot;American Girl&quot;, &quot;Breakdown&quot;, &quot;The Waiting&quot;, &quot;Learning to Fly&quot;, &quot;Free Fallin'&quot; and &quot;Mary Jane's Last Dance.&quot;\n\nThe Heartbreakers still tour regularly and continue to make and record albums. They have gone through numerous line up changes between 1982 and 2002, with Tench, Petty and Campbell being the only members consistently in the band from when it first started.\n\nPetty has fought against his record company on more than one occasion, first in 1976 over transference to another label and then again in 1981 over the price of his record, which was (at that time) considered expensive. He is also outspoken on the current state of the music industry and modern radio stations. On his 2002 album, The Last DJ Petty sang about that and other issues and talked about them on the bonus DVD that came with the limited edition album.\n\nAlthough most of what they do is together as The Heartbreakers, they have also participated in outside projects, with Petty himself releasing solo albums, the most successful being 1989s Full Moon Fever.\n\nAlthough Tom Petty and the Heartbreakers have not released an album since 2002, the three founding members, along with Randall Marsh and Tom Leadon recorded an album by Mudcrutch. This was the band's first album, made more significant by the fact that they had not recorded together since 1974.\n","torrent":{"xt":"urn:btih:ba79a27623e9e9646143ba17edf9f41e7a0efa15","amp;dn":"Tom+Petty+-+The+Very+Best+Of+CDRip+%5BCov%2BCD%5D%5BBubanee%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba79a27623e9e9646143ba17edf9f41e7a0efa15","infoHashBuffer":{"type":"Buffer","data":[186,121,162,118,35,233,233,100,97,67,186,23,237,249,244,30,122,14,250,21]},"announce":[],"urlList":[]}}