{"title":"Deadpool MAX 1 1-12 + 2 1-6 + X-Mas Special (Complete)","uid":8884332,"size":728444292,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:bb54c54320cc478492809da6afbd6d3a6bb70cb0&amp;dn=Deadpool+MAX+1+1-12+%2B+2+1-6+%2B+X-Mas+Special+%28Complete%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"blackcanary","files":-1,"time":1378412296,"description":"English | CBZ | 19 Issues\n\nPublisher:  MAX Comics (an imprint of Marvel)\n\nDeadpool Max #1-12\nPublication Date:  October 6, 2010 - September 28, 2011\nWriter:  David Lapham\nArtist:  Kyle Baker (#1-8, 10-12) and Shawn Crystal (#9)\nColorist:  John Rauch (#9)\nLetterer:  Clayton Cowles\nCovers:  Kyle Baker\n\nWhen the government has a problem that's too dangerous to handle, they call in the one man crazy enough to solve it: Deadpool. Unkillable mercenary, definite weapons expert and swordsman, hopeless romantic, nutjob. But when he's targeting the likes of Hammerhead, leader of the most powerful criminal organization in the world, or Baron Helmut Emmerich Von Zemo, hood-wearing warrior of hate, even an unkillable super-agent may not be enough! You may think you know Deadpool, but you have no idea. Guest-starring Cable, the Taskmaster, and Domino!\n\nCrazy is as crazy does! Wade Wilson ditches his job as the government super-assassin known as Deadpool to spend the rest of his life making sweet, sweet love to his blushing bride, Domino. Or is it Inez? Or Honey Moon? Or Luau Luau, the Hawaiian spirit of vengeance? Take your freakin' pick, because things spiral straight down the tubes when she goes on a murdering spree that threatens to destroy Deadpool's newly formed nuclear family. And Deadpool's handler Bob gets back to work as the two take on machine-gun-wielding hookers and their own twisted histories, using teamwork and good old-fashioned American ingenuity. And guns. And swords. Marvel as two broken men attempt to take down the worldwide terrorist network Hydra in a story so shocking it could only be told by MAX!\n\nDeadpool Max 2 #1-6\nPublication Date:  October 19, 2011 - March 28, 2012\nWriter:  David Lapham\nArtist:  Kyle Baker (#1-2, 4-6) and Shawn Crystal (#3)\nColorist:  Lee Loughridge (#3, 6)\nLetterer:  Clayton Cowles\nCovers:  Kyle Baker\n\nMarvel's most mentally misaligned misanthrope, Deadpool, returns in a gloriously raw, uncensored shoot-'em-up romp across America with his good buddy Hydra Bob, a boatload of explosives, enough military-grade weaponry to sink your battleship and a cocktail of mood-altering pharmaceuticals. When Bob is framed for a terrorist act on American soil and hunted by the U.S. government, he and his best friend Deadpool go on the run in a heartfelt, soul-searching journey full of sex, drugs and unnecessary excessive violence! Familiar friends and foes including Taskmaster, Cable, Agent X, Weasel and Blind Al join the bosom buddies on their sanity-smashing adventure as Deadpool helps his pal Bob try to clear his not-so-good name.\n\nDeadpool MAX X-Mas Special #1:\nPublication Date:  December 7, 2011\nWriter:  David Lapham\nArtists:  David Lapham, Kyle Baker, and Shawn Crystal\nColorists:  Lee Loughridge and Kyle Baker\nLetterer:  Rob Steen\nCover:  Kyle Baker\n\nHow do Deadpool and Bob, the two most wanted terrorists in the world, spend their holiday break? By faking their own deaths, breaking into CIA headquarters, hunting down internet-porn-peddling jihadists and causing a riot in an insane asylum, of course!\n\nThanks goes to Jericko and DTs for this release.\n\nDon't know how to view this comic book?  Use CDisplayEx or another comic book reader application. &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8689374&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8689374&lt;/a&gt;","torrent":{"xt":"urn:btih:bb54c54320cc478492809da6afbd6d3a6bb70cb0","amp;dn":"Deadpool+MAX+1+1-12+%2B+2+1-6+%2B+X-Mas+Special+%28Complete%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb54c54320cc478492809da6afbd6d3a6bb70cb0","infoHashBuffer":{"type":"Buffer","data":[187,84,197,67,32,204,71,132,146,128,157,166,175,189,109,58,107,183,12,176]},"announce":[],"urlList":[]}}