{"title":"Advertising Media Workbook and Sourcebook, 4E [StormRG]","uid":11871838,"size":3599049,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bbd297d06791248fe28d59a9110c0fa5285a7b3d&amp;dn=Advertising+Media+Workbook+and+Sourcebook%2C+4E+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"0xmovva","files":2,"time":1430460146,"description":"TITLE/EDITION Advertising Media Workbook and Sourcebook\nBy: Larry Kelley (Author), Kim Sheehan (Author), Donald W. Jugenheimer (Author)\nPaperback: 380 pages\nPublisher: Routledge; 4 edition (April 14, 2015)\nLanguage: English\nISBN-10: 0765640945\nISBN-13: 978-0765640949\nNOTE: This is the standalone ebook and may not include access codes that come packaged with the bound book\n\n\n\n\nThis combination of workbook and sourcebook presents both easy-to-understand explanations of advertising media sources and calculations along with real-world examples of source material from advertising and media companies. It is designed for both practitioners and students - anyone who wants to master the process of advertising media planning.\n\nEach of the book's 45 concise units opens with a brief text segment, presents sample source materials from actual advertising and media companies, and concludes with plenty of hands-on exercises. Units are compact and easy-to-understand, and they progress in a logical way, from communication planning to media strategies and tactics.\n\nThe book also includes several valuable appendices: a media math primer, standard media formulae, media planning checklists, and a glossary of media terms.\n\nIn response to popular demand, the authors have broadened the scope of the book and added more current topics. Changes include:\n\nMany new exercises with new media formats and digital media\nA new introduction of the concept of a purchase funnel as a media planning tool\nNew units devoted to popular social media channels (Facebook, Twitter, YouTube)\nTables and exercises updated with more recent data","torrent":{"xt":"urn:btih:bbd297d06791248fe28d59a9110c0fa5285a7b3d","amp;dn":"Advertising+Media+Workbook+and+Sourcebook%2C+4E+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbd297d06791248fe28d59a9110c0fa5285a7b3d","infoHashBuffer":{"type":"Buffer","data":[187,210,151,208,103,145,36,143,226,141,89,169,17,12,15,165,40,90,123,61]},"announce":[],"urlList":[]}}