{"title":"StarDrive-FLT","uid":8414865,"size":1188706551,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:bbe8b1e9daf75675031a54e76cbfe8fa4cedab58&amp;dn=StarDrive-FLT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"Mr.Stifmeister","files":-1,"time":1367005938,"description":"\n                                                               ANSi JED\n\n\n            In Their 26th Year Of Glory, FairLight Released #1085\n\n                      StarDrive (c) Iceberg Interactive\n\n:   Supplied by: FAIRLIGHT            : : Release Date: 26-04-2013           :\n    Cracked by:  FAIRLIGHT                Game Type:    Strategy\n    Packaged by: FAIRLIGHT                Image Format: ISO\n               -----\n    DISCS: 1 DVD                          Protection: Steam\n\n    System Requirements : Windows PC and Use of One's Brain\n\n\n Game information:\n =================\n\n StarDrive sets a new benchmark for the '4X Space Strategy' genre. Starting\n with a single planet and a small number of space-worthy vessels, you  must\n venture forth into the galaxy, conquer new worlds, build new colonies  and\n defend your very existence against those who would take what is yours. How\n you play is your decision. Use diplomacy or brute force.  Trade,  spy  and\n research your way to galactic domination. Make friends, or  create  mortal\n enemies...\n\n The heart of StarDrive is its ship design and combat engine.\n\n StarDrive takes a modular approach to ship design, allowing the player  to\n create custom ships where the composition and placement  of  ship  modules\n really matters to the performance of a ship.. In combat, if your  portside\n armour is taking a beating, then rotate around and show them the starboard\n side! Hide behind a friendly capital ship's shields; warp into and out  of\n the   fray,   launch   fighters,   lay   mines,   and   so   much    more.\n\n\n Features:\n =========\n * Real time gameplay with a seamless zoom from a grand strategic view to a\n   close-up action view\n * Choose from 8 beautifully rendered alien races or design your own to\n   lead into the stars; interact, negotiate and forge allegiances on your\n   way to victory\n * Expand your empire and colonize all kinds of planets, terraform and\n   populate them and build them into specialized centers of trade or\n   industry\n * Research and unlock an array of technologies to improve your military\n   and industrial capabilities\n * Control your ships with classic real time strategy commands or jump into\n   the fray by taking direct 'arcade' control of any ship in your empire\n * Create your unique ship designs with the modular ship design system and\n   determine your own fate in battle\n * Create custom fleet formations and set rules of engagement in the\n   easy-to-use fleet editor\n * Steal technologies, incite rebellions, or rob your enemies blind with a\n   rich agent-based espionage system\n * Deploy ground troops from orbit to defeat the enemies' last planetary\n   defenses in ground combat\n * Explore the rich universe that comes alive with random events, remnant\n   elements, hidden treasures, deep space terrors and late-game threats\n\n\n Installation Information:\n =========================\n\n * Burn or mount\n * Install\n * Play the game\n\n NOTE: As usual, block the game exe in your firewall.\n\n                                                             /TEAM FAiRLIGHT\n\n\n                    +-+  QUALITY, TRADITION  AND PRIDE +-+\n","torrent":{"xt":"urn:btih:bbe8b1e9daf75675031a54e76cbfe8fa4cedab58","amp;dn":"StarDrive-FLT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbe8b1e9daf75675031a54e76cbfe8fa4cedab58","infoHashBuffer":{"type":"Buffer","data":[187,232,177,233,218,247,86,117,3,26,84,231,108,191,232,250,76,237,171,88]},"announce":[],"urlList":[]}}