{"title":"Life And Debt - Jamaica, IMF &amp; World Bank","uid":3802714,"size":734228480,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bbffa7ae98183660b5b990b391cb3fa8971dee79&amp;dn=Life+And+Debt+-+Jamaica%2C+IMF+%26+World+Bank+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"fuctndabrain","files":1,"time":1189492188,"description":"In 1962, Jamaica won its independence from the United Kingdom, and the island nation, which had long struggled with poverty, attempted to use its agricultural resources in order to create a sound economic base. As Jamaica&amp;#039;s financial problems grew more severe with time, prime minister Michael Manley struck a deal in 1977 with a consortium of economic institutions through the International Monetary Fund, who would loan money to the nation in exchange for removal of trade restrictions and subsidized exports. Twenty-five years later, most Jamaicans would agree that the deal drove a stake through the island&amp;#039;s agricultural and industrial economy; imports from America have ruined the island&amp;#039;s dairy industry, interference from growers and merchants in the United States and Latin America have effectively ended the growing of onions, bananas, carrots, and potatoes as cash crops, the value of the Jamaican dollar has plummeted, and the island is now seven billion dollars in debt to the IMF, with interest driving that figure higher each day. Filmmaker Stephanie Black examines the sad state of Jamaica&amp;#039;s economy in the face of &quot;free trade&quot; in the global economy in the documentary Life + Debt, which includes interviews with Michael Manley and IMF director Stanley Fischer; the Jamaica Kincaid novel A Small Place provides some of the text for the film&amp;#039;s narration.","torrent":{"xt":"urn:btih:bbffa7ae98183660b5b990b391cb3fa8971dee79","amp;dn":"Life+And+Debt+-+Jamaica%2C+IMF+%26+World+Bank+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbffa7ae98183660b5b990b391cb3fa8971dee79","infoHashBuffer":{"type":"Buffer","data":[187,255,167,174,152,24,54,96,181,185,144,179,145,203,63,168,151,29,238,121]},"announce":[],"urlList":[]}}