{"title":"Kiteboarding Progression Beginner","uid":4865137,"size":1896979637,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bc386ea0d4acac0ed1faed3cfda34d5163f40b74&amp;dn=Kiteboarding+Progression+Beginner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"mondyciappina","files":1,"time":1240464416,"description":"Direct rip from DVD; separated into chapters.  Total length: 2.5 hours\n\n=====\n\nProfessional kiteboarders show each step of the learning process in a clear, concise, and easily replicated way. From setting up the kite to your first jump, Progression: Beginner safely demonstrates easy-to-learn ways to master kitesurfing. As a fully authorized IKO (International Kiteboarding Organization) instructional DVD, you can rest assured that Progression: Beginner will enhance the learning process, being the perfect companion to professional instruction. \n\nSubjects covered in Progression: Beginner include: Location and Conditions Equipment and Terminology Kite Setup Launching and Landing Kite Flying Body Dragging Re-launch and Self Rescue Waterstart Riding and Staying Upwind Change of Direction Jumping \n\nWith over 2 1/2 hours of meticulous instruction, slow motion run-throughs, and common problem analysis, you'll progress to intermediate level in no time! Don't expect to watch the DVD from start to finish each time, just focus in on the sections that you are currently looking to improve upon. So many people learn to kite and then struggle for months or even years trying to move on and progress through to the areas of kitesurfing that excite people in the first place. With this DVD we aim to get you riding confidently, staying upwind, carving turns and jumping into the sky.","torrent":{"xt":"urn:btih:bc386ea0d4acac0ed1faed3cfda34d5163f40b74","amp;dn":"Kiteboarding+Progression+Beginner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc386ea0d4acac0ed1faed3cfda34d5163f40b74","infoHashBuffer":{"type":"Buffer","data":[188,56,110,160,212,172,172,14,209,250,237,60,253,163,77,81,99,244,11,116]},"announce":[],"urlList":[]}}