{"title":"pinocchio di benigni 2002","uid":4723305,"size":733962240,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bd0eff9107c523df9040eea2f413700c59f8313c&amp;dn=pinocchio+di+benigni+2002&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"Anshaj22","files":1,"time":1234625608,"description":"Synopsis:  Roberto Benigni (LIFE IS BEAUTIFUL) brings Carlo Collodi's classic children's story to glorious life in this big budget live-action adaptation. Gepetto (Carlo Guiffre), a humble toy maker, fashions a marionette out of a log that has miraculously appeared on his doorstep. After wishing upon a star that his creation, Pinocchio (Benigni), would come to life, Gepetto's wish is granted by the beautiful Blue Fairy (Nicoletta Braschi). The only condition is that Pinocchio must prove his valor, and be completely honest at all times, in order to become a real boy. Unfortunately, this isn't easy for the enthusiastic puppet, who seems to find trouble everywhere he turns. After a long, tumultuous journey, in which Pinocchio is accosted by two corrupt thieves, turned into a donkey, and swallowed by a shark, Pinocchio is reunited with his father, setting up a final challenge that will prove once and for all if Pinocchio has the heart to become a real boy. Benigni's follow-up to the Oscar-winning LIFE IS BEAUTIFUL is a crowd-pleasing fantasy film, featuring beautiful cinematography from Dante Spinotti (HEAT, L.A. CONFIDENTIAL). The American release boasts the voices of actors Breckin Meyer, Glenn Close, and John Cleese.\n\n\n\n\npictures at:\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0255477/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0255477/&lt;/a&gt;","torrent":{"xt":"urn:btih:bd0eff9107c523df9040eea2f413700c59f8313c","amp;dn":"pinocchio+di+benigni+2002","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd0eff9107c523df9040eea2f413700c59f8313c","infoHashBuffer":{"type":"Buffer","data":[189,14,255,145,7,197,35,223,144,64,238,162,244,19,112,12,89,248,49,60]},"announce":[],"urlList":[]}}