{"title":"FutileStruggles - He Wanted A Pony Girl For Christmas 720p Compl","uid":11727129,"size":1468568745,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:bd2c2dadb951d7756b66e9433ba2675bbb6610dd&amp;dn=FutileStruggles+-+He+Wanted+A+Pony+Girl+For+Christmas+720p+Compl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":3,"uploader":"merzedes","files":174,"time":1425116613,"description":"FutileStruggles - He wanted a Pony Girl for Christmas 720p Complete \n\nFeaturing: Caroline Pierce\n\n\n4x720p MP4.\n\n\nCaroline Pierce is handcuffed and leg ironed on the floor. My son Frank, asked for a PonyGirl for Christmas and I thought it would be nice to have one around as well. I decided it would be a good father son project to train her together, but first I had to break her down a bit, so she could be presented on Christmas. She starts moaning through her harness panel ballgag and that's when I arrive to slap her ass, elbow cuff, and hogcuff her. I leave her to struggle. I return a bit later with Caroline's own crop. I pull up a chair and start cropping her tits. I squeeze and grope them before unbuttoning her shirt. Caroline yelps through her gag with even more intensity now as I crop her bare tits. She gets a few crops on her inner thighs, ass, and pussy as well. I continue manhandling her as I explain what is expected of her. I leave her to struggle once again as I get another tool. I put a shock collar around her neck with a remote control. I hear Caroline scream and see her twitch... Yes, It works. I leave her in her bondage for a while longer, before I release her from the Hogcuff, and put her on her knees. She is told to stay, and she does. So far her training seems to be working. She whines, as drool runs down from under the panel gag. The gag is removed and I ask her a few questions. I ask if she's ready to be my PonyGirl. She mumbles something and gets another shock. I ask again and she answers &quot;yes&quot;. Her training is coming along nicely. I remove her blindfold and I recuff her wrists in front, so she can strip, but first, I put blackout blinding contacts in her eyes.\n\nCaroline looks terrified as she tries to adjust to the contacts. I grope her tits and remove her ankle cuffs, before I stand her up. I smack her ass and order her to strip. She can't remove her shirt because she's cuffed, so I just cut it off her. I smack her bare ass and then go to get her new harness. I ask her what her name is again, and she mumbles incoherently. I give her another zap and she screams and huddles down. I remind her that she is the ponygirl. I recuff her wrists behind her back before I buckle her harness on her. I sit her in a chair and I put her boots back on her. I ask her to make some ponygirl sounds for me while I get the next part of her attire.\n\nI strap a head harness on The PonyGirl, and then I gag her with a metal bit gag with a large tongue port. She coughs and gags on the unforgiving protrusion at the back of her throat. A flow of snot and drool also stream down her chin as she does her best to deal with the gag. After a bit, I take it out and replace it with a rubber bit and tongue port. Although this gag is not nice, it seems like a treat compared to the other. I explain to her that I won't hesitate to use the other one again if she misbehaves. I have her count for me and she does it like a ponygirl should. I then remove her handcuffs and slide an armbinder over her arms. I lace it up and buckle the straps. \n\nI order the pony girl to turn in a tight circle so we can all see how pretty she looks in her leather harness and bondage. I then order her to jump up and down for a while. I the order her high step march in place like a proper ponygirl. Snot and drool continue to run down her chin as I cuff and hobble her ankles with a chain. I walk away from her and then I call her to me. She hears my voice and has to make her way towards me while blinded. I then walk to the other side and call her again. I order to stop with a whoooa. I nipple clamp her before I call her to me again a few more times. I then have her turn in a tight circle again. Ponygirl has been listening and obeying quite nicely and I believe she is ready to be presented to my son. She yelps as I remove the clamps. I place a pretty bow on each nipple and then I place a piece of tape on her forehead that says &quot;To Frank&quot;. She waits. \n\nI added a little deleted footage of Caroline with the metal bit gag with tongue port.  \n\nScreens &lt;a href=&quot;\nhttp://s27.postimg.org/hyudcn46b/Futile_Struggles_He_Wanted_A_Pony_Girl_For_Chri.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s27.postimg.org/hyudcn46b/Futile_Struggles_He_Wanted_A_Pony_Girl_For_Chri.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://s7.postimg.org/5cseqh6mz/Futile_Struggles_He_Wanted_A_Pony_Girl_For_Chri.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s7.postimg.org/5cseqh6mz/Futile_Struggles_He_Wanted_A_Pony_Girl_For_Chri.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://s1.postimg.org/h7d818gxr/Futile_Struggles_He_Wanted_A_Pony_Girl_For_Chri.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s1.postimg.org/h7d818gxr/Futile_Struggles_He_Wanted_A_Pony_Girl_For_Chri.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://s27.postimg.org/b3eq79z37/Futile_Struggles_He_Wanted_A_Pony_Girl_For_Chri.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s27.postimg.org/b3eq79z37/Futile_Struggles_He_Wanted_A_Pony_Girl_For_Chri.jpg&lt;/a&gt;\n\nUploaded by Merzedes and Shallow2\n\n16 000 Femdom/BDSM/Fetish torrentuploads completed. Man.. feels like every 1000 goes by faster and faster ;)\n\nJust keep on leaving us the nice comments below and we are happy :)\n\nAny Questions ?? Read our FAQ!!\n  \n &lt;a href=&quot;\nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg&lt;/a&gt;\n\nCheers  :-)","torrent":{"xt":"urn:btih:bd2c2dadb951d7756b66e9433ba2675bbb6610dd","amp;dn":"FutileStruggles+-+He+Wanted+A+Pony+Girl+For+Christmas+720p+Compl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd2c2dadb951d7756b66e9433ba2675bbb6610dd","infoHashBuffer":{"type":"Buffer","data":[189,44,45,173,185,81,215,117,107,102,233,67,59,162,103,91,187,102,16,221]},"announce":[],"urlList":[]}}