{"title":"Linwood Barclay - Broken Promise (Promise Falls #1)","uid":15252030,"size":300076110,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:bd6f38b6b57046d8f7ef6f4a7a26f77ef5f16086&amp;dn=Linwood+Barclay+-+Broken+Promise+%28Promise+Falls+%231%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"Cybotage","files":99,"time":1468064177,"description":"From New York Times bestselling author Linwood Barclay comes an explosive novel set in the peaceful small town of Promise Falls, where secrets can always be buried—but never forgotten.\r\n\r\nThe morning it all started, newspaper reporter David Harwood had plenty to worry about. A single parent with no job, forced to return with his young son to the small town of Promise Falls to live with his parents, the future wasn't looking too rosy.\r\n\r\nSo when his mother asked him to look in on his cousin, Marla, who was still not quite right after losing her baby, it was almost a relief to put the disaster his own life had become to one side. The relief wouldn't last long.\r\n\r\nWhen he gets to Marla's house he's disturbed to find a smear of blood on the front door. He's even more disturbed to find Marla nursing a baby, a baby she claims was delivered to her &quot;by an angel.&quot; And when, soon after, a woman's body is discovered across town, stabbed to death, with her own baby missing, it looks as if Marla has done something truly terrible.\r\n\r\nBut while the evidence seems overwhelming, David just can't believe that his cousin is a murderer. In which case, who did kill Rosemary Gaynor? And why did they then take her baby and give it to Marla?\r\n\r\nWith the police convinced they have an open and shut case, it's up to David to find out what really happened, but he soon discovers that the truth could be even more disturbing.\r\n\r\nRead by Quincy Dunn Baker, Brian O'Neill\r\nFormat: MP3\r\nBitrate: 64 Kbps\r\nUnabridged","torrent":{"xt":"urn:btih:bd6f38b6b57046d8f7ef6f4a7a26f77ef5f16086","amp;dn":"Linwood+Barclay+-+Broken+Promise+%28Promise+Falls+%231%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd6f38b6b57046d8f7ef6f4a7a26f77ef5f16086","infoHashBuffer":{"type":"Buffer","data":[189,111,56,182,181,112,70,216,247,239,111,74,122,38,247,126,245,241,96,134]},"announce":[],"urlList":[]}}