{"title":"Maya Fiennes - Kundalini Yoga to Detox and Destress","uid":8870401,"size":372625454,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:be4d5438166ef99a59fd5b1a8c233673d248d182&amp;dn=Maya+Fiennes+-+Kundalini+Yoga+to+Detox+and+Destress&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"acer47x","files":-1,"time":1378047582,"description":"You may have years of yoga experience, but if it's limited primarily to the hatha style that's practiced most commonly in the West, musician-instructor Maya Fiennes' Kundalini Yoga to Detox and Destress may prove very surprising--and in very a good way. The London-based Fiennes describes kundalini as both &quot;the mother of all yoga&quot; and &quot;among the easiest styles of yoga to learn&quot; (not to mention a good way to &quot;prepare for the Aquarian Age&quot; that's coming in 2012, for those watching their calendars), a combination of movement, breath, and chanting designed to awaken, energize, and relax. That may all be true, but the contrast to the more familiar hatha style is striking. Where the latter usually concentrates on holding poses, gradually but subtly deepening them over the course of several long breaths, kundalini features almost constant movement; rapid side arm extensions and seated lifts and drops (a bit like jumping up and down on a trampoline from a seated position) are but two examples of the intense but highly enjoyable routines demonstrated here, and although the entire 60-minute program is done seated, on the back, or an all fours--there are no standing poses whatsoever--it's plenty strenuous enough to provide a good workout. Indeed, even pranayama work like the &quot;breath of fire,&quot; featuring short, sharp, powerful inhalations and exhalations, is brisk and intense. Fiennes, who also supplied the rhythmic, pulsing music, offers explicit instructions and encouragement without being either frivolous or overly serious--a good balance, just like the practice itself. --Sam Graham\n\n\nProduct Description\n&quot;&quot;To be in her presence, and to feel her spirit, her energy, and her teaching is an extraordinary experience&quot;&quot; Deepak Chopra. Musician and yoga teacher Maya Fiennes combines her talents to create a stunningly beautiful Kundalini practice focused on fortifying the bodys stress defenses. Maya uses movement, breath, mantra, and chantsall set to her own exhilarating musicto awaken the spirit, energize the body, and relax the mind. These movement sequences are designed to detoxify and strengthen kidneys and adrenals, the bodys first line of defense against stress-induced illness. Among the easiest styles of yoga to learn, Kundalini can produce dramatic results quickly. Youll feel more awake and aware, healthier, and better able to face everyday challenges.","torrent":{"xt":"urn:btih:be4d5438166ef99a59fd5b1a8c233673d248d182","amp;dn":"Maya+Fiennes+-+Kundalini+Yoga+to+Detox+and+Destress","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be4d5438166ef99a59fd5b1a8c233673d248d182","infoHashBuffer":{"type":"Buffer","data":[190,77,84,56,22,110,249,154,89,253,91,26,140,35,54,115,210,72,209,130]},"announce":[],"urlList":[]}}