{"title":"Ultimate Marvel through December 1, 2014 (darkhomr)","uid":11647637,"size":11647877960,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:bedc5864f47196c6d90e0f6702e87d89bc269dcb&amp;dn=Ultimate+Marvel+through+December+1%2C+2014+%28darkhomr%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":3,"uploader":"dadrkhomr","files":-1,"time":1417842661,"description":"Ultimate Marvel is an imprint of comic books published by Marvel Comics, featuring reimagined and updated versions of the company's superhero characters, including Spider-Man, the X-Men, the Avengers, and the Fantastic Four. The imprint was launched in 2000 with the publication of the series Ultimate Spider-Man and Ultimate X-Men, giving new origins for the characters. The universe has been designated as Earth-1610[1] within the Marvel Multiverse, which comprises an infinite number of alternate universes.\n\n\n\nI have put together this torrent that many people asked for.  Included in this torrent is 700 comics between the 2000 launch of the Marvel Ultimate universe and now.  This is a rather large torrent, expecially for a comic book torrent. 10 Gigs is a lot to seed, but be patient.  \n\n\nHere are the rules for this torrent:\n\n1.  If you find something is missing  made in the next posting as I find them.  When pointing out what is possibly missing, please let me know.  I have done my best to make sure each title is complete, but mistakes happen.\n\n2.  This will be seeded 24/7 as long as my seedbox is running, but as long as you can try and help with the seeding.\n\n3.  Do NOt complain about the size of this torrent.  If you have a problem with the size of it, don't download it, or download it in parts.  The more current torrent clients allow you to deselect what you do not want.  Take responsibility for your part in this exchange.  \n\n4.  I have chosen a mixture of Empire, Minutemen, Novus and DCP scans of comics.  Please do not post or message that I should be going with (group name) because it is better. Feel free to message me with broken pages or issues opening.  Be reasonable though and understand that there are 2100 comics in this pack and I am sure that I missed one or two.  \n\nNow, enjoy, share, and help the community.  Your help could assist another in getting involved with reading comics","torrent":{"xt":"urn:btih:bedc5864f47196c6d90e0f6702e87d89bc269dcb","amp;dn":"Ultimate+Marvel+through+December+1%2C+2014+%28darkhomr%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bedc5864f47196c6d90e0f6702e87d89bc269dcb","infoHashBuffer":{"type":"Buffer","data":[190,220,88,100,244,113,150,198,217,14,15,103,2,232,125,137,188,38,157,203]},"announce":[],"urlList":[]}}