{"title":"The Art of Waiting - Belle Boggs","uid":15785663,"size":2130007,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bf36a574aeeb49d293a23a2e492cb95e26afecc5&amp;dn=The+Art+of+Waiting+-+Belle+Boggs&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"mr_mando","files":2,"time":1473317319,"description":"\nA brilliant exploration of the natural, medical, psychological, and political facets of fertility\r\n\r\nWhen Belle Boggs's &quot;The Art of Waiting&quot; was published in Orion in 2012, it went viral, leading to republication in Harper's Magazine, an interview on NPR's The Diane Rehm Show, and a spot at the intersection of &quot;highbrow&quot; and &quot;brilliant&quot; in New York magazine's &quot;Approval Matrix.&quot;\r\n\r\nIn that heartbreaking essay, Boggs eloquently recounts her realization that she might never be able to conceive. She searches the apparently fertile world around her--the emergence of thirteen-year cicadas, the birth of eaglets near her rural home, and an unusual gorilla pregnancy at a local zoo--for signs that she is not alone. Boggs also explores other aspects of fertility and infertility: the way longing for a child plays out in the classic Coen brothers film Raising Arizona; the depiction of childlessness in literature, from Macbeth to Who's Afraid of Virginia Woolf?; the financial and legal complications that accompany alternative means of family making; the private and public expressions of iconic writers grappling with motherhood and fertility. She reports, with great empathy, complex stories of couples who adopted domestically and from overseas, LGBT couples considering assisted reproduction and surrogacy, and women and men reflecting on childless or child-free lives.\r\n\r\nIn The Art of Waiting, Boggs deftly distills her time of waiting into an expansive contemplation of fertility, choice, and the many possible roads to making a life and making a family","torrent":{"xt":"urn:btih:bf36a574aeeb49d293a23a2e492cb95e26afecc5","amp;dn":"The+Art+of+Waiting+-+Belle+Boggs","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf36a574aeeb49d293a23a2e492cb95e26afecc5","infoHashBuffer":{"type":"Buffer","data":[191,54,165,116,174,235,73,210,147,162,58,46,73,44,185,94,38,175,236,197]},"announce":[],"urlList":[]}}