{"title":"100 Cases in Radiology [PDF] [StormRG]","uid":10423613,"size":8311049,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bf3aed5db780652bcf40ebf3034106f193c963ac&amp;dn=100+Cases+in+Radiology+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"0xmovva","files":3,"time":1403673259,"description":"Author: Robert Thomas, James Connelly, Christopher Burke\nSeries: 100 Cases (Book 9)\nPaperback: 320 pages\nPublisher: CRC Press; 1 edition (February 24, 2012)\nLanguage: English\nISBN-10: 1444123319\nISBN-13: 978-1444123319 \nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n___________________________________________________________________________________\n\nA 36-year-old housewife presents in the emergency department complaining of progressively increasing breathlessness over the last two weeks, accompanied by wheeze and a productive cough. You are the medic on duty...\n\n100 Cases in Radiology presents 100 radiological anomalies commonly seen by medical students and junior doctors on the ward, in outpatient clinics or in the emergency department. A succinct summary of the patient's history, examination and initial investigations, including imaging photographs, is followed by questions on the diagnosis and management of each case. The answer includes a detailed discussion of each topic, with further illustration where appropriate, providing an essential revision aid as well as a practical guide for students and junior doctors.\n\nMaking clinical decisions and choosing the best course of action is one of the most challenging and difficult parts of training to become a doctor. These cases will teach students and junior doctors to recognize important radiological signs, and the medical and/or surgical conditions to which these relate, and to develop their diagnostic and management skills.","torrent":{"xt":"urn:btih:bf3aed5db780652bcf40ebf3034106f193c963ac","amp;dn":"100+Cases+in+Radiology+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf3aed5db780652bcf40ebf3034106f193c963ac","infoHashBuffer":{"type":"Buffer","data":[191,58,237,93,183,128,101,43,207,64,235,243,3,65,6,241,147,201,99,172]},"announce":[],"urlList":[]}}