{"title":"Adrian Wallwork - English for Academic Research. Grammar Exercis","uid":9919594,"size":950550,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c0032f8211b1dc7e3ea2636bd0a9a87d63f955d7&amp;dn=Adrian+Wallwork+-+English+for+Academic+Research.+Grammar+Exercis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":2,"uploader":"Anette14","files":4,"time":1396989087,"description":"Description\nProduct details\nBook Title: English for Academic Research: Grammar Exercises\t\nBook Author: Adrian Wallwork (Author)\nPaperback: 188 pages\nPublisher: Springer; 2013 edition (26 Sep 2012)\nLanguage: English\nISBN-10: 1461442885\nISBN-13: 978-1461442882\n\nBook Description\nPublication Date: 26 Sep 2012 | ISBN-10: 1461442885 | ISBN-13: 978-1461442882 | Edition: 2013\nThis book is based on a study of referees' reports and letters from journal editors on reasons why papers written by non-native researchers are rejected due to problems with English grammar. It draws on English-related errors from around 5000 papers written by non-native authors, several hundred emails, 500 abstracts by PhD students, and over 1000 hours of teaching researchers how to write and present research papers. The exercises include the following areas: active vs passive, use of we articles (a/an, the, zero) and quantifiers (some, any, few etc)conditionals and modals countable and uncountable nouns genitive infinitive vs -ing form numbers, acronyms, abbreviations relative clauses and which vs that tenses (e.g. simple present, simple past, present perfect)word order Exercise types are repeated for different contexts. For example, the difference between the simple present, present perfect and simple past is tested for use in papers, referees' reports, and emails of various types. Such repetition of similar types of exercises is perfect for revision purposes. English for Academic Research: Grammar Exercises is designed for self-study and there is a key to all exercises. Most exercises require no actual writing but simply choosing between various options, thus facilitating e-reading and rapid progress. The exercises can also be integrated into English for Academic Purposes (EAP) and English for Special Purposes (ESP) courses at universities and research institutes. The book can be used in conjunction with the other exercise books in the series and is cross-referenced to: English for Research: Usage, Style, and Grammar English for Writing Research Papers, English for Academic Correspondence and Socializing Adrian Wallwork is the author of around 30 ELT and EAP textbooks. He has trained several thousand PhD students from 35 countries to write and present academic work. English for Writing Research Papers, English for Academic Correspondence and Socializing Adrian Wallwork is the author of around 30 ELT and EAP textbooks. He has trained several thousand PhD students from 35 countries to write and present academic work. English for Academic Correspondence and Socializing Adrian Wallwork is the author of around 30 ELT and EAP textbooks. He has trained several thousand PhD students from 35 countries to write and present academic work.\n\nAbout the Author\nAdrian Wallwork is the author of around 30 ELT and EAP textbooks. He has trained several thousand PhD students from 35 countries to write and present academic work.\n","torrent":{"xt":"urn:btih:c0032f8211b1dc7e3ea2636bd0a9a87d63f955d7","amp;dn":"Adrian+Wallwork+-+English+for+Academic+Research.+Grammar+Exercis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0032f8211b1dc7e3ea2636bd0a9a87d63f955d7","infoHashBuffer":{"type":"Buffer","data":[192,3,47,130,17,177,220,126,62,162,99,107,208,169,168,125,99,249,85,215]},"announce":[],"urlList":[]}}