{"title":"Metallica - Live Shit - Binge Purge (Live In Seatle) (1989)","uid":11406305,"size":1468932096,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c087de61d55ac5391b7099ac4e260873b0a8c6d6&amp;dn=+Metallica+-+Live+Shit+-+Binge+Purge+%28Live+In+Seatle%29+%281989%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"analogkid6103","files":1,"time":1415481252,"description":"Metallica dominated heavy metal music in the 1980s and 1990s, emerging as one of the top musical acts in history by the end of the century. Drummer Lars Ulrich (26 December 1963) and guitarist James Hetfield (3 August 1963) started the band in 1981. After a few line-up changes (including guitarist Dave Mustaine, who left in 1982 to form Megadeath), the band released Kill 'Em All in 1983 and toured the U.S. with Ulrich, Hetfield, guitarist Kirk Hammett (18 November 1962) and bass player Cliff Burton (10 February 1962).\n\nIn 1986 the band released Master of Puppets, signalling their development from speed metal thrashers to serious songsmiths who could pound out the heavy riffs. That same year a bus accident claimed the life of Burton, and Jason Newsted (4 March 1963) joined the band. Their major-label release ...And Justice For All was a critical and popular success (they had a top 40 hit with &quot;One&quot; ), and the band toured relentlessly. Their so-called &quot;black&quot; album in 1991 included the hit song &quot;Enter Sandman,&quot; and their exposure on MTV helped make them superstars.\n\nIn 1996 they released Load, followed the next year by Reload, both top-selling albums that solidified Metallica's presence in mainstream rock. In 2000 they were in the news regularly for their legal battle with the online file sharing service, Napster, and drummer Ulrich appeared before the United States Senate, explaining to a sympathetic Orrin Hatch that file sharing was, in fact, stealing. Eventually Metallica and Napster reached an agreement,Which left me pissed,embittered and resolute to erase them from my world. which I mistakenly did (more on that at bottom) but in 2001 Jason Newsted left the band and James Hetfield entered a substance abuse rehabilitation program, leaving the band's latest recording on hold.\n\n1989 Live Shit: Binge &amp; Purge (Live In Seatle)\n\nTracklist:\n\n1. &quot;The Ecstasy Of Gold&quot;\n2. &quot;Blackened&quot;\n3. &quot;For Whom the Bell Tolls&quot;\n4. &quot;Welcome Home (Sanitarium)&quot;\n5. &quot;Harvester of Sorrow&quot;\n6. &quot;The Four Horsemen&quot;\n7. &quot;The Thing That Should Not Be&quot;\n8. &quot;Master of Puppets&quot;\n9. &quot;Fade to Black&quot;\n10. &quot;Seek and Destroy&quot;\n11. &quot;...And Justice For All&quot;\n12. &quot;One&quot;\n13. &quot;Creeping Death&quot;\n14. &quot;Battery&quot;\n15. &quot;Last Caress&quot;\n16. &quot;Am I Evil?&quot;\n17. &quot;Whiplash&quot;\n18. &quot;Breadfan&quot;\n\nQuality: DVDRip\nFormat: MP4\nVideo codec: H.264\nAudio codec: AAC\nVideo: MPEG4 Video (H264) 368x272 (640Kbps)\nAudio: AAC 48000Hz stereo 192Kbps\n\n\nSound: The sound of this DVD is great, but it gives you live feeling, not album sound. As many know Metallica is one of the best heavybands in this world and they know how to deliver their music. As always they perform it well. This shows Metallica in '89 and '92, and you get three CDs with a live concert from Mexico in '93, you get very much for your money. // 10\n\nContent: This DVD was made around the time of ...And Justice For All and Metallica(Black album) so it has many songs from those albums, but there are many songs from the other albums to. This is the best live DVD concert I own, it is even better than S&amp;M and Iron Maiden's Rock In Rio. I am very much satisfied with the setlist because there are so many good songs there. They should have had Disposable Heroes and Ride The Lightning and it would have been the perfect Metallica setlist. It does have some photos and at the San Diego disc from '92 there is a 20 minuts long documentary about Metallica and the making of the Metallica album. And at the Seattle disc from '89 there are flash &quot;forward&quot; where you see what that has happened between '92 and '89. There are also many goood things such as Hammett playing Little Wing by Jimi Hendrix and Hetfield and Ulrich battling each other on the drums. Plus a long Seek And Destroy in San Diego where Hetfield is getting down with the audience and singing with them. And Lars running from one drumkit to another during a song. // 10\n\nProduction Quality: It is perfect quality which are being used filming these shows. They are filmed from many different gigs. It must have been trendy at that time, but Metalica have used it like that ever since. // 10\n\nOverall Impression: It is as good as most of the album songs, the only thing which is bad is that they dont play the whole Master Of Puppets in '92. The most impressive thing about this DVD is the overall Metalica experience you get from it. I just love this DVD, can't hate Metallica! If some punk stole this disc I would buy a new, and if I knew who it was I would take it back! Boys and girls, run out and buy this now! // 10\n\n\nMaster of puppets song as a part of the whole live show, sorry about being not able to find it separate...\nUPLOADER SPEAKS- As some may have noticed I have been posting a lot of metallica lately Just to make up for the complete ignoring of them because of the napster debacle and Hetfields attitude about filesharing. I did not listen to,post, or promote them in any way shape or form at all from the conclusion of the napster trial. That was the wrong decision I made that was exactly what they wanted. So Im uploading them with a vengeance and fury that is as fierce and non compromising as the music. Thanks for listening to my uploads and in some cases watching them as I am a Music uploader who for the most part handles Metal. with some exceptions but not to many.For more on that and whatever, take a look at my pages and it becomes apparent what Im doing. Peace\n\n\nGenre: Bootleg Video\nSubgenre: Thrash Metal\nBitrate: Others\nSize: 843.96 MB\n1 file","torrent":{"xt":"urn:btih:c087de61d55ac5391b7099ac4e260873b0a8c6d6","amp;dn":"+Metallica+-+Live+Shit+-+Binge+Purge+%28Live+In+Seatle%29+%281989%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c087de61d55ac5391b7099ac4e260873b0a8c6d6","infoHashBuffer":{"type":"Buffer","data":[192,135,222,97,213,90,197,57,27,112,153,172,78,38,8,115,176,168,198,214]},"announce":[],"urlList":[]}}