{"title":"Steven Myers - The New Tsar:The Rise and Reign of Vladimir Putin","uid":14294826,"size":15393084,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c08cc108a71fad16c3ee163d80e864516749f19b&amp;dn=Steven+Myers+-+The+New+Tsar%3AThe+Rise+and+Reign+of+Vladimir+Putin&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"SectorVector","files":1,"time":1460438220,"description":"The New Tsar: The Rise and Reign of Vladimir Putin by Steven Lee Myers\r\n\r\nPages     : 592 pages\r\nPublisher : Knopf (September 29, 2015)\r\nISBN-13   : 978-0307961617\r\nFormat    : epub\r\n\r\n\r\nThe New Tsar is the book to read if you want to understand how Vladimir Putin sees the world and why he has become one of the gravest threats to American security.\r\n\r\nThe epic tale of the rise to power of Russia's current president—the only complete biography in English – that fully captures his emergence from shrouded obscurity and deprivation to become one of the most consequential and complicated leaders in modern history, by the former New York Times Moscow bureau chief.\r\n\r\n In a gripping narrative of Putin’s rise to power as Russia’s president, Steven Lee Myers recounts Putin’s origins—from his childhood of abject poverty in Leningrad, to his ascension through the ranks of the KGB, and his eventual consolidation of rule. Along the way, world events familiar to readers, such as September 11th and Russia’s war in Georgia in 2008, as well as the 2014 annexation of Crimea and the ongoing conflict in Ukraine, are presented from never-before-seen perspectives.  \r\n\r\nThis book is a grand, staggering achievement and a breathtaking look at one man’s rule. On one hand, Putin’s many reforms—from tax cuts to an expansion of property rights—have helped reshape the potential of millions of Russians whose only experience of democracy had been crime, poverty, and instability after the fall of the Soviet Union. On the other hand, Putin has ushered in a new authoritarianism, unyielding in his brutal repression of revolts and squashing of dissent. Still, he retains widespread support from the Russian public. \r\n\r\nThe New Tsar is a narrative tour de force, deeply researched, and utterly necessary for anyone fascinated by the formidable and ambitious Vladimir Putin, but also for those interested in the world and what a newly assertive Russia might mean for the future","torrent":{"xt":"urn:btih:c08cc108a71fad16c3ee163d80e864516749f19b","amp;dn":"Steven+Myers+-+The+New+Tsar%3AThe+Rise+and+Reign+of+Vladimir+Putin","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c08cc108a71fad16c3ee163d80e864516749f19b","infoHashBuffer":{"type":"Buffer","data":[192,140,193,8,167,31,173,22,195,238,22,61,128,232,100,81,103,73,241,155]},"announce":[],"urlList":[]}}