{"title":"SimCity Digital Deluxe (2013) [Origin-rip, No crack]","uid":8237721,"size":4079422609,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c0c50609f4c751a701183e52dde501137ab8151a&amp;dn=SimCity+Digital+Deluxe+%282013%29+%5BOrigin-rip%2C+No+crack%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"bloc97","files":-1,"time":1362882791,"description":"Build Description: SimCity SL Shipping Data Build\nBuild Version: 257517359 / 13.02.28_12.35.59\nChangelist Number: 726228\n\nThis is ripped directly from Origin, and does not contain ANY crack, you will have to find one yourself.\n\nSimCity is a city-building and urban planning simulation video game developed by Maxis, a subsidiary of Electronic Arts. Released for Microsoft Windows in early March 2013, it's the first major installment in the SimCity series since the release of SimCity 4 a decade prior. An OS X version is scheduled for release during Q1/Q2 2013.\n\nThe game is considered to be a reboot of the SimCity series. Players can create a settlement that can grow into a city by zoning land for commercial, industrial, or residential development, as well as building and maintaining public services, transport and utilities. SimCity utilizes a new engine called GlassBox, allowing for more detailed simulation than previous games. Throughout its development, SimCity received critical acclaim for its new engine and reimagined gameplay, however publications cautioned the game's use of a persistent internet connection, with which it stores saved games and allows players to share resources.\nPrior to release SimCity received positive reviews, however the game's launch was met with negative reception as a result of widespread technical problems. These issues included network outages, problems with saving progress and difficulty connecting to the game's servers. As a result, some reviewers were unable to review the game, labeling the launch as a &quot;disaster&quot; and the game as &quot;unplayably broken&quot;, urging players to avoid purchasing the game until the issues were resolved.\n\nHappy gaming!,\n-Bloc97","torrent":{"xt":"urn:btih:c0c50609f4c751a701183e52dde501137ab8151a","amp;dn":"SimCity+Digital+Deluxe+%282013%29+%5BOrigin-rip%2C+No+crack%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0c50609f4c751a701183e52dde501137ab8151a","infoHashBuffer":{"type":"Buffer","data":[192,197,6,9,244,199,81,167,1,24,62,82,221,229,1,19,122,184,21,26]},"announce":[],"urlList":[]}}