{"title":"Tomb Raider: The Last Revelation - Chronicles - GOG","uid":7902950,"size":1306367526,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c10047c68d72f2c9895e5499c7c631d252efce9f&amp;dn=Tomb+Raider%3A+The+Last+Revelation+-+Chronicles+-+GOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":2,"uploader":"AN0NYMOUS142857","files":-1,"time":1355004231,"description":"Includes Tomb Raider: The Last Revelation and Tomb Raider Chronicles.\nUtilize new moves to overcome obstacles: walk along tightropes, swing across parallel bars, and stealthily attack your enemies with silent hand-to-hand combat takedowns.\nExplore tombs as a teenage Lara Croft discovering her roots as an adventurer.\nHighly interactive environments: light torches, swing from ropes, and kick down doors.\n\nOverview:\n\nWhen Lara was only 16, she was tutored in archaeology by Professor Werner Von Croy, a world-famous archaeologist. Skip forward now, to find Lara in Egypt, minding her own business until a pool of quicksand pulls her underground, deep into an ancient tomb. Here she unwittingly releases the evil god Set, and for the rest of the game her ultimate aim is to recapture him and return him to his prison. Tomb Raider: The Last Revelation follows her quest through 43 levels, all set in the same underground world, so the story moves as seamlessly and effortlessly as the famous Tomb Raider herself.\n\nIn Tomb Raider Chronicles, Lara is still missing in Egypt and there is no word about her whereabouts. Fearing the worst, her closest friends arrange a service in her honor and to share their insights about some of Laraï¿½s more mysterious exploits. Tomb Raider Chronicles offers new insights into the past adventures of Lara Croft along with a host of new weapons such as the grappling hook gun and a sniper rifle. If you feel creative and want to make your own adventures, the official Tomb Raider Level Editor is included with the game.\n\nMinimum system requirements: Windows XP / Windows Vista / Windows 7, 1.8 GHz Processor, 512MB RAM (1 GB recommended), 3D graphics card compatible with DirectX 7 (compatible with DirectX 9 recommended), 2GB HDD, Mouse, Keyboard.\n\nACCEPTANCE OF END USER LICENSE AGREEMENT REQUIRED TO PLAY\n\nInstall and Play.","torrent":{"xt":"urn:btih:c10047c68d72f2c9895e5499c7c631d252efce9f","amp;dn":"Tomb+Raider%3A+The+Last+Revelation+-+Chronicles+-+GOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c10047c68d72f2c9895e5499c7c631d252efce9f","infoHashBuffer":{"type":"Buffer","data":[193,0,71,198,141,114,242,201,137,94,84,153,199,198,49,210,82,239,206,159]},"announce":[],"urlList":[]}}