{"title":"Paul Young - The Essential Paul Young","uid":5399259,"size":76499560,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c134e017f053ec024389cc1e3d7128d8ff1cf220&amp;dn=Paul+Young+-+The+Essential+Paul+Young&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":2,"uploader":"piratetorrent1989","files":-1,"time":1267318437,"description":"Paul Young was born in Luton, Bedfordshire, England. He has an older brother, Mark Young, and a younger sister, Joanne Young.[1] As a youth, after school, he played football for the Vauxhall Motors factory and in his spare time played in several bands as a bass guitarist. The first group for which he became lead singer was Kat Kool &amp; The Kool Kats.\n\nIn the late 1970s he joined Streetband, who had one Top 20 hit in the UK, with the humorous, novelty track &quot;Toast&quot;. The single peaked at No. 18 in November 1978. In December 1979 the Streetband broke up and Young formed the Q-Tips, who established their name by playing live but had no hits in the UK, although their single &quot;Letter Song&quot; did enjoy minor success in mainland Europe.\n\nThe Q-Tips disbanded in 1982, and Young was signed by CBS Records as a solo performer. Helped by the driving sound of Pino Palladino's fretless bass in his backing band, his first two singles, &quot;Iron Out the Rough Spots&quot; and a cover of &quot;Love of the Common People&quot; had no success, but the third, a cover of the Marvin Gaye classic &quot;Wherever I Lay My Hat (That's My Home)&quot; reached No. 1 in the UK singles chart for three weeks in the summer of 1983, the first of fourteen British Top 40 singles he had (the song was included on the soundtrack of the 1992 British comedy film Peter's Friends).\n\nSimilar success followed all over Europe. In the UK, follow-up single &quot;Come Back and Stay&quot; reached No. 4, and a re-release of &quot;Love of the Common People&quot; made it to No. 2 and even received radio airplay in the United States, while his debut album No Parlez was certified platinum in various countries.\n\nYoung's style at the time was a warm, approachable white soul, though he sometimes received playful criticism for his fashion decisions. However, his choice of an Antony Price silk suit for the cover of No Parlez proved to be impractical for the concert stage, where his energetic shows dictated more robust clothing.\n\nThe year 1984 was a difficult one for Young, as his first heavy promotional and live concert tour of America strained his vocal cords severely, to the extent that he was completely unable to sing at all for most of the year.[citation needed] He recovered sufficiently to provide a famous performance of the opening line to the Band Aid single &quot;Do They Know It's Christmas?&quot; and for his second album, The Secret of Association, which secured his future success in the United States, Japan and Australia. However, he continued to have occasional voice and throat difficulties.\n\nYoung's biggest worldwide hit followed in 1985 with a version of Daryl Hall's &quot;Everytime You Go Away.&quot; The song reached #1 on the U.S. pop charts, and he performed it during the London segment of the Live Aid concert. In 1990, he released a cover of The Chi-Lites' song &quot;Oh Girl,&quot; which peaked at #8 on the Billboard Hot 100.\n\nHe continued to have a successful career, with some highlights such as singing the Crowded House track &quot;Don't Dream It's Over&quot; at the Nelson Mandela 70th Birthday Tribute in 1988, producing a popular duet, &quot;Senza una donna (Without a Woman),&quot; with Italian blues singer Zucchero in 1991, and singing &quot;Radio Ga Ga&quot; with the surviving members of Queen in 1992, at The Freddie Mercury Tribute Concert soon after Freddie Mercury died. In 1991, he recorded a duet with Irish group Clannad for the Blake Edwards film Switch, a cover of the Joni Mitchell song, &quot;Both Sides Now&quot;.\n\n&quot;Don't Dream It's Over&quot;, &quot;Senza una donna (Without a Woman)&quot; and &quot;Both Sides Now&quot; were all featured on his first greatest hits album, From Time To Time - The Singles Collection, released in 1990, including the most prominent hit singles from his first four solo albums, the three above mentioned songs and a fourth, previously unreleased, selection called &quot;I'm Only Foolin' Myself&quot;.\nLos Pacaminos at the 2006 Wickham Festival\n\nIn 1993, Young was freed from his contract with the CBS/Sony Records label, and he released fewer solo albums after that. He reformed the Q-Tips for a short series of concerts that year. He contributed to the Vangelis album Voices in 1995. Young sang the British national anthem, &quot;God Save the Queen,&quot; on the eve of England's Euro '96 semifinal match against Germany. From there, he was known to divide his time between family, the informal Tex-Mex group Los Pacaminos, and performing live during '80s revival tours in the UK between 2001 and 2008. In November 2001, when Paul was on the final night of the Here and Now tour, Michael Aspel awarded him his This is Your Life book. The show went out on BBC One on 5 December that year.\n\nIn September 2006, he appeared in the BBC1 cooking show Celebrity Masterchef, and won his show, allowing him a place in the semi-finals. A year later, he was a contestant on another cooking show, ITV's Hell's Kitchen.\n\nTracks:\n\nEvery Time You Go Away\nCome Back And Stay\nWherever I Lay My Hat (That's My Home)\nLove Of The Common People\nSenza Una Donna (Without a Woman) - Duet With Zucchero\nTomb Of Memories\nI'm Gonna Tear Your Playhouse Down\nEverything Must Change\nWhat Becomes of the Broken Hearted\nHeart Full Of Rain\nDon't Dream It's Over\nNow I Know What Made Otis Blue\nSome People\nOh Girl\nSoftly Whispering I Love You\nIt Was a Very Good Year\nI Close My Eyes And Count To Ten (Live)\nLove Will Tear Us Apart (Live","torrent":{"xt":"urn:btih:c134e017f053ec024389cc1e3d7128d8ff1cf220","amp;dn":"Paul+Young+-+The+Essential+Paul+Young","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c134e017f053ec024389cc1e3d7128d8ff1cf220","infoHashBuffer":{"type":"Buffer","data":[193,52,224,23,240,83,236,2,67,137,204,30,61,113,40,216,255,28,242,32]},"announce":[],"urlList":[]}}