{"title":"How to Lie with Statistics: come difendersi [PDF - ENG] Riconosc","uid":5714351,"size":8147625,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:c17d268e43b41d60bd1dd756c34883aed08811f7&amp;dn=How+to+Lie+with+Statistics%3A+come+difendersi+%5BPDF+-+ENG%5D+Riconosc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"exportacc","files":1,"time":1280025063,"description":"How to Lie with Statistics: come difendersi [PDF - ENG] Riconoscere inganni e propaganda nell'abuso di statistiche\n\nHow to Lie with Statistics\nCome ingannare con le statistiche\nOvvero: come i politici e la pubblicita' continuano ad ingannarci\nMetodi di autodifesa da propaganda (pubblicitaria e non) basata su manipolazione e abuso delle statistiche.\nLingua: Inglese\nAutore: Darrell Huff\npagine 146 [suddivise in 73 pagine PDF]\n\nQuesto libro usato nelle scuole di statistica e famoso in tutto il mondo, e' utile a creare le miglior difese di cui il cittadino-elettore-consumatore ha bisogno per districarsi nella giungla di sondaggi-grafici troppo spesso ingannevoli e studi pagnoncellici che popolano la propaganda nostrana e gli slogan piu' o meno pubblicitari.\n\nper maggiori info: en.wikipedia.org/wiki/How_To_Lie_With_Statistcs\n[IMG]http://upload.wikimedia.org/wikipedia/en/thumb/2/2a/How_to_Lie_with_Statistics.jpg/100px-How_to_Lie_with_Statistics.jpg[/IMG]\n\nda en.wikipedia.org:\nHow to Lie with Statistics e' un libro scritto da Darrell Huff nel 1954 che presenta un'introduzione alle statistiche per il lettore comune. E' un breve volume illustrato che sottolinea i comuni errori, sia in buona e sia in mala fede, associati con l'interpretazioen delle statistiche, e come questi errori possano portare a conclusioni inaccurate. E' diventato uno dei libri di statistica piu' vastamente letti nella storia (anche nonostante Huff non fosse uno statistico ), con oltre un milione e mezzo di copie vendute nell'edizione in lingua inglese[1]. E' anche stata ampliamente tradotta.\n\n   1. ^ &quot;Negli ultimi 50 anni, How to Lie with Statistics ha venduto piu' copie di orni altro testo statistico.&quot; J.M. Steele. &quot;Darrell Huff and Fifty Years of How to Lie with Statistics. Statistical Science, 20 (3), 2005, 205*209.[http://www-stat.wharton.upenn.edu/~steele/Publications/PDF/TN148.pdf]\n\n\nArgomenti del libro includono &quot;La correlazione non implica causa&quot; e &quot;L'uso dei campioni casuali&quot;. mostra inoltre come i grafici statistici possano essere usati per distorcere la realta' ....\n-------\nIl libro riporta molti esempi, sia teorici che reali di come aziende, pubblicita' e politici usano la statistica in maniera distorta per perseguire i loro fini...\nDagli esempi si possono notare numerose analogie con le propagande odierne:\nil governo dice: chi usa eroina in passato uso' marijuana, percio': chi usa marijuana per forza in futuro usera' eroina\nquesto e' un'esempio di manipolazione/costruzione di rapporto di causa-effetto.\nSe cio' fosse vero sarebbe anche vero che: tutti i rapinatori da piccoli bevevano latte; quindi tutti i lattanti da grandi rapineranno una banca.\nQuest'ultimo caso e' vistosamente assurdo, ma purtoppo il primo caso e' piu' subdolo (droga leggera porta a droga pesante) ed e' propaganda che continua a mietere vittime (proibizionismo).\nUn' esempio diretto letteralmente riportato nel libro e' quello dei test di laboratorio sull'efficacia di un dentifricio.\nL' azienda produttrice diceva: nove volte su dieci e' migliore di altri dentifrici. L'autore si informo' e scopri che quei dieci risultati di cui nove erano positivi, venivano selezionati da centinaia di risultati.\nAltro caso di manipolazione spiegato e' quello di confondere il pubblico presentando come media la media aritmetica, o la mediana oppure la moda, a seconda di quella che serve ad ottenere il risultato voluto.\n\n\nENG:\nHow to Lie with Statistics\nFrom Wikipedia, the free encyclopedia\n146 pages [73 PDF pages (each one is 2 pages)]\n\nHow to Lie with Statistics is a book written by Darrell Huff in 1954 presenting an introduction to statistics for the general reader. It is a brief, breezy, illustrated volume outlining common errors, both intentional and unintentional, associated with the interpretation of statistics, and how these errors can lead to inaccurate conclusions. It has become one of the most widely read statistics books in history (even though Huff was not a statistician), with over one and a half million copies sold in the English-language edition[1]. It has also been widely translated.\n\nThemes of the book include &quot;Correlation does not imply causation&quot; and &quot;Using Random Sampling&quot;. It also shows how statistical graphs can be used to distort reality ...\n\n   1. ^ &quot;Over the last fifty years, How to Lie with Statistics has sold more copies than any other statistical text.&quot; J.M. Steele. &quot;Darrell Huff and Fifty Years of How to Lie with Statistics. Statistical Science, 20 (3), 2005, 205*209.[http://www-stat.wharton.upenn.edu/~steele/Publications/PDF/TN148.pdf]\n\n\nse vi piace questa release forse vi interesseranno anche le atre mie rel:\n\nLe mie releases|My other releases|Mis otros torrentes: &lt;a href=&quot;\nhttp://tracker.btarena.org/account-details.php?id=35713&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tracker.btarena.org/account-details.php?id=35713&lt;/a&gt; &lt;a href=&quot;\nhttp://thepiratebay.se/user/exportacc/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/exportacc/&lt;/a&gt; &lt;a href=&quot;\nhttp://ilcorsaronero.info/usr/53046&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ilcorsaronero.info/usr/53046&lt;/a&gt; &lt;a href=&quot;\nhttp://1337x.org/user/exportaccoun/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://1337x.org/user/exportaccoun/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.torrentmatrix.com/account-details.php?id=874873&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.torrentmatrix.com/account-details.php?id=874873&lt;/a&gt;\n\n\n\n[URL=http://forum.RnT.ScazzoepicoVillage.scaxxoepico.orgi4/RnTforum/index.php?showtopic=190694]link[/URL]","torrent":{"xt":"urn:btih:c17d268e43b41d60bd1dd756c34883aed08811f7","amp;dn":"How+to+Lie+with+Statistics%3A+come+difendersi+%5BPDF+-+ENG%5D+Riconosc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c17d268e43b41d60bd1dd756c34883aed08811f7","infoHashBuffer":{"type":"Buffer","data":[193,125,38,142,67,180,29,96,189,29,215,86,195,72,131,174,208,136,17,247]},"announce":[],"urlList":[]}}