{"title":"SRS Audio Sandbox 1.10.2.0","uid":5283986,"size":7407942,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c1a9481df20673c7bc31a38efbe3cb94c83e00c0&amp;dn=SRS+Audio+Sandbox+1.10.2.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"aoloffline","files":1,"time":1263651363,"description":"SRS Audio Sandbox is the ultimate audio enhancement software for the PC. Experience amazing sound tailored to any PC speaker configuration - headphones, stereo speakers, or surround speakers, all with the click of a button. Users simply select their audio content (e.g. music, movie, game or voice) and then choose from many presets (i.e. rock music, classical, jazz, country, etc).\n\nFor users who want even more customization, SRS Audio Sandbox lets you personalize your audio through the use of advanced controls, which provide deep, rich bass, restore the clarity to vocal and high frequency sounds, provide 3D enhancement for stereo and mono content, and more.\n\nBest of all, SRS Audio Sandbox allows users to experience surround sound on their PC, regardless of their speaker arrangement, even over headphones.  SRS technology is able to overcome the physical limitations of poorly placed or small size speakers, delivering the best entertainment experience available on a PC. \n\n    *\n\n      Realistic surround sound experience from desktop speakers, internal notebook speakers and headphones\n    *\n\n      Improved bass\n    *\n\n      Dialog clarity makes vocals easier to understand\n    *\n\n      Delivers a more lively and brilliant sound by highlighting the high frequency details originally presented in the audio source\n    *\n\n      Speaker output optimization to compensate and reposition audio placement for poorly placed speakers \n\n","torrent":{"xt":"urn:btih:c1a9481df20673c7bc31a38efbe3cb94c83e00c0","amp;dn":"SRS+Audio+Sandbox+1.10.2.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1a9481df20673c7bc31a38efbe3cb94c83e00c0","infoHashBuffer":{"type":"Buffer","data":[193,169,72,29,242,6,115,199,188,49,163,142,251,227,203,148,200,62,0,192]},"announce":[],"urlList":[]}}