{"title":"The Hidden Origins of Islam (gnv64)","uid":15218217,"size":37978144,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c26c82ce18b907c42c221fc80ece67b08bc3a8b6&amp;dn=The+Hidden+Origins+of+Islam+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"gnv65","files":4,"time":1467707850,"description":"The Hidden Origins of Islam: New Research into Its Early History\r\nby Karl-Heinz Ohlig and Gerd-R Puin\r\nPrometheus Books | July 2009 | ISBN-10: 1591026342 | 405 Pages | scanned PDF | 36.2 mb\r\n\r\nDespite Muhammad's exalted place in Islam, even today there is still surpisingly little actually known about this shadowy figure and the origins of the Qur'an because of an astounding lack of verifiable biographical material. Furthermore, most of the existing biographical traditions that can be used to substantiate the life of Muhammad date to nearly two centuries after his death, a time when a powerful, expansive, and idealized empire had become synonymous with his name and vision - thus resulting in an exaggerated and often artificial characterization of the prophetic figure coupled with many questionable interpretations of the holy book of Islam.\r\n\r\nOn the basis of datable and localizable artifacts from the seventh and eighth centuries of the Christian era, many of the historical developments, misconceptions, and fallacies of Islam can now be seen in a different light. Excavated coins that predate Islam and the old inscription in the Dome of the Rock in Jerusalem utilize symbols used in a documented Syrian Arabic theology - a theology with Christian roots.\r\n\r\nInterpreting traditional contexts of historical evidence and rereading passages of the Qur'an, the researchers in this thought-provoking volume unveil a surprising - and highly unconventional - picture of the very foundations of Islamic religious history.\r\n\r\nAbout the Authors\r\nKarl-Heinz Ohlig is professor emeritus of Religious Studies and the History of Christianity at the University of the Saarland, chairman of the Inarah Institute for Research into the Early History of Islam and the Qur'an, and the author of many books including Weltreligion Islam: Eine Einführung (Islam as World Religion: An Introduction).\r\nGerd-R. Puin, a retired research associate at the University of the Saarland, is an expert on the historical orthography of the Qur'an.\r\n \nhttps://s32.postimg.org/kyhgtbo6d/The_Hidden_Origins_of_Islam.jpg","torrent":{"xt":"urn:btih:c26c82ce18b907c42c221fc80ece67b08bc3a8b6","amp;dn":"The+Hidden+Origins+of+Islam+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c26c82ce18b907c42c221fc80ece67b08bc3a8b6","infoHashBuffer":{"type":"Buffer","data":[194,108,130,206,24,185,7,196,44,34,31,200,14,206,103,176,139,195,168,182]},"announce":[],"urlList":[]}}