{"title":"Microsoft Word 2010 Simplified 2012","uid":7622422,"size":16887862,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c2b8cf523d0edc075627d518c38c9171c66a6753&amp;dn=Microsoft+Word+2010+Simplified+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"renatosistema","files":-1,"time":1347361696,"description":"Book Description\n\nSimply the easiest way yet to get up to speed on Word 2010\n\nMicrosoft Word 2010 includes all sorts of new features and functionalities, a redesigned interface, new emphasis on collaboration, and many additional changes. Both users of previous editions and those new to the Office applications will appreciate the clear, visual instruction in this book.\n\nWith step-by-step instructions and large, full-color screen shots demonstrating dozens of Word 2010 tasks, Word 2010 Simplifiedgets you up and running faster than you ever thought possible.\n\nWord is the most-used application in Microsoft Office, which holds more than 90 percent of the market for Windows-based productivity suites\nThe new version of Word includes many changes and new features; both newcomers to Word and users of previous editions will appreciate this clear, visual introduction to the program\nA streamlined interior with large font and screenshots, makes this guide easy to follow for all users at any age\nCovers the basics, document fundamentals, formatting documents and adding graphics, collaborating and sharing documents, how and when to use Office Web Applications, and much more\n\nIf you learn best when you see how things are done, or if you just want a quick and easy guide to familiarize you with the new features of Word 2010, Word 2010 Simplified fills the bill. ","torrent":{"xt":"urn:btih:c2b8cf523d0edc075627d518c38c9171c66a6753","amp;dn":"Microsoft+Word+2010+Simplified+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2b8cf523d0edc075627d518c38c9171c66a6753","infoHashBuffer":{"type":"Buffer","data":[194,184,207,82,61,14,220,7,86,39,213,24,195,140,145,113,198,106,103,83]},"announce":[],"urlList":[]}}