{"title":"Command and Conquer - Generals + Zero Hour + Patches + No-CD Cra","uid":9620185,"size":2451965611,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c2bbc05b19074cf206d9421b429ac78545504163&amp;dn=Command+and+Conquer+-+Generals+%2B+Zero+Hour+%2B+Patches+%2B+No-CD+Cra&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":4,"uploader":"NearNightHawk","files":14,"time":1392489403,"description":"Hi!\n\nThis is a torrent for Command and Conquer Generals and Zero Hour. (Also Reborn Mod)\n\nThis installation has everything you need from patches, No-CD Cracks, ISOs needed, keygens, and even PowerISO installation if you need it.\n\nCommand and Conquer Generals has the patch for version 1.08 and Zero Hour has the patch for version 1.04.\n\nThis installation will enable you to play all Singleplayer content and even add custom maps and mods you would like to install. There is a mapbuilder in the Zero Hour installation folder that you can make your own custom maps if you would like.\n\nThis version will not however include online multiplayer, you will have to find a way around that.\n\nThis will allow you to play LAN games though. So this could be used for LAN parties for sorts.\n\nAlso, this whole installation also includes an optional mod called &quot;Reborn&quot;. It is a mod that adds all new content to modernize the gameplay just a little bit with real world leaders and more massive gameplay. It is easy to install and uninstall.\n\n___________________________________________________________________________________\n\n\nCommand &amp; Conquer: Generals is a real-time strategy (RTS) video game and the seventh installment in the Command &amp; Conquer series. It was released for Microsoft Windows and Mac in 2003 and 2004.\n\nIt pits 3 factions against each other in campaign and versus modes. The three factions being GLA, USA, and Chinese forces.\n\nVery fun game up to 8 players and full capabilities to play against AI by yourself or with friends!\n\nI hope you enjoy this and let me know if I can help with anything!\n\nInstallation instructions in the torrent.\n\nEnjoy!","torrent":{"xt":"urn:btih:c2bbc05b19074cf206d9421b429ac78545504163","amp;dn":"Command+and+Conquer+-+Generals+%2B+Zero+Hour+%2B+Patches+%2B+No-CD+Cra","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2bbc05b19074cf206d9421b429ac78545504163","infoHashBuffer":{"type":"Buffer","data":[194,187,192,91,25,7,76,242,6,217,66,27,66,154,199,133,69,80,65,99]},"announce":[],"urlList":[]}}