{"title":"FX Photo Studio Pro v. 2.0.61 [K]racked","uid":6874633,"size":94327994,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:c2fddb3869b58ffe523a2ca19a8f6aead5e607b5&amp;dn=FX+Photo+Studio+Pro+v.+2.0.61+%5BK%5Dracked&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"polisdavid","files":-1,"time":1323369171,"description":"Official Web Site: &lt;a href=&quot; http://www.macphun.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.macphun.com/&lt;/a&gt;\n\nEither you are a professional photographer or just a hobbyist, FX Photo Studio PRO will take you to the brand new level of photo creativity on the Mac. Combine and layer any of the 172 effects to create the perfect looking image.\n\nA completely customizable interface allows you to preview each effect, compare original and resulting images, label favorites and even save combinations of effects as presets. The new masking and color splash tools allow you to apply effects and colors to a part of the image only, giving even more creative freedom to your photography.\n\nCategories of effects include: Lo-Fi, Grunge, Art, Vintage, Tilt-Shift, Sketches, Hollywood FX, Color Splash, Blurs and many more. With a set of professional editing tools you can improve and enhance your pictures even further.\n\nCreated by usability and photography professionals, FX Photo Studio PRO user interface ensures that editing your photos can't get any easier. The elegantly simple design provides easy access to every photo processing tool you'll need, without cluttering your screen and allowing you to focus on your image. Import pictures from Aperture or iPhoto library Load images from any folder on your Mac or digital camera. Export images in a variety of formats to iPhoto or folders on your Mac or share via most popular social networks.\n\nWhat's new:\n\n* New photo effects\n\n* High resolution masking tool (paint with over 172 high quality photo\n  effects and filters)\n\n* High resolution selective color tool (color splash tool)\n\n* User interface improvements\n\n* Full compatibility with Lion\n\nSystem Requirements:\n\nOS version: Mac OS X 10.6 or later\nProcessor type(s) &amp; speed: Intel\n\n--- PLEASE SEED ---","torrent":{"xt":"urn:btih:c2fddb3869b58ffe523a2ca19a8f6aead5e607b5","amp;dn":"FX+Photo+Studio+Pro+v.+2.0.61+%5BK%5Dracked","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2fddb3869b58ffe523a2ca19a8f6aead5e607b5","infoHashBuffer":{"type":"Buffer","data":[194,253,219,56,105,181,143,254,82,58,44,161,154,143,106,234,213,230,7,181]},"announce":[],"urlList":[]}}