{"title":"Superbrothers.Sword.and.Sworcery.EP.v1.54.cracked-THETA-on","uid":7194845,"size":454036580,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c33517c8b9332a0dd0be594862bd2f7d78201714&amp;dn=Superbrothers.Sword.and.Sworcery.EP.v1.54.cracked-THETA-on&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"ontotita","files":2,"time":1334710193,"description":"Released: April 16, 2012 (PC)\n\nSONGS are found in the install dirsoundtrack folder\n\nSuperbrothers: Sword &amp; Sworcery EP is an exploratory action adventure with an emphasis on audiovisual style. Traverse a mythic little realm, use a sword to do battle &amp; evoke sworcery to solve mystical musical mysteries. Co-operate with friends via Twitter, experience a videogame world that is affected by moon phases &amp; help a wandering warrior monk complete her woeful errand.\n\nSuperbrothers: Sword &amp; Sworcery is a brave experiment in I/O cinema; A fresh approach to adventure &amp; action designed for Appleï¿½s touchtronic machinery; A 21st century update to the pioneering works of Miyamoto, Mechner &amp; Chahi; The recipient of the ï¿½Achievement in Artï¿½ award from the 2010 IGF Mobile; A crude videogame haiku about life, love &amp; death; A showcase for a style of painterly pixel artwork familiar to readers of Wired &amp; The New York Times; A videogame EP featuring music by rockstar &amp; critically acclaimed composer Jim Guthrie; Created with a broad, literate audience in mind. A choice cut of myth &amp; dreams.\n\n\nSuperbrothers: Sword &amp; Sworcery EP features an album's worth of original music by noted composer Jim Guthrie as well as artwork &amp; designs by Superbrothers Inc, crafted &amp; engineered by videogame wizards at Capy in Toronto, Canada.\nKey Features:\n\n-Guide a warrior monk on a laid back adventure in a bronze age mountain wilderness, overcome occasionally hard-hitting battes &amp; solve mystical musical puzzles to help The Scythian complete her woeful errand.\n-A fevered famicom dream. Explore a lavishly-painted mythopoetic storyworld affected by real-world moon phases, conceived &amp; crafted by a representative at Superbrothers Inc.\n-A prog rock concept record you can hang out in. Treat your ears to an album's worth of original music created by the legendary composer Jim Guthrie.\n-Remastered &amp; ready for public exhibition. The new edition features razor-sharp pixels and a refined audio mix, ideal for projecting in a home theatre or cinema context.\n-Point &amp; click. This new edition of S:S&amp;S EP for the electric computer has been faithfully re-engineered by videogame wizards at Capy to support input via the two-button mouse.\n-Tweet this? Optionally co-operate with friends via Twitter by relaying clues &amp; other tidbits as you dig deeper into the esoteric mysteries of S:S&amp;S:EP.\n\n\nInstallation Instructions:\n\n1. Install with Superbrothers - Sword &amp; Sworcery EP.exe\n2. Play the game with swordandsworcery_pc.exe","torrent":{"xt":"urn:btih:c33517c8b9332a0dd0be594862bd2f7d78201714","amp;dn":"Superbrothers.Sword.and.Sworcery.EP.v1.54.cracked-THETA-on","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c33517c8b9332a0dd0be594862bd2f7d78201714","infoHashBuffer":{"type":"Buffer","data":[195,53,23,200,185,51,42,13,208,190,89,72,98,189,47,125,120,32,23,20]},"announce":[],"urlList":[]}}