{"title":"OpenCL Programming by Example [PDF]~StormRG~","uid":9587326,"size":3908702,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c34c68bed6c7528ee893cb3ca34d34af6e8f0230&amp;dn=OpenCL+Programming+by+Example+%5BPDF%5D%7EStormRG%7E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"steelballz","files":-1,"time":1391836890,"description":"Description\nOpenCL Programming by Example\nAuthor: Ravishekhar Banger, Koushik Bhattacharyya\nPublished: Dec 23 2013\nPublisher: Packt Publishing\nISBN: 1849692343\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\n\nTested on the above readers with no problems on laptop and Android tablet.\nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. Please allow a couple\nseconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n\nCover from actual book file\n\n\nProduct Description\nIn Detail\n\nResearch in parallel programming has been a mainstream topic for a decade, and will continue to be so for many decades to come. Many parallel programming standards and frameworks exist, but only take into account one type of hardware architecture. Today computing platforms come with many heterogeneous devices. OpenCL provides royalty free standard to program heterogeneous hardware.\n\nThis guide offers you a compact coverage of all the major topics of OpenCL programming. It explains optimization techniques and strategies in-depth, using illustrative examples and also provides case studies from diverse fields. Beginners and advanced application developers will find this book very useful.\n\nBeginning with the discussion of the OpenCL models, this book explores their architectural view, programming interfaces and primitives. It slowly demystifies the process of identifying the data and task parallelism in diverse algorithms.\n\nIt presents examples from different domains to show how the problems within different domains can be solved more efficiently using OpenCL. You will learn about parallel sorting, histogram generation, JPEG compression, linear and parabolic regression and k-nearest neighborhood, a clustering algorithm in pattern recognition. Following on from this, optimization strategies are explained with matrix multiplication examples. You will also learn how to do an interoperation of OpenGL and OpenCL.\n\n&quot;OpenCL Programming by Example&quot; explains OpenCL in the simplest possible language, which beginners will find it easy to understand. Developers and programmers from different domains who want to achieve acceleration for their applications will find this book very useful.\nApproach\n\nThis book follows an example-driven, simplified, and practical approach to using OpenCL for general purpose GPU programming.\nWho this book is for\n\nIf you are a beginner in parallel programming and would like to quickly accelerate your algorithms using OpenCL, this book is perfect for you! You will find the diverse topics and case studies in this book interesting and informative. You will only require a good knowledge of C programming for this book, and an understanding of parallel implementations will be useful, but not necessary.\n\n\n\n\nScientia est potentia\n","torrent":{"xt":"urn:btih:c34c68bed6c7528ee893cb3ca34d34af6e8f0230","amp;dn":"OpenCL+Programming+by+Example+%5BPDF%5D%7EStormRG%7E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c34c68bed6c7528ee893cb3ca34d34af6e8f0230","infoHashBuffer":{"type":"Buffer","data":[195,76,104,190,214,199,82,142,232,147,203,60,163,77,52,175,110,143,2,48]},"announce":[],"urlList":[]}}