{"title":"Cam studio 2.0","uid":3653682,"size":7822837,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c37b949528ef6c7df61013f465cfad9d8dd65dab&amp;dn=Cam+studio+2.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"Zaush Ocean","files":6,"time":1175583256,"description":"CamStudio 2.0 para grabar tus videotutoriales\n\nPara mi gran sorpresa, este programa tiene muchas ganas de vivir, y resulta que un sujeto llamado Nick the Geek ha creado un sitio para la descarga, informacion y actualizacion de este excelente programa.\nEn pocas palabras, CamStudio es Open Source, y te permitira grabar lo que sucede en tu pantalla a formato AVI y SWF (flash), incluyendo audio (voz) y/o mensajes de texto en pantalla. Tienes la posibilidad de especificar la resolucion de la captura (para grabar solo parte de la pantalla), la cantidad de imagenes por segundo, el tipo de cursor a utilizar, etc.\nLo mejor de todo es que tambien esta disponible un excelente codec de compresion llamado CSCD (CamStudio Lossless Codec v1.0), el cual es muy similar al TSCC usado por el programa Camtasia Studio. La calidad es practicamente la misma de el original, pero el tama?o resultante de el video es muy peque?o. Lo mejor de todo es que este codec es Open Source!\nNota: CamStudio fue originalmente creado por una compa?ia llamada RenderSoft, la cual fue comprada por otra compa?ia llamada eHelp (creadores de RoboDemo), y finalmente Macromedia compro eHelp y RoboDemo para crear su producto llamado &amp;#039;Captivate&amp;#039;. eHelp, sabiendo que CamStudio era capaz de hacer cosas que RoboDemo hacia (especificamente exportar a SWF), pero gratuitamente... decidieron sacar a la luz una nueva version de Camstudio: v2.1, la cual arreglo un par de bugs, pero removieron la capacidad de crear archivos Flash, y ademas era necesario registrar el programa para usarlo (ademas de que la version 2.1\nmide mas de 9 megas, mientras que la version original 2.0 mide solamente 1.29 megas).\nAsi que mucho cuidado con la version 2.1 de camstudio que esta rondando en muchos sitios de la red.\nA crear tutoriales con la version original de este programa y su codec de compresion!","torrent":{"xt":"urn:btih:c37b949528ef6c7df61013f465cfad9d8dd65dab","amp;dn":"Cam+studio+2.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c37b949528ef6c7df61013f465cfad9d8dd65dab","infoHashBuffer":{"type":"Buffer","data":[195,123,148,149,40,239,108,125,246,16,19,244,101,207,173,157,141,214,93,171]},"announce":[],"urlList":[]}}