{"title":"Chuck Mangione-6 cd","uid":5257099,"size":602035223,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c392f7ff3ab17753ba825b83dcfe24bc2e9f0408&amp;dn=Chuck+Mangione-6+cd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":4,"uploader":"flitigalisa","files":76,"time":1262615833,"description":"For more than five decades, Chuck Mangione's love affair \nwith music has been characterized by his boundless energy, \nunabashed enthusiasm, and pure joy that radiates from \nthe stage.\n\nMangione first attracted attention with his brother, Gap, \nin a mainstream jazz band, The Jazz Brothers, in which he \nplayed trumpet much like that of the man who he refers to \nas his musical father-Dizzy Gillespie. In fact Dizzy gave \nChuck an 'updo' horn just like his own.\n\nChuck's years with the Jazz Brothers overlapped with his \nattending the Eastman School of Music and eventually \nresulted in his solo album debut.  Chuck left home to \nplay with Art Blakey and the Jazz Messengers, assuming \nthe trumpet chair that had belonged to such great players \nas Clifford Brown, Kenny Dorham, Bill Hardman, Lee Morgan \nand Freddie Hubbard.\n\nAnother important step in Mangione's career development was \nhis return to the Eastman School of Music as director of \nthe school's Jazz Ensemble. His &quot;Friends &amp; Love&quot; concert \nwith the Rochester Philharmonic Orchestra was recorded \nlive and featured &quot;Hill Where the Lord Hides.&quot; This led \nto a recording contract with a major label, Mercury \nrecords, and his first Grammy nomination.\n\nThose early years with Mercury culminated in the title tune \nof one of Mangione's most popular albums. Land of Make Believe, \nanother Grammy nominee, Mangione then signed with A&amp;M Records \nand delivered two extremely successful releases in one year, \nChase The Clouds Away, which was used as background music \nduring the telecast of the 1976 Olympic Games; and Bellavia \n(&quot;beautiful way&quot;), named to honor his mother, which won \nMangione his first Grammy award.\n\nDuring the late 1970's, Chuck received more awards and \naccolades for his recordings. He reached new heights \nwith his mega-hit single and album, Feels So Good.\nThe 1980 Mangione entry in Current Biography called \n&quot;Feels So Good&quot; the most recognized melody since the \nBeatles'  &quot;Michelle.&quot;  The Children of Sanchez \ndouble-album soundtrack won the Hollywood Foreign \nPress Association's Golden Globe Award, then earned \nMangione a second Grammy award. \n\nIn 1980 maximum impact was achieved in front of an \n&quot;intimate&quot; television of several hundred million when \nChuck's &quot;Give It All You Got&quot; was heard around the \nworld as the theme of the Winter Olympics in Lake Placid \nwhich he performed live at the closing ceremonies.\n\nMangione was also busy with personal projects during \nthe 1980's. He hosted an 8-hour concert featuring \njazz legends Dizzy Gillespie and Chick Corea, which \nbenefited the Italian earthquake Relief Fund.\n\nThe '80's were exceptionally full years for Chuck. Having \nsigned with Columbia Records he released several albums, \nincluding Love Notes, Journey To A Rainbow, Disguise, \nand Save Tonight For Me. Another highlight was working out \nwith the New York Yankees at their spring training camp at \nthe invitation of his friend and fan, George Steinbrenner.  \nChuck was often seen playing the National Anthem at Yankee \nStadium and All Star games in San Francisco and Chicago.   \nThere was also &quot;Salute to Chuck Mangione&quot; a one-hour TV \nspecial hosted by Dick Clark; numerous performing and \nconducting dates with symphony orchestras across the \ncountry, plus television interviews on The Tonight Show, \nLarry King, Soul Train, Solid Gold, and many others.\n\nIn 1989, Chuck released two live albums, &quot;The Boys From Rochester,&quot; \nfeaturing Steve Gadd, Gap Mangione, Joe Romano and frank Pullara, \nplus a double album, Chuck Mangione Live at the Village Gate.  \nFollowing these releases, and more than 25 years of one-nighters \naround the world, Chuck Mangione stopped playing.\n\n Many people point to the death of Dizzy Gillespie as the event \nthat propelled Mangione back into music. In 1994 chuck scheduled \na whirlwind of activity that included recording sessions for two \nnew albums, a series of nightclub performances by himself and \nother jazz favorites which featured his &quot;Cat in the Hat&quot; matinees \nfor kids (they continue to draw SRO audiences and raves from \ncritics, parents and kids alike). Four major orchestra dates \nin upstate New York helped create an endowment fund in honor \nof his father, Papa Mangione, and musical father Dizzy Gillespie, \nfor the Rochester School of the Arts.\n\nChuck is currently caricatured on the Fox TV hit show, \nKing Of The Hill.He is the celebrity spokesman for &quot;Mega-lo-mart&quot; \nand scored the music for the 1998 Valentine's Day episode.\n\nWhen Chuck performed in Poland for the 1999 Film and Jazz Festival, \nhis composition &quot;Children of Sanchez&quot; brought the audience to its \nfeet. Unbeknownst to the composer, the piece had become somewhat\nof an anthem during the struggle for democracy and many in the \naudience were in tears, holding their hands over their hearts.\n\nIn the year 2000 Chuck made his first ever appearance in Korea to \nSRO audiences where Feels So Good has been the top requested \ninstrumental hit for the past twenty years.  He returned to Seoul \nin 2001 and was performing there when 9/11 happened.\n\nChuck has recorded two albums for Chesky Records. \nThe Feelings Back &amp; Everything For Love.\n\nHis 60th Birthday Bash Concert at the Eastman Theater in \nRochester New York raised over $50,000 for \nSt. John's Nursing Home.\n\nRecently Smooth Jazz stations throughout the U.S. recognized \nChuck Mangione's &quot;Feels So Good&quot; as their all time #1 song.\n\nChuck received the Eastman School of Music Alumni Achievement Award in 2007\n\nIn 2009, Chuck was highlighted at the Smithsonian in an artifacts Donation Ceremony\nand Onstage Discussion that pays homage to his illustrious career, artistry, \ncommunity service, and dedication to jazz education.\n\n","torrent":{"xt":"urn:btih:c392f7ff3ab17753ba825b83dcfe24bc2e9f0408","amp;dn":"Chuck+Mangione-6+cd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c392f7ff3ab17753ba825b83dcfe24bc2e9f0408","infoHashBuffer":{"type":"Buffer","data":[195,146,247,255,58,177,119,83,186,130,91,131,220,254,36,188,46,159,4,8]},"announce":[],"urlList":[]}}