{"title":"Trampled By Turtles - Palomino [2010][EAC,log,cue. FLAC]","uid":8250117,"size":266051359,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c3ddebbb191166dae34b672a5961ab05a044f3ce&amp;dn=Trampled+By+Turtles+-+Palomino+%5B2010%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"dickspic","files":15,"time":1363149466,"description":"Artist: Release: Palomino\nMusicBrainz: c1ecd5f1-87f5-470f-9c8a-a4009a2319dd\nReleased: 2010-04-09\nLabel: Banjodad Records\nCatalog#: BR 07\nCountry: US\n\nTracklisting:\n\n01. Wait So Long (03:26)\n02. Victory (03:57)\n03. It's a War (02:30)\n04. Separate (03:33)\n05. Bloodshot Eyes (05:00)\n06. New Son/Burnt Iron (04:23)\n07. Help You (03:13)\n08. Feet and Bones (01:55)\n09. Gasoline (03:00)\n10. Sounds Like a Movie (02:26)\n11. New Orleans (03:31)\n12. Again (03:15)\n\nIt's hard to come up with a memorable band name that sticks in a listener's head, and on that score alone Trampled by Turtles is worth your time. It's also a moniker that doesn't telegraph the band's sound, nor does it paint the group into a stylistic corner. That said, this Duluth, MN quintet does have a niche, but it's one that the band has carved out all on its own. Call it bluegrass thrash if you like, a rip-snortin', fire-breathin' kind of post-punk folk music that mashes up traditional country picking with a decidedly rock &amp; roll approach. Their energy is so fierce it may take a few tracks before you realize that there's no drummer here, just five guys playing with such driving energy that a drummer is implied by their staccato instrumental prowess. Things kick off with a couple of tunes that almost leave the speakers of your sound system smoking -- &quot;Wait So Long&quot; starts out fast, then goes into overdrive, an angry cry of frustration from a guy who wants to be more than a best friend to his gal. Songwriter, guitarist, and singer Dave Simonett wails his heart out while Ryan Young's supersonic fiddle tosses gasoline on the fire. &quot;It's a War&quot; starts at a high-speed pace and doesn't let up, with Young's fiddle screaming like the siren on a rampaging fire engine. &quot;Help You&quot; is a rock tune played bluegrass style, with Dave Carroll's banjo and Erik Berry's mandolin splitting the solos that would usually be taken by a lead guitar. The band is just as impressive on slow tunes that allow you to appreciate Simonett's songwriting chops. &quot;Again&quot; is a slow, smoky rumination on a self-destructive relationship that burns on even though both lovers know it's a losing proposition, &quot;Separate&quot; is a quirky folk-pop tune with a cryptic lyric and inventive use of rhythm banjo, while &quot;Gasoline&quot; recalls a bluesy Appalachian lament with Carroll's clanging banjo and Simonett's defeated vocal.","torrent":{"xt":"urn:btih:c3ddebbb191166dae34b672a5961ab05a044f3ce","amp;dn":"Trampled+By+Turtles+-+Palomino+%5B2010%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3ddebbb191166dae34b672a5961ab05a044f3ce","infoHashBuffer":{"type":"Buffer","data":[195,221,235,187,25,17,102,218,227,75,103,42,89,97,171,5,160,68,243,206]},"announce":[],"urlList":[]}}