{"title":"Professional JavaScript for Web Developers (3e) mobi","uid":10802209,"size":3999764,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c45df823c32be6cdcb2585d43aa41fd7301f79af&amp;dn=Professional+JavaScript+for+Web+Developers+%283e%29+mobi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"SectorVector","files":-1,"time":1408361071,"description":"Professional JavaScript for Web Developers,\n\nby Nicholas C. Zakas\n\n\n# ISBN-13   : 9781118026694 \n# Publisher : Wrox\n# Year      : 2012\n# Edition   : 3\n# Pages     : 960\n# Format    : mobi\n\n\nThis book provides a developer-level introduction along with more advanced and useful features of JavaScript. Coverage includes:\n\n- JavaScript use with HTML to create dynamic webpages,\n  language concepts including syntax and flow control statements\n\n- variable handling given their loosely typed nature\n\n- built-in reference types such as object and array\n\n- object-oriented programing\n\n- powerful aspects of function expressions\n\n- Browser Object Model allowing interaction with the browser itself\n\n- detecting the client and its capabilities\n\n- Document Object Model (DOM) objects available in DOM Level 1\n\n- how DOM Levels 2 and 3 augmented the DOM\n\n- events, legacy support, and how the DOM redefined how events should work\n\n- enhancing form interactions and working around browser limitations\n\n- using the tag to create on-the-fly graphics\n\n- JavaScript API changes in HTML5\n\n- how browsers handle JavaScript errors and error handling\n\n- features of JavaScript used to read and manipulate XML data\n\n- the JSON data format as an alternative to XML\n\n- Ajax techniques including the use of XMLHttpRequest object and CORS\n\n- complex patterns including function currying, partial function application,\n  and dynamic functions\n\n- offline detection and storing data on the client machine\n\n- techniques for JavaScript in an enterprise environment for\n  better maintainability\n\n\nThis  book   is  aimed  at   three  groups  of   readers:  Experienced\nobject-oriented programming developers looking  to learn JavaScript as\nit  relates to  traditional OO  languages such  as Java  and C++;  Web\napplication developers  attempting to  enhance site  usability; novice\nJavaScript developers.\n\n\nAuthor\n======\n\nNicholas C. Zakas worked with the Web for over a decade. He has worked\non  corporate  intranet  applications  used by  some  of  the  largest\ncompanies  in the  world  and large-scale  consumer  websites such  as\nMyYahoo!  and  the  Yahoo!  homepage.  He  regularly  gives  talks  at\ncompanies and  conferences regarding front-end best  practices and new\ntechnology.\n\n\n-_-","torrent":{"xt":"urn:btih:c45df823c32be6cdcb2585d43aa41fd7301f79af","amp;dn":"Professional+JavaScript+for+Web+Developers+%283e%29+mobi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c45df823c32be6cdcb2585d43aa41fd7301f79af","infoHashBuffer":{"type":"Buffer","data":[196,93,248,35,195,43,230,205,203,37,133,212,58,164,31,215,48,31,121,175]},"announce":[],"urlList":[]}}