{"title":"Demons (Dario Argento) - (1985) DVDRip","uid":5643137,"size":734011392,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c486796a5fa6f0bfefbfd221666a079073fe5f10&amp;dn=Demons+%28Dario+Argento%29+-+%281985%29+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"Horrorspoke","files":-1,"time":1277195044,"description":"SYNOPSIS:\n\nArt imitating art is the basis of this demonic tale of a group of invited guests who are granted a free lunch in the form of a screening of a horror film that brings naturalism to life. Baited and penned in, this walled-in feeling quickly turns to screams and fear as those who are dead lust after the flesh of those living. The free lunch has turned full circle in the cinema of hell and it is only a question of time before the demons from the abyss are asking for second portions.\n\nIMDB REVIEW:\n\nDemons (1985) is a movie that has to be seen with a nice stereo sound system because the music rocks. Demons is gooey and bloody. It's also nicely accompanied by an awesome soundtrack. Argento wanted to produce a movie that was a mindless and brainless exercise of absurdity, an instant popcorn movie that was going to make him and his investors a lot of money. Well, with the aid of Lamberto Bava he accomplished what he set out to do. The results are what you see on the screen. An action packed thrill ride. A movie from the 80's. A young woman and her friend are given tickets to a movie by a masked man who sort of resembles Lou Reed (Michael Soavi). Argento's daughter is in this picture (Fiore Argento), Lamberto Bava has a cameo appearence and 70's Italian child star Nicoletta Elmi (she's all grown up!) has a role as the theatre usherette. If you like cheesy horror films, this one's right up your alley. Highly recommended.\n\nSeed and enjoy everyone!!!","torrent":{"xt":"urn:btih:c486796a5fa6f0bfefbfd221666a079073fe5f10","amp;dn":"Demons+%28Dario+Argento%29+-+%281985%29+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c486796a5fa6f0bfefbfd221666a079073fe5f10","infoHashBuffer":{"type":"Buffer","data":[196,134,121,106,95,166,240,191,239,191,210,33,102,106,7,144,115,254,95,16]},"announce":[],"urlList":[]}}