{"title":"Genie Backup Manager Pro v9.0.567.891 + crack-TE","uid":7471669,"size":29210186,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c49ad0e13b653358122e148b4e67024a6b3ffdc1&amp;dn=Genie+Backup+Manager+Pro+v9.0.567.891+%2B+crack-TE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"mrriser007","files":-1,"time":1343169570,"description":"Genie Backup Manager Professional is a total system and data protection solution that combines ease-of-use and robust performance. It allows users to perform fast backup and recovery jobs reliably, and protects all MS Windows based desktops, laptops, and networked systems against various types of threats such as system failure, human error, and disaster.GBM Pro V8.0; equipped with Windows Vista compatible disaster recovery feature, guarantees your business continuity by backing up your whole system (Operating System, Applications, Documents, E-mails, Settings, Desktop, Files/Folders, MS Outlook, and Win Mail, etc) and offering faster and easier recovery without the need for MS Windows installation CD, through a clear cut wizard-based interface.\n\nWith GBM Pro V8.0, users can backup their data to virtually any storage destination including: Local/LAN location, Removable Media Devices (USB, REV disks, Floppy disks, etc), Remote location using FTP, CD/DVD media, Tape Drives, as well as Online using Ajax-based backup technology, offering better data management and greater data availability.\n\nGBM Pro V8.0 delivers higher reliability as it packs everything under one roof by providing a built-in open/used files backup agent together with an easy-to-use smart backup scheduler where users can set GBM to perform different backup jobs in different times and intervals, snooze or even pause scheduled backup(s), and prompt GBM to postpone backup if the system is running on batteries (Laptop Power Optimization Support).\n\nUsing U.S. government-certified Advanced Encryption Standard (AES), Genie Backup Manager Pro V8.0 provides premium security and prevents unauthorized access to backed up data, and employs a 128-Bit Secure Socket Layer (SSL) for data transmission, certified by the leading global provider of SSL certificates Thawte, assuring data integrity and forbidding eavesdroppers from intervening data.","torrent":{"xt":"urn:btih:c49ad0e13b653358122e148b4e67024a6b3ffdc1","amp;dn":"Genie+Backup+Manager+Pro+v9.0.567.891+%2B+crack-TE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c49ad0e13b653358122e148b4e67024a6b3ffdc1","infoHashBuffer":{"type":"Buffer","data":[196,154,208,225,59,101,51,88,18,46,20,139,78,103,2,74,107,63,253,193]},"announce":[],"urlList":[]}}