{"title":"645 of the best Rock Songs Ever","uid":4250479,"size":4695072746,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c4fa980466a04ad0e0a5bbb036edbfa68f380742&amp;dn=645+of+the+best+Rock+Songs+Ever&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":2,"uploader":"Liberal Eradication","files":646,"time":1213984045,"description":"645 of the best Rock Songs Ever:\n\nAre these the greatest 645 Rock songs ever?\nI would say yes. ...But &quot;best ever&quot; and &quot;greatest&quot; type terms are subjective to your tastes. Note I used &quot;of the&quot; in the title. I won&amp;#039;t presume to think this is everything. There is bound to be a few of somebody&amp;#039;s personal favorites omitted (especially newer stuff). You should, however, find a ton of good stuff in here and not much you will hate, unless you suck of course! ;-)\n\nWhy did I share this?\nI&amp;#039;m sick of seeing these so-called &quot;Greatest ### Songs of all time&quot; torrents that really seemed to be filled with schlock. Again, it&amp;#039;s subjective, but when you&amp;#039;ve got 500 songs, it&amp;#039;s hard to justify leaving certain all time classics out.\n\nWhat is it?\nThis is stuff from my personal collection. I normalized the volume of this pack (to 93 Db) so you won&amp;#039;t have dead quiet levels on one song and then ear shattering loudness on the next track. All are .mp3 format. Most (95%) are high bit rates, 192 to 320, with a few scattered 160 and the very rare (like 5 or so) 128 bitrate songs. I separated them into 3 categories of: Rock, Lite Rock and Hard Rock. This may not be perfect either, so sue me?\n\nWhy 645 songs? Why not 500? ...or 734?\nThis torrent, at 4.37GB, just barely fits on one DVD. I suppose I could have re-encoded everything to 192, but hey, I&amp;#039;m lazy. You&amp;#039;re lucky I bothered to segregate these songs from my collection and share them! So? 645 it is!\n\nSeeding/connection:\nI will share this until seeded, but after that, you folks are essentially on your own. My connection isn&amp;#039;t the greatest (~50 or so kbps upload), so this will take a few days to seed. (afterwards, I want my upload speed back for ME damnit!) If my seed disappears, have no fear, I will have it back up shortly. If I check back weeks/months later and there&amp;#039;s someone dying for a re-seed, I may have a heart and do it, but no guarantees. I am after all, a heartless prick.\n\nFeel free to share this elsewhere, it&amp;#039;s not like I have any rights to this. :-D\n","torrent":{"xt":"urn:btih:c4fa980466a04ad0e0a5bbb036edbfa68f380742","amp;dn":"645+of+the+best+Rock+Songs+Ever","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4fa980466a04ad0e0a5bbb036edbfa68f380742","infoHashBuffer":{"type":"Buffer","data":[196,250,152,4,102,160,74,208,224,165,187,176,54,237,191,166,143,56,7,66]},"announce":[],"urlList":[]}}