{"title":"Essential Haematology, 6E- Hoffbrand [PDF] [StormRG]","uid":10806179,"size":31976295,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c5578a1b387b65baf08f2df851b7f1e44847ac0a&amp;dn=Essential+Haematology%2C+6E-+Hoffbrand+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"0xmovva","files":2,"time":1408384635,"description":"Author: Victor Hoffbrand (Author), Paul Moss (Author)\nPaperback: 468 pages\nPublisher: Wiley-Blackwell; 6 edition (March 14, 2011)\nLanguage: English\nISBN-10: 1405198907\nISBN-13: 978-1405198905\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n__________________________________________________________________________________\n\n\nEssential Haematology is established as the most authoritative introduction to haematology. Beautifully presented, it introduces the formation and function of blood cells and diseases that arise from dysfunction and disruption of these processes. Basic science, diagnostic tests, clinical features and management are all clearly explained. The book outlines the basic principles of clinical and laboratory haematology and shows how manifestations of blood diseases can be explained by new knowledge of the disease processes.\nFor the first time, Essential Haematology is fully supported by a suite of online MCQs and answers, and is now available as a FREE enhanced Wiley Desktop Edition (upon purchase of the book).\n\nThoroughly updated to reflect the latest research in this fast-moving field\nContains summary boxes at the end of each chapter\nIncludes an expanded treatment range and an expanded section on bone marrow failure and transplantation\nIncludes a companion website at www.wiley.com/go/essentialhaematology featuring figures and tables from the book for downloading, and interactive multiple choice questions prepared by the authors","torrent":{"xt":"urn:btih:c5578a1b387b65baf08f2df851b7f1e44847ac0a","amp;dn":"Essential+Haematology%2C+6E-+Hoffbrand+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5578a1b387b65baf08f2df851b7f1e44847ac0a","infoHashBuffer":{"type":"Buffer","data":[197,87,138,27,56,123,101,186,240,143,45,248,81,183,241,228,72,71,172,10]},"announce":[],"urlList":[]}}