{"title":"Justin Townes Earle - 2012 - Nothing's Gonna Change the Way You ","uid":7176721,"size":196175173,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c60b47cba11eddc00d57dd3dee0e7d3a5f0db5ac&amp;dn=Justin+Townes+Earle+-+2012+-+Nothing%27s+Gonna+Change+the+Way+You+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"bludStain","files":-1,"time":1334140087,"description":"Justin Townes Earle - 2012 - Nothing's Gonna Change the Way You Feel About Me Now\n\nReview by Thom Jurek\nJustin Townes Earle's 2010 effort Harlem River Blues sounded like he'd found his way as a singer/songwriter amid the spidery, criss-crossing lines of Memphis' long and sometimes fractious musical heritage. Earle moved to London, but the sound of Nothing's Gonna Change the Way You Feel About Me Now is even more haunted by Memphis than its predecessor. Its sounds have woven their way so far inside his songwriting and arrangements here that he almost disappears. Recorded in North Carolina, loneliness, frustrated desire, regret, thinly veiled admissions of substance abuse, and even self-pity topically weave themselves through these songs. On &quot;Am I That Lonely Tonight?&quot; he talks about being emotionally and physically wasted when hearing his father on the radio and the conflicting feelings it raises. The sad, slow horn chart, nostalgically acknowledges the Memphis influence. The fingerpicked electric guitars, standup bass, and brushed snares just underscore the singer's desolation. The title track, with a shimmering B-3, muted horns, and upright bass walking a straight line, is the third heartworn ballad in a row, and it threatens to overwhelm the proceeding. (Sequencing on this date is an issue.) Its melancholy, dragging tempo, slurred, uneven time signature, and most of all, Earle's voice, all sound completely ragged. On the first uptempo number, &quot;Baby's Got a Bad Idea,&quot; populated with a rockabilly swagger, Earle's hoarse, near-spoken, off-key delivery almost derails it. &quot;Maria&quot; fares better with a Willie Mitchell-style slippery horn chart and in the pocket drums. The muted trumpet in the gospel-blues of &quot;Down on the Lower East Side,&quot; is a nice touch, as is the restrained passion in Earle's vocal delivery. &quot;Memphis in the Rain&quot; is more lighthearted and actually swings, with R&amp;B effortlessly carrying the singer. &quot;Won't Be the Last Time&quot; and &quot;Unfortunately Anna,&quot; both exhausted, oppressive ballads, commence as halting folkish Americana -- though the latter has a very attractive jazzy mid-section and bridge. Closer &quot;Movin' On&quot; uses Johnny Cash as an inspiration, and it feels more natural than anything here. It shuffles and hops; it finds a groove and relaxes inside it. As strained as some of Nothing's Gonna Change the Way You Feel About Me Now is, there is much to enjoy: Earle's lyrics, while sometimes sophomoric, are fairly sophisticated and searingly honest; the arrangements and his melodies usually lovely. While it's true this album often feels like the listener is being asked to endure a personal confession without redemption as a reward that is also part of its hopefully deliberate, perverse charm.\n","torrent":{"xt":"urn:btih:c60b47cba11eddc00d57dd3dee0e7d3a5f0db5ac","amp;dn":"Justin+Townes+Earle+-+2012+-+Nothing%27s+Gonna+Change+the+Way+You+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c60b47cba11eddc00d57dd3dee0e7d3a5f0db5ac","infoHashBuffer":{"type":"Buffer","data":[198,11,71,203,161,30,221,192,13,87,221,61,238,14,125,58,95,13,181,172]},"announce":[],"urlList":[]}}