{"title":"Lonely Planet Ireland (11th Ed) (AZW3,Retail){32Skulls}","uid":10968296,"size":25289108,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c6a09b382abd19d9c1e733f972ee512aef75eb5b&amp;dn=Lonely+Planet+Ireland+%2811th+Ed%29+%28AZW3%2CRetail%29%7B32Skulls%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"32Skulls","files":-1,"time":1409770878,"description":"                      â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ \n\nLonely Planet Ireland is your passport to all the most relevant and up-to-date advice on what to see, what to skip, and what hidden discoveries await you. Slurp oysters and clap your hands to spirited fiddle music in a lively Galway pub, explore medieval castles in Dublin and beyond, or set off amid vibrant green hills toward Atlantic coastal trails; all with your trusted travel companion. Get to the heart of Ireland and begin your journey now!\n\nInside Lonely Planet's Ireland Travel Guide:\n\n\nFull-colour maps and images throughout\n\nHighlights and itineraries show you the simplest way to tailor your trip to your own personal needs and interests\n\nInsider tips save you time and money, and help you get around like a local, avoiding crowds and trouble spots\n\nEssential info at your fingertips - including hours of operation, phone numbers, websites, transit tips, and prices\n\nHonest reviews for all budgets - including eating, sleeping, sight-seeing, going out, shopping, and hidden gems that most guidebooks miss\n\nCultural insights give you a richer and more rewarding travel experience - including\n\ncustoms, history, art, literature, music, landscapes, sports, food and drink\nFree, convenient pull-out Dublin map (included in print version), plus over 80 colour maps\n\n\nCovers: Dublin, Waterford, Kilkenny, Cork, Kerry, Kildare, Limerick, Clare, Galway, Sligo, Donegal, The Midlands, Louth, Belfast, Armagh, Derry, and more\n\n\nBy Neil Wilson, Lonely Planet, Ryan Ver Berkmoes, Josephine Quintero, Catherine Le Nevez, Fionn Davenport\nPublished by Lonely Planet in 2014\nAZW3, Retail, 736 pages, English ","torrent":{"xt":"urn:btih:c6a09b382abd19d9c1e733f972ee512aef75eb5b","amp;dn":"Lonely+Planet+Ireland+%2811th+Ed%29+%28AZW3%2CRetail%29%7B32Skulls%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6a09b382abd19d9c1e733f972ee512aef75eb5b","infoHashBuffer":{"type":"Buffer","data":[198,160,155,56,42,189,25,217,193,231,51,249,114,238,81,42,239,117,235,91]},"announce":[],"urlList":[]}}