{"title":"Takedown.Red.Sabre-RELOADED","uid":8942766,"size":2665619488,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c6a4566d7bd5c63e92b2df86c60a22f32e88e617&amp;dn=Takedown.Red.Sabre-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"Mr.Stifmeister","files":2,"time":1379705868,"description":"\nnERv\n\nTakedown: Red Sabre (c) 505 Games\n\n09/2013 :..... RELEASE.DATE .. PROTECTION .......: Steam\n1 :.......... DISC(S) .. GAME.TYPE ........: Action/Simulation\n\nTAKEDOWN is a thinking-person's shooter. The player that takes things slow,\naims carefully, and plans their moves right will overcome the player who\nruns in with guns blazing. Close-quarters battle brings the fight inside,\nas you would see SWAT teams or SOF units taking down small numbers of\ndangerous adversaries. Non-linear environments allow for multiple routes\nand tactics and add replayability\n\nIn recent years, shooters have become homogenized. There used to be a wide\nrange of different games to choose, from run-and-gun action titles to\nslow-paced tactical shooters focusing on strategy and tactics, but now most\nshooters follow the same model of big set pieces, regenerating health,\nlinear levels, and &quot;cinematic experiences&quot;. The realistic tactical shooters\nwith in-depth planning have almost entirely disappeared in recent years\n\nThis game focuses on realistic weapons modeling, squad based play, in a\nclose-quarters battle setting. To succeed in this game you need to take\nthings slow, study your environment, and execute flawlessly. If you get shot\nthere are consequences. You won't be hiding behind a wall waiting for your\nhealth to regenerate. If a team member goes down, you will have to assess\nthe situation and reallocate team members if necessary to complete the\nmission.\n\nDon't expect all of the tools and plans to be forced fed to you - it is up\nto the player to ensure their team is equipped and ready for the tasks at\nhand. With features such as realistic bullet penetration, accuracy, and\nrecoil, choosing the proper weapons, ammunition, armor, and gear for\nthe mission is up to you, so choose carefully\n\nGameplay modes include single player, co-op, and competitive multiplayer.\nIf you are a fan of old school shooters where thinking meant more than\nrunning and gunning or perks, or if you are just looking for something\ndifferent in your shooter games experience, this is the game for you\n\nFEATURES\n\n- Fight Smart in Deadly, Close Quarters Combat - Players must think\nand move tactically, stay alert, watch, listen and choose wisely while\nsetting up their squad for the perfect shot\n\n- Tackle Engagements That Are Different Every Time - Nonlinear maps allow\nfor multiple tactics and approaches to both attack and defense. Gamers\nmust choose their gear to best execute strategy\n\n- Out Think The Enemy - Gamers need to work closely and communicate well\nwith their team to not only attack the enemy but to coordinate to\nsecure multiple objectives\n\n1. Unrar.\n2. Burn or mount the image.\n3. Install the Game\n4. Copy the crack from Crack dir to your install directory\n5. If you want to play 64 bit version change your shortcut to Win64 folder\n6. Play the game\n7. Support the software developers. If you like this game, BUY IT\n\n","torrent":{"xt":"urn:btih:c6a4566d7bd5c63e92b2df86c60a22f32e88e617","amp;dn":"Takedown.Red.Sabre-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6a4566d7bd5c63e92b2df86c60a22f32e88e617","infoHashBuffer":{"type":"Buffer","data":[198,164,86,109,123,213,198,62,146,178,223,134,198,10,34,243,46,136,230,23]},"announce":[],"urlList":[]}}