{"title":"T3 India - September 2016 (gnv64)","uid":15854328,"size":31624658,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c72e8e4d94f2af172bbc7f82834f24411ac94d12&amp;dn=T3+India+-+September+2016+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"gnv65","files":4,"time":1474219079,"description":"T3 India - September 2016\r\nEnglish | 117 pages | True PDF | 30.1 mb\r\n\r\nThe World's Leading Gadget Magazine! Tomorrow's Technology Today aka T3 strives to bring the best of technology in a crisp and a concise manner. The Indian edition focuses on India launches and reviews with a mix of global ongoing trends. T3 India also features a buying guide that recommends the best products in its respective category. \r\n\r\nFEATURES\r\n029 GADGET GURU\r\nHe knows more about tech than any mere mortal, and he’s here to answer your questions on smooth faces, adding HDMI to your old projector and VR\r\n031 AGENDA\r\nSeven amazing new tech adventures for you to try today. View the world’s first VR album, build cool tech with electric blocks, get e-inked with AR and much more!\r\n060 STATE OF THE ART\r\nIt’s the battle of the lightweight laptops as Microsoft’s Surface Book takes on the HP Spectre and Apple’s MacBook. Who will reign victorious?\r\n052 MAN VS TECH\r\nOur cycle-mad deputy editor puts three bikes to the test in the ultimate tech time trial. Can a more expensive bike make him faster on the road?\r\n\r\nHYPE\r\n010 PREVIEW\r\nThe best new tech out there including Olympus’s action cam, Asus Zenbook 3, Samsung Galaxy Note7 and Titan’s latest smartwatch\r\n026 PEOPLE\r\nWe serve up (sorry) a raft of gadgets for Andy Murray – everyone’s favourite ray of sunshine. C’mon Tim!\r\n028 TALKING TECH\r\nThis month, Duncan Bell brings his knowledge to the subject of internet trolls – and argues why we should lock more people up for being horrendous online\r\n\r\nSELECT\r\n082 SONY HIGH-RES TURNTABLE\r\nIt promises to change the way you play your vinyl forever. But does Sony’s latest turntable spin us right round?\r\n086 HP SPECTRE 13\r\nBeauty is one thing but what if that’s combined with performance as well? We check out HP’s Spectre 13\r\n092 GAMES\r\nWe get lost in No Man’s Sky massive universe\r\n \nhttps://s11.postimg.io/v06vml9eb/T3_India_September_2016.jpg","torrent":{"xt":"urn:btih:c72e8e4d94f2af172bbc7f82834f24411ac94d12","amp;dn":"T3+India+-+September+2016+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c72e8e4d94f2af172bbc7f82834f24411ac94d12","infoHashBuffer":{"type":"Buffer","data":[199,46,142,77,148,242,175,23,43,188,127,130,131,79,36,65,26,201,77,18]},"announce":[],"urlList":[]}}