{"title":"Beethoven - Complete Piano Sonatas &amp; Concertos - Claudio Arrau","uid":5152625,"size":2459521740,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c75f2bde75efd1e234418878047801332bcd01bb&amp;dn=Beethoven+-+Complete+Piano+Sonatas+%26+Concertos+-+Claudio+Arrau&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":4,"uploader":"dougietrotter","files":-1,"time":1257646636,"description":"Claudio Arrau played with seriousness of purpose that could make other pianists seem like dilettantes and with respect for the composer's score that bordered on veneration. He had nothing but scorn for pianists who played the opening of Beethoven's Opus 111 with two hands instead of one because there were fewer risks. If something was technically difficult, Arrau assumed that the composer had written it that way because the difficulties had an expressive value that it was the interpreter's duty to find.\n\nArrau's devotion to Beethoven is memorialized by this budget-priced, 14-CD collection of his recordings, mostly from the 1960s, of the composer's 32 sonatas, five concertos (with Bernard Haitink conducting the Concertgebouw Orchestra of Amsterdam), and most important sets of variations. His Beethoven is not always successful. His sometimes ponderous seriousness keeps early works, such as the Sonata No. 3 and the Concerto No. 2, from smiling, and his lack of spontaneity makes the whimsy in Sonata No. 26 and the &quot;Diabelli Variations&quot; sound labored. But in the composer's weightiest works, Arrau can produce revelations. Certainly, no one plays Sonata No. 32 better. The first movement sounds like thunder that comes ever closer and the finale's chains of trills, played with exquisite finish and expressive perfection, transport the listener to a higher realm. If Arrau could be single-minded in his devotion to the composer's score, he also believed that music could encompass everything. When Arrau was at his best - as he frequently is in this set - it does.\n\n\n\nEnjoy and Seed!!\n","torrent":{"xt":"urn:btih:c75f2bde75efd1e234418878047801332bcd01bb","amp;dn":"Beethoven+-+Complete+Piano+Sonatas+%26+Concertos+-+Claudio+Arrau","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c75f2bde75efd1e234418878047801332bcd01bb","infoHashBuffer":{"type":"Buffer","data":[199,95,43,222,117,239,209,226,52,65,136,120,4,120,1,51,43,205,1,187]},"announce":[],"urlList":[]}}