{"title":"Efter Brylluppet (After the Wedding (2006) (audio 4)(NL subs) TB","uid":6462080,"size":4259151125,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:c7f8ad95adede1bc9ec332186848a10e3393d767&amp;dn=Efter+Brylluppet+%28After+the+Wedding+%282006%29+%28audio+4%29%28NL+subs%29+TB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":2,"uploader":"Vlinder2","files":-1,"time":1307806521,"description":"Efter Brylluppet (After the Wedding - 2006) \t\n\n\n\nDenemarken / Zweden / Verenigd Koninkrijk / Noorwegen\nDrama\n120 minuten\n\nmet Mads Mikkelsen, Sidse Babett Knudsen en Rolf LassgÃƒÂ¥rd\n\nGemiddelde:\nMoviemeter: 3,90\nIMDB: 7.8/10\n\nDeze film staat op nummer 102 in de films top 250.\n\nLiefhebbers van een avondje film, vergeet niet dat er naast de grote \\&quot;Hollywoodreleases\\&quot; nog tig van \\&quot;andere\\&quot; (kwaliteits) films zijn, die te goed zijn om in de anonimiteit te verzwelgen.\n\n\nDeze film geregisseerd door Susanne Bier, was een groot succes en werd genomineerd voor de Oscar, Beste Buitenlandse Film.\n\nSamenvatting:\nJacob Petersen is hulpverlener in India. Hij runt samen met de plaatselijke bevolking een weeshuis. Wanneer het weeshuis door schulden lijkt te moeten sluiten, komt er blijkt een Deense zakenman JÃƒÂ¸rgen een groot geldbedrag te willen investeren.\n\nRecensie:\nEfter Brylluppet was de derde film die de Deense regisseur Susan Bier maakte met de eveneens Deense scenarioschrijver Anders Thomas Jensen. Ook deze film komt voort uit Biers en Jensens interesse in catastrofale plots en morele dilemma\\'s.\n\nDit is een complex familiedrama vol emoties. Het scenario is een goed gelaagd verhaal dat langzaamaan ontrafeld wordt. Het acteerwerk van zowel Mikkelsen als LassgÃƒÂ¥rd is fenomenaal te noemen. De rest van de cast levert trouwens ook prima werk af. Ook de dilemma\\'s waarin de mensen zich in deze film voor geplaatst zien zijn vaak moeilijk en de gevolgen van de keuzes leveren een aantal zeer indrukwekkende en zwaar emotionele scÃƒÂ¨nes op, zonder dat het er ook weer te dik op ligt. Indrukwekkend drama dus, met een einde waar je stil van wordt. Zeer dikke aanrader, een prima film!\n\nVerhaal:\nJacob Petersen is een Deen die zijn leven heeft gewijd aan het runnen van een weeshuis in India. Op het moment dat het huis met sluiting wordt bedreigd, meldt zich Jorgen, een rijke Deense zakenman, die een miljoenendonatie wil doen. Voorwaarde is wel dat Jacob persoonlijk naar Denemarken terugkeert voor de onderhandelingen. Eenmaal daar aangekomen blijken er een aantal bijkomende haken en ogen aan de deal te zitten. Zo moet Jacob opeens op de bruiloft van Jorgens dochter Anna komen. Die bruiloft blijkt een cruciale verbinding te zijn tussen een aantal gebeurtenissen in zijn verleden en zaken die in de toekomst verscholen liggen. Jacob wordt voor grote morele dilemma\\'s geplaatst.\n\n\nEnglish\n\nStoryline\n\nJacob Pederson lives in shanty surroundings in Bombay, India, and assists in the running of Anand Orphanage and School. He had attempted a number of projects to assist orphans, including child prostitutes - all quite in vain. He has adopted a young male orphan, Pramod, and takes special care of him. With growing pressure on the facilities, which is on the verge bankruptcy, the orphanage receives an offer of funding from wealthy Danish citizen, Jorgen, which may put an end to it's problems. In order to obtain the monies, Jacob must travel to Copenhagen, meet with Jorgen, get financial assistance, and be back to celebrate Pramod's 8th birthday. He sets forth, is received by Christina Refner, an employee and future son-in-law of Jorgen. Jacob is shown all possible courtesy and even housed in a posh apartment. He subsequently meets with Jorgen, shows him video-tapes and submits that a few Kroner could really save several lives which would otherwise succumb to minor illnesses and infections...\n \n\nInfo:\nBron.........: Retail\nTaal.........: Deens, Zweeds, Engels, Hindi\nAudio........: DD 5.1\nOndertitels..: Nederlands\n\nMet dank en alle eer voor de originele poster\n\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/36227&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/36227&lt;/a&gt; &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0457655/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0457655/&lt;/a&gt;\n\nTBS\n ","torrent":{"xt":"urn:btih:c7f8ad95adede1bc9ec332186848a10e3393d767","amp;dn":"Efter+Brylluppet+%28After+the+Wedding+%282006%29+%28audio+4%29%28NL+subs%29+TB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7f8ad95adede1bc9ec332186848a10e3393d767","infoHashBuffer":{"type":"Buffer","data":[199,248,173,149,173,237,225,188,158,195,50,24,104,72,161,14,51,147,215,103]},"announce":[],"urlList":[]}}