{"title":"Ray Gigant","uid":15540998,"size":2235816144,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c995ba4ddadd9dd461dd819f5cd7c4fe5a3988f1&amp;dn=Ray+Gigant&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"dauphong","files":1,"time":1470920302,"description":"About This Game\r\nRay Gigantis a unique dungeon crawler RPG which combines dungeon crawling adventure with Japanese visual novel like story telling. Players will first be introduced to the gripping tale of Ichiyawho is a young fighter shrouded in mystery. As the story progresses the player will be introduced to new characters which you later get to experience as the main character. There are a total of 3 different tales told in the perspective of Ichiya, Kyle and Nil.\r\n\r\nInnovative Battle System:\r\nUnlike ordinary turn based RPG battles, Ray Gigantadopts a unique style where you will be fighting massive enemies from different distances and perspectives. Your party is comprised of 3 characters, each with their own unique abilities to engage in 3-way view battles. Also use the rhythm-based, Slash Beat system to unleash deadly attacks while feeling the fate of the heroes and heroine resonate through their bodies!\r\n\r\nStory:\r\nIn a not so far away time of June 20XX... Earth’s major cities are being attacked by giant creatures called the Gigant. Each nation’s force tried to thwart the attacks to no avail. But then it was discovered that a single boy in Tokyo was able to defeat these monsters. His name, IchiyaAmakaze. This boy that defeated Gigantsusing a mysterious power called the Yorigamicame to be known throughout the world. But, after defeat of the Gigants, he lost control of his power... After destroying the city he protected, he loses his conscious. It was then where he was detained and sent to a safe location where his fate would unfold...\r\n\r\nFlow of Game Play:\r\nIn Ray Gigant, players will start off with the story part to set the setting and then adventure off into the dungeons for exploration and battles. Your team will be comprised of three characters, each with unique abilities and will have to face various forms of enemies. After boss battles there will be event scenes to further progress the story.\r\n\r\nDungeon Exploration:\r\nIn Ray Gigant, the story progresses by exploring and clearing the various dungeons called Megalosites. There a number of these dungeons and players will explore them on a 3D map.\r\n\r\nCombat:\r\nThe game features a dynamic 3-way view battle against towering Gigants. When facing huge Gigants, the characters within the party take position from 3 distances, each facing the Gigantwith methods fit for use from their positions.\r\n\r\nParasitism:\r\nWith the Yorigamisin coexistence with Ichiyaand others, they gradually are taken over by the Yorigami, thus imparting the state of Parasitism. During this time, the characters will fight at the expense of their very lives.\r\n\r\nSlash Beat Mode:\r\nSlash Beat Mode, aka SBM, is a special skill that can be unleashed by spending Slash Points (SP). Normally you are only able to execute an action 5 times per turn, but by using SBM you can execute a command over a 100 times.\r\n\r\nLeveling System [Evolve Tree]:\r\nThe leveling within the game is done through the Evolve Tree system. The tree branches into 3 different categories, each with a distinct feature to them","torrent":{"xt":"urn:btih:c995ba4ddadd9dd461dd819f5cd7c4fe5a3988f1","amp;dn":"Ray+Gigant","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c995ba4ddadd9dd461dd819f5cd7c4fe5a3988f1","infoHashBuffer":{"type":"Buffer","data":[201,149,186,77,218,221,157,212,97,221,129,159,92,215,196,254,90,57,136,241]},"announce":[],"urlList":[]}}