{"title":"Moonshiners Season 1 and 2 in 720p HD [CARG]","uid":8096684,"size":30621501467,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:c999adf59aa32967ee411826fa4ef3deee344cfb&amp;dn=Moonshiners+Season+1+and+2+in+720p+HD+%5BCARG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":6,"uploader":"Hard2Find2","files":-1,"time":1359853548,"description":"CARG Release Moonshiners Season 1 and 2 in 720p High Definition\n\n\n**ALL CREDIT TO ORIGINAL ENCODERS** This is just a compiled collection of this T.V. Show. Names have been changed to complete the integrity of being full seasons. The season 1 special (also known as S01E07) is NOT in High Definition along with theSutton documentary.\n\n\n\nBe sure to check out the other CARG release's. \nTo show your support for the time and effort in building this collection, Please seed at full speed during and after download so that others can also enjoy.\n\n\n\nMoonshiners is an American docudrama television series on the Discovery Channel that dramatizes the life of people who produce (illegal) moonshine. The series dramatizes their liquor production efforts, law-evading techniques and life.\n \nThe show appears to viewers to be a reality television show, however it is just a reenactment. There have been legitimate claims by local officials that the show is not what it portrays to be. Virginia authorities have stated that no illegal liquor is actually being produced by the people depicted in the show. The Virginia Department of Alcoholic Beverage Control said in March 2012 that, &quot;If illegal activity was actually taking place, the Virginia ABC Bureau of Law Enforcement would have taken action.&quot;\n \nPortions of the show that feature MarvinSutton were taken from a documentary film by Neal Hutcheson. Hutcheson's documentary was filmed in 2002 and released the same year with the title This is the Last Dam Run of Likker I'll Ever Make. In 2008, a version of the documentary that was edited for television was broadcast on PBS and the Documentary Channel with the title The Last One, and it received a Southeast Emmy Award in 2009. Sutton was arrested in 2007 for illegally distilling liquor and felony possession of a firearm, and was sentenced to eighteen months in jail in 2009. He subsequently committed suicide rather than report for a federal prison term that was scheduled to begin in a few days.\n\n\nOfficial Website\n &lt;a href=&quot;\nhttp://dsc.discovery.com/tv-shows/moonshiners&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dsc.discovery.com/tv-shows/moonshiners&lt;/a&gt;\n\nMerchandise\n &lt;a href=&quot;\nhttp://store.discovery.com/moonshiners/index.php?v=discovery_shows_moonshiners&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.discovery.com/moonshiners/index.php?v=discovery_shows_moonshiners&lt;/a&gt;\n\n\n\n","torrent":{"xt":"urn:btih:c999adf59aa32967ee411826fa4ef3deee344cfb","amp;dn":"Moonshiners+Season+1+and+2+in+720p+HD+%5BCARG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c999adf59aa32967ee411826fa4ef3deee344cfb","infoHashBuffer":{"type":"Buffer","data":[201,153,173,245,154,163,41,103,238,65,24,38,250,78,243,222,238,52,76,251]},"announce":[],"urlList":[]}}