{"title":"Standup Comedy - Steven Wright - I Still Have A Pony","uid":4319090,"size":60962845,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ca896a772d2f950afbec3a450550c70bb754a781&amp;dn=Standup+Comedy+-+Steven+Wright+-+I+Still+Have+A+Pony&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"rambam1776","files":16,"time":1217286385,"description":"I finally got an invitation to join Demonoid, where my Google searches for torrents I cannot find here keep showing great stuff. I spent all last week grabbing comedy albums which I am now going to upload here. Other than going to the trouble of fixing tags and getting artwork and details, these torrents are as the original posters seeded them. I am not endorsing or recommending all of these. In fact, I think some of them suck. However, there is a major lack of well seeded comedy torrents here, and I hope to encourage more people to post new ones. Also, who says *MY* taste matches somebody elses? The reviews are from ALLMUSIC or from AMAZON. As usual, much thanks to the OPs who put these out and about.\n\nRambam1776\n\n\n\nSTEVEN WRIGHT ? I STILL HAVE A PONY\n\nCareer\nWright&amp;#039;s 1985 comedy album entitled I Have a Pony, released on Warner Bros. Records, received critical acclaim and was nominated for a Grammy Award. In 1989, he won an Academy Award for his short film, The Appointments of Dennis Jennings. In 1992, Wright had a recurring role on the television sitcom Mad About You. He also supplied the voice of the radio DJ in the film Reservoir Dogs.\nThere are numerous lists of jokes attributed to Wright circulating on the Internet, sometimes of dubious origin. Wright has stated that &quot;someone showed me a site, and half of it that said I wrote it, I didn&amp;#039;t write. Recently, I saw one, and I didn&amp;#039;t write any of it. What&amp;#039;s disturbing is that with a few of these jokes, I wish I had thought of them. A giant amount of them, I&amp;#039;m embarrassed that people think I thought of them, because some are really bad.&quot;[4]\nAfter his 1990 comedy special Wicker Chairs and Gravity, Wright continued to do live stand-up performances, but was largely absent from television, only doing occasional guest spots on late night talk shows. In 2006, Wright noticed that much of his audience in recent years was getting older and wanted to reach out to a generation that only knew him from films like Half Baked. He produced his first stand-up special in 16 years, Steven Wright: When the Leaves Blow Away, originally aired on Comedy Central on October 21st, 2006 and again a day after its DVD release date, Wednesday, April 24.\nIn a 2005 poll to find The Comedian&amp;#039;s Comedian, he was voted amongst the top 50 comedy acts ever by fellow comedians and comedy insiders. He was named #23 on Comedy Central&amp;#039;s list of the 100 greatest standups of all time.\nOn September 25, 2007, Wright released a follow-up to I Have a Pony, titled I Still Have a Pony (a CD release of the material from When the Leaves Blow Away).\n\n Notable jokes\n \t&quot;Curiosity killed the cat, but for a while I was a suspect.&quot; \n \t&quot;I stayed up all night playing poker with tarot cards. I got a full house, and four people died.&quot; \n \t&quot;I&amp;#039;m living on a one-way dead-end street. I don&amp;#039;t know how I ever got there.&quot; \n \t&quot;Whenever I fill out an application and it says &amp;#039;In case of an emergency notify...,&amp;#039; I put Doctor. What the hell is my mother gonna do?&quot; \n \t&quot;I was arrested today for scalping low numbers at the deli.&quot; \n \t&quot;I had a skylight installed in my apartment. The people who live above me are furious.&quot; \n \t&quot;I went into this restaurant that serves you breakfast at any time, so I ordered French toast during the Renaissance.&quot; \n \t&quot;I wish my first word was &amp;#039;quote&amp;#039;, so when I died I could say &amp;#039;un-quote&amp;#039;.&quot; \n \t&quot;I finally got around to reading the dictionary. Turns out the zebra did it.&quot; \n \t&quot;If it&amp;#039;s a penny for your thoughts, and you put your two cents in, someone&amp;#039;s making a penny.&quot; \n \t&quot;I saw a subliminal advertising executive, but only for a second.&quot; \n \t&quot;I spilled spot remover on my dog. Now he&amp;#039;s gone.&quot; \n \t&quot;It&amp;#039;s a small world, but I wouldn&amp;#039;t want to paint it.&quot; \n \t&quot;Next week I&amp;#039;m gonna have an MRI to find out whether or not I have claustrophobia.&quot; \n \t&quot;They say you don&amp;#039;t know what you&amp;#039;ve got &amp;#039;til it&amp;#039;s gone. So I got rid of everything to see what I had.&quot; \n \t&quot;When I woke up, everything in my apartment had been stolen...and replaced with exact replicas.&quot; \n \t&quot;Do you think when they asked George Washington for his ID, he&amp;#039;d just pull out a quarter?&quot; \n \t&quot;I went to the bank and asked to borrow a cup of money. They said, &quot;What for?&quot; I said, &quot;I&amp;#039;m going to buy some sugar.&quot; \n \t&quot;My theory of evolution, is that Darwin was adopted.&quot; \n \t&quot;24-hour banking? I haven&amp;#039;t got time for that.&quot; \n \t&quot;I went to a store that had a sign that said &quot;Open 24 Hours&quot; and it was closed...I asked the manager &amp;#039;Why are you closing? It says you&amp;#039;re open 24 hours.&amp;#039; He said &amp;#039;Not in a row.&amp;#039;&quot; \n \t&quot;So I&amp;#039;m driving along, being real careful &amp;#039;cos its an old car and I installed my own airbags, I got an old bean bag chair, some laughing gas and a compressor, so if I hit the accident just right I&amp;#039;ll be floating up in the air laughing hysterically&quot; \n \t&quot;So I said to the hitchhiker &amp;#039;what do you do?&amp;#039; He said &amp;#039;I&amp;#039;m a student&amp;#039;. I said &amp;#039;a student of what?&amp;#039; He said he was studying journalism and photography, so I said &amp;#039;that&amp;#039;s funny, I&amp;#039;m actually writing a short story about a photographer who went completely insane trying to take a close up photo of the horizon.&amp;#039;&quot; \n \t&quot;You know when someone reads a letter in the movies and you always hear what&amp;#039;s written in the voice of the person who wrote the letter? Yeah, that kills me. In fact I get the same thing with menus.&quot; \n \tI was driving along when I saw a hitchhiker holding a sign that said &quot;heaven&quot;, so I hit him. He probably went there. He seemed like a nice guy. \n \tI&amp;#039;d like to do my imitation of bowling. (Drags the microphone across the stage floor, then whips it upwards.) Gutter. It took me a year and a half to write that. I didn&amp;#039;t know how to word it. \n \t&quot;This next song doesn&amp;#039;t go &amp;#039;something&amp;#039; like this; it goes &amp;#039;exactly&amp;#039; like this.&quot; \n\n\n\nReview by David Jeffries \nThe reason it took deadpan, surreal, and cerebral comedian Steven Wright more than 20 years to release a follow-up to his supreme 1985 album, I Have a Pony, was that he knew that if he wanted to keep performing live he would have to have a third album&amp;#039;s worth of material. After all, if you give his fans a recording, they&amp;#039;ll listen to it repeatedly, day after day, memorizing the set to the point where they could do Wright&amp;#039;s material as well as he could. The audio version of his Comedy Central television special When the Leaves Blow Away, I Still Have a Pony is an album worth the 20-year wait, and no doubt you&amp;#039;ll soon know someone who can repeat it verbatim. It&amp;#039;s filled with great stories ? like when Steven gets fired from the pet store for braiding the snakes ? and those sharp one-liners that run the spectrum of strangeness from the almost Henny Youngman-esque &quot;I bought an iPod that can either hold 5,000 songs or one phone message from my mother&quot; to the truly weird &quot;She would drink so much she would slur her pauses.&quot; If there&amp;#039;s a way to tell this Pony from its predecessor, it&amp;#039;s that the practically asleep comedian is somehow even more comfortable and displays plenty of trust that his audience is smart. Smart enough to take some stories that aren&amp;#039;t really jokes, but witty and bizarre ramblings that play with words and reality itself. He uses these merely witty moments as left jabs between his right hooks (&quot;My friend has a trophy wife, but I don&amp;#039;t think he won first place&quot;) and breaks up his set by grabbing the acoustic guitar and delivering a couple songs like truly evil &quot;The Kitten Song&quot; and the great &quot;Mumble Song.&quot; &quot;Wind chimes are for stupid people so they&amp;#039;ll know that there&amp;#039;s a breeze.&quot; Great stuff that will keep his cult as they always have been: loyal and laughing.\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Steven_Wright&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Steven_Wright&lt;/a&gt;\n &lt;a href=&quot;\nhttp://allmusic.com/cg/amg.dll?p=amg&amp;sql=11:giftxq95ldje&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://allmusic.com/cg/amg.dll?p=amg&amp;sql=11:giftxq95ldje&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:ca896a772d2f950afbec3a450550c70bb754a781","amp;dn":"Standup+Comedy+-+Steven+Wright+-+I+Still+Have+A+Pony","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca896a772d2f950afbec3a450550c70bb754a781","infoHashBuffer":{"type":"Buffer","data":[202,137,106,119,45,47,149,10,251,236,58,69,5,80,199,11,183,84,167,129]},"announce":[],"urlList":[]}}