{"title":"Lonely Planet Australia (Travel Guide) - Lonely Planet.mobi","uid":8805935,"size":25555972,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:caa0f92171b5570ca5f965035dbd05f88a56234e&amp;dn=Lonely+Planet+Australia+%28Travel+Guide%29+-+Lonely+Planet.mobi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"Jonnie23","files":-1,"time":1376331811,"description":".Mobi\n\nLonely Planet Australia: Used by more than two million travellers\n\n\nLonely Planet Australia is your passport to all the most relevant and up-to-date advice on what to see, what to skip, and what hidden discoveries await you. Snorkel at the spectacular Great Barrier Reef, watch a mystical sunset over ancient Uluru (Ayers Rock), or get rowdy with fellow Australian football fans; all with your trusted travel companion. Get to the heart of Australia and begin your journey now!\n\nInside Lonely Planet Australia Travel Guide:\n\nColour maps and images throughout\nHighlights and itineraries show you the simplest way to tailor your trip to your own personal needs and interests\nInsider tips save you time and money and help you get around like a local, avoiding crowds and trouble spots\nEssential info at your fingertips - including hours of operation, phone numbers, websites, transit tips, and prices\nHonest reviews for all budgets - including eating, sleeping, sight-seeing, going out, shopping, and hidden gems that most guidebooks miss\nCultural insights give you a richer and more rewarding travel experience - including history, art, sports, environment, landscapes, wildlife, cuisine, wine, and more\nFree, convenient pull-out Australia map (included in print version), plus over 120 local maps\nUseful features - including Walking Tours, Australia Outdoors, and Month-by-Month (annual festival calendar)\nCoverage of Perth, Western Australia, Darwin, Uluru, Adelaide, South Australia, Queensland, Great Barrier Reef, Sydney, New South Wales, Melbourne, Victoria, Canberra, Tasmania, and more\neBook Features: (Best viewed on tablet devices)\n\nZoom-in maps and images bring it all up close and in greater detail\nDownloadable PDF and offline maps let you stay offline to avoid roaming and data charges\nSeamlessly flip between pages\nEasily navigate and jump effortlessly between maps and reviews\nSpeedy search capabilities get you to what you need and want to see\nUse bookmarks to help you shoot back to key pages in a flash\nVisit the websites of our recommendations by touching embedded links\nAdding notes with the tap of a finger offers a way to personalise your guidebook experience\nInbuilt dictionary to translate unfamiliar languages and decode site-specific local terms\nThe Perfect Choice: Lonely Planet Australia, our most comprehensive guide to Australia, is perfect for those planning to both explore the top sights and take the road less travelled.\n\nLooking for just the highlights of Australia? Check out Lonely Planet's Discover Australia, a photo-rich guide to the country's most popular attractions.\nLooking for a guide focused on Sydney or Melbourne? Check out Lonely Planet's Sydney guide or Melbourne &amp; Victoria guide for a comprehensive look at all that these cities has to offer, or Melbourne Encounter, a handy-sized guide focused on the can't-miss sights for a quick trip.\nAuthors: Written and researched by Lonely Planet, Charles Rawlings-Way and Meg Worby, Brett Atkinson, Janye D'Arcy, Peter Dragicevich, Sarah Gilbert, Paul Harding, Catherine Le Nevez, Virginia Maxwell, Miriam Raphael, Regis St Louis, Steve Waters, Penny Watson.\n\nAbout Lonely Planet: Started in 1973, Lonely Planet has become the world's leading travel guide publisher with guidebooks to every destination on the planet, as well as an award-winning website, a suite of mobile and digital travel products, and a dedicated traveller community. Lonely Planet's mission is to enable curious travellers to experience the world and to truly get to the heart of the places they find themselves in.","torrent":{"xt":"urn:btih:caa0f92171b5570ca5f965035dbd05f88a56234e","amp;dn":"Lonely+Planet+Australia+%28Travel+Guide%29+-+Lonely+Planet.mobi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"caa0f92171b5570ca5f965035dbd05f88a56234e","infoHashBuffer":{"type":"Buffer","data":[202,160,249,33,113,181,87,12,165,249,101,3,93,189,5,248,138,86,35,78]},"announce":[],"urlList":[]}}