{"title":"Pro Evolution Soccer 2009 - PES SMoKE Patch 1.5","uid":4847403,"size":812413094,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:cb079374158d3cf582dee206b875586b5ad9eba0&amp;dn=Pro+Evolution+Soccer+2009+-+PES+SMoKE+Patch+1.5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":7,"uploader":"Dido_SMoKE","files":4,"time":1239737003,"description":"Pro Evolution Soccer 2009 - PES SMoKE Patch 1.5\n----------------------------------------------------------------------------------\n\nSome of the features:\n\n- A lot of new clubs and national teams with correct kits.\n- Bundesliga replaces Eredivisie.\n- Some of Eredivisie teams moved to Other Leagues A.\n- 172 overall Clubs, 84 overall national teams. (Highest number ever in PES)\n- NEW faces, balls, boots, stadiums, replay, scoreboard, referee and banners.\n- GDB correct kits for all teams.\n- Teams formation and starting lineups are up to date (10 April 2009)\n- Most national teams are updated according latest national matches.\n- All latest transfers (10 April 2009)\n- No duplicated players or names including ML hidden players.\n- Players in ML hidden players are not used in teams.\n- Correct names for everything.\n- And much much more\n\n----------------------------------------------------------------------------------\n\n- National Teams in Game (84): \n\nAustria, Belgium, Bulgaria, Croatia, Czech, Denmark, England, Finland, France, Germany, Greece, Hungary, Ireland, Belarus, Italy, Netherlands, Northern Ireland, Norway, Poland, Portugal, Romania, Russia, Scotland, Serbia, Slovakia, Slovenia, Spain, Sweden, Switzerland, Turkey, Ukraine, Wales, Cameroon, Cote D'Ivoire, Egypt, Ghana, Nigeria, Senegal, South Africa, Tunisia, Canada, Costa Rica, Mexico, United States, Argentina, Brazil, Chile, Colombia, Ecuador, Paraguay, Peru, Uruguay, Australia, China, Iran, Japan, Saudi Arabia, South Korea, Thailand, UAE, Angola, Guinea, Mali, Morocco, Honduras, Trinidad and Tobago, Bolivia, Venezuela, Bahrain, Iraq, Kuwait, North Korea, Oman, Qatar, Syria, Uzbekistan, Classic England, Classic France, Classic Germany, Classic Italy, Classic Netherlands, Classic Argentina, Classic Brazil.\n\n\n- Clubs in Game (172): \n\nArsenal FC, Aston Villa FC, Blackburn Rovers FC, Bolton Wanderers FC, Chelsea FC, Everton FC, Fulham FC, Hull City AFC, Liverpool FC, Manchester City FC, Manchester United FC, Middlesbrough FC, Newcastle United FC, Portsmouth FC, Stoke City FC, Sunderland AFC, Tottenham Hotspur FC, West Bromwich Albion FC, West Ham United FC, Wigan Athletic FC, AJ Auxerre, FC Girondins de Bordeaux, Stade Malherbe Caen, Grenoble Foot 38, Havre Athletic Club, LE Mans Union Club 72, Losc Lille MÃƒÂ©tropole, FC Lorient Bretagne , Olympique Lyonnais, Olympique de Marseille, AS Monaco FC, AS Nancy Lorraine, FC Nantes, OGC Nice, Paris Saint-Germain, Stade Rennais FC, AS Saint-Etienne, FC Sochaux, Toulouse FC, Valenciennes FC, Atalanta BC, Bologna FC, Cagliari Calcio, Calcio Catania, AC Chievo Verona, ACF Fiorentina, Genoa CFC, Inter Milan, Juventus FC, SS Lazio, US Lecce, AC Milan, SSC Napoli, USC Palermo, Reggina Calcio, AS Roma, UC Sampdoria, AC Siena, Torino FC, Udinese Calcio, Arminia Bielefeld, Bayer 04 Leverkusen, FC Bayern MÃƒÂ¼nchen, VFL Bochum, Energie Cottbus, Borussia Dortmund, Eintracht Frankfurt, Hamburger SV, Hannover 96, Hertha BSC Berlin, TSG 1899 Hoffenheim, Karlruher SC, FC Koln, Borussia M'Gladbach, FC Schalke 04, VFB Stuttgart, Werder Bremen, VFL Wolfsburg, UD Almeria, Athletic Bilbao, FC Barcelona, Real Betis, RC Deportivo LA CoruÃƒÂ±a, RCD Espanyol, Getafe, Sporting Gijon, Recreativo Huelva, Atletico Madrid, Real Madrid CF, Malaga CF, RCD Mallorca, CD Numancia, CA Osasuna, Racing Santander, Sevilla FC, Valencia CF, Real Valladolid, Villarreal CF, RSC Anderlecht, Club Brugge KV, Real Zaragosa, NK Dinamo Zagreb, Ajax Amsterdam, AZ Alkmaar, Feyenoord, PSV Eindhoven, Olympiacos, Panathinaikos, A.E.K. Athens FC, PAOK FC, SL Benfica, FC Porto, Sporting Club Lisbon, Steaua Bucuresti, CFR Cluj, Spartak Moscow, FC Zenit, Celtic FC, Rangers Football Club, FC Bate Borisov, SK Slavia Praha, IFK GÃƒÂ¶teborg, Hammarby IF, FC Basel 1893, Besiktas JK, FenerbahÃƒÂ§e SK, Galatasaray AS, Shakhtar Donetsk, FC Dynamo Kyiv, Reading FC, Wolverhampton FC, Bristol City FC, Aalborg BK, Anorthosis FC, SC Internacional, River Plate, CA Boca Juniors, Cruzeiro EC, Santos FC, Sao Paulo FC, CR Flamengo, CA Penarol, Estudiantes LP, CA Independiente, FK Partizan, FK Crvena Zvezda, EspÃƒÂ©rance de Tunis, Wisla Krakow, Legia Warszawa, Lech Poznan, CSKA Moscow, Standard de LiÃƒÂ¨ge, Al Ahly, Etoile du Sahel, Zamalek SC, BrÃƒÂ¸ndby IF, Aberdeen FC, Al Ittihad Jeddah, Club Africain, Al Hilal Riyadh, FC Copenhagen, Birmingham City FC, Sheffield United FC, Wydad Casablanca, Raja Casablanca, Liga de Quito, Colo Colo, LA Galaxy, Seattle Sounders FC, HJK Helsinki, Rosenborg BK, FC Seoul\n\n---------------------------------------------------------------------------------\n\nInstallation:\n\n1. Decompress the file\n\n2. Copy (PES2009_EDIT01.bin) in the SAVE folder, should be (C:Documents and SettingsUSERMy DocumentsKONAMIPro Evolution Soccer 2009save), replace old file if it asks.\n\n3. Copy the kitserver folder in the Pro Evolution Soccer 2009 installation folder, should be: (C:Program FilesKONAMIPro Evolution Soccer 2009), then open the kitserver folder and run (setup.exe) then click install, then close.\n\n4. Backup then Replace (pes2009.exe) and (settings.exe) with the ones given.\n\nP.S.: Directories are the ones by default installation, if you have changed the defaults use your directories.\n\n----------------------------------------------------------------------------------\n\nchange log:\n\nPES SMoKE Patch 1.5:\n\n- Included the NOCD cracked exe V1.2\n- Multi language Support (English, Spanish, Germany, Portugues, French, italian)\n- Frensh league replaces championship.\n- some of championship teams moved to others.\n- New teams with kits (Sao paulo, Flamengo, Standard de liege, Zamalek, Al Ahly, CSKA Moscow, Cruzeiro, Copenhagen, Etoile Sportive, EspÃƒÂ©rance de Tunis, Club Africain, Lech Poznan, Penarol, Crvena, Partizan, Rosenborg, Liga de Quito, Colo colo, Wisla Krakow, Legia Warszawa, LA Galaxy, Seattle Sounders, Al Ittihad Jeddah, Al Hilal Riyadh, Brondby IF, PAOK FC, Estudiantes LP, CA Independiente, Raja Casablanca, Wydad Casablanca, Aberdeen FC, FC Seoul)\n- New stadiums (NAMED BINS)\n- New faces (All Face Slots are used).\n- Updated faces and kits.\n- New Boots with correct preview\n- Lots of new players.\n- New replay logos.\n- New Scoreboard.\n- Fixed Everton and manCity Goalkeepers kits bug\n- Minor fixes (player rating, coverage on the field was all white, ...)\n\n\nPES SMoKE Patch 1.4:\n\n- Created 140 missing players.\n- Created 15 new players, (pocheco, nemeth, botia, nolito, ...)\n- a lot of forgotten transfers.\n- Added 150 new faces.\n- Updated kits.\n- Corrected some national team player names, (morocco, iraq, venezuela, ...)\n- Added new ball, (Adidas Europass Eurocopa)\n- Fixed cameroon kits. (was tansparent)\n- Corrected teams player number.\n- Updated formations and starting IX (based on last 10 to 15 matches played)\n- Some minor fixes. (ZN in place of AMF, ...)\n\n\nPES SMoKE Patch 1.3 (not released):\n\n- fixed stadium bug, (caused by some kinds of graphic cards)\n- Added team (Real Zaragoza).\n\n\nPES SMoKE Patch 1.2:\n\n- added more than 300 new faces.\n- fixed the balls names and preview balls.\n- fixed in game ball curser (replaced the original with a nice small circle curser).\n- updated kits.\n- fixed faces links\n- Real names for hidden players\n- created missing players\n- fixed some things you may not notice :)\n\n\nPES SMoKE Patch 1.1 (not released):\n\n- optimized some graphics so the game can load faster for low end PCs\n- fixed BAL mode possible crash when playing international games.\n\n----------------------------------------------------------------------------------\n\nFor comments and assistance, contact me at (&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;ed999e8e8e888399889fad948c858282c38e8280&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;)\nHave fun guys,\nSMoKE\n\n","torrent":{"xt":"urn:btih:cb079374158d3cf582dee206b875586b5ad9eba0","amp;dn":"Pro+Evolution+Soccer+2009+-+PES+SMoKE+Patch+1.5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb079374158d3cf582dee206b875586b5ad9eba0","infoHashBuffer":{"type":"Buffer","data":[203,7,147,116,21,141,60,245,130,222,226,6,184,117,88,107,90,217,235,160]},"announce":[],"urlList":[]}}