{"title":"YES! 50 SCIENTIFICALLY PROVEN WAYS TO BE PERSUASIVE - Robert Cia","uid":8751319,"size":11124122,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cb89529778182143d662e169c6bdbc564f2d5ea8&amp;dn=YES%21+50+SCIENTIFICALLY+PROVEN+WAYS+TO+BE+PERSUASIVE+-+Robert+Cia&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"leopardog","files":1,"time":1375038917,"description":"Yes!: 50 Scientifically Proven Ways to Be Persuasive\nby Noah J. Goldstein PhD, Steve J. Martin and Robert B. Cialdini PhD\nPDF FORMAT\n &lt;a href=&quot;\nhttp://www.amazon.com/exec/obidos/ASIN/1416576142/4353-20&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/exec/obidos/ASIN/1416576142/4353-20&lt;/a&gt;\n\nSmall changes can make a big difference in your powers of persuasion\nWhat one word can you start using today to increase your persuasiveness by more than fifty percent?\n\nWhich item of stationery can dramatically increase people's responses to your requests?\n\nHow can you win over your rivals by inconveniencing them?\n\nWhy does knowing that so many dentists are named Dennis improve your persuasive prowess?\n\nEvery day we face the challenge of persuading others to do what we want. But what makes people say yes to our requests? Persuasion is not only an art, it is also a science, and researchers who study it have uncovered a series of hidden rules for moving people in your direction. Based on more than sixty years of research into the psychology of persuasion, Yes! reveals fifty simple but remarkably effective strategies that will make you much more persuasive at work and in your personal life, too.\n\nCo-written by the world's most quoted expert on influence, Professor Robert Cialdini, Yes! presents dozens of surprising discoveries from the science of persuasion in short, enjoyable, and insightful chapters that you can apply immediately to become a more effective persuader. Why did a sign pointing out the problem of vandalism in the Petrified Forest National Park actually increase the theft of pieces of petrified wood? Why did sales of jam multiply tenfold when consumers were offered many fewer flavors? Why did people prefer a Mercedes immediately after giving reasons why they prefer a BMW? What simple message on cards left in hotel rooms greatly increased the number of people who behaved in environmentally friendly ways?\n\nOften counterintuitive, the findings presented in Yes! will steer you away from common pitfalls while empowering you with little known but proven wisdom.\n\nWhether you are in advertising, marketing, management, on sales, or just curious about how to be more influential in everyday life, Yes! shows how making small, scientifically proven changes to your approach can have a dramatic effect on your persuasive powers.","torrent":{"xt":"urn:btih:cb89529778182143d662e169c6bdbc564f2d5ea8","amp;dn":"YES%21+50+SCIENTIFICALLY+PROVEN+WAYS+TO+BE+PERSUASIVE+-+Robert+Cia","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb89529778182143d662e169c6bdbc564f2d5ea8","infoHashBuffer":{"type":"Buffer","data":[203,137,82,151,120,24,33,67,214,98,225,105,198,189,188,86,79,45,94,168]},"announce":[],"urlList":[]}}