{"title":"The Dollhouse - Fiona Davis [EN EPUB MOBI] [ebook] [p_s]","uid":15679209,"size":1669581,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cc14b04d960c0eb8ee8eb5c73d46818fa65a6f1c&amp;dn=The+Dollhouse+-+Fiona+Davis+%5BEN+EPUB+MOBI%5D+%5Bebook%5D+%5Bp_s%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"perfect_stan","files":2,"time":1472288988,"description":"The Dollhouse by Fiona Davis\r\nEnglish | 2016 | Historical Mystery | 1.6 MB\r\n\r\n\r\nFiona Davis’s stunning debut novel pulls readers into the lush world of New York City’s glamorous Barbizon Hotel for Women, where a generation of aspiring models, secretaries, and editors lived side-by-side while attempting to claw their way to fairy-tale success in the 1950s, and where a present-day journalist becomes consumed with uncovering a dark secret buried deep within the Barbizon’s glitzy past.\r\nWhen she arrives at the famed Barbizon Hotel in 1952, secretarial school enrollment in hand, Darby McLaughlin is everything her modeling agency hall mates aren’t: plain, self-conscious, homesick, and utterly convinced she doesn’t belong—a notion the models do nothing to disabuse. Yet when Darby befriends Esme, a Barbizon maid, she’s introduced to an entirely new side of New York City: seedy downtown jazz clubs where the music is as addictive as the heroin that’s used there, the startling sounds of bebop, and even the possibility of romance.\r\nOver half a century later, the Barbizon’s gone condo and most of its long-ago guests are forgotten. But rumors of Darby’s involvement in a deadly skirmish with a hotel maid back in 1952 haunt the halls of the building as surely as the melancholy music that floats from the elderly woman’s rent-controlled apartment. It’s a combination too intoxicating for journalist Rose Lewin, Darby’s upstairs neighbor, to resist—not to mention the perfect distraction from her own imploding personal life. Yet as Rose’s obsession deepens, the ethics of her investigation become increasingly murky, and neither woman will remain unchanged when the shocking truth is finally revealed.\r\n\r\nEnjoy and please SEED!!!","torrent":{"xt":"urn:btih:cc14b04d960c0eb8ee8eb5c73d46818fa65a6f1c","amp;dn":"The+Dollhouse+-+Fiona+Davis+%5BEN+EPUB+MOBI%5D+%5Bebook%5D+%5Bp_s%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc14b04d960c0eb8ee8eb5c73d46818fa65a6f1c","infoHashBuffer":{"type":"Buffer","data":[204,20,176,77,150,12,14,184,238,142,181,199,61,70,129,143,166,90,111,28]},"announce":[],"urlList":[]}}