{"title":"Daniel Keyes - Flowers For Algernon","uid":3917063,"size":260014542,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:cc29b4f889bf6ece502038f6cef18d2b786728ed&amp;dn=Daniel+Keyes+-+Flowers+For+Algernon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"sehnt","files":147,"time":1196541318,"description":".mp3 64kbps mono (Sound quality is very good).\n\nTrack Titles, File Names and Track Numbers are identical (001-147).\n\nUnabridged and Narrated by Jeff Woodman\n\nPlot Outline (taken from Wikipedia):\n\nThe story of Flowers for Algernon centers on Charlie Gordon, a mentally challenged janitor for a plastic box making company (bakery), (37 years old in the original novella, 32 years old in the full novel), who volunteers to take part in an experimental intelligence-enhancing treatment. His progress parallels that of Algernon, a laboratory mouse who had been &amp;#039;enhanced&amp;#039; earlier. The story is told from Charlie&amp;#039;s point of view and written as a journal, in progress reports, or progris riport as he initially spells it, which he keeps as part of the experiment. Subsequent entries trace Charlie&amp;#039;s ever-increasing comprehension and intelligence in the aftermath of the treatment, as he passes through &amp;#039;normalcy&amp;#039;, and then reaches genius level, becoming far more intelligent than the doctors who developed the procedure. He learns more than twenty languages, reads pages at a glance, writes a piano concerto, and disproves the hypothesis of the experiment that he was the subject of ??? among other accomplishments. His writings become eloquently written, reaching an extremely high level of sophistication.\n\nHe discovers both the advantages of intelligence and awareness, including his emotional relationship with his former teacher, Alice Kinnian; and the disadvantages, as he discovers that the people he thought were his friends had only viewed him as &amp;#039;entertainment&amp;#039; and now resent his superior abilities. He feels isolated from those less intelligent than him, which due to his remarkable intellectual growth, is everyone he encounters.\n\n\nPlease seed 1:1\t\t\n\n","torrent":{"xt":"urn:btih:cc29b4f889bf6ece502038f6cef18d2b786728ed","amp;dn":"Daniel+Keyes+-+Flowers+For+Algernon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc29b4f889bf6ece502038f6cef18d2b786728ed","infoHashBuffer":{"type":"Buffer","data":[204,41,180,248,137,191,110,206,80,32,56,246,206,241,141,43,120,103,40,237]},"announce":[],"urlList":[]}}