{"title":"Gang Starr - Studio Discography 1989-2006 [FLAC]","uid":10361935,"size":3298507249,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:cc3e058a7c65a1147280d627558d0d1abf882dc7&amp;dn=Gang+Starr+-+Studio+Discography+1989-2006+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":2,"uploader":"rudown78","files":271,"time":1402819206,"description":"Gang Starr - Studio Discography 1989-2006 [FLAC]\n\n\nThe most influential MC-and-DJ tandem of the 1990s, Gang Starr set new standards for East Coast rap with a pair of early-'90s touchstones, Step in the Arena (1991) and Daily Operation (1992), whose appeal has only grown over the decades. Beginning with these classic releases, both listeners and critics heaped mounds of praise upon Guru and DJ Premier -- the former because of his socially conscious lyrics and no-nonsense stance, the latter because of his DJ-style beat-making and jazzy sound. Following Step in the Arena and Daily Operation, Premier became one of New York's most demanded producers, crafting hits for the city's finest MCs, including the Notorious B.I.G., Nas, Jay-Z, and KRS-One. Guru likewise collaborated with plenty of well-known artists -- Roy Ayers, Donald Byrd, N'Dea Davenport -- on his solo debut, Jazzmatazz, Vol. 1 (1993), and its series of follow-ups. Following Hard to Earn (1994) -- the duo's fourth Gang Starr collaboration overall -- Guru and Premier began focusing primarily on their solo projects, reuniting infrequently -- too infrequently, many fans felt -- for albums such as Moment of Truth (1998) and The Ownerz (2003). During this period of solo activity, Gang Starr became increasingly recognized as a touchstone, one that critics and hip-hop purists frequently cited as a standard-bearer for streetwise, socially conscious East Coast rap.\n\nGuru (born Keith Edward Elam on July 17, 1966, in Boston, MA; died following a battle with cancer on April 19, 2010) and Premier (born Christopher Edward Martin on March 21, 1966, in Houston, TX) began working together in 1989. Guru had founded Gang Starr a couple years earlier, in 1987, and had already established a working relationship with Wild Pitch Records. The partnership of Guru and Premier as Gang Starr led to a formative debut album, No More Mr. Nice Guy (1989), and its featured single, &quot;Words I Manifest.&quot; The DJ-spotlight track &quot;DJ Premier in Deep Concentration&quot; is another highlight of the album, which spent years out of print. Between albums, in 1990, Guru and Premier contributed a song, &quot;Jazz Thing,&quot; to the Mo' Better Blues soundtrack. Gang Starr subsequently moved to Chrysalis Records for their second album, Step in the Arena (1991), on which they perfected the approach of their debut, that is, a stark, hard-hitting jazz-rap production style, complete with Premier's masterful DJ cutting, over which Guru's battle-rap-hardened yet smoothly delivered lyrics -- often thoughtful, sly, and streetsmart -- take flight. Gang Starr's third album, Daily Operation (1992), furthered the duo's approach stylistically; widely considered an East Coast rap classic, it's arguably Guru and Premier's finest work, along with its predecessor.\n\nBeginning in 1993, Guru and Premier began working separately. Guru's debut album, Jazzmatazz, Vol. 1 (1993), took the so-called jazz-rap style to a new level, featuring jazz musicians such as Lonnie Liston Smith, Branford Marsalis, Ronny Jordan, Donald Byrd, and Roy Ayers, along with guest vocalists such as N'Dea Davenport (of the Brand New Heavies) and MC Solaar (of French rap fame). Meanwhile, Premier produced six tracks for KRS-One's solo debut, Return of the Boom Bap (1993); moreover, in 1994 he proceeded to produce three tracks for Nas' debut, Illmatic (&quot;N.Y. State of Mind,&quot; &quot;Memory Lane [Sittin' in da Park],&quot; &quot;Represent&quot;); two for the Notorious B.I.G.'s debut, Ready to Die (&quot;Unbelievable,&quot; an unreleased remix of &quot;Machine Gun Funk&quot;); five for the self-titled debut of Branford Marsalis' Buckshot LeFonque project; the entirety of Jeru the Damaja's debut, The Sun Rises in the East; and also a handful of remixes for various artists. Amid all of this activity, Guru and Premier found time to record their fourth album, Hard to Earn (1994), which was more hardcore-fashioned -- as was the style at the time, in the wake of Death Row's uprising -- than past Gang Starr albums and, also unlike past efforts, featured guest rappers. The album spawned the duo's biggest hit to date, &quot;Mass Appeal,&quot; their first to break the Billboard Hot 100 singles chart (peaking at number 67).\n\nFollowing Hard to Earn, Guru and Premier resumed their solo activity. Guru released Jazzmatazz, Vol. 2: The New Reality (1995) and a various-artists compilation, Guru Presents Ill Kid Records (1995), while Premier produced the bulk of Livin' Proof (1995), the debut of Gang Starr affiliates Group Home (a duo comprised of Lil' Dap and Melachi the Nutcracker, who both had been featured on Hard to Earn). Also in 1995, Premier produced three tracks on KRS-One, the rapper's second solo album; and two tracks on Hold It Down, the third album by Das EFX; as well as assorted remixes and one-off productions. While Guru remained more or less inactive during 1996-1997, releasing no solo albums, Premier stayed busy, producing the entirety of Jeru the Damaja's second album, Wrath of the Math (1996); five tracks on Bahamadia's debut, Kollage (1996); six on M.O.P.'s second album, Firing Squad (1996); three on Jay-Z's debut, Reasonable Doubt (1996) (&quot;D'evils,&quot; &quot;Friend or Foe,&quot; &quot;Bring It On&quot;); one on Nas' second album, It Was Written (1996) (&quot;I Gave You Power&quot;); two on Jay-Z's second album, In My Lifetime, Vol. 1 (1997) (&quot;A Million &amp; One Questions,&quot; &quot;Friend or Foe '98&quot;); two on the Notorious B.I.G.'s second album, Life After Death (1997) (&quot;Kick in the Door,&quot; &quot;Ten Crack Commandments&quot;); four on O.C.'s second album, Jewelz (1997); two on Rakim's solo debut, The 18th Letter (1997); two on the Lady of Rage's debut, Necessary Roughness (1997); and more.\n\nIn 1998, after four years between albums, Gang Starr returned with Moment of Truth, their first album to chart number one (on the R&amp;B/Hip-Hop album chart, that is; it peaked at number six overall, still their best showing commercially to date). Moment of Truth was a significant departure from past Gang Starr efforts, very much contemporary in style; for example, the album features numerous guests (Inspectah Deck, Scarface, G. Dep, K-Ci &amp; JoJo, M.O.P.) and bore little trace of the duo's jazz-rap beginnings. The lead single, &quot;You Know My Steez,&quot; became the second Gang Starr hit to break into the Billboard Hot 100 chart (peaking at number 76). A double-disc retrospective, Full Clip: A Decade of Gang Starr (1999), subsequently marked the duo's ten-year anniversary. In the years that followed, Guru and Premier continued to focus on their own work. Guru continued his Jazzmatazz series, beginning with a third volume, Streetsoul, in 2000; he also released solo rap albums, beginning with Baldhead Slick &amp; da Click (2001). The next Guru release, Version 7.0: The Street Scriptures, arrived in 2005 on his new label, 7 Grand Records; the album featured beats by Solar, who would prove to be an important contributor on additional 7 Grand releases. The fourth volume of Jazzmatazz, including the typical array of guest vocalists and instrumentalists, was issued in the summer of 2007, along with the &quot;raw&quot; companion disc Guru's Jazzmatazz - The Timebomb: Back to the Future Mixtape. Guru 8.0: Lost and Found, the rapper's next 7 Grand full-length, followed in 2009. Premier continued his production activity, working with superstars such as Jay-Z, Nas, and Common, as well as underground rappers such as Royce da 5'9&quot;, Termanology, and NYG'z; he even dabbled in mainstream pop, most notably working extensively with Christina Aguilera on her double-disc album Back to Basics (2006).\n\nAs for Gang Starr, Guru and Premier did reunite for The Ownerz (2003), a celebrated return to form, but the reunion proved short-lived, leaving back-catalog collections such as Mass Appeal: The Best of Gang Starr (2006) to fill the void. Sadly, Guru died at age 43 on April 19, 2010 after battling cancer, suffering a heart attack, and for a time falling into a coma.\n\n\n1989 - No More Mr. Nice Guy\n1991 - Step in the Arena\n1992 - Daily Operation\n1994 - Hard to Earn\n1998 - Moment of Truth\n1999 - Full Clip: A Decade of Gang Starr [2-CD]\n2003 - The Ownerz\n2006 - Mass Appeal: The Best of Gang Starr\n\n\nAlbum artwork and rip logs are included. Enjoy!!!!!!!!!!!!!!!!!!!!!!!!!!!!","torrent":{"xt":"urn:btih:cc3e058a7c65a1147280d627558d0d1abf882dc7","amp;dn":"Gang+Starr+-+Studio+Discography+1989-2006+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc3e058a7c65a1147280d627558d0d1abf882dc7","infoHashBuffer":{"type":"Buffer","data":[204,62,5,138,124,101,161,20,114,128,214,39,85,141,13,26,191,136,45,199]},"announce":[],"urlList":[]}}