{"title":"Cossacks: European Wars &amp; Art of War (Patches, Cracks, Covers)","uid":4206092,"size":1120066052,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ccb315c3594cbf66a8da90656836cd0915cb5061&amp;dn=Cossacks%3A+European+Wars+%26+Art+of+War+%28Patches%2C+Cracks%2C+Covers%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"BASSZAMEGAZOSSZES","files":97,"time":1211813875,"description":"                                    Description                                   \n                                                                                   \nCossacks: European Wars                                                           \nThis is a game about epic battles in one of the most turbulent eras in European history. Mighty nation-states were forged in the fires of the battlefield, and mating decades, wars involving nearly every European nation. These dramatic events of the 16th through 18th centuries in Europe have provided Ukrainian developer GSC Game World with ample material for a fairly ambitious, if flawed, real-time strategy game.                                                   \nAt first glance, Cossacks looks like a real-time strategy game aimed at history majors. The details of the conflicts featured in the game, like the Thirty Years&amp;#039; War and the War for Austrian Succession, aren&amp;#039;t exactly common knowledge, and units like the spakh (Turkish cavalry) and serdiuk (Ukrainian musketeer) will seem obscure to players without an encyclopedic knowledge of military history. Initially, Cossacks also looks like an Age of Empires II clone, just set a few centuries later. The similarities are many and striking. Cossacks features a very similar isometric view, visual style, unit scale, iconic interface, resource       \ndisplay, and map. Villagers harvest materials like wood, stone, and gold. Priests act as adjuncts to your troops, and historically based military units essentially work on a simple rock-paper-scissors combat model, in that each unit specializes in attacks on another particular type of unit.                                   \n\nDetailede Rewiev:                                                                  &lt;a href=&quot;\nhttp://www.gamespot.com/pc/strategy/cossackseuropeanwars/review.html?om_act=convert&amp;om_clk=gssummary&amp;tag=summary;review&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.gamespot.com/pc/strategy/cossackseuropeanwars/review.html?om_act=convert&amp;om_clk=gssummary&amp;tag=summary;review&lt;/a&gt;                                             \n\n           \nCossacks: Art of War:                                                             \nCossacks: The Art of War is the expansion pack to last year&amp;#039;s Cossacks: European Wars by GSC Game World. Cossacks is a real-time strategy game set in Europe during the 17th through 18th centuries. What makes the game particularly interesting is that it focuses on epic-scale historical events and the nations that forged them. The Art of War continues on this theme by adding new campaigns, historical battles, and two new nations. While the expansion doesn&amp;#039;t drastically change the core elements, its additions to the gameplay make Cossacks much more enjoyable by opening up more strategic options.\nThe Art of War&amp;#039;s new content will keep any strategy fan busy for quite a while. There are five new campaigns, which will place you in command of notable historical figures like King Frederick of Prussia or Algerian pirates in the Mediterranean. Each campaign spans several missions and will take you all over Europe as you proceed. If the campaigns weren&amp;#039;t enough, there are also new single-player missions and new historical battles to fight. Bavaria and Denmark have been added to the roster of playable nations, but curiously enough, neither is featured prominently in any of the new missions. At any rate, these are very similar to every other European nation in the game. There are also new units in The Art of War. The majority are ships that you can build once your nation advances to the 18th century. They make naval battles much more devastating andstress importance of dominating the seas if the map has water.                     \n\nDetailed Rewiev:                                                                    &lt;a href=&quot;\nhttp://www.gamespot.com/pc/strategy/cossackstheartofwar/review.html?om_act=convert&amp;om_clk=gssummary&amp;tag=summary;review&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.gamespot.com/pc/strategy/cossackstheartofwar/review.html?om_act=convert&amp;om_clk=gssummary&amp;tag=summary;review&lt;/a&gt;                   \n\n                                                                                                                                                           \nFeatures:                                                                           \n- Grandiose battles of up to 8000 units.                                           \nUnlimited variety of tactical and strategic methods of land or sea war             \nagainst enemies.                                                                   \n- Original economic system with six resources: food, wood, stone, gold,           \ncoal and iron.                                                                     \n- Full 3D landscape with real world physics.                                       \n- Resolution: 800 x 600, 1024 x 768, 1280 x 1024, 1600 x 1024.                     \n- Huge maps up to 36x36 game screens at 1280x1024 resolution.                     \n- Special effects smoke, fog, explosions, buildings&amp;#039; burning, explosion           \nrebounds, real-time water rendering.                                               \n- Multiplayer game supports up to 7 players via modem, local network, or Internet.                                                                         \n- Random Map and Historical Battles modes.                                         \n- Random map generator.                                                           \n- 16 rivaling nations with their original graphics, economic and technical         \ndevelopment peculiarities.                                                         \n- Original game interface More than 85 real historical large-scale wars and       \nbattles of XVI-XVIII centuries.                                                   \n- A huge technological hierarchy of more than 300 upgrades.                       \n- Military formations: column, rank, or square. A formation includes an           \nofficer and a drummer, and units&amp;#039; abilities increase in a formation\n\nSystem Requirements:                                                               \n    OS: Win95/98/2000/ME/NT                                                           \n    CPU: Pentium 200 (233 Mhz or better Recommended)                                 \n    RAM: 32 MB RAM (64 Mb recommended)                                               \n    VGA: 1 MB video card (4 Mb VGA recommended)                                       \n    HDD: 200 MB available hard disk space                                             \n    ODD: 8x CD-ROM                                                                   \n    Misc.: Sound card, DirectX 6\n\nInstallation                                   \n- European Wars:                                                                     \n    1. Install the game (full Install)                                                 \n    2. Aplly the patch loceted in the PATCH dir.                                       \n    3. Copy the crack from the CRACK dir.                                             \n    4. Play and enjoy or start to install the expansion                               \n   \n- Art of War:                                                                       \n    1. Install the Game (YOU MUST INSALL EUROPEAN WARS FIRST)                         \n    2. Install the patch, from the PATCH dir                                           \n    3. Install Crack, from CRACK dir                                                   \n    4. That&amp;#039;s all... Have fun","torrent":{"xt":"urn:btih:ccb315c3594cbf66a8da90656836cd0915cb5061","amp;dn":"Cossacks%3A+European+Wars+%26+Art+of+War+%28Patches%2C+Cracks%2C+Covers%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ccb315c3594cbf66a8da90656836cd0915cb5061","infoHashBuffer":{"type":"Buffer","data":[204,179,21,195,89,76,191,102,168,218,144,101,104,54,205,9,21,203,80,97]},"announce":[],"urlList":[]}}