{"title":"Netter's Obstetrics and Gynecology, 2E [PDF] [StormRG]","uid":11331396,"size":54610406,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ccd16a4c51aa60683ee221515e9dd513444f30c9&amp;dn=Netter%27s+Obstetrics+and+Gynecology%2C+2E+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"0xmovva","files":2,"time":1414686213,"description":"TITLE/EDITION Netter's Obstetrics and Gynecology, 2e (Netter Clinical Science)\nAuthor: Roger P. Smith \nSeries: Netter Clinical Science\nHardcover: 664 pages\nPublisher: Saunders; 2nd edition (December 17, 2008)\nLanguage: English\nISBN-10: 1416056823\nISBN-13: 978-1416056829\nFormat: Retail PDF\nNOTE: this is the standalone ebook and may not include access codes that come packaged with the bound book\n\n___________________________________________________________________________________\n\n\nGain easy visual access to the common conditions and problems most often encountered in obstetrics and gynecology practice! This resource pairs more than 250 exquisite Netter images with concise descriptions of the most current medical thinking on common diseases/conditions, diagnostics, treatments, and protocols for a single easy-to-use quick reference. New and expanded coverage including a new section on gynaecological and obstetric procedures, overviews of preventative women's health, healthy pregnancy, and counseling place need-to-know guidance at your fingertips for regular office visits, while short reference lists cite graded evidence-based studies for more in-depth research. The result is a superb source for fast clinical reference as well as patient and staff education.\nFeatures concise text with standardized headings for quick access to expert medical thinking.\nPresents more than 250 exquisite Netter and Netter-style illustrations that provide a quick and memorable overview of each disease.\nPresents topics of importance to obstetrics and gynecology practice, including common procedures, health maintenance schedules, healthy pregnancy check-ups, contraception, counseling, and other preventive care.\nIncludes an evidence-based reference list in each chapter, enabling you to research further into clinical studies with varying levels of evidence.\nIncludes coverage of pathophysiology, when important, for clinical management","torrent":{"xt":"urn:btih:ccd16a4c51aa60683ee221515e9dd513444f30c9","amp;dn":"Netter%27s+Obstetrics+and+Gynecology%2C+2E+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ccd16a4c51aa60683ee221515e9dd513444f30c9","infoHashBuffer":{"type":"Buffer","data":[204,209,106,76,81,170,96,104,62,226,33,81,94,157,213,19,68,79,48,201]},"announce":[],"urlList":[]}}