{"title":"Springer Handbook of Geographic Information","uid":15576697,"size":57548908,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cd2c01349de68d8d226ab0c5384b8a219b88a08f&amp;dn=Springer+Handbook+of+Geographic+Information&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"clouderone","files":1,"time":1471346473,"description":"Springer Handbook of Geographic Information - Wolfgang Kresse, David M. Danko (Springer, 2012).pdf\r\n\r\nComputer science provides a powerful tool which was virtually unknown three generations ago and new applications have emerged which were technically not feasible without the support of a computer. These developments lead to new high-level domains. One of them is Geographic Information.\r\n\r\nClassical fields of knowledge are geodesy (surveying), cartography, and geography. Electronics and computers have revolutionized geodetic methods. Cartography has faced the dominance of the computer that results in simplified cartographic products. All three fields now make use of the internet and databases where geodesy may be interpreted as the input-component, cartography as the output component, and geography as one of many application of geographic information.\r\n\r\nFast and mobile internet access as well as a comprehensive standardization of data exchange have opened the door to many new applications. Typical examples are spatial data infrastructures. They enable an overlay of data that reside on different computers but are geometrically referred to the same area. They revolutionize the relations between citizens and administration and economy. Another field is location based services which link mobile devices with spatial and temporal data. The most advanced concept is called ubiquitous GIS which handles a great number of position-coded mobile objects. The automatic administration of these objects has already gained importance within logistics enterprises.\r\n\r\nThe contents of the Springer Handbook of Geographic Information reflects these thoughts. It is organized in the parts, Basics, Geographic Information, and Applications. Some parts of the basics part belong to computer science. However, the reader gets a comprehensive view of geographic information because the topics selected from computer sciences have a close relation to geographic information","torrent":{"xt":"urn:btih:cd2c01349de68d8d226ab0c5384b8a219b88a08f","amp;dn":"Springer+Handbook+of+Geographic+Information","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd2c01349de68d8d226ab0c5384b8a219b88a08f","infoHashBuffer":{"type":"Buffer","data":[205,44,1,52,157,230,141,141,34,106,176,197,56,75,138,33,155,136,160,143]},"announce":[],"urlList":[]}}