{"title":"Zombasite v1.0","uid":15680079,"size":322762047,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:cd2e4ba05c83ca3f0e9a42a1549aaa37ee3791cf&amp;dn=Zombasite+v1.0&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"dauphong","files":1,"time":1472301577,"description":"\nAbout This Game\r\nZombasite is a zombie apocalypse action RPG set in a dynamic, evolving, fantasy world for Windows, Mac, and Linux.\r\n\r\nThe dark elves have always played god by creating and enhancing underworld slave creatures. As they watched a horde of zombies destroy the huge demon city Kraval, the dark elves were tantalized by the devastating power of uncontrolled zombies, and desired to control and increase it. When they wove their dominating magic into a few captive zombies something went horribly wrong!\r\n\r\nThey hadn't known the powerful necromancer, Ciglio, had created these zombies. To control his huge armies of undead, Ciglio permanently bound his zombies and their infected victims to him. This binding was so powerful, their loyalty surpassed his untimely death. In the dark elves' pride and lust, their magic twisted into Ciglio's binding, fusing into a new, uncontrollable creation, the Zombasite.\r\n\r\nZombasite is a nasty, voracious, all-consuming Zombie Parasite. It doesn't just reanimate the dead into mindless zombies. It is intelligent, insatiable, and unstoppable---infecting and killing the living, spreading faster and in more ways, helping the dead utilize many of their original skills, and mutating the dead with new powers. Dark elf zombies are terrifying!\r\n\r\nSo what does this have to do with you? You are the leader of a clan trying to survive the apocalypse. This is easier said than done. When a follower dies, they can't be saved by any means. The Zombasite is highly contagious and zombies are quickly ravaging the world's surface. Food is a critical resource that must be obtained. Vendors are rare and have limited supplies. Some of the stronger monsters have survived and are as dangerous as ever. Clans of humans and monsters are fighting over what few supplies are left. Even within your own clan it isn't safe. Humans living on the edge are even more unstable than usual. So yeah, survival isn't easy.\r\n\r\nFeatures:\r\n\r\n    Survive the zombie apocalypse in a fantasy world\r\n    Experience uniquely created worlds for every game, with different areas, monsters, items, and quests\r\n    Explore a dynamic, evolving, living world\r\n    Lead a clan of followers who have their own personalities and skills\r\n    Navigate relationships with rival clans using diplomacy, trade, war, and raids\r\n    Adventure with your friends with co-op multiplayer\r\n    Your choices truly impact the game!\r\n    Customize your experience with many character and world options including turning off zombies and clans","torrent":{"xt":"urn:btih:cd2e4ba05c83ca3f0e9a42a1549aaa37ee3791cf","amp;dn":"Zombasite+v1.0","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd2e4ba05c83ca3f0e9a42a1549aaa37ee3791cf","infoHashBuffer":{"type":"Buffer","data":[205,46,75,160,92,131,202,63,14,154,66,161,84,154,170,55,238,55,145,207]},"announce":[],"urlList":[]}}