{"title":"My Favorite Year (multi subs) [1982] Peter O'Toole","uid":6159663,"size":1073724174,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cd76d54851b2c050fd203808b7de497a628bec0f&amp;dn=My+Favorite+Year+%28multi+subs%29+%5B1982%5D+Peter+O%5C%27Toole&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":3,"uploader":"ThorntonWilde","files":-1,"time":1297165866,"description":" &lt;a href=&quot;http://bayimg.com/mAdEnaAdl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/mAdEnaAdl&lt;/a&gt;\n\nMy Favorite Year (1982) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0084370/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0084370/&lt;/a&gt;\n\nAUDIO TRACK 1 ORIGINAL SOUNDTRACK\nAUDIO TRACK 2 COMMENTARY BY DIRECTOR RICHARD BENJAMIN \n\nEnglish language with English French Spanish Portuguese subtitles\n\n\nMy Favorite Year is a 1982 American comedy film directed by Richard Benjamin which tells the story of a young comedy writer.[1] It stars Peter O'Toole, Mark Linn-Baker, Jessica Harper, Joseph Bologna, Lou Jacobi, Bill Macy, Lainie Kazan, Selma Diamond, Cameron Mitchell, and Gloria Stuart. O'Toole was nominated for the Academy Award for Best Actor. The film was adapted into an unsuccessful 1992 Broadway musical of the same name.\n\n  Peter O'Toole  ...  Alan Swann  \n  Mark Linn-Baker  ...  Benjy Stone  \n  Jessica Harper  ...  K.C. Downing  \n  Joseph Bologna  ...  King Kaiser  \n  Bill Macy  ...  Sy Benson  \n  Lainie Kazan  ...  Belle Carroca  \n  Anne De Salvo  ...  Alice Miller  \n\nMel Brooks, executive producer of the film, was a writer for the Sid Caesar variety program Your Show of Shows, early in his career. Movie swashbuckler Errol Flynn was a guest on one episode, and this real-life occurrence inspired Dennis Palumbo's largely fictional screenplay. Swann was obviously based on Flynn, while Benjy Stone is loosely based on both Brooks and Woody Allen, who also wrote for Caesar.\n\nAccording to Brooks, the character of Rookie Carroca also was based on a real person, a Filipino sailor in the U. S. Navy who was his neighbor in Brooklyn. Much like Alan Brady on The Dick Van Dyke Show, King Kaiser represented Sid Caesar (&quot;Kaiser&quot; is the German equivalent of the Roman title Caesar). Selma Diamond, another former Your Show of Shows writer (who inspired Rose Marie's 'Sally Rogers' character on The Dick Van Dyke Show), appears as a costume mistress.\n\nOther writers from Your Show of Shows had already made their own use of their experiences. The comic play, Laughter on the 23rd Floor, by Neil Simon included thinly disguised versions of Sid Caesar and his staff, as did The Dick Van Dyke Show, which was created by Brooks' friend and colleague, Carl Reiner (who would later star in Van Dyke's show as Alan Brady).\n\nBrooks acknowledges that most of the movie's plot was fabricated. He says that Flynn's appearance on Your Show of Shows was uneventful, that none of the writers got much of a chance to talk to Flynn, let alone become his friend or take him home to dinner.\n\nThe film was the first directing effort for actor Richard Benjamin.\n\nSet in 1954 New York, director Richard Benjamin's first effort, My Favorite Year (1982), is the story of an alcoholic former star of Hollywood's Golden Age and his inability to adapt to the live television programs of the fifties. Peter O'Toole stars as the Errol Flynn-John Barrymore-esque Alan Swann who has traded in fencing and swashbuckling films for booze and women. Mark Linn-Baker is Benjy Stone, the junior writer on the TV comedy/variety series, The King Kaiser Show and an incurable fan of Swann. Stone is commissioned to baby-sit Swann (O'Toole) after the latter has a disastrous encounter with the show's star, King Kaiser, as a result of a drinking binge. As the film progresses toward Swann's live appearance on television, Stone begins to share his charge's escalating panic over the upcoming event. \n\nMy Favorite Year was inspired by Mel Brooks' real-life experience with Errol Flynn when he appeared on Sid Caesar's Your Show of Shows. Mel Brooks (the producer of My Favorite Year) was a junior writer at the time and was assigned the role of chaperon for the former swashbuckler, who was hitting the bottle hard. Indeed, Richard Benjamin described Brooks's involvement in My Favorite Year as being more than just financial. It was the former comedy writer's experiences with Flynn that helped Benjamin find the right tone for the film - a mixture of awe and comic exasperation toward a once famous star who was trying to hide his insecurities through heavy drinking.\n\nNot surprisingly, Peter O'Toole, once a heavy drinker himself, received an Academy Award nomination for Best Actor for his flamboyant portrayal of Swann. With the exception of his performance in The Stunt Man (1980) two years earlier, My Favorite Year was O'Toole's most critically acclaimed performance since The Ruling Class in 1972 and he still hasn't topped it. \n\n\n","torrent":{"xt":"urn:btih:cd76d54851b2c050fd203808b7de497a628bec0f","amp;dn":"My+Favorite+Year+%28multi+subs%29+%5B1982%5D+Peter+O%5C%27Toole","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd76d54851b2c050fd203808b7de497a628bec0f","infoHashBuffer":{"type":"Buffer","data":[205,118,213,72,81,178,192,80,253,32,56,8,183,222,73,122,98,139,236,15]},"announce":[],"urlList":[]}}