{"title":"USMLE Step 2 Secrets, 4E [Epub] [StormRG]","uid":10564882,"size":6124890,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cda7284cef75647b82ef0e2bfa9e6b825da7cd4e&amp;dn=USMLE+Step+2+Secrets%2C+4E+%5BEpub%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"0xmovva","files":-1,"time":1405508235,"description":"Author: Theodore X. O'Connell\nSeries: Secrets\nPaperback: 368 pages\nPublisher: Saunders; 4 edition (December 18, 2013)\nLanguage: English\nISBN-10: 0323188141\nISBN-13: 978-0323188142\nFormat: Retail Epub\nReader Required: Adobe Digital Editions, Calibre, MoonReader for Android\n\nNOTE: no PDF available, if you want it to scroll like a PDF just read it in Calibre.\nThis is the eBook of the printed book and may not include any media, website accesscodes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Don't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n__________________________________________________________________________________\n\n\nUSMLE Step 2 Secrets is an easy-to-read review perfect for busy students like you. Theodore X. O'Connell, MD - author of several review and clinical reference books - has thoroughly revised this popular text, which presents essential questions and answers covering the important concepts you need to know to score well on the USMLE Step 2 exam: key conditions you will be expected to recognize, all specialty and subspecialty topics, and necessary clinical concepts.\n\nLearn the most important questions and answers with the proven format of the highly acclaimed Secrets SeriesÂ®.\n\nMaster all specialty and subspecialty topics covered on Step 2.\nIdentify key facts in the &quot;Top 100 Secrets.&quot;\n\nReview material quickly and easily thanks to bulleted lists, algorithms, illustrations, and a new 4-color section featuring key pathologic and clinical images.\n\nApply tips, memory aids, and &quot;secrets&quot; gathered by Theodore X. O'Connell, MD, and used trusted by students to pass the boards.\n\nFind information quickly with a second color highlighting chapter and section titles, legends, bullets and icons, and key terms.\n\nBenefit from thorough revisions that ensure high-yield focus and most current overview of board-tested content.","torrent":{"xt":"urn:btih:cda7284cef75647b82ef0e2bfa9e6b825da7cd4e","amp;dn":"USMLE+Step+2+Secrets%2C+4E+%5BEpub%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cda7284cef75647b82ef0e2bfa9e6b825da7cd4e","infoHashBuffer":{"type":"Buffer","data":[205,167,40,76,239,117,100,123,130,239,14,43,250,158,107,130,93,167,205,78]},"announce":[],"urlList":[]}}