{"title":"Mastering Adobe Captivate 7 [PDF] [StormRG]","uid":9822619,"size":9844313,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ce34ff6f3bbc0db443e7055c923109f1e86ffe71&amp;dn=Mastering+Adobe+Captivate+7+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"steelballz","files":-1,"time":1395717362,"description":"Description\nMastering Adobe Captivate 7 \nAuthor:Bruyndonckx, Damien\nPublished:Feb. 21 2014\nPublisher:Packt Publishing \nISBN-10:1783559888\nISBN-13:9781783559886\nASIN:B00IM5UW3A\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\n\nTested on the above readers with no problems on laptop and Android tablet. \nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. Please allow a couple \nseconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\nimage\nCover from actual book file\n\n\nProduct Description\n\n\nIn Detail\n\nAdobe Captivate 7 helps you rapidly author a wide range of interactive and HTML5-based e-Learning content with minimum programming. With Adobe Captivate 7, you can capture the on-screen action and also enhance your e-Learning projects by including animations, videos, Smart Shapes, buttons, and drag-and-drop interactions.\n\nThis book is a perfect introduction to Adobe Captivate 7. It will help you get started with the tool quickly and efficiently. This book demonstrates each and every feature of Adobe Captivate 7 giving you the expertise you need to create and deploy your own professional-quality e-Learning courses. You will be able to publish your work in various formats virtually on any desktop and mobile device.\n\nThis book will guide you through the creation of four e-Learning projects including a demonstration, an interactive simulation, a YouTube-like screencast, and a SCORM compliant quiz. The first part of the book will drive you through the three main steps of the Captivate production process. In the first step, you will use the powerful capture engine of Captivate to generate the slides and screenshots required for the project. In the second step, you will enhance your slides and screenshots using the objects provided by Captivate. These objects include animations, sophisticated interactions, videos, sound, and more. In the third step, you will make your projects available to the outside world by publishing them in various formats including Adobe Flash and HTML 5 so that you content can be played back on every desktop and mobile device. The second part of the book will focus on the advanced tools of Captivate. These tools include the questions slides that make up a quiz, SCORM, AICC, and Tin Can compliance, localization of your e-Learning content and widgets among others. In the last chapter, you will unleash the true power of Captivate by using the variables and the advanced actions to create a unique e-Learning experience.\nApproach\n\nA comprehensive tutorial packed with examples, which is divided into small subtopics that follows a clear and logical outline to help you get to grips with Adobe Captivate 7. Readers are also encouraged to develop their understanding of the tool through practical exercises and experimentations in every chapter. A lot of external references and tips and tricks from established e-Learning professionals are also included.\nWho this book is for\n\nIf you are a designer, e-Learning developer, or webmaster who wants to construct an interactive and fun-filled e-Learning project using Adobe Captivate 7, this book is ideal for you. Just a basic knowledge of operating system is expected from the developers interested in this book.\n\n\n\nimage\nScientia est potentia","torrent":{"xt":"urn:btih:ce34ff6f3bbc0db443e7055c923109f1e86ffe71","amp;dn":"Mastering+Adobe+Captivate+7+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce34ff6f3bbc0db443e7055c923109f1e86ffe71","infoHashBuffer":{"type":"Buffer","data":[206,52,255,111,59,188,13,180,67,231,5,92,146,49,9,241,232,111,254,113]},"announce":[],"urlList":[]}}