{"title":"The Wise Mans Fear (The Kingkiller Chronicle: Day Two) - Patrick","uid":6211760,"size":1838925,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ce88943ba7af80758c3e68e889d4f803e240baf5&amp;dn=The+Wise+Mans+Fear+%28The+Kingkiller+Chronicle%3A+Day+Two%29+-+Patrick&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"cokebear2020","files":1,"time":1299010098,"description":"&quot;There are three things all wise men fear: the sea in storm, a night with no moon, and the anger of a gentle man.\n&quot;\nAn escalating rivalry with a powerful member of the nobility forces Kvothe to leave the University and seek his fortune abroad. Adrift, penniless, and alone, he travels to Vintas, where he quickly becomes entangled in the politics of courtly society. While attempting to curry favor with a powerful noble, Kvothe discovers an assassination attempt, comes into conflict with a rival arcanist, and leads a group of mercenaries into the wild, in an attempt to solve the mystery of who (or what) is waylaying travelers on the King's road.\n\nAll the while, Kvothe searches for answers, attempting to uncover the truth about the mysterious Amyr, the Chandrian, and the death of his parents. Along the way, Kvothe is put on trial by the legendary Adem mercenaries, forced to reclaim the honor of the Edema Ruh, and travels into the Fae realm. There he meets Felurian, the faerie woman no man can resist, and who no man has ever survived. Under her tutelage, Kvothe learns much about true magic and the ways of women.\n\nIn The Wise Man's Fear Kvothe takes his first steps on the path of the hero and learns how difficult life can be when a man becomes a legend in his own time.","torrent":{"xt":"urn:btih:ce88943ba7af80758c3e68e889d4f803e240baf5","amp;dn":"The+Wise+Mans+Fear+%28The+Kingkiller+Chronicle%3A+Day+Two%29+-+Patrick","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce88943ba7af80758c3e68e889d4f803e240baf5","infoHashBuffer":{"type":"Buffer","data":[206,136,148,59,167,175,128,117,140,62,104,232,137,212,248,3,226,64,186,245]},"announce":[],"urlList":[]}}