{"title":"Computational Neuroscience and Cognitive Modelling [PDF] [StormR","uid":9835806,"size":1621932,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cedb12cd2fcc250f4b3439d95f2750520db01889&amp;dn=Computational+Neuroscience+and+Cognitive+Modelling+%5BPDF%5D+%5BStormR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"0xmovva","files":-1,"time":1395908954,"description":"Author: Britt Anderson\nPaperback: 240 pages\nPublisher: SAGE Publications Ltd; 1 edition (January 8, 2014)\nLanguage: English\nISBN-10: 1446249301\nISBN-13: 978-1446249307\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it!  :D\n\n_________________________________________________________________________________\n\n\nThis unique, self-contained and accessible textbook provides an introduction to computational modelling neuroscience accessible to readers with little or no background in computing or mathematics. Organized into thematic sections, the book spans from modelling integrate and firing neurons to playing the game Rock, Paper, Scissors in ACT-R. This non-technical guide shows how basic knowledge and modern computers can be combined for interesting simulations, progressing from early exercises utilizing spreadsheets, to simple programs in Python.\n\n\nKey Features include:\n\n\n\n- Interleaved chapters that show how traditional computing constructs are simply disguised versions of the spreadsheet methods\n\n- Mathematical facts and notation needed to understand the modelling methods are presented at their most basic and are interleaved with biographical and historical notes for context\n\n- Numerous worked examples to demonstrate the themes and procedures of cognitive modelling.\n\n\n\nAn excellent text for upper-level undergraduate and postgraduate students taking courses in research methods, computational neuroscience / computational modelling, and cognitive science / neuroscience. It will be especially valuable to psychology students.","torrent":{"xt":"urn:btih:cedb12cd2fcc250f4b3439d95f2750520db01889","amp;dn":"Computational+Neuroscience+and+Cognitive+Modelling+%5BPDF%5D+%5BStormR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cedb12cd2fcc250f4b3439d95f2750520db01889","infoHashBuffer":{"type":"Buffer","data":[206,219,18,205,47,204,37,15,75,52,57,217,95,39,80,82,13,176,24,137]},"announce":[],"urlList":[]}}