{"title":"Avengers vs. X-Men [COMPLETE] [ZINC]","uid":9470724,"size":3122398016,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:cf0a196250e2cb0e36424a0b7b73314246079150&amp;dn=Avengers+vs.+X-Men+%5BCOMPLETE%5D+%5BZINC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"ZINC","files":-1,"time":1389560146,"description":"\n&quot;Avengers vs. X-Men (abbreviated AvX) is a 2012 crossover event that was featured in comic books published by Marvel Comics. The event, consisting of an eponymous limited series and numerous tie-in books, involves the return of the Phoenix Force and the subsequent war between the Avengers and the X-Men. The 12-issue, twice-monthly series was first published in April 2012, and features a storyline by Jason Aaron, Brian Michael Bendis, Ed Brubaker, Jonathan Hickman and Matt Fraction, and a rotating team of artists including John Romita, Jr., Olivier Coipel and Adam Kubert.\n\nThe event was preceded by the four-issue limited series, Avengers: X-Sanction by Jeph Loeb and Ed McGuinness, and Avengers vs. X-Men #0. Avengers vs. X-Men also ties into the limited series; AVX: VS, described as &quot;the fight book&quot; which expands upon many of the one-on-one battles featured in the main series, the digital series; Avengers vs. X-Men: Infinite, and into a number of ongoing series; including Avengers, Avengers Academy, New Avengers, Secret Avengers, Uncanny X-Men, Wolverine and the X-Men and X-Men: Legacy. The event was succeeded by the limited series, AvX: Consequences.&quot;\n\nUPLOADER NOTES.\n\nI have used Wiki as a source regarding comics that tie in with the AVX story, so there are not in reader order.\nWith my torrent i managed to find a digital copy of the AVX story TPB done by Meganubis-Empire.\nWhat was missing from the wiki and i have included in the other folder are the WHAT IF titles for AVX.","torrent":{"xt":"urn:btih:cf0a196250e2cb0e36424a0b7b73314246079150","amp;dn":"Avengers+vs.+X-Men+%5BCOMPLETE%5D+%5BZINC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf0a196250e2cb0e36424a0b7b73314246079150","infoHashBuffer":{"type":"Buffer","data":[207,10,25,98,80,226,203,14,54,66,74,11,123,115,49,66,70,7,145,80]},"announce":[],"urlList":[]}}