{"title":"Winnie-the-Pooh (Russian version) FULLDVD DVD5","uid":7414804,"size":3947675648,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:cf31d8f57ca078e3b4d6e0135b375c31e8cdb6b8&amp;dn=Winnie-the-Pooh+%28Russian+version%29+FULLDVD+DVD5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"honeywhite","files":21,"time":1341482573,"description":"In the Soviet Union, three Winnie-the-Pooh stories were made into a celebrated trilogy of short films by animation studio Soyuzmultfilm from 1969 to 1972.  Soyuzmultfilm is famous for such great works as Crocodile Gena, Film, Film, Film, Karlsson on the Roof, The Musicians of Bremen, Three from Buttermilk Village, Hedgehog in the Fog, The Mystery of the Third Planet, and, perhaps most famously, Nu, pogodi!\n\nThese stories are perhaps the most faithful to the original book by A. A. Milne.  In the Disney version, the characters are presented as inhabiting a book, whose pages turn on their own; the story is obviously presented by the narrator to the audience sitting at home, not to Christopher Robin as in the books.  Disney adds so much saccharine to the story it becomes almost cloyingly sweet.\n\nThe way this was dealt with in the Russian edition was very interesting.  Christopher Robin was done away entirely, giving his lines to Piglet.  This makes for quite a difference, as Piglet looks up to Pooh, while Christopher Robin indulgently looks down on him, like a father and his favourite son.  The exchanges between narrator and audience are gone, too; instead, the narrator faithfully tells just the story.\n\nThe classic red-shirt stuffed bear look has been done away with as well; you may find this to your taste, or not (I can't choose!).  The Russian Pooh looks more like a real bear, with shorter extremities and darker fur; he looks a bit like Misha, the Moscow Olympics mascot.  \n\nThe trilogy was directed by Fyodor Khitruk, with Evgeni Leonov as Winnie-the-Pooh, Iya Savvina as Piglet, Anatoliy Shchukin as Rabbit, Erast Garin as Eeyore, Zinaida Naryshkina as Owl, and Vladimir Osenev as the narrator.\n\nThe three films are:\n\nWinnie-the-Pooh (1969), based on chapter 1\nWinnie-the-Pooh Pays a Visit (1971), based on chapter 2\nWinnie the Pooh and the Blustery Day (1972), based on chapters 4 and 6.\n\nAgain, I could only find the full DVD of this with description only in Russian, so I decided to spread the torrent around so it never runs out of peers and seeds, and so the rest of the world can enjoy this excellent piece of Russian animation.","torrent":{"xt":"urn:btih:cf31d8f57ca078e3b4d6e0135b375c31e8cdb6b8","amp;dn":"Winnie-the-Pooh+%28Russian+version%29+FULLDVD+DVD5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf31d8f57ca078e3b4d6e0135b375c31e8cdb6b8","infoHashBuffer":{"type":"Buffer","data":[207,49,216,245,124,160,120,227,180,214,224,19,91,55,92,49,232,205,182,184]},"announce":[],"urlList":[]}}