{"title":"Be Here To Love Me - A Film About Townes Van Zandt - 2004","uid":8140869,"size":733680100,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cf334f18536b61610b31448827cf5e1342362d18&amp;dn=Be+Here+To+Love+Me+-+A+Film+About+Townes+Van+Zandt+-+2004&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"CrankEMan","files":-1,"time":1360805736,"description":"Be Here To Love Me: A Film About Townes Van Zandt is a 2004 documentary film directed by Margaret Brown which chronicles the often turbulent life of American singer-songwriter Townes Van Zandt. The film includes interviews of Van Zandt's immediate family and contemporaries such as Willie Nelson, Kris Kristofferson, Emmylou Harris, Lyle Lovett, Steve Earle and Guy Clark[1] along with ... home movies, old TV performances and, especially, early Seventies footage originally filmed by James Szalapski for his outlaw country documentary Heartworn Highways.\n\nTownes Van Zandt was a well regarded and influential musician and songwriter. The film follows his life as an artist, and documents the impressions he made on other musicians, his commitment to a mental facility, involvement in music, drugs and alcohol, departure from his family, several of his live performances, and general life on the road.\nThe film covers some of Van Zandt's time spent in Houston, Texas, where he began his musical development, though according to the film's DVD commentary, much was excluded from the early years, when he met many of his early influences and lifelong friends (Lightnin' Hopkins, Guy Clarke, Steve Earle, Micky Newbury, etc.), and developed his musical skills in the city's folk and country scene in the late 60s and early 70s.\n\nFile: Be.Here.To.Love.Me.A.Film.About.Townes.Van.Zandt.2004.LIMITED.DVDRip.XviD-NOSCREENS.avi\nSize: 733659136 bytes (699.67 MiB), duration: 01:40:07, avg.bitrate: 977 kb/s\nAudio: mp3, 48000 Hz, stereo, 40 kb/s\nVideo: mpeg4, yuv420p, 624x352, 23.98 fps(r)\n","torrent":{"xt":"urn:btih:cf334f18536b61610b31448827cf5e1342362d18","amp;dn":"Be+Here+To+Love+Me+-+A+Film+About+Townes+Van+Zandt+-+2004","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf334f18536b61610b31448827cf5e1342362d18","infoHashBuffer":{"type":"Buffer","data":[207,51,79,24,83,107,97,97,11,49,68,136,39,207,94,19,66,54,45,24]},"announce":[],"urlList":[]}}