{"title":"Crips.And.Bloods.Made.In.America.2008.DVDrip.Xvid.AC3-Haggebulle","uid":6611884,"size":1446495228,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cf6b6910461c6df1c06748e583e18e15d8d74d59&amp;dn=Crips.And.Bloods.Made.In.America.2008.DVDrip.Xvid.AC3-Haggebulle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"haggebull","files":-1,"time":1313627931,"description":"Crips and Bloods Made in America\n\n&quot;It's impossible to look away from the screen.&quot; - Variety \nA cluster of neighborhoods lies in the heart of Southern California, streets and boulevards forming a grid between concrete ribbons of freeway. Surrounded by the California Dream, this region has a legacy. Nearly a quarter of its young men will end up in prison. Many others will end up dead. These neighborhoods in South Los Angeles are home to two of America's most infamous African-American gangs, the Crips and the Bloods. \nOn these streets over the past 30 years, more than 15,000 people have been murdered in an ongoing cycle of gang violence that continues unabated. It was here, just a few miles from the gated communities and sprawling mansions of Beverly Hills, where America's most bloody and costly outbreaks of civil unrest erupted -? not once, but twice, 27 years and just three miles apart. \nAcclaimed director Stacy Peralta (Dogtown and Z Boys, Riding Giants) examines the story of South Los Angeles and the gangs that inhabit it. Narrated by Academy AwardÃ‚Â® winner Forest Whitaker and produced by NBA superstar Baron Davis, Crips and Bloods: Made In America blends gripping archival footage with in-depth interviews. Peralta brings his trademark dynamic visual style and story-telling ability to this often-ignored chapter of America's history. Hard-hitting, yet ultimately hopeful, the film not only documents the emergence of the gangs but also offers insight as to how this ongoing tragedy might be resolved. \n\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0479044/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0479044/&lt;/a&gt;","torrent":{"xt":"urn:btih:cf6b6910461c6df1c06748e583e18e15d8d74d59","amp;dn":"Crips.And.Bloods.Made.In.America.2008.DVDrip.Xvid.AC3-Haggebulle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf6b6910461c6df1c06748e583e18e15d8d74d59","infoHashBuffer":{"type":"Buffer","data":[207,107,105,16,70,28,109,241,192,103,72,229,131,225,142,21,216,215,77,89]},"announce":[],"urlList":[]}}