{"title":"2Pac - Strictly 4 My N.I.G.G.A.Z (MP3@320kbps)","uid":9910419,"size":155066721,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:d022f599fcc6ca3f35448455da9c7b1f4c2d1b27&amp;dn=2Pac+-+Strictly+4+My+N.I.G.G.A.Z+%28MP3%40320kbps%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":2,"uploader":"FrankFoo2","files":-1,"time":1396886340,"description":"\n2Pac - Strictly 4 My N.I.G.G.A.Z (MP3@320kbps)\n\nLinage: CD &gt; EAC &gt; flac &gt; dbPowerAmp &gt; MP3\nIncludes: ID3 tags, Front Cover, Disc\n\nProduct Details\n\n* Audio CD (March 10, 1998)\n* Original Release Date: February 16, 1993\n* Number of Discs: 1\n* Format: Explicit Lyrics\n* Label: Jive\n* ASIN: B000005Z0G\n\nTrack Listings\n\n01. Holler If Ya Hear Me\n02. Pac's Theme (Interlude)\n03. Point The Finga\n04. Something 2 Die 4 (Interlude)\n05. Last Wordz\n06. Souljah's Revenge\n07. Peep Game\n08. Strugglin'\n09. Guess Who's Back\n10. Representin' 93\n11. Keep Ya Head Up\n12. Strictly 4 My N.I.G.G.A.Z...\n13. The Streetz R Deathrow\n14. I Get Around\n15. Papa'z Song\n16. 5 Deadly Venomz\n\n\nThis probably was one of his most overlooked albums because radio refused to play anything off this damn album until he decided to release &quot;I Get Around&quot; &amp; &quot;Keep Your Head Up&quot; months after releasing &quot;Holla If Ya Hear Me&quot; which MTV, BET, \nradio and other media outlets couldn't say no to because of demand by the audience. \nThough &quot;Holla&quot; was typical angry PAC, the radio had pretty much been on ignore PAC status. \nBy this time also PAC had already incurred the wrath of our then Vice President Dan Quayle, was being accused of shooting two State Police Officers, and was being blamed for an individual killing a cop in Texas who said listening to this CD made him do it. \nSo obviously, radio, corporate america and even all of white america made 2PAC to be villain number one on a level that P.E. nor Luke from 2 Live Crew or even N.W.A. could reach. \nIf you have the Vice President of the U.S. calling you out by name, you must really really struck a wrong nerve :-). \nThough that helped this lp sell records, a lot of bangin tracks never got played like it should have. &quot;I Get Around&quot; and &quot;Keep Your Head Up&quot; was just something for the club, radio and video but the real head banger that got lost was the LP title &quot;Strictly 4 My Niggaz&quot;. \nThat joint just straight rocked and was lyrically tight. \nEventhough Run-DMC and the Beastie Boys may have started that Rock n Roll and rap fusion, with that track, PAC took it to new levels. \nStrictly Representin '93 was definitely tight, Soulja's Revenge was a tad bit disappointing compared to Soldier Story pt 1, but then that's a lot to ask to follow up that classic track from 2PACOLYPSE NOW. \n&quot;Holla If Ya Hear Me&quot; started the album nicely &quot;Something To Die 4&quot; wasn't really a single (sadly, cuz the music to the track was nice) but more of a ghetto introspective on life was deep, &quot;Last Wordz&quot; with ICECUBE and ICE-T(sadly, ICE-T was lyrically challenged on this song but PAC wanted to work with both ICE's) was hype. &quot;Papaz Song&quot; for anybody who didn't have a real pops in their life, was deep and heartfelt and got much airplay in my rotation at the time. &quot;The Streetz R Deathrow&quot; w/ the ICECUBE hook in the chorus was just simply off da chain. 5 Deadly Venomz w/Treach and a weak azz Apache (could have left Apache off) had the potential to be much better without Apache. \n\nOverall, this was a nice sophmore album that should have done much better and lyrically, PAC wasn't really the same after this LP.\n\nA FrankFoo Original Rip\n\n","torrent":{"xt":"urn:btih:d022f599fcc6ca3f35448455da9c7b1f4c2d1b27","amp;dn":"2Pac+-+Strictly+4+My+N.I.G.G.A.Z+%28MP3%40320kbps%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d022f599fcc6ca3f35448455da9c7b1f4c2d1b27","infoHashBuffer":{"type":"Buffer","data":[208,34,245,153,252,198,202,63,53,68,132,85,218,156,123,31,76,45,27,39]},"announce":[],"urlList":[]}}