{"title":"Ragnarok Online 06-06-2014 kRO Client Folder","uid":10339470,"size":2214324888,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d0c1fe16a2cb588708a025bb75d1afdcae27aaad&amp;dn=Ragnarok+Online+06-06-2014+kRO+Client+Folder&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"NokTham","files":1,"time":1402522103,"description":"..This ZIP file contains all the files required to play Ragnarok Online, just extract and it's done.\n\n..Regarding the previous patcher issues, this torrent contains the latest patch files, so you shouldn't have any problems when patching the game.\n\n..This kRO Client Folder is dated as 06-06-2013 (mm-dd-yyyy), therefor BEFORE YOU DOWNLOAD THIS, you should check if there are any changes - you can check it in here http://ratemyserver.net/index.php?page=download_kROLinks check the file date..\n\n..All you have to do is extract the file, after that execute rsu-kro-rag-lite.exe and rsu-kro-renewal-lite.exe to update the Client Folder (in case of new updates are released) (make sure you open one at a time, let it check for updates, and only after it is finished you may execute the other) (make sure you run them at least once a week to see if there are new updates)..\n\n..After being extracted and updated you may now install a client from the server you are going to play..\n\n::I'll be seeding this until my HDD burns or death takes me, up to 700KB/s::\n\n::MAKE SURE YOU HELP SEEDING THIS::\n\n::Ragnarok Online Patcher Lite Thanks To Ai4rei/AN nn.nachtwolke.com::\n\nNOTE: Although RateMyServer is mentioned on this torrent's description, i want to clarify that they are not responsible for this torrent, i mention RateMyServer because they are (from what i see) the best source for Ragnarok Online Clients and Servers list, also THE source where most people go when looking for Ragnarok Online Clients and Servers.\n","torrent":{"xt":"urn:btih:d0c1fe16a2cb588708a025bb75d1afdcae27aaad","amp;dn":"Ragnarok+Online+06-06-2014+kRO+Client+Folder","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0c1fe16a2cb588708a025bb75d1afdcae27aaad","infoHashBuffer":{"type":"Buffer","data":[208,193,254,22,162,203,88,135,8,160,37,187,117,209,175,220,174,39,170,173]},"announce":[],"urlList":[]}}