{"title":"The Story of Scotland","uid":15760420,"size":1241485,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d132b565016195ee8f0911b43c8acb393885f585&amp;dn=The+Story+of+Scotland&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"marty14","files":1,"time":1473107519,"description":"The Story of Scotland - Nigel Tranter [epub]\r\n\r\nScotland's story cannot be told merely in terms of documentary evidence, for this would be to neglect an integral part of the nation's heritage. The legends, myths, stories and memories handed down from generation to generation must be added to the bare bones of factual record if the character of the country is to be truly revealed. Nigel Tranter was able to combine the two with a masterly hand, expertly weaving the colourful threads of folklore into the fabric of historical fact. Tranter was impeccably qualified to tell the story of Scotland, having written many books detailing the nation's rich past and he possessed an exceptional gift for storytelling.\r\n\r\nHis account begins in the years before records made traditional history possible and ends with the transformation of Scotland during the 19th century into a workshop of the world and a source of pioneers for Britain's empire. In this perennial bestseller, Niigel Tranter's incomparable tale of a nation's enthralling history is the most comprehensible primer on the subject yet published. Before he passed away in January 2000, Tranter had written over 70 novels and several works of non-fiction, almost all of them historical works set in Scotland","torrent":{"xt":"urn:btih:d132b565016195ee8f0911b43c8acb393885f585","amp;dn":"The+Story+of+Scotland","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d132b565016195ee8f0911b43c8acb393885f585","infoHashBuffer":{"type":"Buffer","data":[209,50,181,101,1,97,149,238,143,9,17,180,60,138,203,57,56,133,245,133]},"announce":[],"urlList":[]}}