{"title":"The Year of Voting Dangerously - Maureen Dowd (ebook, epub)","uid":15866978,"size":2349823,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d144aaee998980908ab6aa5f2bf4908771498a90&amp;dn=The+Year+of+Voting+Dangerously+-+Maureen+Dowd+%28ebook%2C+epub%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"Squiddy82","files":2,"time":1474378823,"description":"Maureen Dowd's incendiary takes and takedowns from 2016--the most bizarre, disruptive and divisive Presidential race in modern history.\r\n\r\nTrapped between two candidates with the highest recorded unfavorables, Americans are plunged into The Year of Voting Dangerously. In this perilous and shocking campaign season, The New York Times columnist traces the psychologies and pathologies in one of the nastiest and most significant battles of the sexes ever. Dowd has covered Donald Trump and Hillary Clinton since the '90s. She was with the real estate mogul when he shyly approached his first Presidential rope line in 1999, and she won a Pulitzer prize that same year for her penetrating columns on the Clinton impeachment follies. Like her bestsellers, Bushworld and Are Men Necessary?, THE YEAR OF VOTING DANGEROUSLY will feature Dowd's trademark cocktail of wry humor and acerbic analysis in dispatches from the political madhouse. If America is on the escalator to hell, then THE YEAR OF VOTING DANGEROUSLY is the perfect guide for this surreal, insane ride.\r\n\r\n\r\nEditorial Reviews\r\nReview\r\n&quot;Dowd was born to write about this race. And she dissects its main characters with poison in her pen and poetic punch in her delivery...Dowd surely captures the theater of our politics better than anyone else: The Clintons. The Trumps. The Obamas. The Bushes. She has been in their heads as long as they have been on our minds. She's the establishment's resident shrink.&quot;―NYT Book Review\r\n\r\nAbout the Author\r\nMaureen Dowd is a columnist for The New York Times and a best-selling author. During the 1970s and the early 1980s, she worked for Time magazine and The Washington Star, where she covered news as well as sports and wrote feature articles. Dowd joined the Times in 1983 as a metropolitan reporter and eventually became an op-ed writer for the newspaper in 1995. In 1999, she was awarded a Pulitzer Prize for her series of columns on the Monica Lewinsky scandal in the Clinton administration","torrent":{"xt":"urn:btih:d144aaee998980908ab6aa5f2bf4908771498a90","amp;dn":"The+Year+of+Voting+Dangerously+-+Maureen+Dowd+%28ebook%2C+epub%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d144aaee998980908ab6aa5f2bf4908771498a90","infoHashBuffer":{"type":"Buffer","data":[209,68,170,238,153,137,128,144,138,182,170,95,43,244,144,135,113,73,138,144]},"announce":[],"urlList":[]}}