{"title":"The Dumpling Sisters Cookbook (gnv64)","uid":12049271,"size":14736891,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d1d57b75d73f2477c523171c0802c32a93c407a2&amp;dn=The+Dumpling+Sisters+Cookbook+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":2,"uploader":"gnv65","files":4,"time":1434965219,"description":"The Dumpling Sisters Cookbook - Over 100 Favourite Recipes From A Chinese Family Kitchen\nby The Dumpling Sisters and Amy Zhang\nWeidenfeld &amp; Nicolson | June 2015 | ISBN-10: 0297609068 | ePUB | 13.9 mb\n\nAmy and Julie Zhang have been entertaining and educating their thousands of followers on Youtube with their recipes for deliciously easy homemade Chinese food - now THE DUMPLING SISTERS CHINESE COOKBOOK brings you more of the recipes and advice that those fans have been clamouring for. Dedicated to and destined to be adored by every Chinese food lover, this book is full of Chinese-food favourites, impressive sharing dishes and even sweet treats that have been little acknowledged in a western understanding of Chinese food - until now. This is Chinese home cooking at its best. The recipes are structured as to give a gradual introduction to Chinese dishes, beginning with the simple; Best Ever Fried Rice, and working up to the more elaborate Cracking Five-Spice Roast Pork Belly, and are interspersed with the insider tips and tricks that the girls' Youtube fans adore. There is also a focus on Chinese culture and eating etiquette (for perfecting those chopstick skills), including sharing menu planner and a guide to shopping at the Chinese supermarket. Amy and Julie write with wit and gusto - they are the perfect cooks to take any food lover on a journey to discover real Chinese cooking.\n\nAbout the Authors\nThe Dumpling Sisters are an engaging and charismatic duo who have referred to themselves as the 'young, Asian, and (much) less hairy Hairy Bikers'. They are exceptionally bright girls; Amy has a PhD in science and Julie has a masters in psychology and criminology, with a passion for cooking. The Zhang family is from Guangzhou in China, a city famed for its incredible Cantonese cuisine. After moving to New Zealand the family set up a Chinese food cart which was as a family - giving Amy and Julie invaluable experience of cooking Chinese food to the highest standards. In 2014 the food cart is still going strong. \nVisit their blog: http://thedumplingsisters.com/ and \nwatch their videos: http://thedumplingsisters.com/youtube-channel/ \n\nCONTENTS\nDedication\nTitle Page\nIntroduction\nYum cha\nChineasy\nSharing Menu\nOodles of Noodles\nBanquet\nChinese Bakery\nSweet Tooth\nBasics\nIngredients &amp; suppliers\nAcknowledgements\nCopyright\n &lt;a href=&quot;\nhttp://s16.postimg.org/he3ea9s6t/The_Dumpling_Sisters_Cookbook.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s16.postimg.org/he3ea9s6t/The_Dumpling_Sisters_Cookbook.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:d1d57b75d73f2477c523171c0802c32a93c407a2","amp;dn":"The+Dumpling+Sisters+Cookbook+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1d57b75d73f2477c523171c0802c32a93c407a2","infoHashBuffer":{"type":"Buffer","data":[209,213,123,117,215,63,36,119,197,35,23,28,8,2,195,42,147,196,7,162]},"announce":[],"urlList":[]}}