{"title":"Good Manners for Nice People Who Sometimes Say Fuck - Amy Alkon","uid":10509527,"size":229085495,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d1dc92601b7c0908d0f0e09721695fa786f7c295&amp;dn=Good+Manners+for+Nice+People+Who+Sometimes+Say+Fuck+-+Amy+Alkon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1404826748,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - Add this to your iTunes collection, and change &quot;Media Kind&quot; to &quot;Audiobook.&quot; Right-click the track or album, and select &quot;Get Info&quot; from the context menu. You will find &quot;Media Kind&quot; under &quot;Options.&quot; This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\nIf you need the single MP3 file chopped up into smaller segments, you can use Audiobook Cutter.\n\n\nGood Manners for Nice People Who Sometimes Say F*ck\n\nWritten by: Amy Alkon\nNarrated by: Carrington MacDuffie\nLength: 7 hrs and 54 mins\nFormat: Unabridged\nRelease Date:06-03-14\nProgram Type: Audiobook\n\nWe live in a world that's very different from the one in which Emily Post came of age. Many of us who are nice (but who also sometimes say &quot;f*ck&quot;) are frequently at a loss for guidelines about how to be a good person who deals effectively with the onslaught of rudeness we all encounter. To lead us through this this miasma of modern manners, syndicated columnist Amy Alkon - The Advice Goddess - gives us a new set of manners for our 21st-century lives. In chapters titled &quot;The Telephone&quot;, &quot;The Internet&quot;, &quot;The Apology&quot;, and &quot;Communicating&quot;, among others, Alkon maps out new rules that go beyond what fork to use to answer real questions we all have:\n\nWhen is it okay to phone somebody instead of emailing or texting? When is it rude?\n\nWhy shouldn't you tweet about a guest at a private dinner party? Everybody knows privacy is dead, right?\n\nHow do you shut the guy up in the pharmacy line with his cellphone on speaker?\n\nWhen is it right to approach somebody who's crying in public and when is it right to leave him alone?\n\nWhen should you unfriend somebody on Facebook and what do you say when she calls you on it?\n\nIf you have an STD, when do you tell people, what do you say, and do you have to contact everyone you've ever had sex with?\n\nReal advice for today with more than a touch of humor, Good Manners for Nice People Who Sometimes Say F*ck is destined to give good old Emily a shove off the etiquette shelf (if that's not too rude to say). ","torrent":{"xt":"urn:btih:d1dc92601b7c0908d0f0e09721695fa786f7c295","amp;dn":"Good+Manners+for+Nice+People+Who+Sometimes+Say+Fuck+-+Amy+Alkon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1dc92601b7c0908d0f0e09721695fa786f7c295","infoHashBuffer":{"type":"Buffer","data":[209,220,146,96,27,124,9,8,208,240,224,151,33,105,95,167,134,247,194,149]},"announce":[],"urlList":[]}}