{"title":"New Order - Blue Monday 12&quot; &amp; 7&quot;","uid":6577558,"size":21712280,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d217b9c07f682255972c38f462c015ac663d21fc&amp;dn=New+Order+-+Blue+Monday+12%5C%22+%26+7%5C%22&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":2,"uploader":"mr.festus","files":2,"time":1312275025,"description":"&quot;Blue Monday&quot; is a single released in 1983 by British band New Order, and later remixed in 1988 and 1995. The song has been widely remixed and covered since its original release, and became a popular anthem in the dance club scene.\n\nBackgroundAt nearly seven-and-a-half minutes, &quot;Blue Monday&quot; is one of the longest tracks ever to chart in the UK, and is the biggest-selling 12&quot; single of all time.[1][2] Despite selling well it was not eligible for an official gold disc because Factory Records was not a member of the British Phonographic Industry association. However, the Official UK Chart Company (UK Singles Chart) has estimated its total UK sales at over one million. In the all-time UK best-selling singles chart, published in 2002, &quot;Blue Monday&quot; came 76th.\n\nThe song begins with a distinctive semiquaver kick drum intro, programmed on an Oberheim DMX drum machine.[3] Gillian Gilbert eventually fades in a sequencer melody. According to band interviews in NewOrderStory, she did so at the wrong time, so the melody is out of sync with the beat; however, the band considered it to be a happy accident that contributed to the track's charm. The verse section features the song's signature throbbing synth bass line, played by a Moog Source, overlaid with Peter Hook's bass guitar leads. The synth bass line was sequenced on a Powertran Sequencer home built by Bernard.[4] Bernard Sumner delivers the lyrics in a deadpan manner. &quot;Blue Monday&quot; is an atypical hit song in that it does not feature a standard verse-chorus structure. After a lengthy introduction, the first and second verses are contiguous and are separated from the third verse only by a brief series of sound effects. A short breakdown section follows the third verse, which leads to an extended outro.\n\n&quot;Blue Monday&quot; is often seen as one of the most important crossover tracks of the 1980s pop music scene. Synthpop had been a major force in British popular music for several years, but &quot;Blue Monday&quot; was arguably the first British dance record to exhibit an obvious influence from the New York club scene, particularly the work of producers like Arthur Baker (who collaborated on New Order's follow-up single &quot;Confusion&quot;).\n\nAccording to Bernard Sumner, &quot;Blue Monday&quot; was influenced by four songs: the arrangement came from &quot;Dirty Talk&quot;, by Klein + M.B.O.; the signature bassline with octaves came from Sylvester's disco classic, &quot;You Make Me Feel (Mighty Real)&quot;; the house beat came from &quot;Our Love&quot;, by Donna Summer; and the long keyboard pad on the intro and outro was sampled from the Kraftwerk song &quot;Uranium&quot;, from the Radio-Activity album.[5] In an interview for Channel 4's countdown of the biggest selling UK singles, the band claimed to have written the song in response to crowd disappointment at the fact that they never played encores. This song, they say, allowed them to return to the stage, press play on a synthesiser and leave the stage again. An example of this happening appears on New Order's concert video Pumped Full of Drugs.\n","torrent":{"xt":"urn:btih:d217b9c07f682255972c38f462c015ac663d21fc","amp;dn":"New+Order+-+Blue+Monday+12%5C%22+%26+7%5C%22","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d217b9c07f682255972c38f462c015ac663d21fc","infoHashBuffer":{"type":"Buffer","data":[210,23,185,192,127,104,34,85,151,44,56,244,98,192,21,172,102,61,33,252]},"announce":[],"urlList":[]}}