{"title":"ZCUT Power Cardio &amp; Strength Series - x264 - MP4 - DVDrip","uid":8922010,"size":4336449675,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:d2d0727a5c6237d193f80c789486a8ec51a6b6f7&amp;dn=ZCUT+Power+Cardio+%26amp%3B+Strength+Series+-+x264+-+MP4+-+DVDrip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":2,"uploader":"MrTVGuy","files":-1,"time":1379275377,"description":"ZCUT POWER CARDIO SERIES AND ZCUT POWER STRENGTH SERIES - X264 - MP4 - DVDRIP\n\nTwo amazing workout series in one amazing download.\n\nThe ZCUT POWER CARDIO SERIES has been edited. The &quot;breakdowns&quot; of all workouts have been moved to the documentation folder. This way after you watch it once, you can get right to the workout quickly without rewatching that part everytime. I also added in background music to each workout as well.\n\nThe ZCUT POWER STRENGTH SERIES has also been edited. The &quot;breakdowns&quot; have been moved to the documentation folder but no background music was added as this series already has background music.\n\nIncluded are 30, 60 and 90 day workout calendars for both series in PDF format for easy printing.\n\nABOUT THE WORKOUTS\n\nZuzka leads the ZCUT series by motivating viewers through a workout calendar that utilizes the 12 unique workouts that are included. Each of the 12 short, intense, fat shredding workouts are based on her successful YouTube format that has helped millions achieve the abs and body of their dreams.\n\n&quot;ZCUT leads my fans through a fast body changing program with short, under twenty minute workouts that are based on the actual workouts I use to create my body,&quot; said Zuzka Light. &quot;I never workout longer than 20 minutes - its not necessary, especially if you do these type of workouts. YouTube has allowed me to reach a worldwide audience and now these cardio workouts give my viewers a system that will work for anybody.&quot;\n\nThousands of people have already seen incredible results with her first series, ZCUT Power Cardio, now Zuzka is back for more with ZCUT Power Strength. Including 12 new power-building routines geared to push users to the limit, this series of high-intensity workouts will tone, trim and strengthen your entire body. \nThese workouts are dynamically structured to ensure functional strength, an overall leaner physique, and an enhanced confidence. Zuzka even features video coaching through her immensely popular website. \n\n&quot;This series is for everyone who is not afraid to test their comfort zone in order to reach their goals,&quot; says Zuzka. &quot;The exercise routines in this series are going to turn muscles into fat burning furnaces and fine-tune all of those muscles that sculpt a sexy shape.&quot; ","torrent":{"xt":"urn:btih:d2d0727a5c6237d193f80c789486a8ec51a6b6f7","amp;dn":"ZCUT+Power+Cardio+%26amp%3B+Strength+Series+-+x264+-+MP4+-+DVDrip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2d0727a5c6237d193f80c789486a8ec51a6b6f7","infoHashBuffer":{"type":"Buffer","data":[210,208,114,122,92,98,55,209,147,248,12,120,148,134,168,236,81,166,182,247]},"announce":[],"urlList":[]}}