{"title":"THE BEATLES-REVOLVER","uid":7903085,"size":33249994,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d2d768edf417a74d3c345a15095aa5d181c41249&amp;dn=THE+BEATLES-REVOLVER&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"PiratePrincess","files":14,"time":1355007069,"description":"Revolver is the seventh studio album by the English rock band the Beatles, released on 5 August 1966 on the Parlophone label and produced by George Martin. Many of the tracks on Revolver feature an electric guitar-rock sound that contrasts with their previous LP, the folk rock inspired Rubber Soul (1965). In Britain, the fourteen tracks from Revolver were released to radio stations throughout July 1966, &quot;building anticipation for what would clearly be a radical new phase in the group's recording career&quot;.[1]\n\nIt reached number one on both the British chart and American chart and stayed at the top spot for seven weeks and six weeks, respectively. The album was remastered 9 September 2009 for the first time since its 1987 digital compact disc release. Placed at number 1 in the All-Time Top 1000 Albums and number 3 in the Rolling Stone magazine's list of the 500 greatest albums of all time,[2] the album is often regarded as one of the greatest achievements in music history and one of the Beatles' greatest studio achievements.","torrent":{"xt":"urn:btih:d2d768edf417a74d3c345a15095aa5d181c41249","amp;dn":"THE+BEATLES-REVOLVER","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2d768edf417a74d3c345a15095aa5d181c41249","infoHashBuffer":{"type":"Buffer","data":[210,215,104,237,244,23,167,77,60,52,90,21,9,90,165,209,129,196,18,73]},"announce":[],"urlList":[]}}