{"title":"AD 69: Emperors, Armies and Anarchy","uid":15791703,"size":16516772,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d3a6ce9ef508a0c153739feafd21f97678d06495&amp;dn=AD+69%3A+Emperors%2C+Armies+and+Anarchy&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"marty14","files":1,"time":1473386184,"description":"AD 69: Emperors, Armies and Anarchy - Nic Fields [epub]\r\n\r\nWith the death of Nero by his own shaky hand, the ill-sorted, ill-starred Iulio-Claudian dynasty came to an ignominious end, and Rome was up for the taking. This was 9 June, AD 68. The following year, commonly known as the ‘Year of the Four Emperors’, was probably one of Rome’s worst. \r\n\r\nNero's death threw up a critical question for the Empire. How could a new man occupy the vacant throne in Rome and establish a new dynasty? This situation had never arisen before, since in all previous successions the new emperor had some relation to his predecessor, but the psychotic and paranoid Nero had done away with any eligible relatives. And how might a new emperor secure his legal position and authority with regards to the Senate and to the army, as well as to those who had a vested interest in the system, the Praetorian Guard? The result was that ambitious and unscrupulous generals of the empire fell into a bloody power struggle to decide who had the right to wear the imperial purple.\r\n\r\nTacitus, in his acid way, remarks that 'one of the secrets of ruling had been revealed: an emperor could be created outside Rome'. This was because imperial authority was ultimately based on control of the military. Thus, to retain power a player in the game of thrones had to gain an unshakable control over the legions, which were dotted along the fringes of the empire. Of course, this in turn meant that the soldiers themselves could impose their own choice. Indeed, it turned out that even if an emperor gained recognition in Rome, this counted for nothing in the face of opposition from the armies out in the frontier provinces. It was to take a tumultuous year of civil war and the death of three imperial candidates before a fourth candidate could come out on top, remain there, and establish for himself a new dynasty. Nic Fields narrates the twists and turns and the military events of this short but bloody period of Roman history","torrent":{"xt":"urn:btih:d3a6ce9ef508a0c153739feafd21f97678d06495","amp;dn":"AD+69%3A+Emperors%2C+Armies+and+Anarchy","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3a6ce9ef508a0c153739feafd21f97678d06495","infoHashBuffer":{"type":"Buffer","data":[211,166,206,158,245,8,160,193,83,115,159,234,253,33,249,118,120,208,100,149]},"announce":[],"urlList":[]}}