{"title":"Midi Quest 10 XL","uid":4527122,"size":55377595,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d494c8b103bedddeebeeec266ae640c03d7e42fa&amp;dn=Midi+Quest+10+XL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"TeamAmerica","files":1,"time":1227396003,"description":"Taken from the 0day.070823 torrent for those who only want to download this program and not the whole 1.59 gigabytes of stuff.  Tested, installed, scanned... virus free and working.  Serial included in file.\n\n----------------------------\n\nWelcome to the world of Midi Quest 10 XL. With  Midi Quest 10 XL, all of those great features that you have for your soft-synths are now available for your hardware synths and effects. Imagine being able to integrate all of your MIDI hardware into your digital audio sequencer and using it the same way you use your soft-synths. With  Midi Quest XL, you can.\n\nMidi Quest XL features its own VST, Studio Connections, and MFX plug-in versions that integrate virtual versions of your hardware into your sequencer. Your MIDI synthesizer or effect unit still creates all of the sound but you create a virtual version of the instrument's interface and integrate it right into your sequencer. After installation, you can audition sounds, organize a bank, edit a patch, record sound changes into a sequence, or do just about anything else that you would do with a soft-synth. You get all of the advantages of working on the computer without sacrificing that great hardware sound. Everything is handled from the comfort of your computer screen and in the digital audio sequencer of your choice. When you're done, all of your settings are saved with your song for immediate recall, just like a soft-synth.\n\nNot only does Midi Quest XL make it easier to use your synth or effect hardware within your studio and sequencer software. Midi Quest XL makes it easier, much easier, to work with your MIDI hardware. Period.\n\n\nFor more info visit sound quest web site.\n\n","torrent":{"xt":"urn:btih:d494c8b103bedddeebeeec266ae640c03d7e42fa","amp;dn":"Midi+Quest+10+XL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d494c8b103bedddeebeeec266ae640c03d7e42fa","infoHashBuffer":{"type":"Buffer","data":[212,148,200,177,3,190,221,222,235,238,236,38,106,230,64,192,61,126,66,250]},"announce":[],"urlList":[]}}