{"title":"Professional Penetration Testing 2E- Syngress 2013 [Epub]","uid":8868515,"size":26497189,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d51a481d28303b2ea0ef6a01078b2a168eb645b3&amp;dn=Professional+Penetration+Testing+2E-+Syngress+2013+%5BEpub%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"F1restorm","files":-1,"time":1377990444,"description":"Professional Penetration Testing, Second Edition\nAuthor: Thomas Wilhelm\nPublished: July 31, 2013\nPublisher: Syngress\nISBN: 9781597499934\nFormat: Retail Epub\nReaders: Adobe Digital Editions (Version 2), Calibre, MoonReader for Android \nTested on PC and Android tablet. On ADE Version 1, the little checkboxes appear as question marks, so please use version 2, which is obviously updated.\n_____________________________________________________________________________\n\nPenetration testing is the act of testing a network to find security vulnerabilities before they are exploited by phishers, digital piracy groups, and countless other organized or individual malicious hackers. The material presented will be useful to beginners all the way through to advanced practitioners. Professional Penetration Testing walks you through the entire process of setting up and running a pen test lab. Penetration testing-the act of testing a computer network to find security vulnerabilities before they are maliciously exploited-is a crucial component of information security in any organization. With this book, you will find out how to turn hacking skills into a professional career. Chapters cover planning, metrics, and methodologies; the details of running a pen test, including identifying and verifying vulnerabilities; and archiving, reporting and management practices.\nAuthor Thomas Wilhelm has delivered penetration testing training to countless security professionals, and now through the pages of this book you can benefit from his years of experience as a professional penetration tester and educator. After reading this book, you will be able to create a personal penetration test lab that can deal with real-world vulnerability scenarios.\nAll disc-based content for this title is now available on the Web.\n-Find out how to turn hacking and pen testing skills into a professional career\n-Understand how to conduct controlled attacks on a network through real-world examples of vulnerable and exploitable servers\n-Master project management skills necessary for running a formal penetration test and setting up a professional ethical hacking business\n-Discover metrics and reporting methodologies that provide experience crucial to a professional penetration tester","torrent":{"xt":"urn:btih:d51a481d28303b2ea0ef6a01078b2a168eb645b3","amp;dn":"Professional+Penetration+Testing+2E-+Syngress+2013+%5BEpub%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d51a481d28303b2ea0ef6a01078b2a168eb645b3","infoHashBuffer":{"type":"Buffer","data":[213,26,72,29,40,48,59,46,160,239,106,1,7,139,42,22,142,182,69,179]},"announce":[],"urlList":[]}}