{"title":"Multi Commander v6.4.6 Build 2246 [32bit + 64bit + Portable]","uid":15623251,"size":31137640,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d5526415771b0f6d04124aed2f991dddb004a341&amp;dn=Multi+Commander+v6.4.6+Build+2246+%5B32bit+%2B+64bit+%2B+Portable%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"ITRG","files":1,"time":1471892179,"description":"Download without torrent client, visit:\r\n \nhttp://crackingpatching[.]com\r\n\r\n[b]Description:[/b]\r\n\r\nIt has long been on our website is not published new file manager, now the day has come. If you suddenly decide to download Multi Commander with our project to the full newsletter, you'll get a pretty good manager to work with files that have tabs system and is a good alternative to the standard Windows Explorer. Please note that in ancient times the program was paid after the developers decided not to be greedy and made it completely free, it is its small plus.\r\nMulti Commander operates using the popular and quite effective support information display, you get two panels for more convenient work with files. According to the developers of this program have absolutely everything you need for comfortable work with the files, now you have to spend a lot less time to perform simple operations. Of course you will get all the standard features of a file manager, that is, you can copy, move, rename, and perform other operations on the selected files.\r\nMulti Commander has some additional features, for example there is support for automatic unpacking files, auto-sorting, you can browse files, edit the registry and connect to remote servers, that is, there is support for FTP. You can view all sorts of files and images, and scripting support to enable automation of a large number of operations. Multi Commander interface is quite easy to use, at the beginning not accustomed to little, it seems that too a whole lot, but then quickly get used to, there is Russian support, therefore, to understand the huge number of settings will not be so difficult, in general, the program I liked and negativity is not caused.\r\nThanks to the tabs, you can open the same panel multiple tabs, it is very convenient, I always just that set. With the built-in caching can more quickly view files. Multi Commander allows you to customize the look of the interface. You can change the background color, and other other parameters of the main window, you can add the program in different plug-ins, you can set permissions for different files, do not forget about the large number of viewers, that is, you can not only see pictures, and documents, listen to audio composition. Generally paint about Multi Commander can be a very long time, especially in many of the program, on the official website, you can read about all the details, and I end up on this a little review.\r\n\r\n[b]How to Install:[/b]\r\ninstructions inside\r\n\r\nFound Issue, suggestions, or just to say &quot;Hi&quot; write him","torrent":{"xt":"urn:btih:d5526415771b0f6d04124aed2f991dddb004a341","amp;dn":"Multi+Commander+v6.4.6+Build+2246+%5B32bit+%2B+64bit+%2B+Portable%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5526415771b0f6d04124aed2f991dddb004a341","infoHashBuffer":{"type":"Buffer","data":[213,82,100,21,119,27,15,109,4,18,74,237,47,153,29,221,176,4,163,65]},"announce":[],"urlList":[]}}