{"title":"McCoy Tyner (58 albums)","uid":3679480,"size":3732135432,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d55e0ff995f3338e2a4447a89c48fc079fa4d23a&amp;dn=McCoy+Tyner+%2858+albums%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":3,"uploader":"cichli","files":427,"time":1178187995,"description":"McCoy Tyner is probably best remembered as the pianist of the classic John Coltrane Quartet. His recordings with that group are awesome, of course - but Tyner was still very young when he did them, and his playing style was by no means fully developed. In fact, his playing with Coltrane pales in comparison to what he would achieve later, particularly on his 70s Milestones recordings.\n\nMcCoy Tyner is a remarkably consistent player - among all these albums, you will not hear him play a single uninspired solo. He is placed in a huge variety of settings, and fits well in all of them. He plays with (to name a few) Ron Carter, Joe Henderson, Alice Coltrane, Billy Cobham, Hubert Laws, Gary Bartz, Freddie Hubbard, John Abercrombie, Al Foster, Carlos Santana, Jack DeJohnette, Tony Williams, John Gilmore, Bobby Hutcherson, Stanley Clarke, Marcus Miller, John Scofield, David Murray, Michael Brecker, Avery Sharpe and Aaron Scott.\n\nHis playing style is perhaps best decribed as &quot;huge&quot;, its most noticeable feature being a freewheeling balls-to-the-wall intensity, though never in a distasteful way. Occasionally, a quiet and romantic side of Tyner also surfaces.\n\nThe early 60&amp;#039;s recordings fit firmly into the post-bop tradition and make for an interesting complement to his recordings with John Coltrane.\n\nHis recordings from the late 60&amp;#039;s (after Coltrane&amp;#039;s death) and through the 70&amp;#039;s find him gradually stepping out of Coltrane&amp;#039;s musical shadow and finding his own voice. He explores all kinds of weird settings, developing a modern, experimental brand of modal jazz that is neither fusion nor free jazz, but may share a small amount of kinship with both.\n\nFrom the 80&amp;#039;s and onward as Tyner grew older, his experimental spirit faded and his music took on a much more traditional bend. Rather than the experimental settings of the 70&amp;#039;s, he starts working with big bands, piano trios, that kind of stuff. The music still makes for an exciting listen, though, as his playing hasn&amp;#039;t dulled down with age by any means!\n\nWith this torrent, I hope to contribute to a greater appreciation of McCoy Tyner&amp;#039;s work outside of the context of Coltrane. It contains a total of 58 albums, which is not quite complete but as close as I ever got. Most rips are decent; one or two are vinyl rips, and there are a handful of glitches here and there. Sorry about that.\n\n-------------------------------------\nAll music guide entry:\n-------------------------------------\nIt is to McCoy Tyner&amp;#039;s great credit that his career after John Coltrane has been far from anti-climatic. Along with Bill Evans, Tyner has been the most influential pianist in jazz of the past 50 years, with his chord voicings being adopted and utilized by virtually every younger pianist. A powerful virtuoso and a true original (compare his playing in the early &amp;#039;60s with anyone else from the time), Tyner (like Thelonious Monk) has not altered his style all that much from his early days but he has continued to grow and become even stronger.\n\nMcCoy Tyner grew up in Philadelphia where Bud Powell and Richie Powell were neighbors. As a teenager he gigged locally and met John Coltrane. He made his recording debut with the Art Farmer-Benny Golson Jazztet, but after six months left the group to join Coltrane in what (with bassist Jimmy Garrison and drummer Elvin Jones) would become the classic quartet. Few other pianists of the period had both the power and the complementary open-minded style to inspire Coltrane, but Tyner was never overshadowed by the innovative saxophonist. During the Coltrane years (1960-1965), the pianist also led his own record dates for Impulse.\n\nAfter leaving Coltrane, McCoy Tyner struggled for a period, working as a sideman (with Ike and Tina Turner, amazingly) and leading his own small groups; his recordings were consistently stimulating even during the lean years. After he signed with Milestone in 1972, Tyner began to finally be recognized as one of the greats, and he has never been short of work since. Although there have been occasional departures (such as a 1978 all-star quartet tour with Sonny Rollins and duo recordings with Stephane Grappelli), Tyner has mostly played with his own groups since the &amp;#039;70s, which have ranged from a quartet with Azar Lawrence and a big band to his trio. In the 80&amp;#039;s and 90&amp;#039;s, Tyner did the rounds of labels (his old homes Blue Note and Impulse! as well as Verve, Enja and Milestone) before settling in with Telarc in the late 90&amp;#039;s and releasing as fine series of albums including 2000&amp;#039;s Jazz Roots: McCoy Tyner Honors Jazz Piano Legends of the 20th Century and 2004&amp;#039;s Illuminations.","torrent":{"xt":"urn:btih:d55e0ff995f3338e2a4447a89c48fc079fa4d23a","amp;dn":"McCoy+Tyner+%2858+albums%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d55e0ff995f3338e2a4447a89c48fc079fa4d23a","infoHashBuffer":{"type":"Buffer","data":[213,94,15,249,149,243,51,142,42,68,71,168,156,72,252,7,159,164,210,58]},"announce":[],"urlList":[]}}