{"title":"239 Computer Science Springer Books - Guerrilla Open Access","uid":8600827,"size":1642598517,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d5747cc470f2ef77766998f079d73e374b6d8dcd&amp;dn=239+Computer+Science+Springer+Books+-+Guerrilla+Open+Access&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":5,"uploader":"dippirate","files":240,"time":1371874982,"description":"\n#\tTorrent File: \t\t\t\t\t\t\t\t#\n# \t239 Computer Science Springer Books [Guerrilla Open Access]\t\t\n\n#\thttp://openaccessmanifesto.org/guerilla-open-access-manifesto/\t\t\n\n#\t30K md5sum.txt\t\t\t\t\t\t\t\t\n#\tTotal 1.6G\t\t\t\t\t\t\t\t\n\n6.6M Celia Hoyles, Jean-Baptiste Lagrange - Mathematics Education and Technology-Rethinking the Terrain.pdf\n4.1M Chris Cornelis, Glad Deschrijver, Mike Nachtegael, Steven Schockaert, Yun Shi - 35 Years of Fuzzy Set Theory.pdf\n7.0M Crina Grosan, Ajith Abraham - Intelligent Systems.pdf\n 12M Cristina Silvano, Marcello Lajolo, Gianluca Palermo - Low Power Networks-on-Chip.pdf\n3.2M Cristina Silvano, William Fornaciari, Eugenio Villar - Multi-objective Design Space Exploration of Multiprocessor SoC Architectures.pdf\n578K  - Cyber-Physical Systems.pdf\n3.1M Daizhan Cheng, Hongsheng Qi, Zhiqiang Li - Analysis and Control of Boolean Networks.pdf\n4.9M Darina Dicheva, Zdravko Markov, Eliza Stefanova - Third International Conference on Software, Services and Semantic Technologies S3T 2011.pdf\n9.0M David Hsu, Volkan Isler, Jean-Claude Latombe, Ming C. Lin - Algorithmic Foundations of Robotics IX.pdf\n 12M David Jin, Sally Lin - Advances in Computer Science, Intelligent System and Environment.pdf\n4.1M David Rios Insua, Simon French - e-Democracy.pdf\n874K David Suendermann - Advances in Commercial Deployment of Spoken Dialog Systems.pdf\n3.6M David Vernon, Claes von Hofsten, Luciano Fadiga - A Roadmap for Cognitive Development in Humanoid Robots.pdf\n6.5M Dieter Uckelmann, Mark Harrison, Florian Michahelles - Architecting the Internet of Things.pdf\n4.3M Dirk Ifenthaler, Pablo Pirnay-Dummer, Norbert M. Seel - Computer-Based Diagnostics and Systematic Analysis of Knowledge.pdf\n6.5M D. Marc Kilgour, Colin Eden - Handbook of Group Decision and Negotiation.pdf\n5.0M Don Torrieri - Principles of Spread-Spectrum Communication Systems.pdf\n 11M Dragica Vasileska, Stephen M. Goodnick - Nano-Electronic Devices.pdf\n 20M Dr. Zhongxue Gan, Dr. Qing Tang - Visual Sensing and its Applications.pdf\n4.9M Eckehard Schnieder, Geza Tarnai - FORMS_FORMAT 2010.pdf\n6.7M Edward H. Y. Lim, James N. K. Liu, Raymond S. T. Lee - Knowledge Seeker - Ontology Modelling for Information Search and Management.pdf\n1.9M Emanuele Bardone - Seeking Chances.pdf\n.\n.\n.\n.\n7.9M Toshiharu Taura, Yukari Nagai - Design Creativity 2010.pdf\n1.9M Tsutomu Sasao - Memory-Based Logic Synthesis.pdf\n 25M Veysel Gazi, Kevin M. Passino - Swarm Stability and Optimization.pdf\n3.1M Vikram Arkalgud Chandrasetty - VLSI Design.pdf\n7.8M Vincent Acary, Olivier Bonnefon, Bernard Brogliato - Nonsmooth Modeling and Simulation for Switched Circuits.pdf\n3.0M Vincenzo Pallotta, Alessandro Soro, Eloisa Vargiu - Advances in Distributed Agent-Based Retrieval Tools.pdf\n1.4M Vitor R. Carvalho - Modeling Intention in Email.pdf\n5.4M Waldemar Rebizant, Janusz Szafran, Andrzej Wiszniewski - Digital Signal Processing in Power System Protection and Control.pdf\n 36M Wasim Ahmed Khan, Abdul Raouf, Kai Cheng - Virtual Manufacturing.pdf\n6.4M Wei Ren, Yongcan Cao - Distributed Coordination of Multi-agent Networks.pdf\n 17M Weisi Lin, Dacheng Tao, Janusz Kacprzyk, Zhu Li, Ebroul Izquierdo, Haohong Wang - Multimedia Analysis, Processing and Communications.pdf\n6.3M W.H. Tang, Q.H. Wu - Condition Monitoring and Assessment of Power Transformers Using Computational Intelligence.pdf\n4.3M Witold Pedrycz, Shyi-Ming Chen - Granular Computing and Intelligent Systems.pdf\n4.6M Wolfgang Minker, Gary Geunbae Lee, Satoshi Nakamura, Joseph Mariani - Spoken Dialogue Systems Technology and Design.pdf\n3.1M Wolfgang Minker, Tobias Heinroth - Next Generation Intelligent Environments.pdf\n8.3M Xiangyu Wang, Jerry Jen-Hung Tsai - Collaborative Design in Virtual Environments.pdf\n7.2M Xiangyu Wang - Mixed Reality and Human-Robot Interaction.pdf\n5.1M Xin-She Yang, Slawomir Koziel - Computational Optimization and Applications in Engineering and Industry.pdf\n","torrent":{"xt":"urn:btih:d5747cc470f2ef77766998f079d73e374b6d8dcd","amp;dn":"239+Computer+Science+Springer+Books+-+Guerrilla+Open+Access","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5747cc470f2ef77766998f079d73e374b6d8dcd","infoHashBuffer":{"type":"Buffer","data":[213,116,124,196,112,242,239,119,118,105,152,240,121,215,62,55,75,109,141,205]},"announce":[],"urlList":[]}}