{"title":"PascalsSubSluts - Alessa Savage (Retching Nymph Craves New Cock)","uid":13095609,"size":1192578907,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:d5796f964fe43e58e4e587ddc4595aa7dcd9ba61&amp;dn=PascalsSubSluts+-+Alessa+Savage+%28Retching+Nymph+Craves+New+Cock%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":3,"uploader":"feeldabyte","files":1,"time":1451116970,"description":"Screens &amp; Info :\r\n\r\n―――――――――――――――――――――――――――――――――\r\n \nhttp://imgkiss.com/image/r5Vr6 \nhttp://imgkiss.com/image/r5iye \nhttp://imgkiss.com/image/r5kB4 \nhttp://imgkiss.com/image/r545L\r\n\r\n―――――――――――――――――――――――――――――――――\r\n\r\nShe's never seen me in action but she's heard all about me and wants -- needs -- to find out if it's true. &quot;I've been with a lot of guys who THINK they're like him,&quot; she says in her interview, &quot;but they're never as hardcore as they think they are.&quot; Andy asks her how she reckons I'm going to be with her. She reckons I'm going to be a bastard. Hopes too, I can see it in her eyes. They're saying &quot;I've never been fucked rough enough and I want you to meat-grind the shit out of me&quot;. Which makes the fact that she's a beautiful, impish, pale whisper of a thing even more erotic but it gets better. The bitch is twisted. She loves watching porn where the girl looks like she's not enjoying it. She loves being fucked without knowing about it in her sleep. She loves getting choked. \r\n\r\n And most of all she loves to retch. So of course having done our research and found this out already, we decide to build the scene around it. Cue Alessa as Andy's new neighbour sitting out on the roof in her bikini gently weeping and prodding her larynx with an orange lollipop. Polite enquiries reveal that she's just broken up with a boyfriend whose penis she was greatly enamoured of and is now mourning. Hence the retching. This is apparently making her feel better. Ever the gentleman, I proffer my own erection to better soothe her woes and the bitch latches onto it like a puppy with a bone, grabbing onto my hips and pulling me into her to gorge on my length.\r\n\r\n An appetite like that on a girl looking like that tends to trigger a reaction in me that I find hard to control and within a jiffy I'm face fucking the little thing with reckless abandon, making her gag and retch and spew rivers of gob-juice all over the carpet. It can only go one way after that. The following 40 minutes see me shag the living fuck out of her. Slapping, spanking, choking, she gets the premier treatment and -- bless her -- actually responds by saying that &quot;This is the best fuck I've ever had in my life&quot;. For some girls, bastard really is best.\r\n\r\n\r\nSail to another one :  https://thepiratebay.se/user/feeldabyte/","torrent":{"xt":"urn:btih:d5796f964fe43e58e4e587ddc4595aa7dcd9ba61","amp;dn":"PascalsSubSluts+-+Alessa+Savage+%28Retching+Nymph+Craves+New+Cock%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5796f964fe43e58e4e587ddc4595aa7dcd9ba61","infoHashBuffer":{"type":"Buffer","data":[213,121,111,150,79,228,62,88,228,229,135,221,196,89,90,167,220,217,186,97]},"announce":[],"urlList":[]}}