{"title":"David Perlmutter - Grain Brain","uid":9220363,"size":146178331,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d5a0abeecff86bf45bdad344af9cb2e2020e7d4e&amp;dn=David+Perlmutter+-+Grain+Brain&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"Lemekk","files":1,"time":1384923539,"description":"The Audio Book Was Difficult to Find, I was going to keep it too myself, But I figured i might as well share it with you guys\n\n\nGrain Brain: The Surprising Truth about Wheat, Carbs, and Sugar - Your Brain's Silent Killers (Audiobook) by David Perlmutter, Peter Ganim and Kristin Loberg English | 2013 | ISBN: 1619698463 | ASIN: B00EPMZE2S | 9 hours and 22 minutes | M4B 36 kbps | 146,5 MB The devastating truth about the effects of wheat, sugar, and carbs on the brain, with a 30-day plan to achieve optimum health. Renowned neurologist David Perlmutter, MD, blows the lid off a topic that's been buried in medical literature for far too long: carbs are destroying your brain. And not just unhealthy carbs, but even healthy ones like whole grains can cause dementia, ADHD, anxiety, chronic headaches, depression, and much more. Dr. Perlmutter explains what happens when the brain encounters common ingredients in your daily bread and fruit bowls, why your brain thrives on fat and cholesterol, and how you can spur the growth of new brain cells at any age. He offers an in-depth look at how we can take control of our &quot;smart genes&quot; through specific dietary choices and lifestyle habits, demonstrating how to remedy our most feared maladies without drugs. With a revolutionary 30-day plan, Grain Brain teaches us how we can reprogram our genetic destiny for the better. ","torrent":{"xt":"urn:btih:d5a0abeecff86bf45bdad344af9cb2e2020e7d4e","amp;dn":"David+Perlmutter+-+Grain+Brain","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5a0abeecff86bf45bdad344af9cb2e2020e7d4e","infoHashBuffer":{"type":"Buffer","data":[213,160,171,238,207,248,107,244,91,218,211,68,175,156,178,226,2,14,125,78]},"announce":[],"urlList":[]}}