{"title":"AC/DC - High Voltage [320k MP3]","uid":10337426,"size":178031082,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d67219c5262dda627c65f17c2adfaba0d97089a9&amp;dn=AC%2FDC+-+High+Voltage+%5B320k+MP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"smbdownload","files":-1,"time":1402495175,"description":"High Voltage is the first internationally released album by Australian hard rock band AC/DC. It contains tracks from their first two Australia-only issued albums, High Voltage and T.N.T. (both from 1975). Originally released on Atlantic Records, this edition of High Voltage has proven popular, selling three million units in the US alone. However, initially the album was panned by some critics upon its release, including a review by Rolling Stone magazine's Billy Altman that called it an &quot;all-time low&quot; for the hard rock genre. It was re-released in 2003 as part of the AC/DC Remasters series.\n\nHigh Voltage is the debut studio album by Australian hard rock band AC/DC, released on 17 February 1975. Six of its eight songs were written by Angus Young, Malcolm Young and Bon Scott. &quot;Soul Stripper&quot; was written by the Young brothers and &quot;Baby, Please Don't Go&quot; is a cover version of a Big Joe Williams song. The album was produced by Vanda &amp; Young at Albert Studios in Sydney, Australia. George Young is the older brother of Angus and Malcolm, who also played bass guitar on a number of the album's songs, and played bass guitar at some of AC/DC's live shows. Harry Vanda was a bandmate of George's in The Easybeats. George and Harry were the main songwriters of The Easybeats' later hits, including their international hit &quot;Friday on My Mind&quot;.\n\nHigh Voltage was originally released on Albert Productions only in Australia, and has never been reissued by another label in this format. The international version of High Voltage, that was issued on Atlantic Records in 1976, has a different cover art and track listing, with only &quot;She's Got Balls&quot; and &quot;Little Lover&quot; appearing overseas. &quot;Baby Please Don't Go&quot;, &quot;Soul Stripper&quot;, &quot;You Ain't Got a Hold On Me&quot; and &quot;Show Business&quot; were later released on '74 Jailbreak in 1984. &quot;Stick Around&quot; and &quot;Love Song&quot; have been released on Backtracks in 2009.\n\nTrack Listing [320k MP3]\n\n1. \t&quot;It's a Long Way to the Top (If You Wanna Rock 'n' Roll)&quot;   \t5:01\n2. \t&quot;Rock 'n' Roll Singer&quot;   \t5:04\n3. \t&quot;The Jack&quot;   \t5:52\n4. \t&quot;Live Wire&quot;   \t5:50\n5. \t&quot;T.N.T.&quot;   \t3:34\n6. \t&quot;Can I Sit Next to You Girl&quot; (A. Young, M. Young) \t4:12\n7. \t&quot;Little Lover&quot;   \t5:37\n8. \t&quot;She's Got Balls&quot;   \t4:51\n9. \t&quot;High Voltage&quot;   \t4:03\n\nOdds And Sods\n\n1. \t&quot;Baby Please Don't Go&quot;   \t5:00\n2. \t&quot;Stick Around&quot;   \t4:39\n3. \t&quot;Soul Stripper&quot;   \t6:25\n4. \t&quot;You Ain't Got a Hold on Me&quot;   \t3:31\n5. \t&quot;Love Song&quot;   \t5:14\n6. \t&quot;Show Business&quot;  \t4:46\n\n","torrent":{"xt":"urn:btih:d67219c5262dda627c65f17c2adfaba0d97089a9","amp;dn":"AC%2FDC+-+High+Voltage+%5B320k+MP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d67219c5262dda627c65f17c2adfaba0d97089a9","infoHashBuffer":{"type":"Buffer","data":[214,114,25,197,38,45,218,98,124,101,241,124,42,223,171,160,217,112,137,169]},"announce":[],"urlList":[]}}