{"title":"TEXAS DISCOGRAPHY plus SHARLEEN SPITERI","uid":8529990,"size":1140945036,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d6da2fdc1e53724e7ecfb526f31675929b7e15ce&amp;dn=TEXAS+DISCOGRAPHY+plus+SHARLEEN+SPITERI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":3,"uploader":"mirrormaster82","files":-1,"time":1370121097,"description":"\nTHIS TORRENT CONTANS ALL TEXAS STUDIO ALBUMS plus 2 SOLO ALBUMS OF SHARLEEN SPITERI\n\n\nTexas are an alternative rock band from Glasgow, Scotland. They were founded by Johnny McElhone (formerly of the bands Altered Images and Hipsway) in 1986 and feature Sharleen Spiteri on lead vocals. Texas made their performing debut in March 1988 at the University of Dundee. They took their name from the 1984 Wim Wenders movie Paris, Texas.\n\nThe band released their debut album Southside in 1989, along with the debut single &quot;I Don't Want a Lover&quot; which was an international hit, reaching the top ten in the UK and other high charting positions in Europe. Southside debuted at number three in the UK and eighty-eight on the US Billboard 200 album charts. Despite the success of Southside, the follow-up albums Mothers Heaven (1991) and Ricks Road (1993) were less successful, peaking at #32 and #18 respectively in the UK.\n\nThe band's fortunes changed in 1997 with the release of their White on Blonde album which entered the UK Albums Chart at number one and became their biggest seller. To date it has been certified six-times platinum in the UK,for shipments in excess of 1.8 million copies. Follow up album, The Hush (1999) was also successful, debuting at number one on the UK album charts and certified triple platinum. The band's Greatest Hits album, released in 2000, was another big seller, again debuting at number one and also being certified six-times platinum. Texas would go on to release a further two studio albums, Careful What You Wish For in 2003, and Red Book in 2005, both of which were certified gold in the UK. After the release of Red Book and a tour to support the album's release, Texas went on hiatus. Lead singer Sharleen Spiteri launched a solo career, releasing her debut solo album, Melody, in 2008.\n\n\nDISCOGRAPHY:\n\nSouthside (1989)\nMothers Heaven (1991)\nRicks Road (1993)\nWhite on Blonde (1997)\nThe Hush (1999)\nCareful What You Wish For (2003)\nRed Book (2005)\nThe Conversation (2013)\n\n\n\nSharleen Spiteri (born 7 November 1967) is a Scottish recording artist and songwriter, and the lead singer of the rock band Texas. Texas began their career in 1986, and shot to fame in 1989 with their top ten single with her brother in law as lead guitarist, &quot;I Don't Want a Lover&quot; released from Southside (1989). Until 2003, Texas's worldwide album sales were counted at 20 million.\n\nHer debut solo album Melody was released in 2008, and her second solo album The Movie Songbook was released in March 2010.\n\nALBUMS:\n\n2008: Melody\n2010: The Movie Songbook\n\n\nGENERAL MUSIC SPECS FOR ALL ALBUMS (except The movie songbook - it has VBR) :\n\nFormat : MPEG Audio (MP3)\nOverall bit rate : 320 Kbps\nSampling rate : 44.1 KHz\nMode : CBR, Stereo\n\nENJOY AND PLEASE SEED TO KEEP THIS TORRENT ALIVE...\n","torrent":{"xt":"urn:btih:d6da2fdc1e53724e7ecfb526f31675929b7e15ce","amp;dn":"TEXAS+DISCOGRAPHY+plus+SHARLEEN+SPITERI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6da2fdc1e53724e7ecfb526f31675929b7e15ce","infoHashBuffer":{"type":"Buffer","data":[214,218,47,220,30,83,114,78,126,207,181,38,243,22,117,146,155,126,21,206]},"announce":[],"urlList":[]}}