{"title":"The God-Kings of England","uid":15741227,"size":3040680,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d71440d7d39e06d8a7885a41783ad8d137339eae&amp;dn=The+God-Kings+of+England&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"marty14","files":1,"time":1472915478,"description":"The God-kings of England: The Viking and Norman Dynasties and their Conquest of England (983-1066) by Hugh Montgomery\r\n\r\nFollowing on from The God-Kings of Europe, The God-Kings of England, continues the Saga of the great Ulvungar Dynasty. It shows that there was a plan to counter the hegemony of Roman Christianity, by counter attacking, first with Viking raids and later by conquest and settlement. This is the tale of the Ulvungars and their attempt to conquer England, under the leadership of Danish Kings such as Sweyn Forkbeard and Canute. They were opposed by their Odonic Anglo-Saxon cousins such as Alfred and Aethelred. The Ulvungars would take control by force of arms. One branch would take England; another would take control of Normandy. Ultimately, they would combine after the Battle of Hastings in the Anglo-Norman Dynasty that would found the Angevin Empire. This book shows the web of marriages and alliances and the detailed planning that went into the final push that culminated at the Battle of Hastings. It shows how the Davidic line of Jesus was protected by the Odonic Kings of England and Dukes of Normandy. In the appendices the author traces and explains who William the Conqueror's real ancestors were and shows detailed genealogies","torrent":{"xt":"urn:btih:d71440d7d39e06d8a7885a41783ad8d137339eae","amp;dn":"The+God-Kings+of+England","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d71440d7d39e06d8a7885a41783ad8d137339eae","infoHashBuffer":{"type":"Buffer","data":[215,20,64,215,211,158,6,216,167,136,90,65,120,58,216,209,55,51,158,174]},"announce":[],"urlList":[]}}