{"title":"Convict Conditioning (ePUB,Retail){32Skulls}","uid":10907586,"size":16587659,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d7513c4b4cda6769829cefb81865d237a750da3f&amp;dn=Convict+Conditioning+%28ePUB%2CRetail%29%7B32Skulls%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"32Skulls","files":-1,"time":1409245155,"description":"                      â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ \n\n\nHow to Train As If Your VERY LIFE Depended on Your Degree of REAL Strength, Power and ToughnessMost physical training systems are designed for the domesticated human animal. That is to say, for us humans who live lives of such relative security that we cultivate our strength and power more out of pride and for a sense of accomplishment than out of an absolute need to survive in the wild. The professional athlete hones his body to function well in a sports event-rather than to emerge safe from a life-or-death struggle. And even those in our military and LEO rely more on the security of their weapons and armor than on their own personal, raw power and brute strength to carry the day. There remains one environment where exuding the necessary degree of authoritative strength and power can mean the difference between life or death: the maximum security prison. In maximum security, the predator preys on the weak like we breathe air. Intimidation is the daily currency. You either become a professional victim or you develop that supreme survival strength that signals the predator to stay at bay.Paul Wade spent 19 years in hell holes like San Quentin, Angola and Marion. He entered this world a gangly, terrorized weakling and he graduated to final freedom, pound-for-pound one of the strongest humans on the planet. Paul Wade dedicated his prison life to the cultivation of that supreme survival strength. And ironically, it is in America's prisons that we can find some of the great, lost secrets of how to get immensely powerful and strong. Paul Wade mined these secrets as if his life depended on it-and of course in many ways it did.Finally free, Paul Wade pays his debt to society-not just with the horrors of his years in the hole-but with the greatest gift he could possibly give us: a priceless set of progressions that can take ANYONE who has the will from abject weakling to strength specimen extraordinaire.\n\n\nBy Paul Wade\nPublished by Dragon Door Publications in 2012\nEPUB, Retail, 294 pages, English","torrent":{"xt":"urn:btih:d7513c4b4cda6769829cefb81865d237a750da3f","amp;dn":"Convict+Conditioning+%28ePUB%2CRetail%29%7B32Skulls%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7513c4b4cda6769829cefb81865d237a750da3f","infoHashBuffer":{"type":"Buffer","data":[215,81,60,75,76,218,103,105,130,156,239,184,24,101,210,55,167,80,218,63]},"announce":[],"urlList":[]}}