{"title":"Goo Goo Dolls - Iris","uid":4669440,"size":126523396,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d7a2a15bb0ec77cc72acb2be82f4ae29473ba72c&amp;dn=Goo+Goo+Dolls+-+Iris&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"2nafish","files":-1,"time":1232682382,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Iris&quot; is a song by American alternative rock band the Goo Goo Dolls. Originally written for the soundtrack of 1998 film City of Angels, the song was later included on the band's sixth album Dizzy Up the Girl. The acoustic guitar in the song gives a distinctive sound as it is in an odd tuning, with 5 of the 6 strings tuned to D. This gives a ringing effect similar to a 12-string guitar. &quot;Iris&quot; has been one of the Goo Goo Dolls' most defining songs in terms of its contribution to the band's future success. It is the longest charting number one single in Billboard Hot 100 Airplay history with 18 consecutive weeks in the number one spot.\n\nThe instrumentals in the song are heavily driven by guitar riffs, mandolin, and cellos, with a steady drum beat beneath.\n\nIt was the first song that the Goo Goo Dolls had been asked to write specifically for a film. Songwriter Johnny Rzeznik has been quoted as saying he broke several years of writer's block and several years of sobriety simultaneously the night he wrote this track.\n\nIn the music video the band is shown high up in skyscrapers, watching the lives of people through telescopes. Seen throughout the video is the actor Nicolas Cage. This theme reflects on what the angels do in the film. Interspersed throughout the video are clips from the film depicting scenes where Seth is falling in love and deciding whether or not to give up being an angel.\n\nThe song was named &quot;Iris&quot; by guitarist/vocalist John Rzeznik for Iris DeMent. Rzeznik found her name while flipping through a magazine, and thought it was a nice name, so he chose it for the song. Prior to this, some fans of the song have speculated that the title refers to the Greek messenger of the gods, Iris. This is thought supposedly because some angels are considered messengers and this song was written for the movie City of Angels (in which the main character is an angel).\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:d7a2a15bb0ec77cc72acb2be82f4ae29473ba72c","amp;dn":"Goo+Goo+Dolls+-+Iris","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7a2a15bb0ec77cc72acb2be82f4ae29473ba72c","infoHashBuffer":{"type":"Buffer","data":[215,162,161,91,176,236,119,204,114,172,178,190,130,244,174,41,71,59,167,44]},"announce":[],"urlList":[]}}