{"title":"Excel 2010 For Dummies - (Malestrom)","uid":5609982,"size":17364246,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d7d647c518f5073412c63008dcf6aa7de38c3074&amp;dn=Excel+2010+For+Dummies+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"malestrom_HH","files":2,"time":1275818799,"description":"Greg Harvey, &quot;Excel 2010 For Dummies&quot;\nFor Dummies | 2010-04-26 | ISBN: 0470489537 | 408 pages | PDF\n\nThe bestselling Excel book on the market, updated for Excel 2010\n\nAs the world's leading spreadsheet application, Excel has a huge user base. The release of Office 2010 brings major changes to Excel, so Excel For Dummies comes to the rescue once more!\n\nIn the friendly and non-threatening For Dummies style, this popular guide shows beginners how to get up and running with Excel and helps more experienced users get comfortable with new features.\n\n# Excel is the number one spreadsheet application worldwide, and Excel For Dummies is the number one guide to using it\n# With the major changes in Microsoft Office 2010, Excel has new features and a new interface design; users need help to get up to speed\n# The book includes everything you need to know to perform basic Excel 2010 tasks\n# Covers creating and editing worksheets and charts, formatting cells, entering formulas, inserting graphs, designing database forms, and adding database records\n# Also covers printing, adding hyperlinks to worksheets, saving worksheets as Web pages, adding existing worksheet data to an existing Web page, and much more\n\nWhether you're new to Excel or just need to understand the 2010 version, Excel 2010 For Dummies provides what you need to know.","torrent":{"xt":"urn:btih:d7d647c518f5073412c63008dcf6aa7de38c3074","amp;dn":"Excel+2010+For+Dummies+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7d647c518f5073412c63008dcf6aa7de38c3074","infoHashBuffer":{"type":"Buffer","data":[215,214,71,197,24,245,7,52,18,198,48,8,220,246,170,125,227,140,48,116]},"announce":[],"urlList":[]}}