{"title":"Galactic Civilizations III Founders Elite Edition Beta v0.40","uid":10769281,"size":1393369209,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d7ec7d96335a19c50d9051389effa4758b4d49d0&amp;dn=Galactic+Civilizations+III+Founders+Elite+Edition+Beta+v0.40&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"Nimbleton","files":-1,"time":1408063403,"description":"Galactic Civilizations III Founders Elite Edition Beta v0.40\n\n\nExtract 7zip &amp; play!\n\n\nNew Features\n\nUpdated ideology system adds lots of new ideologies with unique benefits\nNew Terran tech tree, for balanced gameplay\nNew Altarian tech tree, for better access to mysticism, defense and influence\nNew Drengin tech tree, for when you just want to kill something\nNew Iridium tech tree, for earlier access to economic and production abilities\nAdded shipyard construction queue\nAdded black holes. Black holes are impassable but the only source of antimatter\nAdded the approval system. Now your people judge how you are doing, which affects their productivity and growth\nAdded terraforming, to optimize your worlds and open up new areas to build improvements and give adjacency bonuses\nAdded improvement upgrading\nPlanet generation finalized: Planet traits finalized, planet features finalized, planet light map is now working with population\nShips can now be upgraded\nAdded huge ships to give players more weapons in the late game\nAdded 30 more colonization events\nAdded the antimatter resource. This is needed for some of the advanced missile and point defense augments\nElerium resource can now be harvested. Elerium is used for advanced beam weapons and shield augments\nDurantium resource can now be harvested. Durantium is used for advanced kinetic weapons and armor\nBalance\n\nComplete rebalance\nMap generation pass: Better randomization, more clumping, and players start further from each other\nUI\n\nTons of new art (starbases, icons, lighting and ships all look much better)\nRendering system finalized\nLighting finalized\nAdded a new starbase screen\nAdded the ship and fleet detail screens\nUpdated planet screen\nAdded lots of tooltips (even more will be coming)\nAdded the faction power list so you can see how well you are doing compared to other players\nAdded a &quot;Research Unlocked&quot; popup screen that displays the results of the tech you gained, and what it does\nAI\n\nThe AI knows how to upgrade ships\nAdded difficulty levels (Beginner, Normal, Heroic, Genius, and Godlike)\n\n\n","torrent":{"xt":"urn:btih:d7ec7d96335a19c50d9051389effa4758b4d49d0","amp;dn":"Galactic+Civilizations+III+Founders+Elite+Edition+Beta+v0.40","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7ec7d96335a19c50d9051389effa4758b4d49d0","infoHashBuffer":{"type":"Buffer","data":[215,236,125,150,51,90,25,197,13,144,81,56,158,255,164,117,139,77,73,208]},"announce":[],"urlList":[]}}