{"title":"Rings One","uid":10519561,"size":69056672,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d86d0f12fcbf290a42a99bf3fb265476bdfd61f4&amp;dn=Rings+One&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"wildturkey00","files":2,"time":1404957090,"description":"Format: PDF/webrip\nGenre: Workout/tutorial\nPublished: N/A\n\nBook Description: Rings One begins the Reverse Muscle Up (rMU) progressions, Ring Support, Back Lever (BL), as well as introduces Leverage Assisted Ring Strength (LARS).\nCourse Prerequisite:\n\n-Foundation Two. Foundation Four is highly recommended.\n\nCourse Corequisites:\n\n-Handstand One and Handstand Two\n\n\nNote: Rings One (R1) is not an introductory gymnastics strength training course. If you are a beginner to the world of gymnastics strength training, this is not the appropriate course for you. You would be far better served stopping here, going back and starting again with the GB Foundation and Handstand series.\n\nThe strength and physiques which can be developed using ring strength are little short of amazing. Pound for pound, a world class athlete on the rings is quite simply the strongest athlete over the widest range of motion walking the planet. In addition to being incredibly effective as a strength development method, strength training on the rings will also greatly improve coordination, balance and agility.\n\nRing strength training, properly structured, also provides exceptional arm development for the biceps and brachialis, upper back and surprisingly the forearms as well. Straight arm ring strength training requires that the body function as a whole, which in turn will be limited by the weakest link which in the case of ring strength elements is usually the brachialis; especially in beginners.\n\nRings One begins the Reverse Muscle Up (rMU) progressions, Ring Support, Back Lever (BL), as well as introduces Leverage Assisted Ring Strength (LARS).\n\n\nWith over 110 pictures and 37 videos, our goal is to help you succeed in training. We show only athletes who have trained using these methods (no fitness models) and the training comes from Coach Sommer himself, a National-level USAG coach of nearly 40 years. We have a long line of champion athletes to show this training works, and back our product with a 100% money-back promise if you are not satisfied.\n\n\nRings One continues programming from the Foundation Series and can (and should) be trained with Handstand One and Handstand Two. ","torrent":{"xt":"urn:btih:d86d0f12fcbf290a42a99bf3fb265476bdfd61f4","amp;dn":"Rings+One","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d86d0f12fcbf290a42a99bf3fb265476bdfd61f4","infoHashBuffer":{"type":"Buffer","data":[216,109,15,18,252,191,41,10,66,169,155,243,251,38,84,118,189,253,97,244]},"announce":[],"urlList":[]}}