{"title":"Ibycus Topographic Map 4.0 (Legally Free GPS Maps)","uid":7704309,"size":4060151808,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:d8d585edc926d58170a90e22db2928a50d21765e&amp;dn=Ibycus+Topographic+Map+4.0+%28Legally+Free+GPS+Maps%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":1,"uploader":null,"files":1,"time":1349642128,"description":"     This is the Ibycus Topographic Map set version 4.0 that runs on Garmin GPS units. \n\n     This is legal and free, as it is created from government sources, and kindly assembled by Dale Atkin.\n\n\n     To install them, download the torrent (it is an ISO Image), as well as PowerISO: http://download.cnet.com/PowerISO/3000-2646_4-10439118.html\n\nInstall PowerISO, and then mount the ISO image using PowerISO. Then continue to install it as if it were any other DVD installer. Once installed, it will appear in Basecamp.\n\nAlternatively, you could burn it to a DVD, however that is much slower and is more expensive.\n\n\n\n     Information from the Ibycus Webpage: http://www.ibycus.com/ibycustopo/\n\n&quot;No one likes the legal stuff, but its necessary. No guarantee is made as to the accuracy of these maps, or their suitability for any particular purpose (in some cases, there are *known* inaccuracies. Also, these maps are not endorsed in any way by Garmin, and hence Garmin will obviously offer you no support should you have trouble with them.\n\nThe underlying topo data comes from the Geogratis Website (The BNDT dataset) (? Department of Natural Resources Canada. All rights reserved). This is essentially the data you get on the government issue 1:50,000 topo maps.\n\nThe road data comes from the GeoBase? website. This data at the moment does not have road names or address information, but the positional accuracy is very good (as compared to the StatsCan data set, which has road names and addresses, but poor accuracy)\n\nThe maps are compiled using a free online compiler at http://mapcenter.cgpsmapper.com .\n\nAll data used in these maps was obtained under an ?Unrestricted End User licence? of the distributing bodies. (the details of that license are available at http://www.geobase.ca/geobase/en/licence.jsp and http://www.geogratis.ca/geogratis/en/licence.jsp. The use of this data does not construe an endorsement by any third party)\n\nThe compiler I use forces me to place a few additional restrictions on the use of the data from this site. You may not redistribute any of the maps here for commercial purposes. You may make copies, and give them away, but under no circumstances may you sell them, or repackage them and claim them as your own work (you may repackage smaller datasets and distribute those, provided that you acknowledge the source(s) of the data and that you do not charge for your repackaged versions)&quot;","torrent":{"xt":"urn:btih:d8d585edc926d58170a90e22db2928a50d21765e","amp;dn":"Ibycus+Topographic+Map+4.0+%28Legally+Free+GPS+Maps%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8d585edc926d58170a90e22db2928a50d21765e","infoHashBuffer":{"type":"Buffer","data":[216,213,133,237,201,38,213,129,112,169,14,34,219,41,40,165,13,33,118,94]},"announce":[],"urlList":[]}}