{"title":"Jongens (2014).mkv","uid":11852644,"size":1571720161,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:d8e585ea15fb69a1bb903c394af85f810e47ffae&amp;dn=Jongens+%282014%29.mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"Freefallen51","files":1,"time":1430118215,"description":"BOYS tells the story of Sieger, a sporty, rather quiet 15-year-old boy who discovers love during the summer holidays. Sieger is training in the new athletics team for the national relay championships and meets the intriguing and unpredictable Marc. The friendship that develops seems nothing out of the ordinary, but Sieger secretly harbours stronger feelings for Marc. He engages in a lonely struggle with himself when it emerges that Marc is also in love with him. With his best friend Stef, Sieger discovers a motocross track outside the village. Events soon take on a momentum of their own as Sieger quickly becomes involved with Jessica. At last, he counts for something in the eyes of his tough older brother Eddy, who is secretly using the track to tear around on a moped. Sieger keeps quiet about this to his father, who often clashes with the rebellious Eddy since their mother's death. Sieger tries to make peace between the two, but his mind is elsewhere, as he finds it increasingly difficult to deny his feelings for Marc","torrent":{"xt":"urn:btih:d8e585ea15fb69a1bb903c394af85f810e47ffae","amp;dn":"Jongens+%282014%29.mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8e585ea15fb69a1bb903c394af85f810e47ffae","infoHashBuffer":{"type":"Buffer","data":[216,229,133,234,21,251,105,161,187,144,60,57,74,248,95,129,14,71,255,174]},"announce":[],"urlList":[]}}