{"title":"Pirates of the Caribbean 1, 2 &amp; 3 The Complete DVD Boxset DVDRip","uid":6182738,"size":2839589222,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d925393581eea014e28f3c3976f33896f1309874&amp;dn=Pirates+of+the+Caribbean+1%2C+2+%26+3+The+Complete+DVD+Boxset+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"TSV","files":-1,"time":1298012208,"description":"Pirates of the Caribbean is a series of fantasy-adventure films directed by Gore Verbinski (1-3) and Rob Marshall (4), written by Ted Elliott and Terry Rossio and produced by Jerry Bruckheimer. They are based on a Walt Disney theme park ride of the same name, and follow Captain Jack Sparrow (Johnny Depp), Will Turner (Orlando Bloom), Elizabeth Swann (Keira Knightley), Captain Hector Barbossa (Geoffrey Rush), Joshamee Gibbs (Kevin McNally), along with Angelica (PenÃƒÂ©lope Cruz) and Blackbeard (Ian McShane).\n\nThe films started with their first release on the big screen in 2003 with Pirates of the Caribbean: The Curse of the Black Pearl. After the success of the first film, Walt Disney Pictures revealed that a trilogy was in the works. Pirates of the Caribbean: Dead Man's Chest was released three years later in 2006. The sequel proved successful, breaking records worldwide the day of its premiere. In the end, it earned $1,066,179,725 at the worldwide box office, becoming the fourth and second-fastest film to reach this amount. The third film in the series, Pirates of the Caribbean: At World's End, was released in 2007. So far, the film franchise has grossed $2.68 billion worldwide. In September 2008, Depp signed on for a fourth film in the franchise, Pirates of the Caribbean: On Stranger Tides, set to be released on May 20, 2011 in conventional 2D, IMAX, Disney Digital 3-D and IMAX 3D. Filming began on June 14, 2010 in Hawaii. It has been confirmed that two more installments to the franchise are included in Disney's future plans.\n\nThe series may have been influenced by the Monkey Island series. Coincidentally, one of the writers, Ted Elliott, was allegedly a script writer of a Steven Spielberg-produced MI animated film adaptation.\n","torrent":{"xt":"urn:btih:d925393581eea014e28f3c3976f33896f1309874","amp;dn":"Pirates+of+the+Caribbean+1%2C+2+%26+3+The+Complete+DVD+Boxset+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d925393581eea014e28f3c3976f33896f1309874","infoHashBuffer":{"type":"Buffer","data":[217,37,57,53,129,238,160,20,226,143,60,57,118,243,56,150,241,48,152,116]},"announce":[],"urlList":[]}}