{"title":"Johnny Thunders - 1978 - So Alone","uid":4758818,"size":81153602,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d9d4aa39c8d5f30af3987cf3c1c0d6fcc0703d0a&amp;dn=Johnny+Thunders+-+1978+-+So+Alone&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"_bam_","files":-1,"time":1236610957,"description":"1. Pipeline 2:23\n2. You Can't Put Your Arms Around A Memory 3:48\n3. Great Big Kiss 3:23\n4. Ask Me No Questions 3:33\n5. Leave Me Alone 2:48\n6. Daddy Rollin' Stone 3:19\n7. London Boys 2:50\n8. (She's So) Untouchable 2:54\n9. Subway Train 4:11\n10. Downtown 3:13\n11. Dead Or Alive [bonus track] 3:13\n12. Hurtin' [bonus track] 3:06\n13. So Alone [previously unreleased/bonus track] 4:54\n14. The Wizard [previously unreleased/bonus track] 3:23\n\n\n\nAlbum info:\n\nFollowing the drug-fueled implosion of the Heartbreakers, Johnny Thunders bounced back with his first solo outing, So Alone. Featuring a veritable who's who of '70s punk and hard rock -- Chrissie Hynde, Phil Lynott, Peter Perrett, Steve Marriott, Paul Cook, and Steve Jones, among others -- the record was a testament to what the former New York Dolls guitarist could accomplish with a little focus. Much like Thunders' best work with the Dolls and Heartbreakers, So Alone is a gloriously sloppy amalgam of R&amp;B, doo wop, and three-chord rock &amp; roll. Despite the inevitable excesses that plagued every Thunders recording session, Steve Lillywhite's solid engineering job and a superb set of songs hold everything together. A cover of the Chantays' classic instrumental &quot;Pipeline&quot; leads things off, and is a teasing reminder of what a great guitarist Thunders could be when he put his mind to it. \n\nThe record's indisputable masterpiece is &quot;You Can't Put Your Arms Round a Memory,&quot; a wrenching, surprisingly literate ballad in which Thunders seems to acknowledge that his junkie lifestyle has doomed him to the abyss. Songs like &quot;Leave Me Alone,&quot; &quot;Hurtin',&quot; and the chilling title track continue the theme of life inside the heroin balloon. Fortunately, all this back-alley gloom is leavened by some memorably animated moments. &quot;London Boys&quot; is a scathing reply to the Sex Pistols' indictment of the New York punk scene, &quot;New York.&quot; \n\nThe funky &quot;Daddy Rolling Stone&quot; features the inimitable Lynott on background vocals, while the rave-ups &quot;Great Big Kiss&quot; and &quot;(She's So) Untouchable&quot; are terrific examples of Thunders' raunchy take on classic R&amp;B. Sadly, Johnny Thunders never followed up on the promise of his solo debut. His subsequent records were a frustrating mix of drug-addled mediocrity and downright laziness. But for one brief moment, he seemed to put it all together. That moment is So Alone.","torrent":{"xt":"urn:btih:d9d4aa39c8d5f30af3987cf3c1c0d6fcc0703d0a","amp;dn":"Johnny+Thunders+-+1978+-+So+Alone","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9d4aa39c8d5f30af3987cf3c1c0d6fcc0703d0a","infoHashBuffer":{"type":"Buffer","data":[217,212,170,57,200,213,243,10,243,152,124,243,193,192,214,252,192,112,61,10]},"announce":[],"urlList":[]}}