{"title":"Masonry and Concrete for residential construction{BBS}","uid":6636258,"size":6324022,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d9e9d841aba05fcedf44fb09b50512e8254a7754&amp;dn=Masonry+and+Concrete+for+residential+construction%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1314567132,"description":"The only all-inclusive, accessible reference for all aspects of building with masonry and concrete for residential purposes - ideal for residential builders, contractors, remodelers, and other professionals Part of the Complete Construction Series, this design-it, specify-it, and build-it source aids decision-making and construction performance by illustrating and explaining the function and behavior of each material Provides problem-avoiding insights into installation, construction, storage, and cleaning techniques - filled with tables, graphs, and over 100 illustrations\nFrom the Back Cover\nCut costs and avoid callbacks with this indispensable guide especially for residential construction professionals. Here to help you plan and do any concrete and masonry job right, Masonry and Concrete brings you top-line guidance from one of the country's leading experts, consulting architect Christine Beall, an author of the industry standards. Inside, she gives you ways to reduce materials expenses, slash time spent on the job, and avoid expensive, reputation-damaging errors. Plus, this application-loaded sourcebook alerts you to important new trends in homebuilding, provides a complete source of quick and expert answers, and serves as a springboard for your own design ideas. A featured volume in McGraw-Hill's popular new Complete Construction Series, Masonry and Concrete offers help with: *Every aspect of residential building with masonry and concrete *Construction and installation techniques *Brick, concrete, cast and natural stone *Mixing, reinforcing, pouring, and finishing *Foundations, slabs, paving, veneers, sidewalks, driveways, retaining walls, patios, and new applications *Preventing temperature and weather damage *Tools, techniques, and recommended practices *Planning and estimating *Basic design principles *Performance figures *Specification data *Job site safety *Nearly 300 illustrations, tables, charts, and graphs *Industry standards and CABO code requirements Tailored to the home-building pro, this book delivers all the expertise you'll ever need with these essential building materials and their techniques.\n\n\n    * Paperback: 400 pages\n    * Publisher: McGraw-Hill Professional; 1 edition (August 25, 2000)\n    * Language: English\n    * ISBN-10: 0070067066\n    * ISBN-13: 978-0070067066","torrent":{"xt":"urn:btih:d9e9d841aba05fcedf44fb09b50512e8254a7754","amp;dn":"Masonry+and+Concrete+for+residential+construction%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9e9d841aba05fcedf44fb09b50512e8254a7754","infoHashBuffer":{"type":"Buffer","data":[217,233,216,65,171,160,95,206,223,68,251,9,181,5,18,232,37,74,119,84]},"announce":[],"urlList":[]}}