{"title":"Jimmy Cliff - Ultimate Collection","uid":7043341,"size":165720074,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:da69e0bbe73fae0f1104abc12a4e14477ace7428&amp;dn=Jimmy+Cliff+-+Ultimate+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":2,"uploader":"ramsj900","files":20,"time":1329637494,"description":"Ripped from @ 320kps lossy\n\nRecorded between 1969 &amp; 1999. Includes liner notes by Mike Ragogna &amp; Dana Smart.\n\nDigitally remastered by Erick Labson (1999, MCA Music Media Studios, North Hollywood, California).\n\nNot a career-spanning overview, as opening number &quot;Wonderful World, Beautiful People&quot; dates from 1969, seven years into Jimmy Cliff's career, but this is an excellent trawl through his past nonetheless. Ultimate Collection should really have kicked off with &quot;Waterfall,&quot; his first international hit (number one in Brazil), but &quot;World&quot; brought him success in the both in the U.K. and U.S., and apparently that's all that counts. Nevertheless, the set follows the reggae star down the years, through hit singles and across crucial album tracks, and bringing it all bang up to date with &quot;Rise Up,&quot; a number from Cliff's 1999 Humanitarian album. However, there's one yawning gap -- 1982 to 1988, when Cliff was signed to the Columbia label. Half this collection is given over to the early reggae years, as Cliff's mentor and producer Leslie Kong and his British label Island groomed him for international success, although there was always a tension between the singer/songwriter Island head Chris Blackwell wanted to transform Cliff into and the reggae hero Kong was busily creating. In the end, Cliff was left behind by both; Blackwell transferred his enthusiastic attentions to Bob Marley, while Kong died unexpectedly in 1972. &quot;Sitting in Limbo&quot; was Cliff's haunting lament to the aftermath. &quot;Struggling Man,&quot; &quot;If I Follow My Mind,&quot; and &quot;Sooner or Later,&quot; the first two title tracks to his 1974 and 1975 albums, respectively, all reflect Cliff's attempts to find his feet on his own. &quot;Give the People What They Want,&quot; the title track to his 1981 album, and two other cuts from that set show he finally had, and was now poised for even greater success. Skipping the rest of the decade, the collection picks back up with Cliff's 1993 hit cover of Johnny Nash's &quot;I Can See Clearly Now,&quot; and closes with one of the better tracks from the rather weak Humanitarian album\n\n\n1. Wonderful World, Beautiful People\t3:14\t\t \n2. Come Into My Life\t \t\t2:56\t \n3. Vietnam\t \t\t\t4:51\t \n4. Wild World\t \t\t\t3:52\t \n5. Hard Road To Travel\t \t\t2:37\t\t \n6. You Can Get It If You Really Want\t2:42\t\t \n7. Bongo Man\t \t\t\t4:06\t \n8. The Harder They Come\t \t\t3:40\t \n9. Many Rivers To Cross\t \t\t3:02\t \n10. Sitting In Limbo\t \t\t5:05\n11. Struggling Man\t \t\t3:28 \n12. If I Follow My Mind\t \t\t2:44\t \n13. The News\t \t\t\t3:21 \n14. Sooner Or Later\t \t\t5:14\t \n15. Give The People What They Want\t3:50\t \n16. Shelter Of Your Love\t \t3:32 \n17. Majority Rule\t \t\t3:38 \n18. I Can See Clearly Now\t \t3:15\t \n19. Rise Up\t\t\t\t3:51","torrent":{"xt":"urn:btih:da69e0bbe73fae0f1104abc12a4e14477ace7428","amp;dn":"Jimmy+Cliff+-+Ultimate+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da69e0bbe73fae0f1104abc12a4e14477ace7428","infoHashBuffer":{"type":"Buffer","data":[218,105,224,187,231,63,174,15,17,4,171,193,42,78,20,71,122,206,116,40]},"announce":[],"urlList":[]}}