{"title":"A Course in Miracles, Third Edition (epub, mobi, pdf)","uid":8178909,"size":12562948,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dab2f95f29984d8c4f7309ef864f6abd117ce311&amp;dn=A+Course+in+Miracles%2C+Third+Edition+%28epub%2C+mobi%2C+pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"pharmakate","files":-1,"time":1361587699,"description":"A Course in Miracles, Third Edition, as published by Foundation for Inner Peace; includes Text, workbook and Manual. Appears to be retail quality. Source is mobi; epub and pdf are calibre conversions from mobi. I tried to format the pdf so that it's reasonably useful, unlike typical calibre-generated pdf files.\n\nNote: there are numerous versions of ACIM on tpb and elsewhere on the web, but most are the so-called &quot;ur-text&quot; or public domain version. The version here is not the ur-text; it's the version most widely available in bookstores, etc. There are debates about the differences between them, but if you're looking for the &quot;Foundation&quot;/Ken Wapnick edition, this is it.\n\nThe torrent also contains the two volumes of The Plain Language A Course in Miracles, as translated by Elizabeth Cronkhite, in epub and mobi. The titles are The Message of A Course in Miracles (volume 1) and Practicing A Course in Miracles and The Way of A Course in Miracles (volume 2). Formatting appears different in each one, but both have a retail source. The purpose of the books is to restate the central teachings of ACIM in &quot;plain language.&quot;\n","torrent":{"xt":"urn:btih:dab2f95f29984d8c4f7309ef864f6abd117ce311","amp;dn":"A+Course+in+Miracles%2C+Third+Edition+%28epub%2C+mobi%2C+pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dab2f95f29984d8c4f7309ef864f6abd117ce311","infoHashBuffer":{"type":"Buffer","data":[218,178,249,95,41,152,77,140,79,115,9,239,134,79,106,189,17,124,227,17]},"announce":[],"urlList":[]}}