{"title":"PopCap Games Bookworm Adventures","uid":3588839,"size":26590317,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:dab31ff7838e9c391b49c3d127aafb52dfbab405&amp;dn=PopCap+Games+Bookworm+Adventures&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"phithe","files":3,"time":1167830605,"description":"Bookworm Adventures\n\nThe literary world has been hijacked, and Lex is the only worm buff enough to restore order. Help Lex by spelling your way through a saga of monstrous proportions that boasts a star-studded cast the likes of which Hollywood has never seen. You&amp;#039;ll revel in the witty companionship of Sinbad, shudder before the wretched &amp;#039;do of Medusa and sweat under the scrutiny of the awe-inspiring Sphinx.\n\nBookworm Adventures marks the return of everyone&amp;#039;s favorite bookworm, and this time you&amp;#039;ll have more than words to cut through the gauntlet standing between him and his goal. An ever-growing library of powerful treasures is your ace, and plentiful secrets await those who brave an array of stunning stories and brain-busting mini-games. So gird yourself with the knowledge of ancient gods, timeless heroes and eternal horrors. To survive an epic this bold, you&amp;#039;re gonna need all the help you can get!\n\nHelp Lex battle the biggest threat the Great Library has ever known! Perform wordy wonders to vanquish tons of villains. Boost your word power with gems, potions and treasures. Conquer exciting mini-games and brilliant bonus modes. It&amp;#039;s the ultimate test of vocab valor!\n\nEngaging storyline featuring three lengthy storybooks, each with its own unique theme.\n \nInfinitely replayable mini-games that put your word knowledge and spelling speed to the test.\n \nA comprehensive Tome of Knowledge detailing all the wondrous creatures you&amp;#039;ll encounter throughout the game.\n \nUnlock Arena mode for the ultimate challenge: a timed rematch with every boss from Bookworm Adventures!\n \n\nSystem Requirements:\n\nWindows 98SE, 2000, ME, XP, Vista\nPentium 700MHz \n256MB RAM \nDirectX 7\n\nInstall it , Get the fix out of fix folder and paste it in install directory. PLAY have FUN ! \n\n\n\n","torrent":{"xt":"urn:btih:dab31ff7838e9c391b49c3d127aafb52dfbab405","amp;dn":"PopCap+Games+Bookworm+Adventures","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dab31ff7838e9c391b49c3d127aafb52dfbab405","infoHashBuffer":{"type":"Buffer","data":[218,179,31,247,131,142,156,57,27,73,195,209,39,170,251,82,223,186,180,5]},"announce":[],"urlList":[]}}