{"title":"Julie Andrews - Thoroughly Modern Millie (1967)","uid":4561766,"size":1469997415,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:db0f942efa9b7dea3a7da2dc2fee75bfeace7b53&amp;dn=Julie+Andrews+-+Thoroughly+Modern+Millie+%281967%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"luciana-sabino","files":4,"time":1228704807,"description":"Positivamente Millie\n\nSinopse\n\nNova York, 1922. Millie Dillmount (Julie Andrews) chega na cidade e muda o visual para parecer bem moderna. Ela entÃƒÂ£o se hospeda no Priscilla, um hotel para jovens solteiras que ÃƒÂ© administrado pela Sra. Meers (Beatrice Lillie). que aparentemente ÃƒÂ© uma pessoa bem bondosa. Na verdade a Sra. Meers opera um outro negÃƒÂ³cio muito mais lucrativo, pois sequestra entre suas hÃƒÂ³spedes aquelas que nÃƒÂ£o tem ninguÃƒÂ©m no mundo, ou seja, aquelas as quais a falta nÃƒÂ£o serÃƒÂ¡ sentida, e as vende como escravas brancas. Millie tem uma meta arrumar um emprego como secretÃƒÂ¡ria e casar-se com seu chefe, que tem de ser alguÃƒÂ©m sem nenhum compromisso. No entanto, antes de arrumar um emprego Millie faz amizade com a bela Dorothy Brown (Mary Tyler Moore), um ÃƒÂ³rfÃƒÂ£ que quer ser artista. Millie acha trabalho com Trevor Graydon (John Gavin), um bonito e elegante solteiro, mas ele sÃƒÂ³ tem olhos para Dorothy. Por outro lado um vendedor de clipe para papel, Jimmy Smith (James Fox), faz de tudo para ter o amor de Millie. ApÃƒÂ³s uma festa na fantÃƒÂ¡stica mansÃƒÂ£o de Muzzy Van Hossmere (Carol Channing) em Long Island, Dorothy desaparece. JÃƒÂ¡ desconfiando da Sra. Meers, Jimmy e Millie revistam o quarto de Dorothy e encontram indÃƒÂ­cios de droga nas rosas que Graydon havia lhe enviado e entÃƒÂ£o nÃƒÂ£o resta mais dÃƒÂºvidas. Tentando salvar Dorothy e achar a localizaÃƒÂ§ÃƒÂ£o do esconderijo de Meers, Jimmy se disfarÃƒÂ§a como uma jovem ÃƒÂ³rfÃƒÂ£ e tenta ser seqÃƒÂ¼estrado. PorÃƒÂ©m o plano falha e a situaÃƒÂ§ÃƒÂ£o se complica bastante. \n\n\n\n\nElenco:\nJulie Andrews (Millie Dillmount)\nJames Fox (Jimmy Smith)\nMary Tyler Moore (Dorothy Brown)\nCarol Channing (Muzzy Van Hossmere)\nJohn Gavin (Trevor Gaydon)\nAnthony Dexter (Juarez)\nCavada Humphrey (Srta. Flannery)\nMichael St. Claire (BarÃƒÂ£o Ritcher)\nLisabeth Hush (Judith Tremaine)\nBeatrice Lillie (Sra. Meers)\nJack Soo\nPat Morita\n\n\nAno - 1967\n\nEUA\n\nDireÃƒÂ§ÃƒÂ£o: George Roy Hill\n\nPremiaÃƒÂ§ÃƒÂµes: \n\nGanhou o Oscar de Melhor Trilha Sonora Original, alÃƒÂ©m de ter sido indicado em outras 6 categorias: Melhor Atriz Coadjuvante (Carol Channing), Melhor DireÃƒÂ§ÃƒÂ£o de Arte, Melhor Figurino, Melhor CanÃƒÂ§ÃƒÂ£o Original (&quot;Thoroughly Modern Millie&quot;), Melhor Som e Melhor Trilha Sonora Adaptada.\n\nGanhou o Globo de Ouro de Melhor Atriz Coadjuvante (Carol Channing), alÃƒÂ©m de ter sido indicado em outras 4 categorias: Melhor Filme - ComÃƒÂ©dia/Musical, Melhor Atrzi - ComÃƒÂ©dia/Musical (Julie Andrews), Melhor Trilha Sonora e Melhor CanÃƒÂ§ÃƒÂ£o Original (&quot;Thoroughly Modern Millie&quot;).\n\n\nCuriosidades:\n\nEstrÃƒÂ©ia de Pat Morita no cinema.\n\nÃƒÅ¡ltimo filme da atriz Beatrice Lillie. Ao rodar Positivamente Millie a atriz jÃƒÂ¡ tinha muita dificuldade em memorizar suas falas, sendo necessÃƒÂ¡rio que Julie Andrews ficasse fora da visÃƒÂ£o da cÃƒÂ¢mera dizendo a ela o que precisava falar a cada cena.\n\nO orÃƒÂ§amento de Positivamente Millie foi de US$ 6 milhÃƒÂµes, sendo que o filme arrecadou US$ 40 milhÃƒÂµes nas bilheterias ao redor do planeta. \n\nO filme foi baseado no musical britÃƒÂ¢nico Chrysanthemum, que estreou em Londres em 1956.","torrent":{"xt":"urn:btih:db0f942efa9b7dea3a7da2dc2fee75bfeace7b53","amp;dn":"Julie+Andrews+-+Thoroughly+Modern+Millie+%281967%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db0f942efa9b7dea3a7da2dc2fee75bfeace7b53","infoHashBuffer":{"type":"Buffer","data":[219,15,148,46,250,155,125,234,58,125,162,220,47,238,117,191,234,206,123,83]},"announce":[],"urlList":[]}}