{"title":"InfiniteSkills Learning Corona SDK","uid":8719896,"size":1130464815,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:dc22027915a1613457ec56108b95f0bef0075e37&amp;dn=InfiniteSkills+Learning+Corona+SDK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"EliteBeast","files":-1,"time":1374402280,"description":"Duration 7.75 hours mp4 96 videos + project files\n\nIn this Corona SDK training course, expert author and developer Rafael Hernandez will teach you how to use this popular App Development platform from Corona Labs. Designed for the beginner to Corona SDK and the Lua Programming language, you do not need any prior mobile app development experience to learn how to use this powerful software development kit.\n\nYou will learn how to first set up your project, along with how to adjust settings and configurations for that project. You will learn how to create shapes, manipulate images, create text, and other graphical objects. The course will teach you how to create event listeners, and take action on event triggers. You will learn timers and animation, physics and collision detection, how to use multimedia, GPS and maps, capture user input, data management and much much more.\n\nBy the completion of this training course for the Corona SDK, you will be able to create mobile applications quickly and easily for iOS, Android and other popular mobile devices. The author has included working files to allow you to work alongside him as he shows you how to build working Apps with the Corona SDK and the Lua Programming language.","torrent":{"xt":"urn:btih:dc22027915a1613457ec56108b95f0bef0075e37","amp;dn":"InfiniteSkills+Learning+Corona+SDK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc22027915a1613457ec56108b95f0bef0075e37","infoHashBuffer":{"type":"Buffer","data":[220,34,2,121,21,161,97,52,87,236,86,16,139,149,240,190,240,7,94,55]},"announce":[],"urlList":[]}}