{"title":"Political Suicide in the Annals of American Politics","uid":15932425,"size":893359,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dc3521458e3ce60c3dcc7c657fd92bd3654af633&amp;dn=Political+Suicide+in+the+Annals+of+American+Politics&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"marty14","files":1,"time":1475368419,"description":"Political Suicide: Missteps, Peccadilloes, Bad Calls, Backroom Hijinx, Sordid Pasts, Rotten Breaks, and Just Plain Dumb Mistakes in the Annals of American Politics - Erin McHugh [epub]\r\n\r\nA collection of entertaining and cautionary tales of political missteps in American history, from the birth of the nation through the present day.\r\n\r\nJust in time for the presidential election of 2016 comes Political Suicide, a history of the best and most interesting missteps, peccadilloes, bad calls, back room hijinks, sordid pasts, rotten breaks, and just plain dumb mistakes in the annals of American politics.\r\n\r\nThey have tweeted their private parts to women they're trying to impress. They have gotten caught on tape doing and saying things they really shouldn't have. They have denied knowing about the underhanded doings of underlings ― only to have a paper trail lead straight back to them. Nowadays, it seems like half of what we hear about politicians isn't about laws or governing, but is instead coverage focused on shenanigans, questionable morals, and scandals too numerous to count. And while we shake our heads in disbelief, we still can't resist poring over the details of these notorious incidents.\r\n\r\nIn Political Suicide, the foibles of our politicians are brought from the tabloid pages to this entertaining ― and cautionary ― tale of American history","torrent":{"xt":"urn:btih:dc3521458e3ce60c3dcc7c657fd92bd3654af633","amp;dn":"Political+Suicide+in+the+Annals+of+American+Politics","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc3521458e3ce60c3dcc7c657fd92bd3654af633","infoHashBuffer":{"type":"Buffer","data":[220,53,33,69,142,60,230,12,61,204,124,101,127,217,43,211,101,74,246,51]},"announce":[],"urlList":[]}}