{"title":"Castle Story v0.6.0","uid":13670968,"size":359336404,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:dd0f8963dd9cc2a0e45cb35cd92fdcd1190a15bd&amp;dn=Castle+Story+v0.6.0&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"dauphong","files":1,"time":1456325666,"description":"Castle Story is a creative voxel-based strategy game in which you can build castles one brick at a time using an army of little characters called Bricktrons.\r\n\r\nYour goal will be to explore a vast landscape full of mysteries and dangers, and defend your castle against onslaughts of hostile creatures and possibly other players.\r\n\r\nThe world of Castle Story takes place on flying islands, high above an infinite ocean. The islands are made of voxels, cubes made of various elements, which means you can dig, carve and build anything you can imagine in the landscape. Digging underground to gather resources, stacking bricks on top of each other to build a wall or even tunnelling through a mountain is all possible and even necessary to keep your Bricktrons safe.\r\n\r\nCarefully designing your castle not only requires creativity and imagination, but thanks to pathfinding AI and physics simulations, Castle Story has layers of strategy and depth on top of an otherwise free-form sandbox experience.\r\n\r\nCastle Story will be released for Windows &amp; Mac (with possible Linux support once Unity4 is released)","torrent":{"xt":"urn:btih:dd0f8963dd9cc2a0e45cb35cd92fdcd1190a15bd","amp;dn":"Castle+Story+v0.6.0","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd0f8963dd9cc2a0e45cb35cd92fdcd1190a15bd","infoHashBuffer":{"type":"Buffer","data":[221,15,137,99,221,156,194,160,228,92,179,92,217,47,220,209,25,10,21,189]},"announce":[],"urlList":[]}}