{"title":"Death Note Trilogy-Dual Audio","uid":8630906,"size":4604801761,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ddcb9f3192d4b67c221993ebfd1e3fe14a77a84d&amp;dn=Death+Note+Trilogy-Dual+Audio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"horrorhound","files":-1,"time":1372627227,"description":"Death Note Trilogy-Dual Audio\n\n\n\nTechnical:\nMKV Format\nAll are Dual Audio\nAll have subs for signs and language subs\n720x400\n23.976 fps\n4.28GB total\n1-2 are mp3 sound, L is AC-3\n\n\n\n\nSynopsis:\n\n\nMovie 1\n\nYagami Light is a brilliant college student who, one day, finds a notebook simply titled &quot;Death Note.&quot; Inside of this book is a list of rules and details as for the use of the &quot;Death Note.&quot; When he realizes the power he holds, he decides he's going to make over the world. He wants to make it into a better place by killing those who do others harm. He has been nicknamed by the police &quot;Kira.&quot; L, a brilliant detective who lives in secrecy, rises from the shadows and puts his life on the line trying to capture Light. Both L and Light believe themselves on the side of Justice, and the two match wits trying to show exactly which of them is &quot;good&quot; and which of them is &quot;evil&quot;.\n\n\n\nMovie 2\n\nThe battle continues. L is still suspicious about Light Yagami. He still believes Yagami to be Kira and on the other hand Light Yagami met a girl who is believed to have Death Gods Eyes and a Death Note. Now there are two Kira. Will L succeed in tracking down Kira. Who will be the Last Name. Will Light succeed in creating the new world.\n\n\n\nMovie 3 L\n\nL has finally solved the &quot;Kira&quot; case in which countless criminals had died under mysterious circumstances, but sacrificed his own life in order to stop Kira, leaving himself with only 23 days left to live. For his final case, L goes up against a bio-terrorist group trying to wipe out humanity with a deadly mutated virus. As L tries to formulate an antidote with a scientist, he must also save the lives of two children who have no one else to turn to. Will L be able to save the world before its's too late? Witness the last 23 days of L.","torrent":{"xt":"urn:btih:ddcb9f3192d4b67c221993ebfd1e3fe14a77a84d","amp;dn":"Death+Note+Trilogy-Dual+Audio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ddcb9f3192d4b67c221993ebfd1e3fe14a77a84d","infoHashBuffer":{"type":"Buffer","data":[221,203,159,49,146,212,182,124,34,25,147,235,253,30,63,225,74,119,168,77]},"announce":[],"urlList":[]}}