{"title":"Bullet For My Valentine - Fever [2010]","uid":5506943,"size":118131286,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:def4135813098112b04f95fb62be465e0ac87eb5&amp;dn=Bullet+For+My+Valentine+-+Fever+%5B2010%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"MP3Nova","files":11,"time":1271864797,"description":"Bullet For My Valentine are a Welsh metalcore band from Bridgend, formed in 1998. The band is composed of Matt Tuck (lead vocals, rhythm guitar), Michael Paget (lead guitar), Jason James (bass guitar, backing vocals), and Michael Thomas (drums).\n\nThey were formed under the name Jeff Killed John and started their music career by covering songs by Metallica and Nirvana. Jeff Killed John recorded six songs which were not released; two of these tracks were reworked later in their career as Bullet for My Valentine.\n\nFinancial difficulties dictated the name change, which was followed by a change in music direction. In 2002, the band secured a five-album deal with Sony BMG. Their musical style has been stated to draw influence from classic heavy metal acts such as Metallica, Iron Maiden, and Slayer.\n\nBullet for My Valentine's debut album, The Poison, was released on 3 October 2005 in the United Kingdom and on 14 February 2006 in the United States to coincide with Valentine's Day. The album entered the Billboard 200 in the US at number 128. It was certified Gold by the Recording Industry Association of America.\n\nThe band made appearances at the Download Festival and Kerrang! XXV, and undertook a US tour with Rob Zombie. Bullet for My Valentine's second studio album, Scream Aim Fire, was released on 29 January 2008 and debuted at number four on the Billboard 200.\n\nThe band's third album, Fever, will be released on 27 April 2010. The band has sold over two million albums worldwide.\n\nMembers :\n\nMatt Tuck\nMichael Paget\nJason James\nMichael Thomas\n\n\nGenre..:   Core\nBitrate:   320 k\nSize...:   112.66 MB\n\nFever [2010]\n\n1. Your Betrayal\n2. Fever\n3. The Last Fight\n4. A Place Where You Belong\n5. Pleasure and Pain\n6. Alone\n7. Breaking Out Breaking Down\n8. Bittersweet Memories\n9. Dignity\n10. Begging For Mercy\n11. Pretty On The Outside\n\nEnjoy and support the artist !","torrent":{"xt":"urn:btih:def4135813098112b04f95fb62be465e0ac87eb5","amp;dn":"Bullet+For+My+Valentine+-+Fever+%5B2010%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"def4135813098112b04f95fb62be465e0ac87eb5","infoHashBuffer":{"type":"Buffer","data":[222,244,19,88,19,9,129,18,176,79,149,251,98,190,70,94,10,200,126,181]},"announce":[],"urlList":[]}}