{"title":"Devo - 8 Albums (1978-1999) [FLAC]","uid":9633302,"size":3094730062,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:dfe9aaef5e1a3c772ff34a096e92cacff61dd2e7&amp;dn=Devo+-+8+Albums+%281978-1999%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":5,"uploader":"politux","files":-1,"time":1392816277,"description":"\n  Devo - 8 Albums (1978-1999) [FLAC]\n\n  Genre: Pop/Rock\n  Style: New Wave\n  Source: CD \n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44.1 KHz\n\n  2008 Remasters\n\n  1978 Q: Are We Not Men? A: We Are Devo!\n  1979 Duty Now for the Future\n  1980 Freedom of Choice\n  1981 New Traditionalists\n  1982 oh, no! it's DEVO\n  1984 Shout\n  1999 DEV-O Live\n\n  Other\n\n  2000 Pioneers Who Got Scalped - The Anthology\n\n  One of new wave's most innovative and (for a time) successful bands, Devo was also perhaps one of its most misunderstood. Formed in Akron, OH, in 1972 by Kent State art students Jerry Casale and Mark Mothersbaugh, Devo took its name from their concept of &quot;de-evolution&quot; -- the idea that instead of evolving, mankind has actually regressed, as evidenced by the dysfunction and herd mentality of American society. Their music echoed this view of society as rigid, repressive, and mechanical, with appropriate touches -- jerky, robotic rhythms; an obsession with technology and electronics (the group was among the first non-prog rock bands to make the synthesizer a core element); often atonal melodies and chord progressions -- all of which were filtered through the perspectives of geeky misfits. \n\n  Devo became a cult sensation, helped in part by their concurrent emphasis on highly stylized visuals, and briefly broke through to the mainstream with the smash single &quot;Whip It,&quot; whose accompanying video was made a staple by the fledgling MTV network. Sometimes resembling a less forbidding version of the Residents, Devo's simple, basic electronic pop sound proved very influential, but it was also somewhat limited, and as other bands began expanding on the group's ideas, Devo seemed unable to keep pace. After a series of largely uninteresting albums, the band called it quits early in the '90s, and Casale and Mothersbaugh concentrated on other projects.\n\n  Casale and Mark Mothersbaugh both attended art school at Kent State University at the outset of the '70s. With friend Bob Lewis, who joined an early version of Devo and later became their manager, the theory of de-evolution was developed with the aid of a book entitled The Beginning Was the End: Knowledge Can Be Eaten, which held that mankind had evolved from mutant, brain-eating apes. The trio adapted the theory to fit their view of American society as a rigid, dichotomized instrument of repression which ensured that its members behaved like clones, marching through life with mechanical, assembly-line precision and no tolerance for ambiguity. The whole concept was treated as an elaborate joke until Casale witnessed the infamous National Guard killings of student protesters at the university; suddenly there seemed to be a legitimate point to be made. The first incarnation of Devo was formed in earnest in 1972, with Casale (bass), Mark Mothersbaugh (vocals), and Mark's brothers Bob (lead guitar) and Jim, who played homemade electronic drums. Jerry's brother Bob joined as an additional guitarist, and Jim left the band to be replaced by Alan Myers. \n\n  The group honed its sound and approach for several years (a period chronicled on Rykodisc's Hardcore compilations of home recordings), releasing a few singles on its own Booji Boy label and inventing more bizarre concepts: Mothersbaugh dressed in a baby-faced mask as Booji Boy (pronounced &quot;boogie boy&quot;), a symbol of infantile regression; there were recurring images of the potato as a lowly vegetable without individuality; the band's costumes presented them as identical clones with processed hair; and all sorts of sonic experiments were performed on records, using real and homemade synthesizers as well as toys, space heaters, toasters, and other objects. Devo's big break came with its score for the short film The Truth About De-Evolution, which won a prize at the 1976 Ann Arbor Film Festival; when the film was seen by David Bowie and Iggy Pop, they were impressed enough to secure the group a contract with Warner Bros.","torrent":{"xt":"urn:btih:dfe9aaef5e1a3c772ff34a096e92cacff61dd2e7","amp;dn":"Devo+-+8+Albums+%281978-1999%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfe9aaef5e1a3c772ff34a096e92cacff61dd2e7","infoHashBuffer":{"type":"Buffer","data":[223,233,170,239,94,26,60,119,47,243,74,9,110,146,202,207,246,29,210,231]},"announce":[],"urlList":[]}}