{"title":"Denying to the Grave - Sara E. Gorman","uid":16033525,"size":1341868,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e0513af705e54f26ba9454d7343e4e919ef119fb&amp;dn=Denying+to+the+Grave+-+Sara+E.+Gorman&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":4,"uploader":"mr_mando","files":1,"time":1476453579,"description":"\nDenying to the Grave:   Why We Ignore the Facts That Will Save Us\r\nSara E. Gorman and Jack M. Gorman\r\n \r\nWhy do some parents refuse to vaccinate their children? Why do some people keep guns at home, despite scientific evidence of risk to their family members? And why do people use antibiotics for illnesses they cannot possibly alleviate? When it comes to health, many people insist that science is wrong, that the evidence is incomplete, and that unidentified hazards lurk everywhere. \r\n\r\nIn Denying to the Grave, Gorman and Gorman, a father-daughter team, explore the psychology of health science denial. Using several examples of such denial as test cases, they propose six key principles that may lead individuals to reject &quot;accepted&quot; health-related wisdom: the charismatic leader; fear of complexity; confirmation bias and the internet; fear of corporate and government conspiracies; causality and filling the ignorance gap; and the nature of risk prediction. The authors argue that the health sciences are especially vulnerable to our innate resistance to integrate new concepts with pre-existing beliefs. This psychological difficulty of incorporating new information is on the cutting edge of neuroscience research, as scientists continue to identify brain responses to new information that reveal deep-seated, innate discomfort with changing our minds. \r\n\r\nDenying to the Grave explores risk theory and how people make decisions about what is best for them and their loved ones, in an effort to better understand how people think when faced with significant health decisions. This book points the way to a new and important understanding of how science should be conveyed to the public in order to save lives with existing knowledge and technology","torrent":{"xt":"urn:btih:e0513af705e54f26ba9454d7343e4e919ef119fb","amp;dn":"Denying+to+the+Grave+-+Sara+E.+Gorman","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0513af705e54f26ba9454d7343e4e919ef119fb","infoHashBuffer":{"type":"Buffer","data":[224,81,58,247,5,229,79,38,186,148,84,215,52,62,78,145,158,241,25,251]},"announce":[],"urlList":[]}}