{"title":"Instant Selenium Testing Tools Starter [PDF}~Storm~","uid":9498949,"size":1756560,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e10210554bfc6922c3f1caa55272399bf6969f93&amp;dn=Instant+Selenium+Testing+Tools+Starter+%5BPDF%7D%7EStorm%7E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"steelballz","files":-1,"time":1390172191,"description":"Instant Selenium Testing Tools Starter\nAuthor: Unmesh Gundecha\nPublished: April 25, 2013\nPublisher: Packt Publishing\nISBN: 1782165150\nFormat: Retail PDF\nReader Required: Adobe Reader, Adobe Digital Editions\n\nTested on the above readers with no problems on laptop and Android tablet.\nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss.\nPlease allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nEnjoy! :D\n\n\n\n\n\nProduct Description\n\n\nIn Detail\n\nSelenium is a software testing framework for automating web applications for testing purposes. It uses components such as Selenium IDE, Selenium Client API, and Selenium Webdriver to test web applications, which provides an easy-to-use platform and lets you test your applications more effectively and efficiently.\n\n&quot;Instant Selenium Testing Tools Starter&quot; was born out of the need for a short, yet all-encompassing book that would give you a solid foundation in creating and running tests with Selenium testing tools. This book will enable you to harness the power of Selenium and put it to good use throughout the testing process, quickly and efficiently.\n\nThe &quot;Instant Selenium Testing Tools Starter&quot; can be used as an end-to-end guide or as a desk reference, with sections that deal with all the key aspects of automating tests for web applications. A step-by-step description of key features is provided with the help of simple and concise examples. Each chapter will help you understand the key features of Selenium with tips and tricks that will become the foundation of your knowledge in the future.\n\nApproach\n\nGet to grips with a new technology, understand what it is and what it can do for you, and then get to work with the most important features and tasks.A quick starter for testing web applications easily and efficiently\n\nWho this book is for\n\nThis book is intended for software quality assurance/testing professionals, and software developers who want to start using Selenium for testing web-based applications.\n\n\n","torrent":{"xt":"urn:btih:e10210554bfc6922c3f1caa55272399bf6969f93","amp;dn":"Instant+Selenium+Testing+Tools+Starter+%5BPDF%7D%7EStorm%7E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e10210554bfc6922c3f1caa55272399bf6969f93","infoHashBuffer":{"type":"Buffer","data":[225,2,16,85,75,252,105,34,195,241,202,165,82,114,57,155,246,150,159,147]},"announce":[],"urlList":[]}}