{"title":"Dig! - 2004","uid":8807244,"size":732360906,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e149a18637eba5faeae21ecbc3c960c68dd9ab42&amp;dn=Dig%21+-+2004&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"thelastb","files":-1,"time":1376367341,"description":" A documentary about two rocks bands, spanning a number of years. Brian   \n   Jonestown Massacre and the Dandy Warhols. What makes it special is the   \n   examination of the complex contrasting personalities and the ironies     \n   of success and failure.                                                  \n                                                                            \n   Anton Newcombe, the main man of Brian Jonestown Massacre, is widely     \n   recognised as a musical genius not only by his colleagues, his friends   \n   and rivals the Dandy Warhols, but also by record producers and most      \n   people who have worked with him. Sadly he and his band members are       \n   also incapable of integrating with the real world. Newcombe picks        \n   fights with band members on stage or with members of the audience        \n   (getting arrested at one point for literally kicking in the head of a    \n   fan). Newcombe knows no limits - he plays between 40 and 100 different   \n   instruments, writes and produces all BJM's music, can produce enough     \n   songs to fill a whole album in a single day, has a prophet-like          \n   obsessiveness with his own musical genius, but is also a heavy drugs     \n   user, flies into rages at the slightest compromise of his own artistic \n   integrity, orders his band members about as if they are lower forms of   \n   life, and can blow deals as fast as he makes them. BJM go through a      \n   large number of record labels in fast succession - they sign them up     \n   as soon as they realise Newcombe's talents and let them go as soon as    \n   they realise he is totally uncontrollable.                               \n                                                                            \n   The Warhols acknowledge their debt to Newcombe's creativity and don't    \n   even put themselves in the same exalted sphere of greatness - but the    \n   Warhols have something that BJM don't - the ability to integrate their   \n   talents with common sense, the real world, and their market - as a       \n   mixing pot of talent (even if much of it is distilled from guru          \n   Newcombe) and accessibility, they are the very definition of 'cool.'     \n   DiG! follows the parallel careers of the two bands with increasing       \n   poignancy. At one point, Newcombe pulls stunts designed to generate      \n   publicity by sending apparent death threats and hate messages to the     \n   Warhols (in a box containing live ammunition and insults like a bar of   \n   soap 'to clean up their act') - only he forgets to tell them it's a      \n   stunt and they get so paranoid they take out a restraining order         \n   against Newcombe. By the time the Dandy Warhols take off in Europe       \n   with hits like 'Every Day Should Be A Holiday' and 'Bohemian Like        \n   You', Newcombe is becoming increasingly isolated. BJM are stopped and    \n   the band breaks up when they are arrested for possession of marijuana    \n   - the Warhols get busted for drugs around the same time, let off with    \n   a warning, and even allowed to keep the grass.                           \n                                                                            \n   The wider appeal of DiG! is that the lessons of genius versus            \n   accessibility go way beyond two bands or even rock music. The downside   \n   is that it is still a documentary, however intimate, and it will         \n   mostly only appeal to dedicated film fans or people who are already      \n   interested in the music of one or both of the featured bands. Newcombe   \n   may well be a largely unrecognised genius, and there are feint           \n   glimpses of this in the film, but to the unattuned ear there is little   \n   more than the assertions of the people interviewed to attest to this.    \n   In the words of one of the band members: &quot;In every spiritual             \n   tradition, you burn in hell for pretending to be God and not being       \n   able to back it up.&quot; Newcombe isn't pretending - but numerically there   \n   are maybe still insufficient people to appreciate him in his own         \n   lifetime, and DiG! has an uphill struggle to rectify the balance in      \n   favour of a tortured but largely unrecognised genius.                    \n\n\n    \n      Movie Rip \n   Language(s) _____________ English                                        \n   Subtitle(s) _____________ English, Spanish                                     \n   Feature Length __________ 1 hour, 46 minutes, 32 seconds                 \n   Video Codec _____________ XviD [http://www.xvid.org/]                    \n   Video Stats _____________ 576x416 / 1.385:1 / 778kbps / 25.000 FPS       \n   Audio #1 Codec __________ MP3                                            \n   Audio #1 Stats __________ 125kbps / 48kHz / VBR / 16-bit / J.Stereo      \n   Streams/Total Kbps ______ 2: 916kbps                                     \n\n\nENJOY AND SHARE PLEASE\n\nwearethelastbeatniks","torrent":{"xt":"urn:btih:e149a18637eba5faeae21ecbc3c960c68dd9ab42","amp;dn":"Dig%21+-+2004","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e149a18637eba5faeae21ecbc3c960c68dd9ab42","infoHashBuffer":{"type":"Buffer","data":[225,73,161,134,55,235,165,250,234,226,30,203,195,201,96,198,141,217,171,66]},"announce":[],"urlList":[]}}