{"title":"Alta FedeltÃƒÂ  - High Fidelity (DvdRip ITA, subs ENG)","uid":5178129,"size":734250908,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e1b55729b8e1ed8287b923cfe756f5d22abce50b&amp;dn=Alta+Fedelt%C3%83%C2%A0+-+High+Fidelity+%28DvdRip+ITA%2C+subs+ENG%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"black mamba TNT","files":-1,"time":1259087021,"description":"SCHEDA DEL FILM:\n\nTitolo originale: High Fidelity\nAnno: 2000\nGenere: Commedia\nRegia: Stephen Frears\nCast: John Cusack, Jack Black, Lisa Bonet, Joelle Carter, Iben Hjele, Todd Louiso, Lili Taylor, Natasha Gregson Wagner, Catherine Zeta Jones, Tim Robbins, Joan Cusak\n\nAudio: Italiano\nSottotitoli: Inglese\n\n\nINFO: &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0146882/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0146882/&lt;/a&gt;\n\n\nTRAMA:\n\nRob Gordon (John Cusak), ÃƒÂ¨ il proprietario di un fallimentare negozio di dischi di Chicago. Ed ÃƒÂ¨ qui, al Championnship Vinyl, che Rob trascorre le sue giornate in compagnia dei suoi dipendenti Dick (Todd Louiso) e Barry (Jack Black)...\n\n\nRECENSIONE:\n\nSe metÃƒÂ  dei film che transitano per i nostri schermi sono commedie sentimentali, era un bel po' di tempo che non se ne vedeva una divertente e intelligente, aggraziata e disincantata come Alta fedeltÃƒÂ . All'origine c'ÃƒÂ¨ il best-seller omonimo dell'inglese Nick Hornby e britannico, anche se spesso attivo negli States, ÃƒÂ¨ il regista Stephen Frears. PerÃƒÂ² la produzione ÃƒÂ¨ americana, americani gli attori e la screenplay sposta l'azione da Londra a Chicago. Fino dalla prima scena Rob (John Cusack, anche co-sceneggiatore), che gestisce un piccolo negozio di dischi nella &quot;wind city&quot;, si rivolge direttamente allo spettatore. Lo farÃƒÂ  lungo l'intero film, per comunicargli le sue personali classifiche top-five su tutto: dalle cinque canzoni piÃƒÂ¹ belle alle cinque donne della sua vita. La prima, dopo una love-story durata sei ore, lo ha piantato alle medie; poi, via via, lo hanno lasciato le altre. L'ultima, Laura (Iben Hjejle), se n'ÃƒÂ¨ appena andata di casa. Mentre si chiede che cosa non vada in lui (ma nel frattempo non si nega un'avventura con la bella cantante country Lisa Bonet), divide le giornate con i suoi due dipendenti: il timido Dick e Barry, bestione musicomane che spaventa i clienti. In realtÃƒÂ  Rob ÃƒÂ¨ un maschietto contemporaneo come tanti altri, allo stesso tempo bugiardo e sentimentale, bisognoso di trasgressione e ansioso di stabilitÃƒÂ ; abituato a filtrare le emozioni attraverso le canzoni che ama. AltÃƒÂ  fedeltÃƒÂ  ÃƒÂ¨ il tipo di commedia che ti fa sentire a casa fino dalle prime inquadrature; un po' attuale, come lo ÃƒÂ¨ sempre una storia di sentimenti, un po' fuori-moda, come i dischi di vinile che il protagonista si ostina a vendere contro l'imperante tecnologia del CD. Meno &quot;sociale&quot; che nei film realizzati in Inghilterra, meno preoccupato di quando dirige ad alto budget per Hollywood, Stephen Frears appare perfettamente a proprio agio: muove i personaggi sulle note di una ricchissima colonna sonora, fa colloquiare Rob con Springsteen, si avvale di un cast femminile che include la star Catherine Zeta-Jones, la musa del cinema indipendente Lili Taylor e Joan Cusack (sorella di John nella realtÃƒÂ ) nella parte di un'amica. Divertente, benchÃƒÂ© sovraccaricato, il &quot;cammeo&quot; di Tim Robbins, rivale in amore col codino alla Steven Seagal. Ma si consiglia di tenere d'occhio soprattutto Jack Black nella parte di Barry, il commesso fanatico del pop: giÃƒÂ  visto sullo schermo in piccoli ruoli, cantante dei Tenacious D., Black ÃƒÂ¨ una specie di John Belushi prima maniera, di irresistibile simpatia.\n\n\n\nSCHEDA TECNICA DEL RIP:\n\nDimensione: 700 Mb\nDurata: 01:46:02\n\nVideo Codec: DivX 3 Low-Motion\nVideo Bitrate: 820 kbps\nRisoluzione: 696 x 394\nFPS (Frames/sec): 25.000\nQF (Frame quality): 0.120\n\nAudio Codec: Mp3\nAudio Bitrate: 96 kb/s total (2 chnls)\nFreq Audio: 48000 Hz\n\n\nSCREENSHOTS:\n &lt;a href=&quot;\nhttp://i531.photobucket.com/albums/dd358/ShivaShanti75/bscap0007fj.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i531.photobucket.com/albums/dd358/ShivaShanti75/bscap0007fj.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i531.photobucket.com/albums/dd358/ShivaShanti75/bscap0016zu.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i531.photobucket.com/albums/dd358/ShivaShanti75/bscap0016zu.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i531.photobucket.com/albums/dd358/ShivaShanti75/bscap0027ga.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i531.photobucket.com/albums/dd358/ShivaShanti75/bscap0027ga.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:e1b55729b8e1ed8287b923cfe756f5d22abce50b","amp;dn":"Alta+Fedelt%C3%83%C2%A0+-+High+Fidelity+%28DvdRip+ITA%2C+subs+ENG%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1b55729b8e1ed8287b923cfe756f5d22abce50b","infoHashBuffer":{"type":"Buffer","data":[225,181,87,41,184,225,237,130,135,185,35,207,231,86,245,210,42,188,229,11]},"announce":[],"urlList":[]}}