{"title":"Pilgrim's Progress - Journey To Heaven (Christian Movie)","uid":4510882,"size":922275164,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e1c801a6fe26f50593e13ebb963d87a95b2a9c2f&amp;dn=Pilgrim%5C%27s+Progress+-+Journey+To+Heaven+%28Christian+Movie%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":2,"uploader":"IndianChristian","files":3,"time":1226774025,"description":"Pilgrim&amp;#039;s Progress - Journey To Heaven (Christian Movie)\n\nBased on John Bunyan&amp;#039;s literary classic, Pilgrim&amp;#039;s Progress is a powerful allegory of the life of a believer on a journey from the City of Destruction to the Celestial City. \n\nAmazing visual effects, beautiful locations and a wonderful cast bring to life the story that has inspired each generation for hundreds of years. Follow Christian and his companions on the great journey from the City of Destruction to the gates of Heaven. Along the way, the pilgrims face obstacles large and small, man-made and demon-spawned. Beyond the gripping drama, Bunyon&amp;#039;s powerful allegory teaches us the hazards and hopes of the Christian life, and the triumphant glory that awaits all who faithfully follow the King of Kings! \n\nHighly recommended for all Christians to use as soul winning tool. This is an awesome evangelism tool for non-Christians. The movie explains the life of a real believer who follows Jesus Christ. The message of this film tells briefly but exactly how it is that a Christian who tries to serve Jesus with all his heart goes through (spiritually). At various stages of a Christians life Satan will be sowing seeds of doubts and thorns (example Bible is false - evolution is true, Jesus Christ never existed, Jesus Christ was never resurrected, hatred against Christians, Riots against Christians etc) so that a Christian stops following Christ. The film explains to us that following Jesus Christ is NOT EASY. But if you have accepted him as your LORD and SAVIOR, the CONFORTER (Holy Spirit) is there with you to help you go through it all. This movie is worth watching, and is worth every penny, it&amp;#039;s more than just a film, this is a brief summary of how a REAL CHRISTIAN lives day in and day out. \n \nFollowing Jesus Christ is far more exciting than you can every imagine, knowing that the King of Kings is waiting for you in heaven makes you want to go the distance.  \n\nLanguage: English\nSubtitles: None\nRun Time: 106 minutes\nMy Rating: 9.5/10\nQuality: 9.0/10 (Cinemascope)\nRelease Date: 01-Jul-2008\n\nIf financially possible, please buy this CD/DVD to keep Christian films in business. If Christians won&amp;#039;t buy Christian films then who will?\n\nPlease seed. Let each one of us who call ourself Christians seed 2-3 movies each. So that these movies may become a blessing to all those who are hungry for God&amp;#039;s word &amp; grace. May Jesus bless all those who are seeding the christian torrents.\n\n&quot;Don&amp;#039;t ask me what Christ can do for you! \nHe has done all he could. \nTell me what you can do for Christ?&quot;\n\nUploaded by Indian Christian\n","torrent":{"xt":"urn:btih:e1c801a6fe26f50593e13ebb963d87a95b2a9c2f","amp;dn":"Pilgrim%5C%27s+Progress+-+Journey+To+Heaven+%28Christian+Movie%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1c801a6fe26f50593e13ebb963d87a95b2a9c2f","infoHashBuffer":{"type":"Buffer","data":[225,200,1,166,254,38,245,5,147,225,62,187,150,61,135,169,91,42,156,47]},"announce":[],"urlList":[]}}