{"title":"Me Talk Pretty One Day - David Sedaris-viny","uid":6418506,"size":636610,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e1dbc9f8159154a0bfa9d0e9fb05776104e9dee6&amp;dn=Me+Talk+Pretty+One+Day+-+David+Sedaris-viny&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"daemonx0x","files":-1,"time":1306237441,"description":"Me Talk Pretty One Day - David Sedaris-viny\n\nDavid Sedaris's fourth book mines poignant comedy from his peculiar childhood in North Carolina, his bizarre career path, and his move with his lover to France. Though his anarchic inclination to digress is his glory, Sedaris does have a theme in these reminiscences: the inability of humans to communicate.\n\nThe title is his rendition in transliterated English of how he and his fellow students of French in Paris mangle the Gallic language. In the essay &quot;Jesus Shaves,&quot; he and his classmates from many nations try to convey the concept of Easter to a Moroccan Muslim. &quot;It is a party for the little boy of God,&quot; says one. &quot;Then he be die one day on two... morsels of... lumber,&quot; says another. Sedaris muses on the disputes between his Protestant mother and his father, a Greek Orthodox guy whose Easter fell on a different day. Other essays explicate his deep kinship with his eccentric mom and absurd alienation from his IBM-exec dad: &quot;To me, the greatest mystery of science continues to be that a man could father six children who shared absolutely none of his interests.&quot;\n\nEvery glimpse we get of Sedaris's family and acquaintances delivers laughs and insights. He thwarts his North Carolina speech therapist (&quot;for whom the word pen had two syllables&quot;) by cleverly avoiding all words with s sounds, which reveal the lisp she sought to correct. His midget guitar teacher, Mister Mancini, is unaware that Sedaris doesn't share his obsession with breasts, and sings &quot;Light My Fire&quot; all wrong--&quot;as if he were a Webelo scout demanding a match.&quot; As a remarkably unqualified teacher at the Art Institute of Chicago, Sedaris had his class watch soap operas and assign &quot;guessays&quot; on what would happen in the next day's episode.\n\nIt all adds up to the most distinctively skewed autobiography since Spalding Gray's Swimming to Cambodia.","torrent":{"xt":"urn:btih:e1dbc9f8159154a0bfa9d0e9fb05776104e9dee6","amp;dn":"Me+Talk+Pretty+One+Day+-+David+Sedaris-viny","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1dbc9f8159154a0bfa9d0e9fb05776104e9dee6","infoHashBuffer":{"type":"Buffer","data":[225,219,201,248,21,145,84,160,191,169,208,233,251,5,119,97,4,233,222,230]},"announce":[],"urlList":[]}}