{"title":"Colin Stetson - New History Warfare Vol. 2: Judges (2011) Jazz","uid":6248704,"size":108895001,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e1fe6663e28ccc9ba4d939789fc5529ea75d03de&amp;dn=Colin+Stetson+-+New+History+Warfare+Vol.+2%3A+Judges+%282011%29+Jazz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1300322859,"description":"Colin Stetson\nNew History Warfare\nVolume 2: Judges (2011)\n\n\nWoodwind player Colin Stetson can play powerfully while circularly breathing for long periods, can draw multiphonics out of a sax with great skill, and can command an audience's attention with his focus and melodic improvisations. Stetson was born and raised in Ann Arbor, MI, where he became proficient on assorted saxophones, clarinet, and flute. He earned a degree in music from his hometown school the University of Michigan in 1997, studying with Roscoe Mitchell, Donald Sinta, and Christopher Creviston; afterward, he went on to study with Steve Adams and Henry Threadgill as well. While still in college, he co-founded Transmission (which later became Transmission Trio), and in 1998 he played with progressive Detroit-area jazz-rockers Larval on their Knitting Factory album Larval 2. He moved to the San Francisco Bay Area that summer along with the rest of Transmission, who released their first album in 1999. Stetson also branched out to play with the People's Bizarre, a chamber jazz group influenced by Eastern European folk, and Connector, which blended acoustic and electronic instrumentation. In the meantime, he also played live with the likes of Fred Frith, Peter Kowald, Ned Rothenberg, and Kenny Wollesen, and kept up his Detroit/Ann Arbor connections as well. Before moving west, he had played on his friend Recloose's debut EP for Planet E, and their collaborations continued over the years, culminating in the DJ's acclaimed full-length Cardiology in 2002. Also that year, Tom Waits tapped Stetson for reed work on his Alice and Blood Money albums, which led to significant exposure and a live performance on The Late Show with David Letterman. Stetson had a limited-edition 3&quot; CD release of a 2002 performance at the Artship in Oakland, and his full-length debut as a leader came in the summer of 2003 with the quintet recording Slow Descent. He also has his own website at www.colinstetson.com. In 2008, Stetson delivered the primarily solo saxophone album New History of Warfare, Vol. 1. He returned in 2011 with New History of Warfare, Vol. 2: Judges, which featured spoken word sections from avant-garde singer Laurie Anderson.\n\nChannels:\t\t2 (Stereo)\nSample Rate:\t\t44.1 KHz\nSample Size:\t\t16 bit\nBit Rate:\t\t320 kbps\n\nAudio Quality:\t\tVery High (Lossy)\nEncoder Settings:\tConstant Bit Rate 320 kbps (Insane)\nContains:\t\tAlbum Art, ID Tag [ID3v2.3 (ANSI) &amp; ID3v1.1]\nM3U Playlist:\t\tYes\n\nFormat:\t\t\tMp3\nGenre:\t\t\tJazz\t\nLabel:\t\t\tConstellation\n\n\nColin Stetson's 2008 album New History Warfare, Vol. 1 showcased the saxophonist/multi-reedist's phenomenal multiphonic improvisation style and circular breathing technique. Released in 2011, New History Warfare, Vol. 2: Judges features a similar exploratory solo saxophone approach that is nothing short of mind-blowing. Stetson uses the circular breathing style, recorded in single takes and occasionally with overdubs, to create atmospheric and hypnotic loops that sound like layered analog keyboards more than saxophones. In that sense, the tracks here often bring to mind something along the lines of Jean Michel Jarre crossed with Roscoe Mitchell. These tracks allow Stetson to skronk and pulse, wheeze and then soar with white jet-engine noise that is never purposeless and always controlled. Also featured here are a few spoken word sections with avant-garde icon Laurie Anderson -- including the poetic &quot;A Dream of Water&quot; -- that lend a cinematic quality to the proceedings. Elsewhere, vocalist Shara Worden delivers a haunting lead on the spiritual &quot;Lord I Just Can't Keep from Crying Sometimes.&quot; Primarily, however, it is Stetson's transcendent and muscular ability to layer sound, breath, and rhythm in a meditative compositional style that sticks with you long after Judges is over.\n\n\nTrack List:\n\n01.Awake On Foreign Shores\n02.Judges\n03.The Stars In His Head (Dark Lights Remix)\n04.All The Days I've Missed You (Ilaij I)\n05.From No Part Of Me Could I Summon A Voice\n06.A Dream Of Water\n07.Home\n08.Lord I Just Can't Keep From Crying Sometimes\n09.Clothed In The Skin Of The Dead\n10.All The Colors Bleached To White (Ilaij II)\n11.Red Horse (Judges Ll)\n12.The Righteous Wrath Of An Honorable Man\n13.Fear Of The Unknown And The Blazing Sun\n14.In Love And In Justice\n\n\n\nThanks to &quot;webchella&quot; for his previous upload!\n\n\n\n\nCheers!","torrent":{"xt":"urn:btih:e1fe6663e28ccc9ba4d939789fc5529ea75d03de","amp;dn":"Colin+Stetson+-+New+History+Warfare+Vol.+2%3A+Judges+%282011%29+Jazz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1fe6663e28ccc9ba4d939789fc5529ea75d03de","infoHashBuffer":{"type":"Buffer","data":[225,254,102,99,226,140,204,155,164,217,57,120,159,197,82,158,167,93,3,222]},"announce":[],"urlList":[]}}