{"title":"Bountiful - Recipes Inspired by Our Garden (gnv64)","uid":10445138,"size":34182516,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e21aae39642a9249c873c44493488a8f9c5937ff&amp;dn=Bountiful+-+Recipes+Inspired+by+Our+Garden+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"gnv65","files":-1,"time":1403944602,"description":"Bountiful: Recipes Inspired by Our Garden \nby Todd Porter and Diane Cu \nStewart, Tabori and Chang | October 2013 | ISBN-10: 1617690481 | ePUB | 159 pages | 32.5 mb\n\nTodd Porter and Diane Cu are photographers who publish the immensely popular food, gardening, and lifestyle blog WhiteonRiceCouple.com. Inspired by their love of cooking, growing vegetables and over 38 fruit trees in their suburban garden, Todd and Diane love sharing recipes that are fresh and seasonally simple. Their cookbook, Bountiful ,offers 100 seasonal, flavorful, and approachable recipes, 90 of which have not been seen on the blog, each featuring a vegetable or fruit as the star of the meal. Blueberry Frangipane Tarts, Wilted Mizuna Shrimp Salad, Blood Orange Bars and Gin Cocktail with Pomegranate &amp; Grapefruit are just a few examples of recipes that are inspired from their garden bounty.  \nPeppered with personal stories from Todd's childhood on a cattle ranch in Oregon and Diane's journey from Vietnam to the United States, this cookbook shares the couples' beautiful love story as well as their diverse recipes that reflects their love of fresh and healthy produce, seasonally ripe fruit and sharing a home cooked meal with those you love.\n\nAbout the Authors\nTodd Porter and Diane Cu are professional food photographers and stylists and publish the acclaimed food, recipe, and lifestyle blog WhiteonRiceCouple.com. They are also avid gardeners, busy home cooks and encourage others to share meals with those they love. The popularity of their blog stems from their shared stories of life and food that connect us all. Beyond the blog, their professional work includes clients such as Whole Foods, Williams-Sonoma, Thermador, KitchenAid, Food &amp; Wine Magazine, and the Cooking Channel. They are also photography instructors, teach speciality cooking classes and are sought-after speakers at industry conferences. Todd and Diane have been featured in Sunset magazine, Food &amp; Wine Magazine, Los Angeles Times and on the Cooking Channel.\n\nCONTENTS\nIntroduction\nGarden Planning\nPantry and Kitchen notes\n\nVegetables\nTomatoes\nHerbs &amp; Leafy Greens\nBeans, Stalks &amp; Shoots\nBroccoli &amp; Other Cruciferous Vegetables\nRoots &amp; Bulbs\nSquashes\nPeppers &amp; Chilies\nOther Vegetable Fruits\n\nFruit\nSweet Berries\nCitrus\nStone Fruits\nOther Tree &amp; Vine Fruits\nIndex of Searchable Terms\nAcknowledgments","torrent":{"xt":"urn:btih:e21aae39642a9249c873c44493488a8f9c5937ff","amp;dn":"Bountiful+-+Recipes+Inspired+by+Our+Garden+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e21aae39642a9249c873c44493488a8f9c5937ff","infoHashBuffer":{"type":"Buffer","data":[226,26,174,57,100,42,146,73,200,115,196,68,147,72,138,143,156,89,55,255]},"announce":[],"urlList":[]}}