{"title":"BBC Wildlife Specials - 11 documentaries in all","uid":3979952,"size":8075466692,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e2806d02754c211b34eb1c2409ae5c83525497a2&amp;dn=BBC+Wildlife+Specials+-+11+documentaries+in+all&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":11,"uploader":"relentlesstech","files":11,"time":1200498313,"description":"All eleven programs from the BBC Wildlife Specials series. Each film is a masterpiece of expertise and innovation: award-winning cameramen using revolutionary filming techniques, backed by the latest scientific research, and each features one of nature&amp;#039;s superstars, revealing aspects of its life that have never been seen before.\n\nDangerous, powerful, but above all breath-takingly beautiful, tigers have for centuries sparked awe and admiration. Yet, it is their very uniqueness which has made them a prized object for hunters. This film could be the last complete portrait of tigers in the wild as there is a real chance they could be extinct within the next decade.\n\nThe leopard is the least known of all Africa&amp;#039;s big cats. Until now, the leopard, an animal of the night, has been virtually impossible to observe. Using state-of-the-art camera equipment, this film ventures into the night, and follows the lives of two leopards in Zambia&amp;#039;s Luangwa Valley, to reveal the night-time secrets of the cat that walks on its own.\n\nFew birds have captured the human imagination as deeply as the eagle. Throughout the centuries this majestic bird of prey has been the symbol of strength and courage, such is the perfection of its design. There are 60 different kinds of eagle throughout the world - each type having adapted spectacularly to hunting different forms of prey. Remarkable aerial photography captures the dramatic life of eagles as never seen before.\n\nOne of the most successful species on earth is also one of the least documented. Miniaturised cameras reveal the snakes&amp;#039; world for the first time from their point of view. Head-mounted cameras capture gripping images of the world&amp;#039;s most dangerous snakes hunting and overcoming their prey. Using high-speed photography, x-ray imaging and state-of-the-art computer graphics, this is the most ambitious look at snakes attempted in television.\n\nContains:\nCrocodile\nEagle\nGorilla\nGreat White Shark\nGrizzly\nHumpback Whale\nLeopard\nLion\nPolar Bear\nSerpent\nTiger\n\nFile Size:\n7.52 GB","torrent":{"xt":"urn:btih:e2806d02754c211b34eb1c2409ae5c83525497a2","amp;dn":"BBC+Wildlife+Specials+-+11+documentaries+in+all","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2806d02754c211b34eb1c2409ae5c83525497a2","infoHashBuffer":{"type":"Buffer","data":[226,128,109,2,117,76,33,27,52,235,28,36,9,174,92,131,82,84,151,162]},"announce":[],"urlList":[]}}