{"title":"The Tao of Paleo: Finding Your Path to Health and Harmony ","uid":10578527,"size":693836,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e29ee68e610f227f35ebcac80f60bbbbaa770f55&amp;dn=The+Tao+of+Paleo%3A+Finding+Your+Path+to+Health+and+Harmony+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1405655820,"description":"The Tao of Paleo: Finding Your Path to Health and Harmony by Jason Goldberg, Joseph Salama, Darryl Edwards and Jimmy Moore\nEnglish | 2014 | ISBN: 1499385994 | ISBN-13: 9781499385991 | 278 pages | EPUB | 0,7 MB\n\nThe best way to learn is to be engaged. This book will engage you. Written as a conversation between Joe, Jason, and a number of funny fictional characters, this book will teach you everything you need to know about the paleo lifestyle in depth (not just the food aspect) and will entertain you along the way.\n\nIf you are serious about losing fat, gaining muscle, feeling younger and more energetic, sleeping better, playing harder, and improving your overall quality of life, this book is for you. It is a comprehensive guide to eating, playing, sleeping, and exercising in the way that humans were meant to do. Joe and Jason also include an easy-to-follow 12-week meal plan, exercise program, 36 delicious recipes, shopping list, and all the resources you'll need to start your paleo journey.\n\nFinally, one third of the profits from your purchase go directly to the Farm-to-Consumer Legal Defense Fund, so your purchase will support the farmers that produce healthy, nutritious food.","torrent":{"xt":"urn:btih:e29ee68e610f227f35ebcac80f60bbbbaa770f55","amp;dn":"The+Tao+of+Paleo%3A+Finding+Your+Path+to+Health+and+Harmony+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e29ee68e610f227f35ebcac80f60bbbbaa770f55","infoHashBuffer":{"type":"Buffer","data":[226,158,230,142,97,15,34,127,53,235,202,200,15,96,187,187,170,119,15,85]},"announce":[],"urlList":[]}}