{"title":"The Weather Underground-Documentary","uid":4437380,"size":1471473664,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e2cc1c65b8671755f50dc406b53364b75f673fa1&amp;dn=The+Weather+Underground-Documentary&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"bozo71","files":-1,"time":1223633740,"description":"The Weather Underground-Documentary\n\n\nACADEMY AWARD NOMINEE BEST DOCUMENTARY\n &lt;a href=&quot;\nhttp://www.upstatefilms.org/weather/main.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.upstatefilms.org/weather/main.html&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0343168/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0343168/&lt;/a&gt;\n\n\nIn October 1969 hundreds of young people, clad in football helmets and wielding lead pipes, marched through an upscale Chicago shopping district, pummeling parked cars and smashing shop windows in their path.\n\nThis was the first demonstration of the Weather Underground's &quot;Days of Rage.&quot; Outraged by the Vietnam War and racism in America, the organization waged a low-level war against the U.S.  government through much of the 1970s, bombing the Capitol building, breaking Timothy Leary out of prison, and evading one of the largest FBI manhunts in history.\n\nThe Weather Underground is a feature-length documentary that explores the rise and fall of this radical movement, as former members speak candidly about the idealistic passion that drove them to &quot;bring the war home&quot; and the trajectory that placed them on the FBI's most wanted list.\n\n&quot;Hello, I'm going to read a declaration of a state of war...within the next 14 days we will attack a symbol or institution of American injustice.&quot; ~ Bernardine Dohrn Thirty years ago, with those words, a group of young American radicals announced their intention to overthrow the U.S.  government.  In THE WEATHER UNDERGROUND, former Underground members, including Bernardine Dohrn, Bill Ayers, Mark Rudd, David Gilbert and Brian Flanagan, speak publicly about the idealistic passion that drove them to &quot;bring the war home&quot; and the trajectory that placed them on the FBI's most wanted list.\n\nFueled by outrage over racism and the Vietnam War, the Weather Underground waged a low-level war against the U.S.  government through much of the 1970s--bombing targets across the country that they considered emblematic of the real violence that the U.S.  was wreaking throughout the world.  Ultimately, the group's carefully organized clandestine network managed to successfully evade one of the largest manhunts in FBI history, yet the group's members would reemerge to life in a country that was dramatically different than the one they had hoped their efforts would inspire.  Extensive archival material, including, photographs, film footage and FBI documents are interwoven with modern-day interviews to trace the group's path, from its pitched battles with police on Chicago's streets, to its bombing of the U.S.  Capitol, to its successful endeavor breaking acid-guru Timothy Leary out of prison.  The film explores the Weathermen in the context of other social movements of the time and features interviews with former members of the Students for a Democratic Society (SDS) and the Black Panthers.  It also examines the U.S.  government's suppression of dissent in the 1960s and 1970s.\n\nLooking back at their years underground, the former members paint a compelling portrait of troubled times, revolutionary times, and the forces that drove their resistance.\n\nTHE WEATHER UNDERGROUND is a production of the Free History Project, produced in association with KQED Public Television/San Francisco and ITVS.\n","torrent":{"xt":"urn:btih:e2cc1c65b8671755f50dc406b53364b75f673fa1","amp;dn":"The+Weather+Underground-Documentary","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2cc1c65b8671755f50dc406b53364b75f673fa1","infoHashBuffer":{"type":"Buffer","data":[226,204,28,101,184,103,23,85,245,13,196,6,181,51,100,183,95,103,63,161]},"announce":[],"urlList":[]}}