{"title":"The Red Shoes (1948) Eng (multisubs)","uid":5273087,"size":1348329896,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e33784227aba898f30808071676a34da705bb068&amp;dn=The+Red+Shoes+%281948%29+Eng+%28multisubs%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":2,"uploader":"johnefp","files":-1,"time":1263297440,"description":"Movies : Romance : TV Rip : English\n\nMichael Powell and Emeric Pressburger's influential musical tragedy set the stage for the climactic dance ballets that became a staple of the Arthur Freed-MGM musicals (An American in Paris, Singin' in the Rain and The Band Wagon) of the early 1950s. Hans Christian Andersen's tragic fairy tale forms the basis of this film about betrayal, love and art. The story begins as struggling composer Julian Craster (Marius Goring) attends a performance of the Lermontov Ballet Company and recognizes his own score in the production of &quot;Hearts of Fire.&quot; Julian protests to ballet company director Boris Lermontov (Anton Walbrook) about the unauthorized use of his music. Impressed by Julian's talent, Boris hires him to compose the score for his next ballet -- a dance version of &quot;The Red Shoes.&quot; Boris also hires an attractive young dancer, Victoria Page (Moira Shearer), to perform in the ballet. When the lead ballerina announces that she plans to get married, Boris, in a pique over being abandoned, casts Victoria in the starring role. As Julian works on the score and Victoria struggles to perfect her dance technique, the two fall in love. When &quot;The Red Shoes&quot; ballet is premiered -- seen in a stunning and glorious fifteen-minute sequence -- it is a raging success and it makes Victoria a star. But when Boris learns that Julian and Victoria have fallen in love, Boris, who is secretly in love with Victoria, in a fit of rage forces Julian to leave the ballet company; Victoria leaves with him. Since Boris owns the rights to &quot;The Red Shoes&quot; ballet, he forbids Victoria to perform the dance and she becomes unemployable. Time passes and Julian and Victoria are now happily married. Julian's compositions have made him an international success. One day, with Victoria disembarking from a train in Paris, she meets Boris, who implores her to do one performance of &quot;The Red Shoes&quot; in Monaco. Victoria agrees as Julian cancels an engagement in London to travel to Monte Carlo in order to convince his wife not to perform the ballet. But Victoria goes on with the performance, with tragic results.\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0040725/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0040725/&lt;/a&gt;\n\n\n\nSubtitles:\n &lt;a href=&quot;\nhttp://www.opensubtitles.org/en/search/sublanguageid-all/idmovie-6883&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.opensubtitles.org/en/search/sublanguageid-all/idmovie-6883&lt;/a&gt;\n\n\n\nDirectors:\n\nMichael Powell\nEmeric Pressburger\n\n\nMarius Goring ... Julian Craster\nJean Short ... Terry\nGordon Littmann ... Ike\nJulia Lang ... A Balletomane\nBill Shine ... Her Mate\n\n\n[Movie]\nValid : Yes [AVI]\nDuration : 01:47:31\nMovie complete : Yes\n\n[Video]\nResolution : 640x480 4:3\nCodec : DivX 5\nFPS : 29,97\nBitRate : 1544 Kbps\nQuality Factor : 0,17 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 44100 Hz\nBitRate : 128 Kbps\n\nPlease seed at least as much as you D/L.\n=======================================\nThanks\n\nJohn\n","torrent":{"xt":"urn:btih:e33784227aba898f30808071676a34da705bb068","amp;dn":"The+Red+Shoes+%281948%29+Eng+%28multisubs%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e33784227aba898f30808071676a34da705bb068","infoHashBuffer":{"type":"Buffer","data":[227,55,132,34,122,186,137,143,48,128,128,113,103,106,52,218,112,91,176,104]},"announce":[],"urlList":[]}}