{"title":"S2 Silent Storm Gold Edition GOG","uid":7869656,"size":1783187089,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e42f2b04039c11f9c7e65f93dc44ba5da868c431&amp;dn=S2+Silent+Storm+Gold+Edition+GOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"AN0NYMOUS142857","files":-1,"time":1354162649,"description":"S2 Silent Storm Gold Edition GOG\n\nGenre: Strategy / Turn-based / Historical\nRelease date: September 9, 2004\nCompatible with: Windows XP, Windows Vista, Windows 7 (32 &amp; 64 bit)\nDeveloper / Publisher: Nival Interactive / Nival Interactive\nGame modes: single-player\nESRB Rating: Mature with Blood, Violence. PEGI Rating: 12+ with Violence.\n\n===\n\nThe Silent Storm series brings you two complete games that both provide with you a wealth of turn-based combat against the backdrop of World War II and beyond. Its the year 1943 and you must lead a group of operatives as they assault against the enemy, wreak havoc on their operations, and find out what new power threatens both sides. After the dust settles from the wars end, you must find and destroy the remnants of the organization known as Thors Hammer.\n\nSilent Storm Gold features a fully destructible 3D world with ragdoll physics and non-linear gameplay. Play the game your way: engage in stealth and quietly take out your enemies or take the more direct route with a rocket launcher. Choose from over 40 operatives in each game, for a total of 80 unique personalities and skills, and arm them with over 75 different authentic and painstakingly-researched weapons.\n\nFeatures:\n  - This bundle includes S2: Silent Storm and S3: Silent Storm - Sentinels add-on.\n  - Destructible environment opens up tactical options, whether its flushing an enemy out of a building via rocket launcher or knocking holes in a wall to make a field-expedient shortcut.\n  - Multiple paths to complete the mission. Use brute force or stealth tactics across 3 different difficulty levels.\n  - Unprecedented realism featuring true 3D, a fully destructible environment, and real projectile physics that take into consideration trajectory, speed, and piercing performance.\n\n===\n\nIncludes:\n  * manual\n  * soundtrack\n  * avatars\n  * artworks\n\nEnjoy!!\n","torrent":{"xt":"urn:btih:e42f2b04039c11f9c7e65f93dc44ba5da868c431","amp;dn":"S2+Silent+Storm+Gold+Edition+GOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e42f2b04039c11f9c7e65f93dc44ba5da868c431","infoHashBuffer":{"type":"Buffer","data":[228,47,43,4,3,156,17,249,199,230,95,147,220,68,186,93,168,104,196,49]},"announce":[],"urlList":[]}}