{"title":"Kurt Vonnegut - Breakfast of Champions","uid":5282556,"size":325860634,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e469342e25781fe494cfc823436ef09067255c0c&amp;dn=Kurt+Vonnegut+-+Breakfast+of+Champions&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"ill88eagle","files":-1,"time":1263599598,"description":"Breakfast of Champions or Goodbye Blue Monday By KUrt Vonnegut (Read By Stanley Tucci)\nCopyright 1973 | Audiobook Copyright 2004 | Genre Sci-Fi | Publisher Harper Audio | Unabridged | Number of MP3s: 33 | Total Duration: 5:26:08 | MP3 CBR 128 kbit/s 44100 Hz Mono\n\nEditorial Reviews\nAmazon.com\n&quot;We are healthy only to the extent that our ideas are humane.&quot; So reads the tombstone of downtrodden writer Kilgore Trout, but we have no doubt\nwho's really talking: his alter ego Kurt Vonnegut. Health versus sickness, humanity versus inhumanity--both sets of ideas bounce through this challenging\nand funny book. As with the rest of Vonnegut's pure fantasy, it lacks the shimmering, fact-fueled rage that illuminates Slaughterhouse-Five.\nAt the same time, that makes this book perhaps more enjoyable to read.-\n\nBreakfast of Champions is a slippery, lucid, bleakly humorous jaunt through (sick? inhumane?) America circa 1973, with Vonnegut acting as\nour Virgil-like companion. The book follows its main character, auto-dealing solid-citizen Dwayne Hoover, down into madness, a condition brought\non by the work of the aforementioned Kilgore Trout. As Dwayne cracks, then crumbles, Breakfast of Champions coolly shows the effects his dementia\nhas on the web of characters surrounding him. It's not much of a plot, but it's enough for Vonnegut to air unique opinions on America, sex,\nwar, love, and all of his other pet topics--you know, the only ones that really count. --This text refers to the Paperback edition.\n\nFrom AudioFile\nThis novel was Vonnegut's 50th birthday present to himself. He seems to have wanted to purge himself of his usual literary preoccupations\nso as to renew his imagination for his mature years. So he pursues his fictional alter ego, the sour old sci-fi writer Kilgore Trout, and frees\nhim from his creator, that is, himself. He does this at a small town arts festival after one of Trout's few readers shoots up the place.\nThese events are related as if to a young space alien who knows little of the human &quot;machine,&quot; as the author calls us. Stanley Tucci delivers\na superbly sly interpretation of this fare. He affects a laid-back, melancholy style, using his excellent timing and spurts of mischief\nto bring home the sardonic humor and irony with which the book is larded. This approach goes a long way to mask some of the author's self-indulgence.\nWhile a brief and somewhat fatuous interview with Vonnegut does little to enlighten the leader, the clever packaging reproduces some of the\nillustrations from the printed original, which contribute to the tone of a primer for nonhumans. Y.R. Winner of AUDIOFILE Earphones Award\nÃ‚Â© AudioFile 2004, Portland, Maine-- Copyright Ã‚Â© AudioFile, Portland, Maine\n\nReview\n&quot;It's marvelous...he wheels out all the complaints about America and makes them seem fresh, funny, outrageous, hateful and lovable.&quot;\n--The New York Times\n\n&quot;Vonnegut is George Orwell, Dr. Caligari and Flash Gordon compounded into one writer....A zany but moral mad scientist.&quot;\n--Time\n\n&quot;Free-wheeling, wild and great....Uniquely Vonnegut.&quot;--Publishers Weekly--This text refers to the Paperback edition.\n\nBook Description\nBreakfast of Champions is vintage Vonnegut. One of his favorite characters, aging writer Kilgore Trout, finds to his horror that a Midwest car dealer\nis taking his fiction as truth. The result is murderously funny satire as Vonnegut looks at war, sex, racism, success, politics, and pollution\nin America and reminds us how to see the truth.\n\nAbout the Author\nKurt Vonnegut is a master of contemporary American Literature. His black humor, satiric voice, and incomparable imagination first captured America's\nattention in The Siren's of Titan in 1959 and established him as 'a true artist' with Cat's Cradle in 1963. He is, as Graham Greene has declared, 'one of the best living American writers.'","torrent":{"xt":"urn:btih:e469342e25781fe494cfc823436ef09067255c0c","amp;dn":"Kurt+Vonnegut+-+Breakfast+of+Champions","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e469342e25781fe494cfc823436ef09067255c0c","infoHashBuffer":{"type":"Buffer","data":[228,105,52,46,37,120,31,228,148,207,200,35,67,110,240,144,103,37,92,12]},"announce":[],"urlList":[]}}