{"title":"Mark Levine - The Jazz Theory Book","uid":4583356,"size":116940812,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e488db5bd88674938cf9c461dd70463bd45189ed&amp;dn=Mark+Levine+-+The+Jazz+Theory+Book&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"z3ro","files":1,"time":1229521979,"description":"he Jazz Theory Book is the definitive college level jazz theory textbook from the author of The Jazz Piano Book. According to Mark Levine:\n\n&quot;A great jazz solo consists of 1% magic and 99% stuff that is explainable, analysable, categorisable and doable. This book is mostly about the 99% stuff.&quot;\n\nThe book takes you from basic concepts such as chord construction and the II-V-I progression through scale theory, the blues, 'I've Got Rhythm' changes, slash chords, bebop and pentatonic scales, how to read a lead sheet and memorize tunes plus a study of reharmonization that's is practically a book in itself. A real best seller that deserves a place on every musicians' and teachers' bookshelf.\n\nContents:\n\nPart One - Theory of Chords and Scales\nBasic Theory, Major Scale and the II-V-I Progression; Chord/Scale Theory (Major, Melodic Minor, Diminished and Whole-Tone Scale Harmony); How to Practice Scales; Slash Chords\n\nPart Two - Improvisation - Playing the Changes\nFrom Scales to Music; The Bebop Scales; Playing 'Outside'; Pentatonic Scales; The Blues; Rhythm Changes; Practice, Practice, Practice\n\nPart Three - Reharmonization\nBasic Reharmonization; Advanced Reharmonization; Coltrane Changes; Three Reharmonizations (Spring is Here x 2, Body and Soul)\n\nPart Four - The Tunes\nSong Form and Composition; Reading a Lead Sheet; Memorizing a Tune; Heads; Repetoire\n\nPart Five - The Rest of It\nSalsa and Latin Jazz; Loose Ends; Listen; Index\n\nSpiral bound, 522 pages","torrent":{"xt":"urn:btih:e488db5bd88674938cf9c461dd70463bd45189ed","amp;dn":"Mark+Levine+-+The+Jazz+Theory+Book","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e488db5bd88674938cf9c461dd70463bd45189ed","infoHashBuffer":{"type":"Buffer","data":[228,136,219,91,216,134,116,147,140,249,196,97,221,112,70,59,212,81,137,237]},"announce":[],"urlList":[]}}