{"title":"The.Paradise.(BBC).S02.season.2.720p.hdtv.x264","uid":9522666,"size":7844547897,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:e4f8ec7ec4ca8dd6c0c2bd93a043d24c1df028b3&amp;dn=The.Paradise.%28BBC%29.S02.season.2.720p.hdtv.x264&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"o2286055","files":-1,"time":1390671105,"description":"An intoxicating love story set in England's first department store in the 1870s.\n\nThe Paradise is a British television costume drama series co-produced by BBC Worldwide America and Masterpiece. The Paradise premiered in the United Kingdom on BBC One on 25 September 2012 and premiered in the United States on PBS on 6 October 2013. The series is an adaptation of Ã‰mile Zola's novel Au Bonheur des Dames that relocates the story to North East England.\n\nSeries 1 begins in 1875, and portrays the lives and loves of the people who work, shop and trade, in and around the first English department store. The owner of The Paradise department store is widower John Moray. Moray was once a draper's boy in Emersons, the small shop that grew under his managership into The Paradise, which has come to dominate the high street to the detriment of small shopkeepers nearby.\n\nInto this world comes Denise Lovett, from small town Peebles, whose uncle Edmund is one of the shopkeepers struggling to survive. Denise takes a job at The Paradise and is soon seen by Moray as a rising star, to the annoyance of head of ladies fashion Miss Audrey, and fellow shopgirl Clara. Moray is financially dependent on Lord Glendenning. Glendenning's daughter Katherine is determined to marry Moray, and sees Denise as a direct threat to her ambitions.","torrent":{"xt":"urn:btih:e4f8ec7ec4ca8dd6c0c2bd93a043d24c1df028b3","amp;dn":"The.Paradise.%28BBC%29.S02.season.2.720p.hdtv.x264","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4f8ec7ec4ca8dd6c0c2bd93a043d24c1df028b3","infoHashBuffer":{"type":"Buffer","data":[228,248,236,126,196,202,141,214,192,194,189,147,160,67,210,76,29,240,40,179]},"announce":[],"urlList":[]}}