{"title":"The St. Martin's Guide to Writing, Short Tenth Edition [PDF] [St","uid":10081467,"size":13684441,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e57898e4bd700860ad7738054ba6108328801602&amp;dn=The+St.+Martin%27s+Guide+to+Writing%2C+Short+Tenth+Edition+%5BPDF%5D+%5BSt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"0xmovva","files":3,"time":1399013000,"description":"Author: Rise B. Axelrod, Charles R. Cooper \nPaperback: 880 pages\nPublisher: Bedford/St. Martin's; Tenth Edition edition (January 11, 2013)\nLanguage: English\nISBN-10: 1457604507\nISBN-13: 978-1457604508\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.  Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n__________________________________________________________________________________\n\n\nThe best-selling college rhetoric for over 25 years, The St. Martin's Guide has achieved an unmatched record of success by providing practical innovations for the ever-changing composition course. The acclaimed step-by-step Guides to Writing offer sure-fire invention strategies to get students started, sentence strategies to get and keep students writing, and thoughtful revision strategies to help students make their writing their own. With more hands-on activities for critical reading and working with sources, greater emphasis on the rhetorical situation, a revamped design that helps students see what they need to do at a glance, and a greater variety of formats (cloth, paper, loose-leaf, and e-books), the Guide is better than ever. The print text is now integrated with e-Pages for The St. Martin's Guide, designed to take advantage of what the Web can do.","torrent":{"xt":"urn:btih:e57898e4bd700860ad7738054ba6108328801602","amp;dn":"The+St.+Martin%27s+Guide+to+Writing%2C+Short+Tenth+Edition+%5BPDF%5D+%5BSt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e57898e4bd700860ad7738054ba6108328801602","infoHashBuffer":{"type":"Buffer","data":[229,120,152,228,189,112,8,96,173,119,56,5,75,166,16,131,40,128,22,2]},"announce":[],"urlList":[]}}