{"title":"Ivan Turgenev - Fathers and Sons (Penguin Classics)","uid":11620853,"size":3878553,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e587f7d3af47bc8e5e1d7d1f08769ea0e0595207&amp;dn=Ivan+Turgenev+-+Fathers+and+Sons+%28Penguin+Classics%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"workerbee","files":-1,"time":1417546105,"description":"\n* Ivan Turgenev - FATHERS AND SONS (Penguin Classics, 2009).  Translated by Peter Carson with an Introduction by Rosamund Bartlett and an Afterword by Tatyana Tolstaya.  240 pp. -- ePUB\n\n\nFATHERS AND SONS explores the ageless conflict between generations through a period in Russian history when a new generation of revolutionary intellectuals threatened the state.\n\nReturning home after years away at university, Arkady is proud to introduce his clever friend Bazarov to his father and uncle. But their guest soon stirs up unrest on the quiet country estate -- his outspoken nihilist views and his scathing criticisms of the older men expose the growing distance between Arkady and his father.  And when Bazarov visits his own doting but old-fashioned parents, his disdainful rejection of traditional Russian life causes even further distress.\n\nIn this novel, Turgenev created a beautifully-drawn and highly influential portrayal of the clash between generations, at a time just before the end of serfdom, when the refined yet vanishing landowning class was being overturned by a brash new breed that strove to change the world.  Peter Carson's elegant, naturalistic new translation brings Turgenev's masterpiece to life for a new generation of readers. In her introduction, Rosamund Bartlett discusses the novel's subtle characterisation and the immense social changes that took place in the 1850s Russia of Fathers and Sons.  This edition also includes a chronology, suggested further reading and notes.\n\n\nReviews\n\n&quot;One of the first Russian novels to be translated for a wider European audience. It is a difficult art: in this superb new version, Peter Carson has succeeded splendidly.&quot; -- Michael Binyon, The Times\n\n&quot;If you want to get as close as an English reader can to enjoying Turgenev, Carson is probably the best.&quot; -- Donald Rayfield, The Times Literary Supplement\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                                               &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!","torrent":{"xt":"urn:btih:e587f7d3af47bc8e5e1d7d1f08769ea0e0595207","amp;dn":"Ivan+Turgenev+-+Fathers+and+Sons+%28Penguin+Classics%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e587f7d3af47bc8e5e1d7d1f08769ea0e0595207","infoHashBuffer":{"type":"Buffer","data":[229,135,247,211,175,71,188,142,94,29,125,31,8,118,158,160,224,89,82,7]},"announce":[],"urlList":[]}}