{"title":"Hans Fallada - Hur ska det gå för Pinnebergs - Svensk","uid":15977715,"size":365094196,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e58ef258210bc90693f1abe557fad29f488ab0b1&amp;dn=Hans+Fallada+-+Hur+ska+det+g%26aring%3B+f%26ouml%3Br+Pinnebergs+-+Svensk&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":0,"uploader":"totomas1","files":137,"time":1475860528,"description":"Hans Fallada - Hur ska det gå för Pinnebergs?\r\n\r\nHur ska det gå för Pinnebergs? blev Hans Falladas stora genombrott som författare, och boken betraktas idag som en modern klassiker. Här skildras Weimarrepublikens sista dagar och nazisternas smygande maktövertagande. Det är berättelsen om ett ungt pars kamp mot arbetslöshet och inflation - en hyllning till den lilla människan och till kärlekens styrka i en tid av politisk osäkerhet och ekonomisk kollaps.\r\n\r\nJohannes Pinneberg är bokhållare på en spannmålsfirma och senare expedit i en konfektionsaffär - han vet hur man fjäskar för kunder, han kan räkna och han tar sitt arbete på stort allvar. Men lönen är så låg att det knappt går att leva av den - att sätta ett barn till världen är otänkbart, nästan en katastrof. Men det är precis det som händer Johannes och hans &quot;Lämmchen&quot; (Emma).\r\n\r\nBerättelsen om den unga familjens kamp är hjärtskärande och sorglig men också rolig. De tillhör det &quot;lilla folket&quot; som kämpar för att få råd med tak över huvudet och mat på bordet. De förstår inte vad som händer i samhället, de är inte politiskt intresserade, de är lättlurade och naiva, men skildras med kärlek och ömsinthet mot en underbart levande bakgrund av vänner, familj, arbetskollegor och småborgerlighet.\r\nVarje år sjunker de längre ner i fattigdom och utsatthet. Det är en brutal och grotesk tid.\r\n\r\n\r\nAntal CD: 10 CD\r\nUppläsare: Torsten Wahlund\r\nSpeltid: 12 timmar, 40 minuter","torrent":{"xt":"urn:btih:e58ef258210bc90693f1abe557fad29f488ab0b1","amp;dn":"Hans+Fallada+-+Hur+ska+det+g%26aring%3B+f%26ouml%3Br+Pinnebergs+-+Svensk","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e58ef258210bc90693f1abe557fad29f488ab0b1","infoHashBuffer":{"type":"Buffer","data":[229,142,242,88,33,11,201,6,147,241,171,229,87,250,210,159,72,138,176,177]},"announce":[],"urlList":[]}}