{"title":"The Accidental Universe - Alan Lightman - Audiobook MP3","uid":10517514,"size":111290863,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e5a93725ddc4743a1edf228e337923b393c58a27&amp;dn=The+Accidental+Universe+-+Alan+Lightman+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1404926612,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - Add this to your iTunes collection, and change &quot;Media Kind&quot; to &quot;Audiobook.&quot; Right-click the track or album, and select &quot;Get Info&quot; from the context menu. You will find &quot;Media Kind&quot; under &quot;Options.&quot; This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nThe Accidental Universe: The World You Thought You Knew\n\nWritten by: Alan Lightman\nNarrated by: Bronson Pinchot\nLength: 3 hrs and 51 mins\nFormat: Unabridged\nRelease Date:01-14-14\nProgram Type: Audiobook\n\nFrom the acclaimed author of Einstein's Dreams and Mr. g comes a meditation on the unexpected ways in which recent scientific findings have shaped our understanding of ourselves and our place in the cosmos.\n\nWith all the passion, curiosity, and precise yet lyrical prose that have marked his previous books, Alan Lightman here explores the emotional and philosophical questions raised by discoveries in science, focusing most intently on the human condition and the needs of humankind. He looks at the difficult dialogue between science and religion, the conflict between our human desire for permanence and the impermanence of nature, the possibility that our universe is simply an accident, the manner in which modern technology has separated us from direct experience of the world, and our resistance to the view that our bodies and minds can be explained by scientific logic and laws. And behind all of these considerations is the suggestion - at once haunting and exhilarating - that what we see and understand of the world is only a tiny piece of the extraordinary, perhaps unfathomable whole. ","torrent":{"xt":"urn:btih:e5a93725ddc4743a1edf228e337923b393c58a27","amp;dn":"The+Accidental+Universe+-+Alan+Lightman+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5a93725ddc4743a1edf228e337923b393c58a27","infoHashBuffer":{"type":"Buffer","data":[229,169,55,37,221,196,116,58,30,223,34,142,51,121,35,179,147,197,138,39]},"announce":[],"urlList":[]}}