{"title":"The Constellation Observing Atlas (gnv64)","uid":11170743,"size":15539747,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e605714548aa05743a6628c538b4a97f2d6869ba&amp;dn=The+Constellation+Observing+Atlas+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"gnv65","files":-1,"time":1412698623,"description":"The Constellation Observing Atlas (The Patrick Moore Practical Astronomy Series) \nby Grant Privett and Kevin Jones\nSpringer | August 2013 | ISBN-10: 146147647X | PDF | 221 pages | 14.8 mb\n\nDesigned for anyone who wishes to learn the constellations or observe the best and brightest deep sky objects and double stars, this book contains an alphabetical list of constellations complete with star maps, historical background, and highlights of deep sky objects. Each entry contains position and physical information on enough stars to support astronomers in star-hopping, swinging the telescope from star to star to star to arrive at a faint target. It provides a carefully selected list of accessible and rewarding deep sky objects.\n\nFull-color maps show the constellations, with star types (spectral and physical) indicated by the colors used on the map. Extended objects such as galaxies and nebulae are shown with the approximate apparent size in the sky. With unmatched thoroughness and accessibility, this is a constellation atlas that makes the ideal companion to a night's telescope viewing, for novices and expert amateur astronomers alike. Easy to navigate and refer to, it is the key that unlocks the door to greater night sky exploration. \n\nAbout the Author &lt;a href=&quot;\nhttp://s18.postimg.org/d9mixy05l/Grant.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s18.postimg.org/d9mixy05l/Grant.jpg&lt;/a&gt;\nGrant Privett is an amateur astronomer currently based in Wiltshire, UK.Currently, He is working as a physicist - specialising in image processing of various sorts - but also has in the past been employed as a professional astronomer, a programmer and a real rocket scientist. He has written 2 books &amp; articles for magazines.\n","torrent":{"xt":"urn:btih:e605714548aa05743a6628c538b4a97f2d6869ba","amp;dn":"The+Constellation+Observing+Atlas+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e605714548aa05743a6628c538b4a97f2d6869ba","infoHashBuffer":{"type":"Buffer","data":[230,5,113,69,72,170,5,116,58,102,40,197,56,180,169,127,45,104,105,186]},"announce":[],"urlList":[]}}