{"title":"Sesame Street - Songs From the Street 35 Years of Music [V0]","uid":7326233,"size":260843696,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e6a85585ff0085d9e2ca87d62fa86371c7e7148f&amp;dn=Sesame+Street+-+Songs+From+the+Street+35+Years+of+Music+%5BV0%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"rambam1776","files":-1,"time":1338762349,"description":"Sesame Street - Songs From The Street: 35 Years of Music\n\nFor those who grew up on the magic of PBS and Sesame Street, there are countless musical moments permanently imprinted in the back of our minds, as well as in popular culture's. That said, there are 63 moments spanning three-and-a-half decades that children (and adults) of all ages will recall and sing along to with great fondness. An armada of Sesame Street's guest appearances are included here : Cab Calloway, Lena Horne, R.E.M., the Fugees, Stevie Wonder, Billy Joel, Tony Bennett and Johnny Cash are just but a few. However, it's the interludes from the show's original material featuring cast members, muppets and educational songs that are inarguably the true stars here. From the opening bells and guitar of Sesame Street's instantly identifiable theme song, to the charming, simple anthems courtesy of genius Joe Raposo, to such classics as &quot;C Is for Cookie,&quot; &quot;Rubber Duckie,&quot; &quot;Doin' the Pigeon&quot; and &quot;Mah Na Mah Na,&quot; to the contemplative, potent &quot;Bein' Green&quot; from Kermit the Frog -- it's all here. While some collectors may scoff at the availability of most of this material on other CDs (and truth be told, a follow-up collection focusing entirely on the earliest years would be superb), fans who grew up on the show and children alike will find having them all on one disc, complete with superb liner notes, lyrics and pictures, an essential piece in their children's record collection. This is the definitive resource, bar none. Simply outstanding.\n &lt;a href=&quot;\nhttp://www.amazon.com/Songs-From-Street-Years-Music/dp/B00133KENQ&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Songs-From-Street-Years-Music/dp/B00133KENQ&lt;/a&gt;","torrent":{"xt":"urn:btih:e6a85585ff0085d9e2ca87d62fa86371c7e7148f","amp;dn":"Sesame+Street+-+Songs+From+the+Street+35+Years+of+Music+%5BV0%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6a85585ff0085d9e2ca87d62fa86371c7e7148f","infoHashBuffer":{"type":"Buffer","data":[230,168,85,133,255,0,133,217,226,202,135,214,47,168,99,113,199,231,20,143]},"announce":[],"urlList":[]}}