{"title":"Tinto Brass - Miranda (Uncut)[Divx - Ita Mp3]","uid":4100029,"size":741949314,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e725ec549b1c8d0fcb3991b1508b363a52775b51&amp;dn=Tinto+Brass+-+Miranda+%28Uncut%29%5BDivx+-+Ita+Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":3,"uploader":"circlensess","files":2,"time":1206491330,"description":"Miranda - Uncut dvdrip ITA Mixing by Maximo.avi (707.26 megabyte)\n\nHas 6 extra minutes than the other release.\n\n[img]http://www.sineport.com/poster/eski/miranda.jpg[/img]\n\nDimensione: 707 MB (or 724,234 KB or 741,615,616 bytes)\nDurata: 01:34:09\nVideo Codec: DivX 5.0\nVideo Bitrate: 916 kb/s\nRisoluzione: 640x512 (1.25:1)\nFPS (Frames/sec): 25.00\nQF (Frame quality): 0.112 bits/pixel\nAudio Codec: MP3\nAudio Bitrate: 128 kb/s (64/ch, stereo)\nFreq Audio: 44100 Hz\n\nPlot Outline:\nIn this erotic comedy, Miranda is the landlady of a small country tavern who is looking for a husband, and tries out a variety of men for size.\n  &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0089598/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0089598/&lt;/a&gt;\n\nThe Assman Cometh, 11 April 2002\n\nAh, the mature Tinto Brass! After twenty odd years of trying to make difficult, compelling and erotic films, of seeing his work cut to shreds by clumsier, less artistic hands, of working on huge sets with vast unweildy international casts and of the insufferable dictation of linear narrative and intelligible dialogue enough was enough. From now on it would be back to basics, back to his first love. From now on all of his films would be about women with fat arses. Like Walerian Boroczyk or Russ Meyer ( albeit a Russ Meyer who is a foot shorter and facing the wrong way ) Brass&amp;#039; chief concern is the capture of the female form, as often as possible and from suprisingly intrusive angles. To this end he has established a series of erotic props, his own sexual shorthand. There will always be an oval mirror over any bed, there will invariably be a camp dancing sequence during which the heroine will feel compelled to flash her baggy french knickers. There will be a dream sequence, usually on a beach and usually as a tribute to Fellini, and every time a character goes to the cinema it will be to see another Tinto Brass film. And finally, and perhaps most importantly for Tinto, any woman, no matter what the circumstances and appropos of nothing must be allowed to urinate as and when she pleases, preferably backlit and preferably in public. This is the plot of Miranda. Not in essence, this is not a thumbnail sketch or a five word pitch. THIS IS ALL THAT HAPPENS:Miranda ( Serena Grandi ) the landlady of an Italian taverna has to choose between three men: a rich pensioner, an aggressive GI or the lowly waiter who carries a torch for her. Guess which one she goes for!\n\n","torrent":{"xt":"urn:btih:e725ec549b1c8d0fcb3991b1508b363a52775b51","amp;dn":"Tinto+Brass+-+Miranda+%28Uncut%29%5BDivx+-+Ita+Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e725ec549b1c8d0fcb3991b1508b363a52775b51","infoHashBuffer":{"type":"Buffer","data":[231,37,236,84,155,28,141,15,203,57,145,177,80,139,54,58,82,119,91,81]},"announce":[],"urlList":[]}}