{"title":"Gil Scott-Heron -The Revolution Will Not Be Televised CBR320","uid":6435147,"size":150224420,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e737ca422b844737f54ba67ad3cd629b7a61d1ba&amp;dn=Gil+Scott-Heron+-The+Revolution+Will+Not+Be+Televised+CBR320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1306785232,"description":"Gil Scott-Heron\nThe Revolution\nWill Not Be Televised (1988)\n\n\n\n\nOne of the most important progenitors of rap music, Gil Scott-Heron's aggressive, no-nonsense street poetry inspired a legion of intelligent rappers while his engaging songwriting skills placed him square in the R&amp;B charts later in his career, backed by increasingly contemporary production courtesy of Malcolm Cecil and Nile Rodgers (of Chic). Born in Chicago but transplanted to Tennessee for his early years, Scott-Heron spent most of his high-school years in the Bronx, where he learned firsthand many of the experiences that later made up his songwriting material. He had begun writing before reaching his teenage years, however, and completed his first volume of poetry at the age of 13. Though he attended college in Pennsylvania, he dropped out after one year to concentrate on his writing career and earned plaudits for his novel, The Vulture. Encouraged at the end of the '60s to begin recording by legendary jazz producer Bob Thiele -- who had worked with every major jazz great from Louis Armstrong to John Coltrane, Scott-Heron released his 1970 debut, Small Talk at 125th and Lenox, inspired by a volume of poetry of the same name. With Thiele's Flying Dutchman Records until the mid-'70s, he signed to Arista soon after and found success on the R&amp;B charts. Though his jazz-based work of the early '70s was tempered by a slicker disco-inspired production, Scott-Heron's message was as clear as ever on the Top 30 single 'Johannesburg' and the number 15 hit 'Angel Dust.' Silent for almost a decade, after the release of his 1984 single 'Re-Ron,' the proto-rapper returned to recording in the mid-'90s with a message for the gangsta rappers who had come in his wake; Scott-Heron's 1994 album Spirits began with 'Message to the Messengers,' pointed squarely at the rappers whose influence, positive or negative, meant much to the children of the 1990s.\n\n\n\nFormat:\t\t\tMp3\nBit Rate:\t\t320 CBR\nContains:\t\tAlbum Art &amp; ID Tags\n\n\n\nSpanning 1970-1972, this superb collection takes us back to Gil Scott-Heron's early years, when he was working with jazz producer Bob Thiele, a man who had been in the studio with everyone from John Coltrane and Pharoah Sanders to Coleman Hawkins. But The Revolution Will Not Be Televised isn't a jazz collection per se; it's a collection of innovative R&amp;B and spoken poetry that contains jazz influences and finds Scott-Heron employing such jazz musicians as flutist Hubert Laws and bassist Ron Carter. Like the Last Poets, Scott-Heron has been described as 'one of the first rappers', and while he was hardly the first person to speak in rhyme to music, there are definitely parallels between angry sociopolitical poems like 'Whitey on the Moon,' 'No Knock,' and 'Brother' and hip-hop commentary from the 1980s. Poetry, however, doesn't dominate this album, most of the selections illustrate Scott-Heron's excellence as a singer, including 'Home Is Where the Hatred Is,' 'Did You Hear What They Said?,' and the poignant 'Save the Children.' One of the collection's less political tracks is 'Lady Day and John Coltrane,' an R&amp;B classic that articulates how easily jazz can lift a person's spirits. The Revolution Will Not Be Televised isn't the last word on Scott-Heron's artistry, he recorded many more treasures after leaving Flying Dutchman for Arista in 1975. But it's one of the collections to acquire if you're exploring his artistry for the first time.\n\n\n\nAudio-Info:\n\n\n\n01.The Revolution Will Not Be Televised\n02.Sex Education Ghetto Style\n03.The Get Out Of The Ghetto Blues\n04.No Knock\n05.Lady Day And John Coltrane\n06.Pieces Of A Man\n07.Home Is Where The Hatred Is\n08.Brother\n09.Save The Children\n10.Whitey On The Moon\n11.Did You Hear What They Said\n12.When You Are Who You Are\n13.I Think I'll Call It Morning\n14.A Sign Of The Ages\n15.Or Down You Fall\n16.The Needle's Eye\n17.The Prisoner\n\n\n\n\n\n\n\n\n\n             ****Support the artists &amp; buy it if you like it.****\n\n\n                 ****Enjoy &amp; please don't forget to seed!****\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:e737ca422b844737f54ba67ad3cd629b7a61d1ba","amp;dn":"Gil+Scott-Heron+-The+Revolution+Will+Not+Be+Televised+CBR320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e737ca422b844737f54ba67ad3cd629b7a61d1ba","infoHashBuffer":{"type":"Buffer","data":[231,55,202,66,43,132,71,55,245,75,166,122,211,205,98,155,122,97,209,186]},"announce":[],"urlList":[]}}