{"title":"Obstetrics by Ten Teachers, 19E [PDF] [StormRG]","uid":10114764,"size":5693727,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e73fcfdaa065b913baea55ee82cd2a42d08c6581&amp;dn=Obstetrics+by+Ten+Teachers%2C+19E+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"0xmovva","files":-1,"time":1399573046,"description":"Author: Philip N. Baker, Louise Kenny\nPaperback: 436 pages\nPublisher: CRC Press; 19 edition (March 25, 2011)\nLanguage: English\nISBN-10: 0340983531\nISBN-13: 978-0340983539 \nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n_____________________________________________________________________________________\n\n\nFirst published in 1917 as 'Midwifery', Obstetrics by Ten Teachers is well established as a concise, yet comprehensive, guide within its field. The nineteenth edition has been thoroughly updated, integrating clinical material with the latest scientific advances.\n\nWith an additional editor and new contributing authors, the new edition combines authoritative detail while signposting essential knowledge. Retaining the favoured textual features of preceding editions, each chapter is highly structured, with overviews, definitions, aetiology, clinical features, investigation, treatments, key points and additional reading where appropriate.\n\nTogether with its companion Gynaecology by Ten Teachers, the volume has been edited carefully to ensure consistency of structure, style and level of detail, as well as avoiding overlap of material.\n\nFor almost a century the 'Ten Teachers' titles have together found favour with students, lecturers and practitioners alike. The nineteenth editions continue to provide an accessible 'one stop shop' in obstetrics for a new generation of doctors.","torrent":{"xt":"urn:btih:e73fcfdaa065b913baea55ee82cd2a42d08c6581","amp;dn":"Obstetrics+by+Ten+Teachers%2C+19E+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e73fcfdaa065b913baea55ee82cd2a42d08c6581","infoHashBuffer":{"type":"Buffer","data":[231,63,207,218,160,101,185,19,186,234,85,238,130,205,42,66,208,140,101,129]},"announce":[],"urlList":[]}}