{"title":"Liliana CAVANI - The Night Porter (1974) CRITERION","uid":4104048,"size":1468988576,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e76fbf22ccc74a1bdebcb830d3218e963bb66a35&amp;dn=Liliana+CAVANI+-+The+Night+Porter+%281974%29+CRITERION&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"zeinabqureshi","files":6,"time":1206717385,"description":"Info: ~\nDirected by Liliana Cavani\nIncluded in the Criterion Collection\n\nFiles info: ~\n\t720 x 384 @ 23.9760 fps\n\t128 kbps Dolby AC3 audio\n\tSubs included as idx/sub (rar)\n\tDivX 5.x/6.x encoding\n\nSynopsis (Wikipedia)\n\nDirk Bogarde plays Maximilian Theo Aldorfer, a former Nazi SS officer, and Charlotte Rampling plays Lucia Atherton, a concentration camp survivor who has been tormented by Aldorfer. Thirteen years after World War II, Lucia meets Aldorfer again; he is now the night porter at a Vienna hotel. There, they fall back into their sadomasochistic relationship.\n\nTo hide his shame about his past, Max works obsessively as a hotel night porter where his aim is to please his guests, especially the Countess - a confidante who requires his services to get her young men as sexual partners. Many of the other guests are war criminals, who hold secret meetings in the hotel to uncover any evidence connecting them with their war crimes. Max prepares with these former Nazis a strategy for his upcoming War Trial at the hands of the Allies, as they conduct mock trials to learn about records in the archives they should destroy and witnesses to be tampered with or eliminated. Into this hotel culture, which reeks of nostalgia for the FÃƒÆ’Ã‚Â¼hrer, comes the only live witness who can testify against him - the young Viennese camp inmate who is now married to an American opera conductor. She is someone he sexually abused in the camp and Max can't stop obsessing over their past torturous relationship. They are drawn uncontrollably to each other despite the dark past both of them share and the apparent danger from Max's unchanged fanatical and bloodthirsty Nazi comrades, Klaus and Hans.\n\nEnjoy and Seed...!\nPlease stay a while after downloading, I'll be pulling out pretty soon...\n\nTo Raphael\nRipped by \n-=:ZEiNAB:=-\n\n******************************** FREAKYFLICKS *********************************\n\nFreakyFlicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe FreakyFlicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n   &lt;a href=&quot; http://freakyflicks.proboards54.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://freakyflicks.proboards54.com/&lt;/a&gt;\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE'","torrent":{"xt":"urn:btih:e76fbf22ccc74a1bdebcb830d3218e963bb66a35","amp;dn":"Liliana+CAVANI+-+The+Night+Porter+%281974%29+CRITERION","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e76fbf22ccc74a1bdebcb830d3218e963bb66a35","infoHashBuffer":{"type":"Buffer","data":[231,111,191,34,204,199,74,27,222,188,184,48,211,33,142,150,59,182,106,53]},"announce":[],"urlList":[]}}