{"title":"Microsoft Office 2000 Premium With all updates &amp; Service Packs","uid":5105992,"size":349722228,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e77d346756636c06be75bf700c2a8e22d2e8996c&amp;dn=Microsoft+Office+2000+Premium+With+all+updates+%26+Service+Packs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"kithylin","files":1,"time":1254360859,"description":"My original office 2000 install disc, i've been using this personally for years.\n\nEDIT: Okay after some discussion with a friend of mine, seems i actually have Disc 1 of the full 4-disc office set, the other 3 discs contain: publisher, small office business tools, clip art, photodraw, and Office Server Extensions. If you're trying to get any of these with this torrent, then sorry but they're not here.\n\nThis is What's on this disc:\n\nWord\nAccess\nExcel\nFrontPage\nOutlook\nPowerPoint\n\n\nAs well as the updates as listed below. Sorry for any confusion.\n\n\nThe file contains 1 single *.ISO image, just mount and it'll auto-play the installer. I compressed it with 7-Zip to shave about 276mb off the file for torrent purposes.\n\nOnce you've mounted it, explore the CD in windows explorer and there's a &quot;EXTRA-FILES&quot; sub folder, inside is cdkey.txt the 100% legit cd key.\n\nAlso in the EXTRA-FILES folder is &quot;UPDATES&quot;, only AFTER you've completed the install, then go back to the CD: EXTRA-FILES -&gt; UPDATES and run install.bat\n\nIt's a custom batch file i created that runs through all of the update packages in the correct order (SR1-A -&gt; SP2 -&gt; SP3 -&gt; Supplemental) and has a progress in the batch file as you go through it. All the updates (Including the hard-to-locate SR1-A) are the offline full-install packages, no downloading, since the microsoft download servers don't offer content for Office 2000 anymore.\n\nDuring the updates it comes up several times and says something about &quot;some other update program already updated this&quot; just click &quot;ignore&quot; every time and it goes through, not sure why it does that.\n\nWe can't buy this from microsoft, and microsoft has completely removed all support for office 2000 off their website, so it's finally time to get this up on torrents for everyone.\n\nAlso a little FYI: This is the last version of microsoft office before they went to the online-authentication BS, which is the main reason -I- personally use it.","torrent":{"xt":"urn:btih:e77d346756636c06be75bf700c2a8e22d2e8996c","amp;dn":"Microsoft+Office+2000+Premium+With+all+updates+%26+Service+Packs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e77d346756636c06be75bf700c2a8e22d2e8996c","infoHashBuffer":{"type":"Buffer","data":[231,125,52,103,86,99,108,6,190,117,191,112,12,42,142,34,210,232,153,108]},"announce":[],"urlList":[]}}