{"title":"Deadpool Corps 01-12 + Ex (2010-2011|Digital|AnPymGold-Emp)","uid":10091893,"size":399806456,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:e7e905a2db93c09552b6d90481eccdf777e206c0&amp;dn=Deadpool+Corps+01-12+%2B+Ex+%282010-2011%7CDigital%7CAnPymGold-Emp%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1399215379,"description":"Kieron Gillen and Rob Liefeld bring us this wacky Deadpool story. Promotional info from the first collected edition - &quot;The Deadpool Corps embark on the universe spanning mission that only they can accomplish. Tapped by the Elders of the Universe to gather a crack team of his alternative universe selves for what amounts to an intergalactic suicide mission, Deadpool just can't say no. Enter: Headpool, Kidpool, Dogpool and Lady Deadpool - and it's off to the rescue, right? Not so fast. Turns out another Elder, the Champion, isn't quite sold on this new super-team. If Deadpool and crew want to streak across the universe to face the ultimate enemy, their destiny, and much needed tacos and beer, they're going to have to pass a little test first.&quot;\n\nPromo info for the second collected edition - &quot;How many Deadpools does it take to destroy an alien world? Fresh from inexplicably saving the galaxy, the Deadpool Corps is offered a mission by the Omega Confederation to squash a rebellion by the Krook people that is derailing the company's mining operation. Naturally, the Confederation is a little miffed upon learning the Corps has changed sides! Deadpool tries to modernize the Krook society so the people can defend themselves from invasion, at the same time attempting to win Princess Teela's affections. But her father, the king, challenges Deadpool's rise to power and his kingdom's industrialization. Leave it to Wade Wilson to incite a civil war. Father fights daughter, brother battles brother, and Lady Deadpool duels Deadpool! Will Wade and friends make it out alive, or will their meddling destroy the entire planet?&quot;\n\nThis is all 12 issues of the series + Deadpool Corps - Rank And Foul. Thanks to AnPymGold-Empire for these copies; please seed and enjoy! :-)","torrent":{"xt":"urn:btih:e7e905a2db93c09552b6d90481eccdf777e206c0","amp;dn":"Deadpool+Corps+01-12+%2B+Ex+%282010-2011%7CDigital%7CAnPymGold-Emp%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7e905a2db93c09552b6d90481eccdf777e206c0","infoHashBuffer":{"type":"Buffer","data":[231,233,5,162,219,147,192,149,82,182,217,4,129,236,205,247,119,226,6,192]},"announce":[],"urlList":[]}}