{"title":"Titan - The Life of John D. Rockefeller Sr. - Ron Chernow","uid":4201706,"size":173795189,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e7f05fe7090cdabf257532ce4e7d5a378c94466f&amp;dn=Titan+-+The+Life+of+John+D.+Rockefeller+Sr.+-+Ron+Chernow&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"rambam1776","files":10,"time":1211539250,"description":"Titan - The Life of John D. Rockefeller Sr. - Ron Chernow\n\nRead by George Plimpton\n\nEditorial Reviews\n\nProduct Description\nJohn D. Rockefeller, Sr.--history&amp;#039;s first billionaire and the patriarch of America&amp;#039;s most famous dynasty--is an icon whose true nature has eluded three generations of historians. Now Ron Chernow, the National Book Award-winning biographer of the Morgan and Warburg banking families, gives us a history of the mogul &quot;etched with uncommon objectivity and literary grace . . . as detailed, balanced, and psychologically insightful a portrait of the tycoon as we may ever have&quot; (Kirkus Reviews). Titan is the first full-length biography based on unrestricted access to Rockefeller&amp;#039;s exceptionally rich trove of papers. A landmark publication full of startling revelations, the book will indelibly alter our image of this most enigmatic capitalist.\n        Born the son of a flamboyant, bigamous snake-oil salesman and a pious, straitlaced mother, Rockefeller rose from rustic origins to become the world&amp;#039;s richest man by creating America&amp;#039;s most powerful and feared monopoly, Standard Oil. Branded &quot;the Octopus&quot; by legions of muckrakers, the trust refined and marketed nearly 90 percent of the oil produced in America.\n        Rockefeller was likely the most controversial businessman in our nation&amp;#039;s history. Critics charged that his empire was built on unscrupulous tactics: grand-scale collusion with the railroads, predatory pricing, industrial espionage, and wholesale bribery of political officials. The titan spent more than thirty years dodging investigations until Teddy Roosevelt and his trustbusters embarked on a marathon crusade to bring Standard Oil to bay.\n        While providing abundant new evidence of Rockefeller&amp;#039;s misdeeds, Chernow discards the stereotype of the cold-blooded monster to sketch an unforgettably human portrait of a quirky, eccentric original. A devout Baptist and temperance advocate, Rockefeller gave money more generously--his chosen philanthropies included the Rockefeller Foundation, the University of Chicago, and what is today Rockefeller University--than anyone before him. Titan presents a finely nuanced portrait of a fascinating, complex man, synthesizing his public and private lives and disclosing numerous family scandals, tragedies, and misfortunes that have never before come to light.\n        John D. Rockefeller&amp;#039;s story captures a pivotal moment in American history, documenting the dramatic post-Civil War shift from small business to the rise of giant corporations that irrevocably transformed the nation. With cameos by Joseph Pulitzer, William Randolph Hearst, Jay Gould, William Vanderbilt, Ida Tarbell, Andrew Carnegie, Carl Jung, J. Pierpont Morgan, William James, Henry Clay Frick, Mark Twain, and Will Rogers, Titan turns Rockefeller&amp;#039;s life into a vivid tapestry of American society in the late nineteenth and early twentieth centuries. It is Ron Chernow&amp;#039;s signal triumph that he narrates this monumental saga with all the sweep, drama, and insight that this giant subject deserves.\n\n\n\nAbout the Author\nRon Chernow&amp;#039;s first book, The House of Morgan, won the National Book Award and the Ambassador Award for the year&amp;#039;s best study of American culture. His second book, The Warburgs, won the Eccles Prize as the Best Business Book of 1993 and was also selected by the American Library Association as one of that year&amp;#039;s best nonfiction books. In reviewing his recent collection of essays, The Death of the Banker, The New York Times called the author &quot;as elegant an architect of monumental histories as we&amp;#039;ve seen in decades  and chose the paperback original as one of the year&amp;#039;s Notable Books.\n\n\n--------------------------------------------------------------------------------\nProduct Details\n\nPaperback: 832 pages \nPublisher: Vintage (March 30, 2004) \nLanguage: English \nISBN-10: 1400077303 \nISBN-13: 978-1400077304  \n &lt;a href=&quot;\nhttp://www.amazon.com/Titan-Life-John-Rockefeller-Sr/dp/1400077303/ref=sr_1_1?ie=UTF8&amp;s=books&amp;qid=1211457246&amp;sr=8-1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Titan-Life-John-Rockefeller-Sr/dp/1400077303/ref=sr_1_1?ie=UTF8&amp;s=books&amp;qid=1211457246&amp;sr=8-1&lt;/a&gt;\n\nTranscribed from Audio Tape","torrent":{"xt":"urn:btih:e7f05fe7090cdabf257532ce4e7d5a378c94466f","amp;dn":"Titan+-+The+Life+of+John+D.+Rockefeller+Sr.+-+Ron+Chernow","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7f05fe7090cdabf257532ce4e7d5a378c94466f","infoHashBuffer":{"type":"Buffer","data":[231,240,95,231,9,12,218,191,37,117,50,206,78,125,90,55,140,148,70,111]},"announce":[],"urlList":[]}}