{"title":"Clips4sale - Pristine Edge (My Army Daughter)","uid":15531387,"size":904306892,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:e80c6c28dee2ac21c624e53d0ba3bb11c9cc261b&amp;dn=Clips4sale+-+Pristine+Edge+%28My+Army+Daughter%29++&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"SudoSu","files":1,"time":1470834111,"description":"http://youpornbook.com\r\n\r\n―――――――――――――――――――――――――\r\n ... : Screenshots : ... \r\n――――――――――――――――――――――――― \nhttp://imgkiss.com/image/1fMs6 \nhttp://imgkiss.com/image/1f5ie\r\n\r\nScene 1: Inappropriate\r\nPrestine catches her dad looking at her ass, she gives him a show, sits on his lap and grinds his cock. She needs help stretching and teases her dad about his hard cock. Embarrassed, dad runs off saying &quot;that's inappropriate&quot;!\r\n\r\nScene 2: Dad Catches Me\r\nPrestine gets comfortable now that she is back from the army and enjoys a hot shower in daddy's bathroom. Dad walks in wondering why she is in his shower. Prestine needs help drying off and dad is happy to help, but he can't hide his hard on and Prestine wants to help her dad out. She eagerly goes down on his cock and deep throats it gagging herself. Daddy wants to play with her ass and has to taste her soft pussy. Prestine welcomes her dads cock being slammed into her pussy while she is bent over the tub screaming with pleasure. Daddy opens up his daughter in all positions and can't hold back anymore, blowing his load deep in her pussy.\r\n\r\nScene 3: Military Games\r\nPrestine knows that she can get her daddy's cock hard anytime she wants no matter what he is doing. The girls in the army had a game where they would see who could get a guy off the fastest. Prestine gets her dad's cock in her mouth and gags on it trying to deep throat it. She really wants to get her daddy off. Daddy loves the way she sucks his cock and shoots his load in her mouth so she can enjoy every last drop.\r\n\r\nScene 4: Who Cums Last Wins\r\nPrestine wants to play another game with her dad and he knows he can easily win by making her cum first. Daddy goes down on Prestine and she is loving it! He slams his cock deep in her pussy and she moans loudly. Prestine mounts his dick and bounces up and down trying to get him to cum first. He fucks her wet pussy all over the living room making her scream with pleasure and he spanks her for being a bad girl. She is ready for his cum and gets on her knees, daddy gives her just what she wants and shoots his load all over her face and mouth. Prestine's dad really made a mess!\r\n\r\nTop 0-Day and selected porn at:  https://thepiratebay.se/user/SudoSu/","torrent":{"xt":"urn:btih:e80c6c28dee2ac21c624e53d0ba3bb11c9cc261b","amp;dn":"Clips4sale+-+Pristine+Edge+%28My+Army+Daughter%29++","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e80c6c28dee2ac21c624e53d0ba3bb11c9cc261b","infoHashBuffer":{"type":"Buffer","data":[232,12,108,40,222,226,172,33,198,36,229,61,11,163,187,17,201,204,38,27]},"announce":[],"urlList":[]}}