{"title":"Morrowind: The Complete Collection (+ Overhaul 3.0) by Anesidora","uid":11629805,"size":3519414272,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e831dd78463c112f809c75aa8c2e88a3e5164602&amp;dn=Morrowind%3A+The+Complete+Collection+%28%2B+Overhaul+3.0%29+by+Anesidora&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"Anesidora","files":-1,"time":1417666479,"description":"======================================================================\nThe Elder Scrolls III: Morrowind: The Complete Collection by Anesidora\n======================================================================\n\nThis is a custom DVD image with a complete collection of my favorite game of all time, Morrowind!\n\nIncluded on this DVD:\n\n - Morrowind\n - Morrowind Construction Set\n - both Morrowind expansions: Tribunal and Bloodmoon\n - the final v1.6.1820 patch for the game\n - Morrowind Overhaul 3.0 (MGSO)\n - a no-CD patch that WORKS with the Morrowind Overhaul and Morrowind Code Patch!\n - all .NET/VC++ redists required for Morrowind Overhaul\n - the full Morrowind soundtrack by Jeremy Soule in 320 Kbps MP3 format\n\nFor those who don't know, Morrowind Overhaul is a large collection of graphical and audio improvements for the game. Morrowind Overhaul 3.0 is the latest version, released in 2012. It has its own installer with which you can customize the settings further. It's an impressive collection that makes the game look amazing without ruining the &quot;Morrowind&quot; feel.\n\nOne of the many improvements included with the Morrowind Overhaul is the Morrowind Code Patch, which directly modifies the Morrowind.exe file to fix a large number of bugs in the game. It's an extremely useful utility. The problem is that it only works on an unmodified 1.6.1820 Morrowind.exe, so if you replace it with a cracked version to bypass the CD check, the Morrowind Code Patch will refuse to run. Fortunately, there's one no-CD patch that works alongside the Morrowind Code Patch: TRASD's Morrowind Patch, which is included in this collection.\n\nMorrowind Overhaul homepage:   &lt;a href=&quot;\nhttp://www.ornitocopter.net/morrowind-overhaul/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.ornitocopter.net/morrowind-overhaul/&lt;/a&gt; \n\nGet more Morrowind mods at Morrowind Modding History:   &lt;a href=&quot;\nhttp://mw.modhistory.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mw.modhistory.com/&lt;/a&gt; \n\nMW Modding History has most of the mods that were once hosted on Planet Elder Scrolls, which has not worked since 2012.\n\n===============================================================\nINSTALLATION INSTRUCTIONS: (these are also included on the DVD)\n===============================================================\n\n1. Mount the Morrowind Complete Collection ISO file, or burn it to a DVD.\n2. Run AutoRunMorrowind.exe to install the base game.\n3. Open the &quot;2-Tribunal&quot; folder on the DVD and install the Tribunal expansion.\n4. Open the &quot;3-Bloodmoon&quot; folder on the DVD and install the Bloodmoon expansion.\n5. Open the &quot;4-Patch&quot; folder on the DVD to patch the game to v1.6.1820.\n6. Open the &quot;5-MGSO&quot; folder on the DVD. This contains the Morrowind Overhaul files. Copy the entire contents of this folder to the location where you installed Morrowind. (the files should be in the same place as the Morrowind.exe file)\n7. Run &quot;MOInstaller.exe&quot; from the Morrowind folder. Follow the instructions along the way to set up the Morrowind Overhaul. Most of it is automated, but there are several areas where you can customize the options further.\n\nNow you are done installing and can play the game. However, at this point the CD check for the game is still active. If you keep my custom DVD image mounted, it will successfully pass the CD check. But, if you want to remove the CD check completely, continue with the following steps:\n\n8. Open the &quot;6-noCD&quot; folder on the DVD. Copy the three .bik files there to the &quot;MorrowindData FilesVideo&quot; folder. (these are blank video files to skip the intro videos - alternately, you can also copy everything from the Video folder on the DVD to &quot;MorrowindData FilesVideo&quot; if you want the intro videos to play)\n9. Copy &quot;TRASDs_Morrowind_Patch.exe&quot; to the location where you installed Morrowind. (again, the file should be in the same place as the Morrowind.exe file)\n10. Run &quot;TRASDs_Morrowind_Patch.exe&quot; from the Morrowind folder. This will remove the CD check","torrent":{"xt":"urn:btih:e831dd78463c112f809c75aa8c2e88a3e5164602","amp;dn":"Morrowind%3A+The+Complete+Collection+%28%2B+Overhaul+3.0%29+by+Anesidora","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e831dd78463c112f809c75aa8c2e88a3e5164602","infoHashBuffer":{"type":"Buffer","data":[232,49,221,120,70,60,17,47,128,156,117,170,140,46,136,163,229,22,70,2]},"announce":[],"urlList":[]}}