{"title":"ExploitedCollegeGirls - Mandy","uid":12443617,"size":396063289,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:e8ce4860ec7ef1ddccfc882368b4be7ab4c1a6a3&amp;dn=ExploitedCollegeGirls+-+Mandy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"EndYou","files":1,"time":1442603923,"description":"-------------\n:Description:\n-------------\nIf you like slim, exotic, multi-orgasmic girls then Mandy is definitely your kinda chick. She's got tiny titties with super pokey nipples, a cute little handful of ass, a big smile and an even bigger appetite for sex. On top of those obvious charms, she's a total exhibitionist who will try anything if she thinks it will get her or her guy off. After teasing Jay with her many tales of public fucking and exhibitionism, he puts her to the test and walks her out to the hallway and has her drop to her knees just south of the ice machine for a sneaky public blowjob and then puts her up against the wall for a quick fuck.\n\nIf we gave the updates titles, this week's Ex Co Gi vid would be called either &quot;How to Make a Spinner Scream&quot; or &quot;Why Jay Gets Kicked Out of So Many Hotels.&quot; It's obvious from the start that Jay and Mandy have some solid chemistry. Jay loves a spinner and Mandy certainly doesn't mind a big dick on a decent looking guy so they are basically soul mates. While some porn girls may feel like they need to pretend to be into their co-star, in Mandy's case it's genuine. You can tell how turned on she is when she strips and her pussy is still creamed up from her recent hallway date.\n\nJay gets things re-started by exploring Mandy's pussy with his fingers and then with a vibrator. His attentions seem to be getting to her and he hands Mandy a second vibrator to join in on the action. Things escalate quickly and soon Mandy is having a REALLY good time. Jay can't resist her creamy cameltoe and has her drop to her knees to get his dick hard with a nice tongue lashing. When he's at full attention he lays Mandy out and gives her a seriously deep fucking. You can tell pretty quickly how much Mandy is into it. She completely lets loose as Jay pounds her to one full throated, screaming orgasm after another.\n\nHe flips her over, then pulls her on top and even pounds her face first into the bed as he drills her to orgasm after orgasm, so many that she loses count. There's no way to lose count of Jay's orgasms, though. He unleashes a big splashy load across Mandy's face, very much to her chagrin. Fans of cum hate pay close attention, Mandy is not at all excited about her free facial, but she takes it like a champ. Considering how good jizz is purported to be for skin, Mandy would really do herself a favor by taking a few more loads to the grille. \n\n-------------\n:Screenshots:\n------------- &lt;a href=&quot;\nhttp://imgpremium.com/image/uF&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgpremium.com/image/uF&lt;/a&gt; &lt;a href=&quot;\nhttp://imgpremium.com/image/uL&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgpremium.com/image/uL&lt;/a&gt;","torrent":{"xt":"urn:btih:e8ce4860ec7ef1ddccfc882368b4be7ab4c1a6a3","amp;dn":"ExploitedCollegeGirls+-+Mandy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8ce4860ec7ef1ddccfc882368b4be7ab4c1a6a3","infoHashBuffer":{"type":"Buffer","data":[232,206,72,96,236,126,241,221,204,252,136,35,104,180,190,122,180,193,166,163]},"announce":[],"urlList":[]}}