{"title":"Stone Temple Pilots - Thank You (2003) 320 vtwin88cube","uid":6162865,"size":157705911,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e8eabb7daeb2e12036e15995970c729e4870651a&amp;dn=Stone+Temple+Pilots+-+Thank+You+%282003%29+320+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"vtwin88cube","files":-1,"time":1297275310,"description":"Stone Temple Pilots\nThank You (2003)\n\nStone Temple Pilots were able to turn alternative rock into stadium rock; naturally, they became the most critically despised band of their era. Accused by many critics of being nothing more than ripoff artists who pilfered from Pearl Jam, Soundgarden, and Alice in Chains, the bandmates nevertheless became major stars in 1993. And the influence of those bands was apparent in their music, although Stone Temple Pilots did manage to change things around a bit. STP were more concerned with tight song structure and riffs than punk rage. Their closest antecedents were not the Sex Pistols or HÃƒÂ¼sker DÃƒÂ¼; instead the band resembled arena rock acts from the '70s -- they made popular hard rock that sounded good on the radio and in concert. No matter what the critics said, Stone Temple Pilots had undeniably catchy riffs and production; there's a reason why over three million people bought their debut album, Core, and why their second album, Purple, shot to number one when it was released. \n\nSome bands get no respect, no matter what they do, but Stone Temple Pilots suffered the slings and arrows of outrageous misfortune more than most. Some of this was brought on by themselves, particularly in the early days when they sounded like a mix of Pearl Jam and Alice in Chains and relied on macho bluster in their videos, but critics and rockists singled them out as the one band that typified how the establishment was going to sell out the alt-rock revolution that Nirvana kicked off in 1992, the year punk broke. By Stone Temple Pilots' second album, 1994's Purple, they had not only gotten better and weirder than expected; they'd also had the benefit of being surrounded by bands that really were corporate alt-rock rip-offs, so they not only had gotten better, but circumstances made them seem better, too, even if many critics still clung to their blind hatred of the band. Then, as the music guitarist Dean DeLeo and vocalist Scott Weiland wrote continued to get more interesting, Weiland began his descent into drug addiction, cycling through jail and rehab innumerable times. There was a brief parting of the ways in 1997, as Weiland recorded a solo album and the remaining trio formed the short-lived Talk Show, but the group soldiered on into 2001, cutting solid records, yet they were ultimately derailed by Weiland's addictions -- which, in a charming display of empathy, made some of the band's longtime critics gloat.\n\nChannels:\t\t2 (Stereo)\nSample Rate:\t\t44.1 KHz\nSample Size:\t\t16 bit\nBit Rate:\t\t320 kbps\n\nAudio Quality:\t\tVery High (Lossy)\nEncoder:\t\tLAME 3.98r\nEncoder Settings:\tConstant Bit Rate 320 kbps (Insane)\nContains:\t\tAlbum Art, ID Tag [ID3v2.3 (ANSI) &amp; ID3v1.1]\n\nFormat:\t\t\tMp3\nGenre:\t\t\tAlternative\t\nM3U Playlist:\t\tYes\n\n01.Vasoline\n02.Down\n03.Wicked Garden\n04.Big Empty\n05.Plush\n06.Big Bang Baby\n07.Creep\n08.Lady Picture Show\n09.Trippin' On A Hole In A Paper Heart\n10.Interstate Love Song\n11.All In The Suit That You Wear\n12.Sex Type Thing\n13.Days Of The Week\n14.Sour Girl\n15.Plush (Acoustic Version)\n16.Long Way Home (Bonus Track)\n","torrent":{"xt":"urn:btih:e8eabb7daeb2e12036e15995970c729e4870651a","amp;dn":"Stone+Temple+Pilots+-+Thank+You+%282003%29+320+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8eabb7daeb2e12036e15995970c729e4870651a","infoHashBuffer":{"type":"Buffer","data":[232,234,187,125,174,178,225,32,54,225,89,149,151,12,114,158,72,112,101,26]},"announce":[],"urlList":[]}}