{"title":"jQuery 2 Recipes: A Problem-Solution Approach","uid":11271563,"size":17336172,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e9b302c3484e85cec352c4bdb92e101ce25900fa&amp;dn=jQuery+2+Recipes%3A+A+Problem-Solution+Approach&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"AUDI-A4","files":1,"time":1414087327,"description":"Query is often referred to as the 'write less, do more' JavaScript library. It allows a few clear lines of elegant, well-tested, code to replace many pages of complex hand-coded script, speeding development times and providing substantial cost savings. You will find jQuery 2 Recipes' problem-solution approach to be an excellent value and a feature-packed resource as you begin to include jQuery in your own projects. This book is bursting with fully-worked example recipes showing the core jQuery frameworks (jQuery, jQuery Mobile, jQuery UI) in action. Starting with fundamental principals and progressing to more advanced topics you'll be shown how to make the very best use of jQuery every step of the way. Early on, you'll learn to work confidently with dynamic data and to handle the jQuery events that form the foundation of your application. We'll then build on this foundation to demonstrate how fully working user-interface animations and AJAX data-validation can be constructed within jQuery. We'll show how add-on libraries like jQwidgets can be deployed to create professional quality apps for both the desktop and web with minimal coding. Finally, a full set of debugging and error-handling recipes is included to help you track down bugs and ensure your code is as robust as it can be. What you'll learn This book contains a comprehensive collection of recipes that will help you solve a wide range of jQuery 2.0 problems. Follow working examples of the main features of all three core jQuery frameworks (jQuery, jQuery UI and jQuery Mobile) in action. See how to integrate jqWidgets into your application effectively. Learn the techniques to create and implement custom animations and effects using","torrent":{"xt":"urn:btih:e9b302c3484e85cec352c4bdb92e101ce25900fa","amp;dn":"jQuery+2+Recipes%3A+A+Problem-Solution+Approach","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9b302c3484e85cec352c4bdb92e101ce25900fa","infoHashBuffer":{"type":"Buffer","data":[233,179,2,195,72,78,133,206,195,82,196,189,185,46,16,28,226,89,0,250]},"announce":[],"urlList":[]}}