{"title":"Faith Like Potatoes","uid":9080927,"size":1468049805,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ea5dbc5e85b5bd79ba284a332024bf778f0abf35&amp;dn=Faith+Like+Potatoes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"IndianChristian","files":6,"time":1382385421,"description":"Faith like Potatoes (Christian Movie)\n\n\nA very touching and moving story of one man's trials and tribulations which try his faith. Angus is a very intense man who fights his own inner demons with his farm in Africa and family until he makes a life changing discovery. He turns his life around when he gives it to God. With new found faith that is challenged by many different circumstances he must believe that the Lord has a plan for him.\n\nFrank Rautenbach leads a strong cast as Angus Buchan, a Zambian farmer of Scottish heritage, who leaves his farm in the midst of political unrest and travels south with his family to start a better life in Kwa-Zulu Natal, South Africa. Buchan accepted Jesus at a moment of crisis and began experiencing miracles, ranging from sudden rain putting out a wildfire to reviving a woman struck by lightning. The movie follows Buchan from his failed farm in Zambia to his rise as a lay evangelist, delivering a sermon in a massive South African stadium. He begins as a sullen, short-tempered man, quick to lash out at his wife and the native Zulu workers on his struggling farm. But as his life takes on the purpose of spreading the Word, Buchan finds personal peace (though he also faces personal tragedies). \n\nBased on the inspiring true story of Angus Buchan's autobiographical book, Faith Like Potatoes was adapted for the big screen by award winning actor and director, Regardt van der Bergh, and weaves together the moving journey of a man who, like his potatoes, grows his faith, unseen until the harvest. This inspiring true story of a rugged South African farmer, Angus Buchan, is set in the turbulent hills of the KZN Midlands. Angus' manic quest for material success is slowly transformed into a wild love for God and people, as he wrestles with faith, hope, natural disasters and tragic personal loss. \n\nWe all face challenges in our lives and sometimes question our own faith. This movie may make everyone take a hard look at their own lives and see that changes can be made. This story will have you looking at your own spiritual life in a new light. \n\nRuntime: 117 mins\nLanguage: English\nSubtitles: English\nYear: 2006\nQuality: 10/10\nFormat: avi format \n\nSee reviews here,  &lt;a href=&quot;\nhttp://www.amazon.com/Faith-Like-Potatoes-Frank-Rautenbach/dp/B001QB5SS6&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Faith-Like-Potatoes-Frank-Rautenbach/dp/B001QB5SS6&lt;/a&gt;\n\nI would ask every Christian to do 2 things.\n\n1. If possible please buy this movie. Do you know that there are 2.2 billion Christians on earth today. But only a privileged few, around 12% have the means and the accessibility to buy Christian films. Many Christians are too poor to buy movies or live in places where Christian films are not available. \nThat's not all. Out of the 12% who have the means and accessibility to buy Christian media, only around 0.5% ever buys a Christian movie. In other words only 1 out of 200 Christians ever buys a Christian movie. Pathetic isn't it?\nPlease buy the movies to keep Christian films in business. And please do pray for the Christian movie makers and their families.\n\n2. Please seed the movies for as long as possible. If possible make copies and distribute to your poor neighbors. And please do pray for the movie makers and their families. Remember the Kingdom of Heaven is in you and so is the choice of Heaven/Hell. \n\nPS: If you need any specific Christian movie or have something to say then kindly send a mail to &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;84edeae0ede5eae7ecf6edf7f0ede5eab6b4b4bdc4fde5ecebebaae7ebaaedea&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\nKindly mention the subject as Christian Movies or something similar. \n\n&quot;Don't ask me what Christ can do for you! He has done all he could. Tell me what you can do for Christ?&quot;\n\nUploaded by Indian Christian\n","torrent":{"xt":"urn:btih:ea5dbc5e85b5bd79ba284a332024bf778f0abf35","amp;dn":"Faith+Like+Potatoes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea5dbc5e85b5bd79ba284a332024bf778f0abf35","infoHashBuffer":{"type":"Buffer","data":[234,93,188,94,133,181,189,121,186,40,74,51,32,36,191,119,143,10,191,53]},"announce":[],"urlList":[]}}