{"title":"Train Your Brain to Get Rich by Teresa Aubele","uid":9410744,"size":2803486,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eaf65560cbfea8b97acdc90819fe5b78c82b9f14&amp;dn=Train+Your+Brain+to+Get+Rich+by+Teresa+Aubele&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"420weedman","files":-1,"time":1388282091,"description":"You really can think yourself rich--when you program your gray matter to make money. In this groundbreaking guide, neuroscientist Dr. Teresa Aubele teams up with finance whiz Doug Freeman, business consultant Dr. Lee Hausner, and Psychology Today blogger Susan Reynolds to help you capitalize on your brain--literally. \nThis one-of-a-kind method draws upon the most recent breakthroughs in neuroscience, biology, and psychology to show you how to: \nMake more money, by reprogramming your brain to identify the best opportunities \nInvest more wisely, by short-circuiting the pleasure center that facilitates your faulty reasoning \nRebound from financial setbacks, without getting trapped by your brain's fight-or-flight response \nCreate more wealth, by focusing your mind on innovation and creativity \nKeep more of what you make, by tricking your brain into taking the long view. \nThis book is your ticket to a more money-minded brain, a bigger bank account, and a richer life--one fortune at a time!","torrent":{"xt":"urn:btih:eaf65560cbfea8b97acdc90819fe5b78c82b9f14","amp;dn":"Train+Your+Brain+to+Get+Rich+by+Teresa+Aubele","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eaf65560cbfea8b97acdc90819fe5b78c82b9f14","infoHashBuffer":{"type":"Buffer","data":[234,246,85,96,203,254,168,185,122,205,201,8,25,254,91,120,200,43,159,20]},"announce":[],"urlList":[]}}