{"title":"DiskDigger 1.5.4.1405","uid":7689100,"size":1076512,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:eb1b35574cc0c565ee7c71a8d03e900e7d4a1b7d&amp;dn=DiskDigger+1.5.4.1405&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"wallpwallpapers","files":-1,"time":1349040989,"description":"DiskDigger is a utility for recovering deleted or formatted files from any storage media connected to your computer, including all types of memory cards, USB drives and internal or external hard drives. The program thoroughly searches the file system for traces of files as well as deleted files and allows you to preview many of them as they are found. You can limit the search to certain file types and also specify the sector range of the disk to scan. Easy to use; instant preview of found files; works with all types of storage media\n\nIn a nutshell, the program is shifting more towards a &quot;shareware&quot; model. Here is exactly how it will work now:\n* When you run the program, it will operate normally. That is, it will find your deleted files, show you previews, etc.\n* When you try to save the deleted files, the program will show a message box asking you to enter a license key.\n* The program will actually let you continue without a license key (after a short delay), but it will keep popping up the message box for every file you try to save without a license key.\n\nBased on the above, you can technically recover all your files for free with DiskDigger.\n\nInstall:\n\nRun setup\nUse keygen","torrent":{"xt":"urn:btih:eb1b35574cc0c565ee7c71a8d03e900e7d4a1b7d","amp;dn":"DiskDigger+1.5.4.1405","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb1b35574cc0c565ee7c71a8d03e900e7d4a1b7d","infoHashBuffer":{"type":"Buffer","data":[235,27,53,87,76,192,197,101,238,124,113,168,208,62,144,14,125,74,27,125]},"announce":[],"urlList":[]}}