{"title":"Jacek Komuda - Galeony Wojny [Polish]","uid":14860924,"size":715948057,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:eb5484ebe2d1f5fc230d224898dcd694c78ed3bc&amp;dn=Jacek+Komuda+-+Galeony+Wojny+%5BPolish%5D+MP3%4096&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"everdarksoul","files":42,"time":1465513253,"description":"Marynistyka z pogranicza historii i fantastyki - świat żaglowców, morskich awanturników, kaszubskich piratów, kaprów i kapitanów XVII-wiecznej Rzeczypospolitej. Bitwy wojennych galeonów, salwy całoburtowe, kaperskie rajdy i abordaże na pokładach tonących okrętów, niszczycielskie sztormy, smak morskiej wody i krwi... Śmierć i chwała, gorycz porażki i słodki zapach zwycięstwa!\r\n\r\nTom I\r\n\r\nAudiobook PL - 20 części /   \r\nrozmiar: 402 MB / czas: 09:45:19\r\nczyta: Andrzej Hausner\r\n\r\nGdańsk, rok 1627. Szwedzi atakują ujście Wisły a ich okręty rozpoczynają blokadę miasta. Do walki z eskadrami Gustawa Adolfa staje młoda polska flota wojenna Zygmunta III Wazy, wspierana przez kaprów na służbie królewskiej.\r\nKapitan Arendt Dickmann - późniejszy admirał i zwycięzca w bitwie pod Oliwą - rzuca wyzwanie Fortunie, stawiając na jedną kartę honor i doświadczenie. Razem ze szlachcicem Markiem Jakimowskim - buntownikiem z tureckiej galery - wyrusza w morze, by posłać na dno złowrogiego Lewiatana napadającego na statki z Gdańska.\r\nI przekonać się, czy opowieści o bestii z morskich otchłani są prawdą, czy tylko podstępną intrygą szwedzkich korsarzy...\r\n________________________________________________________\r\n\r\nTom II\r\n\r\nAudiobook PL - 15 części /   \r\nrozmiar: 279 MB / czas: 06:46:34\r\nczyta: Andrzej Hausner\r\n\r\nMija rok od rozpoczęcia polsko-szwedzkiej wojny o ujście Wisły.\r\nArendt Dickmann, powracający ze zwycięskiej wyprawy kapitan w służbie króla Zygmunta III Wazy, znów zmierzyć się musi z diabelską legendą Lewiatana - tajemniczego kapra napadającego na gdańskie statki.\r\nA potem - już jako królewski admirał - poprowadzić polskie galeony wojenne do ostatecznego boju ze Szwedami pod Oliwą, wstrząsając sumieniem dumnego Gdańska","torrent":{"xt":"urn:btih:eb5484ebe2d1f5fc230d224898dcd694c78ed3bc","amp;dn":"Jacek+Komuda+-+Galeony+Wojny+%5BPolish%5D+MP3%4096","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb5484ebe2d1f5fc230d224898dcd694c78ed3bc","infoHashBuffer":{"type":"Buffer","data":[235,84,132,235,226,209,245,252,35,13,34,72,152,220,214,148,199,142,211,188]},"announce":[],"urlList":[]}}