{"title":"The L Word - Season 2 (gremster)","uid":4225737,"size":4748148783,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:eb5a2a21ea3bdcf752c16c55a8703ecd9534c6d2&amp;dn=The+L+Word+-+Season+2+%28gremster%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":2,"uploader":"gremster","files":14,"time":1212814108,"description":"Season 2, Episode 1: Life, Loss, Leaving\nOriginal Air Date: 20 February 2005\nFive months later. Bette desperately begs for forgiveness from Tina over her affair with Candace, but it falls on deaf ears. But Tina is revealed to be hiding a shocking secret from her friends that she happens to be pregnant again. Meanwhile, Alice and Dana continue to hide their romantic tryst from the others, including Tonya. Jenny finds herself with writers block, and saying an emotional goodbye to Tim as he prepares to leave town for a teaching job back in Ohio. Shane lands a new lover, named Carmen de la Morales, whom she meets at a movie studio while doing hairstyling for her latest client. With Marina gone after learning of her nervous breakdown and her attempted suicide, Kit decides to buy The Planet and continues to have mixed feelings over hanging out with Ivan.\n\n\nSeason 2, Episode 2: Lap Dance\nOriginal Air Date: 27 February 2005\nActing on Alice&amp;#039;s advice, Tina decides to hire a famous, but ruthless, feminist lesbian lawyer named Joyce Wischnia, to support and help with her separation from Bette. Meanwhile, Dana and Tonya have a get together with Dana&amp;#039;s parents to discuss their upcoming nuptials. Ivan gives Kit the cold shoulder as she prepares to finalize her purchase of The Planet coffeehouse from Marina&amp;#039;s visiting estranged husband. Jenny enrolls in a creative writing class at UCLA taught by the stern and cynical Charlotte Birch which the latest writing assignment makes Jenny decide to have a serious discussion with Robin regarding their relationship. Also, Dana and Tonya take Alice, Shane, and Tina for a night on the town to a strip club.\n\n\nSeason 2, Episode 3: Loneliest Number\nOriginal Air Date: 6 March 2005\nWhen she is rejected from the writing class of Charlotte Birch, Jenny sets out to win over her intimidating professor by deciding to write a page based on her life story. Shane moves in with Jenny at the house, where Jenny meets Carmen for the first time, and a kind of attraction develops almost at once. Meanwhile, Bette goes on a downward spiral over Tina&amp;#039;s lawsuit. Joyce also offers Tina a place to stay at her guest house during her legal battle. Dana and Alice continue to hide their attraction, while Toyna decides to make a show of her impending marriage to Dana. Kit tries to find an opening act for The Planet&amp;#039;s grand re-opening, and things heat up, then cool down, between Shane and Carmen. Also, Tina is devastated when she finds an e-mail love letter from Candace on Bette&amp;#039;s computer.\n\n\nSeason 2, Episode 4: Lynch Pin\nOriginal Air Date: 13 March 2005\nBette travels to New York on business to ask for continued funding for the California Art Center from Helena Peabody, the ruthless daughter of Peggy Peabody, who takes over her mother&amp;#039;s business and refuses to give anymore funds. Later, Bette finds herself lonely and has a one-night-stand with a woman she meets in a nightclub. Meanwhile, Tina is shocked and angry when her lawyer, Joyce, makes a pass at her. Jenny and Shane search for a new roommate. But they have no luck with interviews until a dashing young film maker, named Mark Wayland, drops by and charms both of them. Kit bonds with an inspirational speaker named Benjamin Bradshaw. Also, Shane has a run-in with a movie producer, named Veronica Bloom whom, after seeing Shane&amp;#039;s quick wit and determination, offers her a job.\n\n\nSeason 2, Episode 5: Labyrinth\nOriginal Air Date: 20 March 2005\nBette tries to fix her relationship with Tina who temporarily settles in the house, but she gets a rude awakening with some bad news at work when Helena Peabody arrives in Los Angeles to stay, and maliciously withdraws her grant from the CAC and gives a $100,000 grant to Tina&amp;#039;s social work office. Things go from bad to worse for Bette when she later finds out that she was the last to know about Tina&amp;#039;s pregnancy. Meanwhile, Alice and Dana try taking their secret relationship to a different level with new sexual positions. Tonya throws a bachelorette party at The Planet with Dana&amp;#039;s and Tonya&amp;#039;s mothers in attendance, and Carmen as the DJ. Shane starts her new job as the PA to the egotistical Veronica Bloom who does not pass up any opportunity to exploit Shane&amp;#039;s personal wit to get what she wants. Jenny gets some confidence from her new shortened hairstyle, while Mark launches a new video project, with both Jenny and Shane being the center of it. But when they both back out, Mark and his sleazy friend, Gomey, install hidden cameras all over the house to get the footage needed.\n\n\nSeason 2, Episode 6: Lagrimas de Oro\nOriginal Air Date: 27 March 2005\nAlice pushes Dana to break up with Tonya after a major tennis tournament. But Dana isn&amp;#039;t prepared for when Tonya reveals her own secret about being involved with Melissa Rivers, one of Dana&amp;#039;s sponsors. Meanwhile, Tina considers her new attraction to Helena as she moves out of Bette&amp;#039;s place for the second time. Tina also ignores Bette&amp;#039;s warnings that Helena is dangerous and does anything to get what she wants. Kit finally hooks up with Benjamin and persuades a lonely Bette to attend one of his seminars. Following Charlotte Birch&amp;#039;s advice, Jenny decides to bond more with Carmen. Also, Mark becomes more obsessed with Shane when he hires a prostitute, named Kelly, to seduce her so he can secretly videotape it.\n\n\nSeason 2, Episode 7: Luminous\nOriginal Air Date: 3 April 2005\nShane tries to dull her pain by a day at a health spa with Veronica in the hopes that she can forget about Carmen and Jenny&amp;#039;s blossoming relationship. Later, Shane gets stoned in which she gets beaten up, and is rescued by Mark. Meanwhile, Tina comes between Helena and her ex lover, Winnie Mann, over custody of their two young children. Bette also sees a glimmer of hope in her life when she meets Leo Herrera, the California Art Center&amp;#039;s new sponsor, and word gets around of her single status. Jenny continues writing her novel for Charlotte&amp;#039;s writing class and comes into issues with her classmate Hunter. Also, Dana and Alice call everyone to The Planet to announce their romantic relationship where Kit throws them a party for them.\n\n\nSeason 2, Episode 8: Loyal\nOriginal Air Date: 10 April 2005\nWhen Alice tries to catch up on her latest journalism assignment, she accidentally runs into her ex, Gabby, and is more surprised to find out that Gabby is now dating Dana&amp;#039;s ex-girlfriend Lara. Meanwhile, Bette and Tina try to reach an agreement over their relationship, as Tina goes house-hunting with Helena who comes on board the CAC&amp;#039;s board of directors. Bette meets Winnie who wants to recruit Bette over helping her win her custody battle over Winnie and Helena&amp;#039;s kids. Jenny is worried that she may have lost the job of ghost-writing a TV star, named Burr Connor&amp;#039;s, autobiography because she lets it slip out about her lesbianism. Mark and Gomey meet with a sleazy producer for their reality video, while Mark continues to obsess over Shane, who finds some comfort in a church over her recent emotional setbacks.\n\n\nSeason 2, Episode 9: Late, Later, Latent\nOriginal Air Date: 17 April 2005\nDana is stunned when Alice requests a bold sexual favor from her: a new strap-on. Meanwhile, Charlotte Birch sets up Jenny with another meeting with Burr Connor to ghost write his autobiography where he privately reveals to Jenny that he too happens to be gay, and does not want to come out of the closet. Jenny also finds out about Mark&amp;#039;s voyeurism when she accidentally discovers his videotape collection where on one, Carmen&amp;#039;s reveals her real feelings for Shane. In the meantime, Mark finally completes his reality video. But his sleazy and narrow-minded producer, dissatisfied that there still isn&amp;#039;t enough sex or nudity in it, terminates Mark&amp;#039;s employment. Kit plans a romantic night for Benjamin, but it doesn&amp;#039;t end well when Benjamin cancels and Kit ends up at an AA meeting where Ivan is in attendance. Also, Bette and Tina have an intimate encounter as they bond over their unborn baby, but it goes no further. Tina then goes back to renew her relationship with Helena.\n\n\nSeason 2, Episode 10: Land Ahoy\nOriginal Air Date: 24 April 2005\nDana, Alice, Shane, Carmen and Jenny take an eventful Olivia Cruise on a ship around the Caribbean. During it, Alice and Dana attempt to roll-play as characters from &quot;the Love Boat&quot; only to end up with Dana becoming seasick. Both Carmen and Shane question Jenny&amp;#039;s moody behavior throughout the trip, in which after wards, Jenny confronts Mark and forces him to come clean to them about his video project and Carmen&amp;#039;s feelings for Shane. Back in Los Angeles, Bette and Kit struggle to reconcile with their estranged father, Melvin, who comes for a visit. Also, Tina attends a formal dinner banquet with Helena to receive a prestigious award for Tina&amp;#039;s social work.\n\n\nSeason 2, Episode 11: Loud &amp; Proud\nOriginal Air Date: 1 May 2005\nDana is stunned when she learns a big secret about her younger brother, Howie, when he tags along with her and Alice at the annual Gay Pride Parade of 2005. Meanwhile, Mark tries to make amends with Jenny and Shane about his videotaping of them, and Jenny eventually tells him that he can stay with them, but on the condition that they cannot be friends. Kit and Bette keep a hospital bedside vigil for their father, Melvin, after learning that he has terminal prostate cancer but worse still, is refusing treatment. Tina also brings Helena along to the Gay Pride Parade, while Shane decides to try to open up to Carmen. At the end, Jenny uncovers a long-repressed and shocking memory about her childhood after visiting a bondage club.\n\n\nSeason 2, Episode 12: L&amp;#039;Chaim\nOriginal Air Date: 8 May 2005\nBette reaches out to Tina as she and Kit decide to take her father home to Bette&amp;#039;s house from the hospital for his final days. Meanwhile, Jenny struggles to compose herself after recalling a difficult memory from her childhood which leads her to a strip club where she decides to perform. Alice becomes jealous when Dana agrees to have dinner with her ex-girlfriend, Lara Perkins. Also, Shane continues to reach out to Carmen.\n\n\nSeason 2, Episode 13: Lacuna\nOriginal Air Date: 15 May 2005\nMelvin&amp;#039;s funeral service is attended by a surprise guest, Gloria Steinem, as Bette gets stunning news about her job when her boss, Franklin, fires her over the board keeping Leo Herrera as the manager. Meanwhile, Tina goes into a surprisingly difficult labor and is forced to go to the hospital as the situation gets more difficult, and dangerous. Jenny finally reaches her breaking point over her painful childhood memory of being gang raped at age 8 at a carnival by a group of four degenerate teens. Alice continues to struggle with her jealousy over Dana being around Lara. Also, Peggy Peabody arrives in Los Angeles and lays down the laws with Helena over her custody battle with Winnie for their two kids. Shane finally decides to try out a relationship with Carmen, and Mark gets renewed confidence when he gets another video taping job.\n","torrent":{"xt":"urn:btih:eb5a2a21ea3bdcf752c16c55a8703ecd9534c6d2","amp;dn":"The+L+Word+-+Season+2+%28gremster%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb5a2a21ea3bdcf752c16c55a8703ecd9534c6d2","infoHashBuffer":{"type":"Buffer","data":[235,90,42,33,234,59,220,247,82,193,108,85,168,112,62,205,149,52,198,210]},"announce":[],"urlList":[]}}