{"title":"Avatar - Legend of Korra - E01 to E07 - Saqib","uid":7286557,"size":1576136095,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:eb76361b48552c639f8e2bdf958c7669bc7aa999&amp;dn=Avatar+-+Legend+of+Korra+-+E01+to+E07+-+Saqib&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"Saqib2012","files":-1,"time":1337600446,"description":"The Legend of Korra is an American animated television series that premiered on the Nickelodeon television network on April 14, 2012. The series is a sequel to Avatar: The Last Airbender, which aired on the same network from 2005 to 2008. The Legend of Korra is currently set to run for a total of 26 episodes, consisting of two seasons of 12 and 14 episodes respectively. It takes place in the same fictional universe as the original show, whose societies have incorporated in them a multitude of elements derived from East Asian and Inuit cultures.\n\nThe series takes place 70 years after the original when technology has advanced to that of around the 1920s on Earth. In it, some people have the ability known as &quot;bending&quot; by which they control and manipulate either water, earth, fire, or air. One bender, known as the &quot;Avatar&quot; and described as the &quot;physical embodiment of the world's spirit&quot;, has the power to bend all four elements and is responsible for maintaining both the balance of nature and peace between the world's four great nations. Korra, the protagonist of the new series, is the next incarnation of the Avatar after Aang of the original series. Set seventy years after the defeat of Phoenix King Ozai and Princess Azula in the four-part finale of the original show, creators Michael Dante DiMartino and Bryan Konietzko follow Korra as she learns the art of airbending, having mastered the other three elements, while facing an anti-bender revolution by a group known as the Equalists.","torrent":{"xt":"urn:btih:eb76361b48552c639f8e2bdf958c7669bc7aa999","amp;dn":"Avatar+-+Legend+of+Korra+-+E01+to+E07+-+Saqib","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb76361b48552c639f8e2bdf958c7669bc7aa999","infoHashBuffer":{"type":"Buffer","data":[235,118,54,27,72,85,44,99,159,142,43,223,149,140,118,105,188,122,169,153]},"announce":[],"urlList":[]}}