{"title":"I am Zlatan Ibrahimovic (Epub &amp; Mobi) Gooner","uid":11690768,"size":20241956,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ecd0d819e82b91e582e7e020f0fa11a82b03323d&amp;dn=I+am+Zlatan+Ibrahimovic+%28Epub+%26amp%3B+Mobi%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"GoonerTPB","files":2,"time":1423519031,"description":"Publisher: Penguin (September 5, 2013)\nLanguage: English\nISBN-10: 0241966833\nISBN-13: 978-0241966839\n\nI am Zlatan - is the explosive, critically-acclaimed memoir of Zlatan Ibrahimovich, one of the world s most gifted and controversial footballers. Why be a Fiat when you can be a Ferrari? Welcome to planet Zlatan. This is the story of how a Swedish outsider rose from poverty to become a football genius. In his own inimitable style, Zlatan recalls every struggle, every goal, and every training ground bust-up on his journey to dominate the world s top clubs, including Ajax, Juventus, Internazionale, Barcelona, Milan and Paris Saint-Germain. Full of wicked one-liners and amazing stories, Zlatan lifts the lid on some of the biggest names in football, including Guardiola, Mourinho and Messi. Moving, funny and totally frank, I am Zlatan is a remarkable story of genuine hardship and unimaginable success. It is unlike any autobiography you have ever read. For fans of The Secret Footballer and Football Manager Stole My Life this no holds barred football memoir is every bit as dramatic and revealing as Roy Keane s classic autobiography. The best footballer s autobiography of recent years is probably I Am Zlatan Ibrahimovic.... (Simon Kuper, author of Why England Always Lose). Eagerly awaited, not least because Ibra seems to be spoiling for a fight on every other page. Dynamite said one Swedish reporter","torrent":{"xt":"urn:btih:ecd0d819e82b91e582e7e020f0fa11a82b03323d","amp;dn":"I+am+Zlatan+Ibrahimovic+%28Epub+%26amp%3B+Mobi%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ecd0d819e82b91e582e7e020f0fa11a82b03323d","infoHashBuffer":{"type":"Buffer","data":[236,208,216,25,232,43,145,229,130,231,224,32,240,250,17,168,43,3,50,61]},"announce":[],"urlList":[]}}