{"title":"Seul Contre Tous - Gaspar Noe - 1998 - Francais w/Eng. ST","uid":3725406,"size":729056746,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ed35b21d27c2b79d1cadd97f2f0e5b66217b28de&amp;dn=Seul+Contre+Tous+-+Gaspar+Noe+-+1998+-+Francais+w%2FEng.+ST&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"zanthor","files":2,"time":1182914723,"description":"Seul Contre Tous\n(Drama -- French (Intl. Critic&amp;#039;s Week))\n\nA Les Cinemas de la Zone presentation of a Cinemas de la Zone/Lovestreams Prods. co-production, with the participation of CNC.\nProduced, written, directed by Gaspar Noe.\n\n \nThe Butcher - Philippe Nahon\nHis Mistress - Frankyie Pain\nHis Daughter, Cynthia - Blandine Lenoir\nMother-in-law - Martine Audrain\n\nBy LISA NESSELSON, Variety\n\nA guy who&amp;#039;s never gotten a break decides to get even in the delectably sordid &quot;One Against All,&quot; an ultra-widescreen slice of jaundice that creates its own unrelentingly tawdry, hermetic universe. Pic does an outstanding job of burrowing into the mind of an essentially decent, average guy as he rationalizes his escalating anger at everyone and everything. A marketing headache in the prevailing climate of &quot;Is it commercial?&quot; Gaspar Noe&amp;#039;s abrasive, ironic and uncomfortably funny pic is a natural for any venue that would program &quot;Eraserhead&quot; were that forthright oddity to debut today.\n\nSeven years after his purposefully putrid 40-minute pic &quot;Carne&quot; racked up prizes (including top honors in the 1991 Cannes Crix Week and the prestigious Prix Georges Sadoul), agent provocateur Noe takes up where that film left off.\n\nOpening sequences of &quot;One&quot; deftly recap the narrative backbone of &quot;Carne.&quot; Entire pic is narrated in voiceover by the unnamed man (Philippe Nahon) who was orphaned during the war, went to work at 14, and eventually opened a butcher shop specializing in horse meat. He also fathered a mute, seemingly retarded daughter by a woman who abandoned him to raise their child alone in a seamy Paris suburb. After a violent assault based on the butcher&amp;#039;s mistaken assumption that his daughter had been raped, he received a prison term.\n\nAs present pic takes up the story, the butcher is &quot;starting over&quot; with the obese, shrewish bar owner (Frankyie Pain) who is very pregnant with his child.\n\nIt&amp;#039;s January 1980 in a housing project in a suburb of Lille, where the butcher and his emasculating mistress have moved in with her mother to await the birth. Unable to find work and fed up with the two women, the butcher has a knock-down fight with his mistress and hitchhikes back to the outskirts of Paris, where he will continue to seek employment and refine a slangy, wide-ranging rant.\n\nThis extended monologue on the futility of existence becomes shockingly well reasoned as the penniless protagonist&amp;#039;s miserable plight is compounded by a fruitless and humiliating job hunt. The butcher has a gun but only three bullets, and pic does such an insidious job of getting the viewer to identify with him that one almost wants to shout out pointers on who to shoot. Finale puts a new spin on family values.\n\nAnyone literal-minded enough to mistake the butcher&amp;#039;s xenophobic train of thought for an endorsement of his world view will walk out in a huff. But Noe -- who may slightly overstate his case in repetitive midsection -- knows exactly what makes his disgruntled protagonist tick. Although the story is set in 1980, his butcher is an effective rep of the disenfranchised working stiffs who currently support the increasingly popular National Front, which blindly advocates &quot;France for the French.&quot;\n\nNoe employs an arresting zoom technique accompanied by an unnerving &quot;bang&quot; to home in on specific facets of the widescreen frame: Those who startle easily may think a firecracker has gone off under their seat.\n\nThe proceedings are parsed by bold Godardian title cards, including one in the home stretch that incorporates a working countdown advising squeamish viewers they have 30 seconds to leave the theater.\n\nThesps do a bang-up job with unflattering material. Biographical data given would suggest that butcher is only 41, not 50 -- as he says and looks -- but that&amp;#039;s a quibble in a venture that otherwise knows precisely what it&amp;#039;s after.\n\nCamera (color, widescreen) Dominique Colin; editors, Lucille Hadzihalilovic, Noe; sound (Dolby) Olivier Le Vacon, Olivier Do Huu. Reviewed at Cannes Film Festival (Intl. Critics Week), May 16, 1998. Running time: 81 MIN.\n\n********************************* FREAKYFLICKS **********************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\nwww.freakyflicks.tk\n\n&amp;#039;If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE&amp;#039;\n\t\t","torrent":{"xt":"urn:btih:ed35b21d27c2b79d1cadd97f2f0e5b66217b28de","amp;dn":"Seul+Contre+Tous+-+Gaspar+Noe+-+1998+-+Francais+w%2FEng.+ST","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed35b21d27c2b79d1cadd97f2f0e5b66217b28de","infoHashBuffer":{"type":"Buffer","data":[237,53,178,29,39,194,183,157,28,173,217,127,47,14,91,102,33,123,40,222]},"announce":[],"urlList":[]}}