{"title":"Lonely Planet San Francisco(9th Ed)(AZW3,Retail){32Skulls}","uid":10968389,"size":17344592,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ee23c6d4ba4543b7dd47e0224bc56392b3dcfa23&amp;dn=Lonely+Planet+San+Francisco%289th+Ed%29%28AZW3%2CRetail%29%7B32Skulls%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"32Skulls","files":-1,"time":1409772310,"description":"                      â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ \n\nLonely Planet San Francisco is your passport to all the most relevant and up-to-date advice on what to see, what to skip, and what hidden discoveries await you. Loll in Golden Gate Park, stroll across the iconic Golden Gate Bridge, get spooked at Alcatraz, ride a legendary cable car, maneuver down the crookedest street in the world, or take a day trip to wine-soaked Napa Valley; all with your trusted travel companion. Get to the heart of San Francisco and begin your journey now!\n\nInside Lonely Planet's San Francisco Travel Guide:\n\n\nFull-color maps and images throughout\n\nHighlights and itineraries show you the simplest way to tailor your trip to your own personal needs and interests\n\nInsider tips save you time and money, and help you get around like a local, avoiding crowds and trouble spots\n\nEssential info at your fingertips - including hours of operation, phone numbers, websites, transit tips, and prices\n\nHonest reviews for all budgets - including eating, sleeping, sight-seeing, going out, shopping, and hidden gems that most guidebooks miss\n\nCultural insights give you a richer and more rewarding travel experience - including history, music, art, architecture, literature, cinema, cuisine, wine, and more\n\nFree, convenient pull-out San Francisco map (included in print version), plus over 38 full-color maps\n\nUseful features - including Top Itineraries, Walking Tours, With Kids, What's New, Month by Month (annual festival calendar), and Day Trips\n\n\nCovers: Golden Gate Park, Fisherman's Wharf, downtown, North Beach, Chinatown, Nob Hill, the Mission, the Haight, and the Castro, as well as Berkeley, Muir Woods, Sausalito, Napa and Sonoma Wine Country, and more\n\nBy Lonely Planet, Alison Bing, Sara Benson, John A. Vlahides\nPublished by Lonely Planet in 2014\nTags: nonfiction, travel guide, north america\nAZW3, Retail, 344 pages, English ","torrent":{"xt":"urn:btih:ee23c6d4ba4543b7dd47e0224bc56392b3dcfa23","amp;dn":"Lonely+Planet+San+Francisco%289th+Ed%29%28AZW3%2CRetail%29%7B32Skulls%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee23c6d4ba4543b7dd47e0224bc56392b3dcfa23","infoHashBuffer":{"type":"Buffer","data":[238,35,198,212,186,69,67,183,221,71,224,34,75,197,99,146,179,220,250,35]},"announce":[],"urlList":[]}}