{"title":"Peggy Lee - Black Coffee (1953)","uid":5500178,"size":67733703,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ee68315d38fb6799ed5afb378da52d3e0c632e3c&amp;dn=Peggy+Lee+-+Black+Coffee+%281953%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"artpepper","files":-1,"time":1271496529,"description":"Peggy Lee - Black Coffee (1953/1956)\n\nVerve Records (re-mastered), 256 kbps\n\n\n\n\n\n\nIncluded on many lists as one of the ten greatest vocal jazz albums ever, &quot;Black Coffee&quot;, recorded in 1953 and 1956, has always been Peggy Lee's own favorite album. Few listeners will be able to resist her ability to turn a standard into a magic moment in jazz history here, as Lee, a great actress with a song, sets up narrative intros of such drama that she seems to be telling personal stories. She varies the melodies, shifts from major to minor, experiments with phrasing, and totally commits herself to pure jazz.\n\nWhen she sings &quot;Black Coffee,&quot; for example, her changes from major to minor, with a single trumpet (Pete Candoli) echoing or wailing in the background, emphasize her anguish, and every listener will believe her agony, as she sings about being &quot;low to the ground,&quot; with &quot;not much heart to fight.&quot; &quot;Easy Living,&quot; a song-poem celebrating being in love. &quot;It Ain't Necessarily So,&quot; sung slower than usual, is sexy and suggestive, with a bass that resembles a heartbeat.\n\n\nEight tracks from 1953 are recorded with Pete Candoli (trumpet), Jimmy Rowles (piano), Max Wayne (bass), and Ed Shaughnessy (drums). Four other songs, recorded in 1956. feature a whole different accompaniment--Stella Castellucci (harp), Lou Levy (piano), Bill Pitman (guitar), Buddy Clark (bass), and Larry Bunker on vibes, drums, and percussion. \n\nThough some listeners may prefer the trumpet-oriented jazz with Candoli to the harp, guitar, and vibes of the 1956 songs, Lee adapts equally well to both approaches, creating an album which has turned my respect for her talent and perfectionism into genuine love for her spirit, imagination, and creativity\n\n\n\n\n\n\nTracklist:\n\n1. Black Coffee\n2. I've Got You Under My Skin\n3. Easy Living\n4. My Heart Belongs To Daddy\n5. It Ain't Necessarily So\n6. Gee Baby (Ain't I Good To You)\n7. A Woman Alone With The Blues\n8. I Didn't Know What Time It Was\n9. When The World Was Young\n10. Love Me Or Leave Me\n11. You're My Thrill\n12. There's A Small Hotel\n\n","torrent":{"xt":"urn:btih:ee68315d38fb6799ed5afb378da52d3e0c632e3c","amp;dn":"Peggy+Lee+-+Black+Coffee+%281953%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee68315d38fb6799ed5afb378da52d3e0c632e3c","infoHashBuffer":{"type":"Buffer","data":[238,104,49,93,56,251,103,153,237,90,251,55,141,165,45,62,12,99,46,60]},"announce":[],"urlList":[]}}