{"title":"Scene of the Crime A Writer&amp;rsquo;s Guide to Crime Scene Investi","uid":10518085,"size":13203021,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ee8725e3e29cb3857fc7edbea225896a65b7ebc7&amp;dn=Scene+of+the+Crime+A+Writer%26rsquo%3Bs+Guide+to+Crime+Scene+Investi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"ZamKhan","files":1,"time":1404932582,"description":"Once you've crafted a compelling and cunning criminal and let him or her go to work, you need to know what tricks of the trade your sleuth -- amateur or professional -- can use to catch said criminal. Scene of the Crime: A Writer's Guide to Crime-Scene Investigations covers all the procedures, technology, and methodology available for use in analyzing a crime scene. Learn about all the investigative tools law enforcement officials have at their disposal, everything from fingerprinting to autopsies.\n\nAnyone who is trying to write a mystery will find these to be useful books, and readers of mysteries will find them equally interesting. Wilson, who is both a medical doctor and a writer, describes various causes of death, detailing both the appearance of the body and the official response to unexpected deaths. Scattered throughout the text are examples from literary works illuminating the use of medical and forensic details to strengthen the writing. Chapters deal with subjects such as time of death, autopsies, determination of murder vs. suicide, and various causes of death. Apt use is made of statistics regarding the frequency of varying causes of death. A glossary and bibliography round out the work. Wingate spent more than six years as a criminal investigator. In this book, she gives detailed descriptions of the crime scene search, methods of firearms investigation, fingerprint identification, identification of human remains, autopsies, and crime labs. The information is peppered with descriptions of cases on which Wingate has worked as a criminal investigator. The information is well presented, and the writing style is personal and energetic.","torrent":{"xt":"urn:btih:ee8725e3e29cb3857fc7edbea225896a65b7ebc7","amp;dn":"Scene+of+the+Crime+A+Writer%26rsquo%3Bs+Guide+to+Crime+Scene+Investi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee8725e3e29cb3857fc7edbea225896a65b7ebc7","infoHashBuffer":{"type":"Buffer","data":[238,135,37,227,226,156,179,133,127,199,237,190,162,37,137,106,101,183,235,199]},"announce":[],"urlList":[]}}