{"title":"17 Carnations: The Royals, the Nazis and the Biggest Cover-Up","uid":15789083,"size":5445457,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eef47bcf7fe90ef36aba51665b3d4e937ea9c17e&amp;dn=17+Carnations%3A+The+Royals%2C+the+Nazis+and+the+Biggest+Cover-Up&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"marty14","files":1,"time":1473367682,"description":"17 Carnations: The Royals, the Nazis and the Biggest Cover-Up in History - Andrew Morton [epub]\r\n\r\nA meticulously researched historical tour de force about the secret ties among Franklin D. Roosevelt, Winston Churchill, the Duke of Windsor, and Adolf Hitler before, during, and after World War II.\r\n\r\nAndrew Morton tells the story of the feckless Edward VIII, later Duke of Windsor, his American wife, Wallis Simpson, the bizarre wartime Nazi plot to make him a puppet king after the invasion of Britain, and the attempted cover-up by Churchill, General Eisenhower, and King George VI of the duke's relations with Hitler. From the alleged affair between Simpson and the German foreign minister to the discovery of top secret correspondence about the man dubbed &quot;the traitor king&quot; and the Nazi high command, this is a saga of intrigue, betrayal, and deception suffused with a heady aroma of sex and suspicion.\r\n\r\nFor the first time, Morton reveals the full story behind the cover-up of those damning letters and diagrams: the daring heist ordered by King George VI, the smooth duplicity of a Soviet spy as well as the bitter rows and recriminations among the British and American diplomats, politicians, and academics. Drawing on FBI documents, exclusive pictures, and material from the German, Russian, and British royal archives, as well as the personal correspondence of Churchill, Eisenhower, and the Windsors themselves, 17 CARNATIONS is a dazzling historical drama, full of adventure, intrigue, and startling revelations, written by a master of the genre","torrent":{"xt":"urn:btih:eef47bcf7fe90ef36aba51665b3d4e937ea9c17e","amp;dn":"17+Carnations%3A+The+Royals%2C+the+Nazis+and+the+Biggest+Cover-Up","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eef47bcf7fe90ef36aba51665b3d4e937ea9c17e","infoHashBuffer":{"type":"Buffer","data":[238,244,123,207,127,233,14,243,106,186,81,102,91,61,78,147,126,169,193,126]},"announce":[],"urlList":[]}}