{"title":"PUP - The Dream Is Over (2016) [24.96 FLAC]","uid":14742322,"size":727550591,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ef04b61d1ee6041f472468455eaed14d84382617&amp;dn=PUP+-+The+Dream+Is+Over+%282016%29+%5B24.96+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"politux","files":11,"time":1464692083,"description":"PUP - The Dream Is Over (2016) [24.96 FLAC]\r\n\r\n  Genre: Rock\r\n  Styles: Pop Punk, Indie\r\n  Source: WEB (Royal Mountain Records)\r\n  Codec: FLAC\r\n  Bit rate: ~ 2,900 kbps\r\n  Bit depth: 24\r\n  Sample rate: 96 kHz\r\n\r\n  01 If This Tour Doesn't Kill You, I Will\r\n  02 DVP\r\n  03 Doubts\r\n  04 Sleep In The Heat\r\n  05 The Coast\r\n  06 Old Wounds\r\n  07 My Life Is Over &amp; I Couldn't Be Happier\r\n  08 Can't Win\r\n  09 Familiar Patterns\r\n  10 Pine Point\r\n\r\n  Surviving too many months in the van and a resultant vocal cord scare for frontman Stefan Babcock, Canadian punks PUP live to tell another tale on their sophomore release, The Dream Is Over. Using the glib prognosis from Babcock's doctor as both their album title and rallying cry, the Toronto-based quartet come off even more ferocious than before on this spirited ten-song effort. With their strong hooks, gang vocals, and spastic transitions, PUP offer a visceral mix of unity and chaos. They've also got a sense of humor that helps keep from getting mired in potential emo/pop-punk tropes, making them sound, at times, like a freaked-out, hardcore Dead Milkmen. Album-opener &quot;If This Tour Doesn't Kill You, I Will&quot; is a fairly self-explanatory airing of band-related grievances with entertaining lines like &quot;everything you do makes me wanna vomit, if this tour doesn't kill you, buddy, I'm on it.&quot; It's a sentiment countless hardscrabble rockers likely share toward their bandmates after too way many hours in close-quartered Econoline vans, but it's all just part of the narrative for the PUP brotherhood who, from the sound of it, remain as tight as ever. Their penchant for tasty guitar leads and catchy, fist-raising melodies manifests itself on highlights like &quot;Sleep in the Heat&quot; and &quot;Can't Win.&quot; For all their self-deprecation and ramshackle bombast, there's no hiding the band's innate musicality, which reveals itself in the myriad of clever changes and occasional bursts of slick vocal harmony, especially on the epic closer &quot;Pine Point.&quot; If the dream really is over for PUP, they sound awfully confident","torrent":{"xt":"urn:btih:ef04b61d1ee6041f472468455eaed14d84382617","amp;dn":"PUP+-+The+Dream+Is+Over+%282016%29+%5B24.96+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef04b61d1ee6041f472468455eaed14d84382617","infoHashBuffer":{"type":"Buffer","data":[239,4,182,29,30,230,4,31,71,36,104,69,94,174,209,77,132,56,38,23]},"announce":[],"urlList":[]}}