{"title":"Spoon - They Want My Soul (2014) [FLAC]","uid":10670063,"size":286225689,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ef6b01725d4071556c75ad0e3efa0f6cc5ec343f&amp;dn=Spoon+-+They+Want+My+Soul+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"politux","files":-1,"time":1406856382,"description":"  Spoon - They Want My Soul (2014) [FLAC]\n\n  Genre: Rock\n  Style: Indie, Alternative\n  Source: Scene CD (outerspace)\n  Codec: FLAC\n  Bit rate: ~ 1,000 kbps\n  Bit depth: 16\n  Sample rate: 44.1 kHz\n\n  01 Rent I Pay \n  02 Inside Out \n  03 Rainy Taxi \n  04 Do You \n  05 Knock Knock Knock \n  06 Outlier \n  07 They Want My Soul \n  08 I Just Don't Understand \n  09 Let Me Be Mine \n  10 New York Kiss \n\n  With a heady blend of precision punk and serpentine classic rock (the band has drawn comparisons to everyone from the Pixies and Sonic Youth to Elvis Costello and Tom Petty), enigmatic, Texas-based indie pop outfit Spoon went from underground press darlings to one of the genre's premier commercially and critically acclaimed alternative rock acts. Formed in Austin by singer/guitarist Britt Daniel and drummer Jim Eno, Spoon released its debut EP, Nefarious, on the small Texas imprint Fluffer Records in 1994, eventually re-recording three of the songs for its 1996 full-length debut, Telephono, for Matador. The album was noisy, hook-filled, and generally well-received, but it wasn't until 1997's Soft Effects EP that the group began to hone in on the tight, minimalist pop that would become its forte. A brief and tumultuous affair with Elektra Records began in 1998 with the release of A Series of Sneaks, and quickly ended after the band was dropped in the midst of an internal company shakeup (the record was reissued in 2002 on Merge with two bonus tracks that chronicled the group's disappointment with major-label politics).\n\n  It was with prominent indie label Merge that the band would go on to carve out its niche in the increasingly widening modern rock mainstream, specifically with Girls Can Tell (2001) and Kill the Moonlight (2002) (the latter spawned the single &quot;The Way We Get By,&quot; which appeared on the popular teen drama The O.C.), both of which found the group taking a more adventurous approach with its sound. Released in 2005, Gimme Fiction soared even higher, debuting at number 44 on the Billboard charts and selling over 160,000 copies, while 2007's Ga Ga Ga Ga Ga made it to number ten and sold over 300,000 copies in the U.S., topping nearly every major critic's year-end list. Spoon, who by this time had become a fixture on soundtracks, television programs, and late-night talk shows, released its seventh full-length album, Transference, on January 18, 2010. It debuted at number four on the Billboard 200. The band then took an extended hiatus of nearly four years, before resurfacing in 2014 with the announcement of another new album, Spoon's eighth. Recorded for the first time with an outside producer -- in the shape of Dave Fridmann -- the album was hailed by the band as its &quot;loudest and gnarliest&quot; to date. Entitled They Want My Soul, it was slated for release in August 2014 through Loma Vista Recordings in the U.S. and Anti in Europe.","torrent":{"xt":"urn:btih:ef6b01725d4071556c75ad0e3efa0f6cc5ec343f","amp;dn":"Spoon+-+They+Want+My+Soul+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef6b01725d4071556c75ad0e3efa0f6cc5ec343f","infoHashBuffer":{"type":"Buffer","data":[239,107,1,114,93,64,113,85,108,117,173,14,62,250,15,108,197,236,52,63]},"announce":[],"urlList":[]}}