{"title":"Brandi Carlile - The Firewatcher's Daughter [2015][WEB/FLAC]","uid":11725193,"size":257147326,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:effd944da0a7477f5ab1490c80978ff3d62fc1a0&amp;dn=Brandi+Carlile+-+The+Firewatcher%27s+Daughter+%5B2015%5D%5BWEB%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"dickspic","files":14,"time":1425012416,"description":"FLAC / Lossless\nLabel/Cat#:ATO Records \nCountry:USA\nYear: March 2, 2015\nGenre:singer songwriter,poppy rocky.\nFormat: Digital\n\n1. Wherever Is Your Heart (3:50)\n2. The Eye (3:31)\n3. The Things I Regret (3:26)\n4. Mainstream Kid (4:19)\n5. Beginning To Feel the Years (3:09)\n6. Wilder (We're Chained) (3:32)\n7. Blood Muscle Skin &amp; Bone (4:16)\n8. I Belong To You (4:30)\n9. Alibi (3:00)\n10. The Stranger At My Door (3:42)\n11. Heroes and Songs (2:47)\n12. Murder In the City (2:53)\n\n\n\n\n\nSeizing the occasion of a label switch to shake up her approach to recording, Brandi Carlile cut The Firewatcher's Daughter quickly, bashing out its 12 songs in a series of single takes with longtime collaborators Tim and Phil Hanseroth. The Twins, as the Hanseroth brothers are known, have been by Carlile's side since her 2005 eponymous debut, so this album doesn't amount to a shift in aesthetic as much as it is a consolidation -- a consolidation that just so happens to leave a few frayed edges dangling. It's a nifty trick, emphasizing mess, especially in the wake of records where all the loose ends were appealingly tied. That's not the case on The Firewatcher's Daughter. Whether the band is engaged in a breakneck sprint, as on the throttling &quot;Mainstream Kid,&quot; or harmonizing with delicacy on &quot;The Eye&quot; and &quot;Wilder (We're Chained),&quot; the music twitches with energy and this vibrancy enhances a set of songs casually touching upon every style Carlile's played in the past. As always, she's grounded in Americana, often straying into a burnished folky melancholy but finding space for urgent country stomps and such full-throttle rock &amp; roll as &quot;Blood Muscle Skin &amp; Bone,&quot; whose hook places it in a netherworld between arena rock and power pop. None of the stylistic shifts amount to showboating: it feels as if Carlile is following her fascinations wherever they lead. She takes a few detours, including indulging in a bit of big-footed stomp on &quot;The Things I Regret&quot; and the fingerpicked electric guitars of &quot;Heroes and Songs,&quot; every one of which keeps The Firewatcher's Daughter from being as cohesive as 2012's Bear Creek, but that laissez-faire sprawl is often more appealing than its predecessor's tidiness: this is music that's lived in and deeply felt, so it resonates long after the album finishes","torrent":{"xt":"urn:btih:effd944da0a7477f5ab1490c80978ff3d62fc1a0","amp;dn":"Brandi+Carlile+-+The+Firewatcher%27s+Daughter+%5B2015%5D%5BWEB%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"effd944da0a7477f5ab1490c80978ff3d62fc1a0","infoHashBuffer":{"type":"Buffer","data":[239,253,148,77,160,167,71,127,90,177,73,12,128,151,143,243,214,47,193,160]},"announce":[],"urlList":[]}}