{"title":"Shining - IX - Everyone, Everything, Everywhere, Ends (2015)a3k","uid":11815643,"size":100076920,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f15773b89ff9abe37f561341e1a944d2165260c5&amp;dn=Shining+-+IX+-+Everyone%2C+Everything%2C+Everywhere%2C+Ends+%282015%29a3k&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"analogkid6103","files":7,"time":1429080598,"description":"\nShining is a Swedish black metal band formed in 1996. The band's music contains depressive undertones, which include personal and suicide-themed lyrics.\n\nThe band's name does not refer to the book The Shining or the film based on it, but rather according to Kvarforth, it means &quot;the path to enlightenment&quot;.\n\nThe band split-up in August 2004 and their fourth album, IV: The Eerie Cold, was supposed to be their last, but the band reformed later the same year with a new line-up capable of live shows. The band then released their fifth album, which was at first going to be called V: Besvikelsens Dystra Monotoni but was later changed to V: Halmstad, a reference to Kvarforth's hometown.\n\nShining openly promotes suicide and self-harm in all its forms (e.g. drugs) in their lyrics. The founder of the band, Niklas Kvarforth, has claimed, with contentment, there have been some cases of people committing suicide at least partially under the influence of Shining's music. Musically, Shining went from black metal with doom influences on their earlier work to a more progressive extreme metal sound with extensive use of clean guitars, guitar solos, different vocal styles and often tempo shifts and odd time signatures. Shining's music also contains several movie samples from films such as Prozac Nation, She's So Lovely, and American Psycho.\n\nVocalist Niklas Kvarforth wanted to &quot;force feed&quot; his listeners &quot;with self-destructive and suicidal imagery and lyrics&quot;. In the beginning he used the term &quot;suicidal black metal&quot; for his music to separate himself from the &quot;mediocre worms&quot;. However, he stopped using the term in 2001 because it had begun to be used by a slew of other bands, whom he felt had misinterpreted his vision and were using the music as a kind of therapy rather than a weapon against the listener as Kvarforth intended. He said that he &quot;wouldn't call Shining a black metal band&quot; and called the &quot;suicidal black metal&quot; term a &quot;foolish idea&quot;.\n\nKvarforth disappeared in July 2006 and a rumor was spread he was presumed to have committed suicide. On August 23, 2006 the band posted a statement on their website declaring Kvarforth had disappeared. The band was said to continue with a new singer named &quot;Ghoul&quot;, as one of the wishes from Kvarforth.\n\nAt a concert that took place on February 3, 2007 at Diezel in Halmstad, Sweden, &quot;Ghoul&quot; was revealed to be Kvarforth. The concert was violent in nature, sparking controversy in the Swedish media, with Kvarforth occasionally fighting the audience and the guest vocalists (Attila Csihar, Maniac and Nattefrost). Razorblades were handed to a member of the audience, and one person was kicked in the chest after grabbing Kvarforth's genitals; who was later found to be Maniac posing as a crazed fan.\n\nOne member of the audience recalls the kicking: &quot;A couple of songs are finished and Kvarforth is standing with zipped up leather pants and some drunk Swede touches his crotch. Kvarforth looks shocked and shouts 'Don't touch me,' before he kicks the fan in the chest.&quot;\n\nCurrent members\nNiklas Kvarforth (a.k.a. &quot;Ghoul&quot; ) - vocals, guitar (1996 onward)\nPeter Huss - lead and rhythm guitar (2005 onward)\nChristian Larsson - bass guitar (2010 onward)\nRainer Tuomikanto - drums (live member, 2012 onward)\nEuge Valovirta - guitar (live member, 2012 onward)\n\n\n\n\nFacebook\nGenre: Black\nSubgenre: Depressive Black Metal\nBitrate: 320 k\nSize: 95.44 MB\nShow/Hide Files:\n7 files\n\nAs normal go to the shows and buy the merch,thats the best way to support the artist, all of that money goes to the band. Not to the DMCA","torrent":{"xt":"urn:btih:f15773b89ff9abe37f561341e1a944d2165260c5","amp;dn":"Shining+-+IX+-+Everyone%2C+Everything%2C+Everywhere%2C+Ends+%282015%29a3k","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f15773b89ff9abe37f561341e1a944d2165260c5","infoHashBuffer":{"type":"Buffer","data":[241,87,115,184,159,249,171,227,127,86,19,65,225,169,68,210,22,82,96,197]},"announce":[],"urlList":[]}}