{"title":"50 Popular Beliefs That  People Think Are Actually True","uid":12089845,"size":199321408,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f1c638ddf15c395546a899587d3de88d1a94f5b5&amp;dn=50+Popular+Beliefs+That++People+Think+Are+Actually+True&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"davieboy1966","files":2,"time":1436008608,"description":"Written by Guy P. Harrison\nFormat: MP3\n\nStressing the excitement of scientific discovery and the legitimate mysteries and wonder inherent in reality, this book invites readers to share the joys of rational thinking and the skeptical approach to evaluating our extraordinary world. Maybe you know someone who swears by the reliability of psychics or who is in regular contact with angels. Or perhaps you're trying to find a nice way of dissuading someone from wasting money on a homeopathy cure. Or you met someone at a party who insisted the Holocaust never happened or that no one ever walked on the moon. How do you find a gently persuasive way of steering people away from unfounded beliefs, bogus cures, conspiracy theories, and the like? This down-to-earth, entertaining exploration of commonly held extraordinary claims will help you set the record straight. This veteran journalist has not only surveyed a vast body of literature, but has also interviewed leading scientists, explored &quot;the most haunted house in America,&quot; frolicked in the inviting waters of the Bermuda Triangle, and even talked to a &quot;contrite Roswell alien.&quot; It is not out simply to debunk unfounded beliefs. Wherever possible, he presents alternative scientific explanations, which in most cases are even more fascinating than the wildest speculation. For example, stories about UFOs and alien abductions lack good evidence, but science gives us plenty of reasons to keep exploring outer space for evidence that life exists elsewhere in the vast universe. The proof for Bigfoot or the Loch Ness Monster may be nonexistent, but scientists are regularly discovering new species, some of which are truly stranger than fiction.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:f1c638ddf15c395546a899587d3de88d1a94f5b5","amp;dn":"50+Popular+Beliefs+That++People+Think+Are+Actually+True","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1c638ddf15c395546a899587d3de88d1a94f5b5","infoHashBuffer":{"type":"Buffer","data":[241,198,56,221,241,92,57,85,70,168,153,88,125,61,232,141,26,148,245,181]},"announce":[],"urlList":[]}}