{"title":"GirlsWay{ Little Red:A Lesbian Fairy Tale:Part Four - 10.13.16 }","uid":16021744,"size":288568409,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:f46a7497375ea08907aa5d1e1909d15cb416f663&amp;dn=GirlsWay%7B+Little+Red%3AA+Lesbian+Fairy+Tale%3APart+Four+-+10.13.16+%7D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":7,"uploader":"worldet","files":1,"time":1476345592,"description":"Starring Abigail Mac, Kendra Lust, Cassidy Klein\r\n\r\nWhen I first heard that my dear husband's granddaughter was found, and that the social worker wanted me to take her in I was so delighted. I never got a chance to have little ones of my own, so I couldn't resist falling in love from the first moment I had a chance to be a grandma. Nothing could have prepared me for her first visit though. That Wolf certainly fucks whatever she wants, and I can't say I'd disagree. After she took my first greeting with my sweet Little Red and turned it into some kind of filthy mockery, I knew that my place was silence in the corner. I'm happy I got to see what that total bitch did when Red came searching for me. I am just so proud that my sweet Little Red has come to find me, and that she was so courageous to get tangled up with that Wolf. It was all so frightening seeing her get close to that bitch but she really held her own as Wolf peeled off that innocent dress to get Red worked up to the point I can say she really has a way with women. Secretly I want to have my hands on the sweet girl but Wolf took that from me a second time, and that, I just can't forgive. I saw Wolf pound their pussies together so hard I was quite certain she'd break my granddaughter, but Red held up, and now that they're passed out, I have a chance to pull my weight.\r\n \nhttp://imagesouls.net/img-57ff2125a87df.html  \nhttp://imagesouls.net/img-57ff218d8ce7f.html","torrent":{"xt":"urn:btih:f46a7497375ea08907aa5d1e1909d15cb416f663","amp;dn":"GirlsWay%7B+Little+Red%3AA+Lesbian+Fairy+Tale%3APart+Four+-+10.13.16+%7D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f46a7497375ea08907aa5d1e1909d15cb416f663","infoHashBuffer":{"type":"Buffer","data":[244,106,116,151,55,94,160,137,7,170,93,30,25,9,209,92,180,22,246,99]},"announce":[],"urlList":[]}}