{"title":"Space.Hulk-SKIDROW","uid":8830023,"size":737578650,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f4cfcc54ab2c27caab0fa1cdb849bb92dfe1197c&amp;dn=Space.Hulk-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"Mr.Stifmeister","files":2,"time":1376945259,"description":"\nS  K  I  D  R  O  W\n.the leading force.\n\nproudly presents\nSpace Hulk (c) Full Control Studios\n\n19-08-2013......Release Date - Protection.................Steam\nStrategy...........Game Type - Disk(s)....................1 DVD\n\nRELEASE NOTES\n\nThe legendary Space Hulk returns to Windows PC and Mac in this epic\nturn based strategy game. Set in the Warhammer 40,000 universe, an\nintriguing story of legendary battles and heroic actions unfolds. Play\nas a small squad of fearless Space Marine Terminators who attempt to\nreclaim their honor by mounting an assault on a derelict space hulk\ninfested by hordes of vicious tyranid Genestealers.\n\nTake control of the Adeptus Astartes of the Blood Angel chapter and\nguide them towards glory, while battling fierce Xenos and uncovering\nancient relics in the infested confines of the massive Space Hulk\nnamed &quot;Sin of Damnation&quot;.\n\nThe game is a 3D digital turn based strategy game that recreates the\nclassic claustrophobic board game experience in both singleplayer and\nmultiplayer.\n\nFeatures:\n\nThe first Space Hulk computer game in 17 years Available on multiple\nplatforms.\n\nSet in the hugely popular Warhammer 40,000 universe Official license\nof the legendary boardgame from Games Workshop.\n\nTurn-based tactical strategy game Based on the popular and iconic\nboard game mechanics.\n\nBlood Angel Terminators Fight the ferocious Genestealers with heroes\nof the mighty Blood Angels.\n\nFearsome Genestealers with challenging AI Meet unforgiving hordes of\nGenestealers\n\nThematic 3D environment Experience the dark labyrinth of a Space Hulk\nas never before..\n\nSingle player campaign based on the &quot;Sin of Damnation&quot; space hulk Take\non the Sin of Damnation campaign, which includes 3 brand new prequel\nmissions and the 12 missions from the classic board game.\n\nMultiplayer head-to-head recreating the board game experience against a\nfriend Get in the hot seat and battle it out with a friend.\n\nCross platform multiplayer between Windows PC, Mac and iOS Play\nasynchronous against friends and foes on multiple platforms.\n\nINSTALL NOTES\n\n1. Unpack the release\n2. Mount or burn image\n3. Install\n4. Copy the cracked content from the SKIDROW folder and into the main\ninstall folder and overwrite\n5. Block the game in your firewall and mark our cracked content as\nsecure/trusted in your antivirus program\n6. Play the game\n7. Support the companies, which software you actually enjoy\n\nGREETINGS\n\nTo all friends of the family and honorable rival groups\n\nascii art by the\ngodlike &amp; terrific duo\nmalodix  irokos\ntitan artdivision\n\n","torrent":{"xt":"urn:btih:f4cfcc54ab2c27caab0fa1cdb849bb92dfe1197c","amp;dn":"Space.Hulk-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4cfcc54ab2c27caab0fa1cdb849bb92dfe1197c","infoHashBuffer":{"type":"Buffer","data":[244,207,204,84,171,44,39,202,171,15,161,205,184,73,187,146,223,225,25,124]},"announce":[],"urlList":[]}}