{"title":"Galaxie 500","uid":4329908,"size":253490789,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f53354c9aa23414dd4b1d6e117c10b211ba51dea&amp;dn=Galaxie+500&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":2,"uploader":"kras77","files":49,"time":1217980999,"description":"This torrent contains:\n\nToday\nOn Fire\nThis Is Our Music\nThe Uncollected Galaxie 500\n\nIn case you wondered, the noise at the end of &quot;King Of Spain&quot; is not supposed to be there, however i didn't notice until after uploading this. My appologies. Fixed version here: http://thepiratebay.se/torrent/4330023\n\nFrom Wikipedia: \n\nGuitarist Dean Wareham, drummer Damon Krukowski and bassist Naomi Yang had met at the Dalton School in New York City, but began playing together during their time as students at Harvard University. Wareham and Krukowski had formed a band called Speedy and the Castanets, whose bass player left, Yang joining the group, the band changing their name to Galaxie 500, after a friend's car (a Ford car of the 1960s, the Ford Galaxie 500). In their early years, Krukowski didn't own a drum kit, so he borrowed one from his Harvard classmate Conan O'Brien, who'd bought a kit but had recently given up playing it. This drum kit can be heard on many of Galaxie 500's early recordings.\n\nThe band began playing gigs in Boston and New York, and recorded a demo which they sent to Shimmy Disc label boss and producer Mark Kramer, who agreed to produce the band. With Kramer at the controls, the band recorded the &quot;Tugboat&quot; single and the &quot;Oblivious&quot; flexi-disc, and moved on to record their debut album, Today, which was released on the small Aurora label.[2] In 1989, they signed to Rough Trade, and released their second album, On Fire, which has been described as &quot;lo-fi psychedelia reminiscent of Jonathan Richman being backed by The Velvet Underground&quot;, and is considered the band's defining moment. On Fire reached number 7 in the UK Indie Chart, and met with much critical acclaim in the United Kingdom, but was less well-received by the US music press, who cited Wareham's 'vocal limitations' as a weakness.\n\nWith Kramer's live sound production at the mixing board at the band's every gig, the sound and the increasingly loyal audience grew with each release.\n\nGalaxie 500 recorded two sessions for John Peel's BBC Radio 1 programme, these later released on the Peel Sessions album. Their cover of Jonathan Richman's &quot;Don't Let Our Youth Go To Waste&quot; was also voted into number 41 in 1989's Festive 50 by listeners to the show.\n\nThe band split up in the spring of 1991 after a third album, This Is Our Music, Wareham quitting the band after a lengthy American tour.\n\nGalaxie 500's records were released in the US and UK on the independent Rough Trade label. When Rough Trade went bankrupt in 1991, Krukowski and Yang purchased the masters at auction, reissuing them on Rykodisc in 1997.\n\nMusical style and influences\n\nGalaxie 500 leveraged fairly minimal instrumental technique with intense atmospherics, provided by producer Kramer, and their distinctive sound bore an influence beyond the small audience for their independently released albums. The Velvet Underground and Jonathan Richman have been identified as key influences. In interviews on the Galaxie 500 DVD Don't Let Our Youth Go to Waste, Wareham cites Spacemen 3 as another key inspiration.\n\nPost-Galaxie 500 activities\n\nAfter leaving Galaxie 500, Wareham tried his hand at production, working with Mercury Rev. He released a solo single, &quot;Anesthesia&quot; in February 1992, and formed a new band, Luna. Krukowski and Yang continued to record under the moniker Pierre Etoile, and then Damon and Naomi (whose first two releases were also produced by Kramer), and as members of Magic Hour. They also began the avant-garde press Exact Change.\nInfluence\n\nGalaxie 500's music had an influence on many later indie music groups, including Low.It has been covered and referenced by several well known artists. In Liz Phair's song &quot;Stratford-on-Guy&quot;, she sings, &quot;And I was pretending that I was in a Galaxie 500 video.&quot; In Xiu Xiu's song &quot;Dr. Troll&quot;, Jamie Stewart sings, &quot;Listen to On Fire and pretend someone could love you.&quot; The Submarines did a cover of &quot;Tugboat&quot; in their recent iTunes Live Session EP, recorded with famed indie rock producer Adam Lasus. The Brian Jonestown Massacre And This Is Our Music was titled in reference to the group's album This Is Our Music (which was in turn titled after Ornette Coleman's album This Is Our Music). Sonic Youth frontman Thurston Moore has cited Galaxie 500's album Today as &quot;the guitar record of 1988&quot;.\n\nCover material\n\nThe group's oeuvre included a fair number of cover songs, often with arrangements that were drastically different from their original counterparts. These include:\n\n    * &quot;Listen the Snow Is Falling&quot; - Yoko Ono\n    * &quot;Ceremony&quot; - Joy Division/New Order\n    * &quot;Submission&quot; - Sex Pistols\n    * &quot;Rain&quot; - The Beatles\n    * &quot;Don't Let Our Youth Go to Waste&quot; - Jonathan Richman\n    * &quot;Cheese and Onions&quot; - The Rutles\n    * &quot;Here She Comes Now&quot; - The Velvet Underground\n    * &quot;Isn't It a Pity&quot; - George Harrison\n    * &quot;Final Day&quot; - Young Marble Giants\n    * &quot;Victory Garden&quot; - Red Krayola\n    * &quot;Moonshot&quot; - Buffy St. Marie\n    * &quot;Well... All Right&quot; - Buddy Holly\n\nMy other torrents: &lt;a href=&quot;\nhttp://thepiratebay.se/user/kras77&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/kras77&lt;/a&gt;\n","torrent":{"xt":"urn:btih:f53354c9aa23414dd4b1d6e117c10b211ba51dea","amp;dn":"Galaxie+500","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f53354c9aa23414dd4b1d6e117c10b211ba51dea","infoHashBuffer":{"type":"Buffer","data":[245,51,84,201,170,35,65,77,212,177,214,225,23,193,11,33,27,165,29,234]},"announce":[],"urlList":[]}}