{"title":"Wizardry 8 GoG","uid":8749863,"size":1334792976,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f5955a3347ace58d3f043982cb2434acd99b426a&amp;dn=Wizardry+8+GoG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":2,"uploader":"AN0NYMOUS142857","files":26,"time":1375004482,"description":"\nWhat's cool about it:\nContinue the adventure with the group of adventurers that braved through Wizardry 7, or create a new custom party from a plethora of races and classes.\nChoose a custom personality for each character and hear them speak over 100 lines of dialogue. Kindly or chaotic, burly or surly - how your characters act is completely up to you.\nTalk with intelligent characters who react to how you treat them and become your allies or enemies in your quest of 200 hours of gameplay or more.\nOverview:\nThe universe is in the throes of violent upheaval and change. Vast and mysterious forces are preparing for the final confrontation. A small group of heroes from distant lands must plunge into the heart of the maelstrom, to uncover long-forgotten secrets, and bring about a new era. Should they succeed, they will gain the powers of the gods themselves. If they fail, countless worlds worlds will fall into the grip of darkness.\n\nPrepare to experience the culmination of a prestigious RPG series. Enter a vast world of intrigue and wonder. Unravel a gripping, non-linear storyline. Battle your way to victory using your swords, your magic, and your wits. Compete with rivals or align with allies as you struggle to ascend to the Cosmic Circle. Take the battle to the dreaded Dark Savant in Wizardry 8, the phenomenal conclusion to the Dark Savant trilogy, one of the most extensive and challenging stories ever told in classic role-playing games!\n","torrent":{"xt":"urn:btih:f5955a3347ace58d3f043982cb2434acd99b426a","amp;dn":"Wizardry+8+GoG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5955a3347ace58d3f043982cb2434acd99b426a","infoHashBuffer":{"type":"Buffer","data":[245,149,90,51,71,172,229,141,63,4,57,130,203,36,52,172,217,155,66,106]},"announce":[],"urlList":[]}}