{"title":"A Canticle for Leibowitz by Walter M. Miller Jr.","uid":9723791,"size":602812,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f699500790629358629d9f9e75c87e927b39dbd8&amp;dn=A+Canticle+for+Leibowitz+by+Walter+M.+Miller+Jr.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"PirateBook","files":1,"time":1394270574,"description":"\nWinner of the 1961 Hugo Award for Best Novel and widely considered one of the most accomplished, powerful, and enduring classics of modern speculative fiction, Walter M. Miller, Jr.'s A Canticle for Leibowitz is a true landmark of twentieth-century literature - a chilling and still-provocative look at a post-apocalyptic future.\n\nIn a nightmarish ruined world slowly awakening to the light after sleeping in darkness, the infant rediscoveries of science are secretly nourished by cloistered monks dedicated to the study and preservation of the relics and writings of the blessed Saint Isaac Leibowitz. \n\nFrom here the story spans centuries of ignorance, violence, and barbarism, viewing through a sharp, satirical eye the relentless progression of a human race damned by its inherent humanness to recelebrate its grand foibles and repeat its grievous mistakes.\n\nSeriously funny, stunning, and tragic, eternally fresh, imaginative, and altogether remarkable, A Canticle for Leibowitz retains its ability to enthrall and amaze. It is now, as it always has been, a masterpiece.\n\nGenre: Speculative Fiction | Literature","torrent":{"xt":"urn:btih:f699500790629358629d9f9e75c87e927b39dbd8","amp;dn":"A+Canticle+for+Leibowitz+by+Walter+M.+Miller+Jr.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f699500790629358629d9f9e75c87e927b39dbd8","infoHashBuffer":{"type":"Buffer","data":[246,153,80,7,144,98,147,88,98,157,159,158,117,200,126,146,123,57,219,216]},"announce":[],"urlList":[]}}