{"title":"The Chemistry of Beer - The Science in the Suds (gnv64)","uid":9848431,"size":16007038,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f6fcd8ace31f880cf39eb5f1dbfd579c54ee0a1e&amp;dn=The+Chemistry+of+Beer+-+The+Science+in+the+Suds+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"gnv65","files":-1,"time":1396113541,"description":"The Chemistry of Beer: The Science in the Suds \nby Roger Barth\nWiley | November 2013 | ISBN-10: 1118674979 | True PDF | 348 pages | 15.2 mb\n\nDiscover the science of beer and beer making\nEver wondered just how grain and water are transformed into an effervescent, alcoholic beverage? From prehistory to our own time, beer has evoked awe and fascination; it seems to have a life of its own. Whether you're a home brewer, a professional brewer, or just someone who enjoys a beer, The Chemistry of Beer will take you on a fascinating journey, explaining the underlying science and chemistry at every stage of the beer making process. All the science is explained in clear, non-technical language, so you don't need to be a PhD scientist to read this book and develop a greater appreciation for the world's most popular alcoholic drink.\nThe Chemistry of Beer begins with an introduction to the history of beer and beer making. Author Roger Barth, an accomplished home brewer and chemistry professor, then discusses beer ingredients and the brewing process. Next, he explores some core concepts underlying beer making. You'll learn chemistry basics such as atoms, chemical bonding, and chemical reactions. Then you'll explore organic chemistry as well as the chemistry of water and carbohydrates. Armed with a background in chemistry principles, you'll learn about the chemistry of brewing, flavor, and individual beer styles. The book offers several features to help you grasp all the key concepts, including:\n-    Hundreds of original photographs and line drawings\n-    Chemical structures of key beer compounds\n-    Glossary with nearly 1,000 entries\n-    Reference tables\n-    Questions at the end of each chapter\n\nThe final chapter discusses brewing at home, including safety issues and some basic recipes you can use to brew your own beer. There's more to The Chemistry of Beer than beer. It's also a fun way to learn about the science behind our technology and environment. This book brings life to chemistry and chemistry to life.\n\nAbout the Author\nROGER BARTH, PhD, has been a professor in the Department of Chemistry at West Chester University since 1985. He teaches courses in General Chemistry, Physical Chemistry, and Introductory Chemistry. Dr. Barth also created and teaches a course on the Chemistry of Beer.\n\nCONTENTS\nPREFACE xi\nACKNOWLEDGMENTS xiii\nABOUT THE AUTHOR xvii\nPERIODIC TABLE OF ELEMENTS xviii\nPREFACE xi\nACKNOWLEDGMENTS xiii\nABOUT THE AUTHOR xvii\nPERIODIC TABLE OF ELEMENTS xviii\n1 INTRODUCTION 1\n2 WHAT IS BEER? 17\n3 CHEMISTRY BASICS 33\n4 WATER 69\n5 INTRODUCTION TO ORGANIC CHEMISTRY 89\n6 SUGARS AND STARCHES 113\n7 MILLING AND MASHING 131\n8 WORT SEPARATION AND BOILING 149\n9 FERMENTATION 161\n10 TESTS AND MEASUREMENTS 177\n11 THE CHEMISTRY OF FLAVOR 195\n12 THE CHEMISTRY OF BEER STYLES 211\n13 FOAM AND HAZE 225\n14 BEER PACKAGING 241\n15 BEER FLAVOR STABILITY 251\n16 BREWING AT HOME 265\nGLOSSARY 295\nINDEX 317","torrent":{"xt":"urn:btih:f6fcd8ace31f880cf39eb5f1dbfd579c54ee0a1e","amp;dn":"The+Chemistry+of+Beer+-+The+Science+in+the+Suds+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6fcd8ace31f880cf39eb5f1dbfd579c54ee0a1e","infoHashBuffer":{"type":"Buffer","data":[246,252,216,172,227,31,136,12,243,158,181,241,219,253,87,156,84,238,10,30]},"announce":[],"urlList":[]}}