{"title":"Aquaman (001 - 033 + Extras) (2011 - Ongoing) (Digital) (Empire)","uid":10745465,"size":1802861282,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:f714ce592aecb43ca289fbd00cdd74796af41194&amp;dn=Aquaman+%28001+-+033+%2B+Extras%29+%282011+-+Ongoing%29+%28Digital%29+%28Empire%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"nemesis43","files":39,"time":1407809459,"description":"Aquaman (001 - 033 + Extras) (2011 - Ongoing) (Digital) (Empire) \n\n\nA &quot;New 52&quot; initiative title starring Aquaman and Mera as they strive to find a new life on the surface. Written by Geoff Johns and drawn by Ivan Reis. After Reis resigned from the title during the &quot;THRONE OF ATLANTIS&quot; crossover, Paul Pelletier became the leading penciler. Aquaman's look has been redesigned by Jim Lee.\n\nWritten by: Geoff Johns (#0, 1-19, 21 - ongoing) John Ostrander (#20)\n\nDrawn by: Ivan Reis (#0, 1-13) Pete Woods (#14) Paul Pelletier (#15-19, 21-ongoing) Manuel Garcia (#20)\n\nThis new book continues with Aquaman's most popular origin of his father being a lighthouse keeper and his mother from an Atlantean royal family. Black Manta has not killed Aquaman's son, as he and Mera have no children yet; however Aquaman did kill Black Manta's father. Also, Ocean Master is still Aquaman's half-brother, although in a different origin. No longer do they have the same father but instead the same mother Atlanna, which means that Orm is also from the royal bloodline. We see Aquaman return to Amnesty Bay along with Mera. Greatly distressed by the harsh treatment given during the years from Atlantis, Aquaman decides to abdicate from his role as their King, returning to full-time heroics. However, he now struggles with his lack of reputation with the greater public, still seeing him as an inefficient, weak metahuman with useless powers, constantly subject to ridicule. Ocean Master, who is depicted to be the King of Atlantis, has only gone to the surface world twice and is believed to have sent Black Manta to steal the ancient Atlantean artifacts and relics. Having the fact the U.S missiles were manually launched near the city of Atlantis, Ocean Master waged war on the surface world carrying out the Atlantean War Plans, he and Aquaman created. In the aftermath of the war, Aquaman is again the rightful king of Atlantis and now trying to reconnect with the sea life as we'll as with the people of Atlantis, vowing to the sea life that he'll never fail them again. He's once again the King of the Seven Seas, trying to protect the aquatic life from any threat to the ocean and serve as a greater purpose for the Atlanteans; but will they accept his leadership?\n\nIn September 2013 DC is having all its books focus on the villains because of Trinity War and Forever Evil and number them '.1' and '.2'.\n\nThe 2 Villain books that are from Aquaman are\n\nAquaman #23.1 - Black Manta #1 (Written by Geoff Johns and Tony Bedard and Drawn by Claude St. Aubin)\n\nAquaman #23.2 Ocean Master #1 (Written by Geoff Johns and Sterling Gates and drawn by Geraldo Borges)","torrent":{"xt":"urn:btih:f714ce592aecb43ca289fbd00cdd74796af41194","amp;dn":"Aquaman+%28001+-+033+%2B+Extras%29+%282011+-+Ongoing%29+%28Digital%29+%28Empire%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f714ce592aecb43ca289fbd00cdd74796af41194","infoHashBuffer":{"type":"Buffer","data":[247,20,206,89,42,236,180,60,162,137,251,208,12,221,116,121,106,244,17,148]},"announce":[],"urlList":[]}}