{"title":"The Beatles - Let It Be (Deluxe 35mm Widescreen)","uid":9553483,"size":3711870214,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f7880430d4fd21dfc7527d97182f70815b6a5dde&amp;dn=The+Beatles+-+Let+It+Be+%28Deluxe+35mm+Widescreen%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"luvhandler","files":-1,"time":1391310126,"description":"The Beatles - Let It Be (Deluxe 35mm Widescreen Stereo Edition)\n\nThe filmed account of the Beatles's attempt to recapture their old group spirit by making a back to basics album, which instead drove them further apart.\n  &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0065976/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0065976/&lt;/a&gt;\n\nDirector: Michael Lindsay-Hogg\nStars: John Lennon, Paul McCartney, George Harrison, Ringo Starr\n\nFrom the web site info: \n\n\nLet It Be is a filmed documentary of the Beatles rehearsing and recording their new album in 1969.  The film culminated with a concert by the group set on the rooftop on their own Apple office building in London's west end.  Paul McCartney's concept for the album and film was that it wasn't going to have studio trickery like overdubs and effects.  It was &quot;back to the roots&quot; with the Beatles performing the songs in a natural way.  The film and it's accompanying soundtrack was delayed while the Beatles recorded and released their final album &quot;Abbey Road&quot;. \nIt was eventually released in 1970 and received an Academy Award for it's title song.\n\nFor the Beatles completist and serious fans, the biggest frustration has been in not finding the &quot;Beatles - Let It Be&quot; in a complete, uncropped, great quality version. The reason for this is quite interesting. The original film was shot in 16mm (standard TV 4x3 format).  However, when the film was released, they cropped the 16mm print by chopping off parts of the top and bottom and blew it up to 35mm widescreen. I myself wondered in the 70's why the picture quality was so mediocre right in the movie theatre!  Now we all know why.  So even in the theatre, one did NOT get to see the full picture that was filmed.\n\nThen to add insult to injury, when Let It Be was released in the 1980's on Beta and VHS videotape and on Laserdisc (all in standard TV 4x3 format), the manufacturers did NOT go back to the original 16mm film that was shot in the same format. INSTEAD, they sourced it from the 35mm widescreen theatre print and CHOPPED it AGAIN!, this time from the sides. So anyone purchasing previous Beta, VHS and Laserdisc versions of Let It Be, now got to see even LESS!, since it has now been chopped on all 4 sides.\n\nThis recent WIDESCREEN, STEREO import Blu-Ray release rectifies a lot of the problems.  For anyone that saw the film in the theatres in the 70's, it is great now to be able to see the original theatrical release, in stereo AND in much improved quality, including clearer picture and more natural colours, the absolute best version you can find of this release.\n\nQuality:  Very good quality, approximately an 8.5 (using our quality rating table located on our website).  Audio quality is very good to excellent and now mainly in STEREO!\n\nRunning Length: 80 minutes\n\n\nNote:\n\nSource: Blu-ray\n\nEncoded using TMPEGEnc 1980 x 1080, 6000 kbs, Stereo, mp4. \nSample included: Yes\n\nThis is a re-submitted torrent. I took a look at the last one and wasn't satisfied with the quality so I had the torrent deleted and redid the project leaving it at full resolution. \n\nBefore I deleted the torrent, this last comment was left: \n\t\nNCC86 at 2014-01-31 01:27 CET:\n\nDON'T WASTE YOUR TIME -- It isn't true widescreen, just zoomed in two or three times and cut to a 16:fish frame. If you want to see this take the copy of Let It Be you already have and tape paper to the screen. Done. (end of quote)\n\nluvhandler at 2014-01-31 06:40 CET:\n\nNCC86, a little more background from the liner notes of the actual copy I have (with clarifications):  \n\n&quot;This new transfer has been made from an original, undamaged, vhs (or videotape) recording of the BBC2 repeat from May 1982. Unusually, the Beeb screened the widescreen 35mm theatrical print with black bars at the top and bottom. When released on vhs and laserdics, this widescreen version was cropped severely at the sides to produce the full frame image. Here it is presented unaltered. \n\nAlthough the film was shot at 24 frames per second, BBC2 aired it in PAL format at 25fps. For this disc it has been slowed down to 23.976 fps (my ripped copy says 29.97) and presented in a compatible NTSC format, this preserving the correct speed and pitch of the original. The actual picture has been scaled up to 480 pixels and encoded in anamorphic format so as not to lose any resolution&quot; (end of quote). \n\nI have had the 4:3 versions and I can tell you that this version is a vast improvement, it is not &quot;zoomed in&quot;. Is it the same as an official release? No, but fat chance of that happening for a while: http://en.wikipedia.org/wiki/Let_It_Be_(film)\n\nBased on this feedback, I have included a sample with this torrent. If anyone thinks this might be a &quot;waste of time&quot;, download just the sample, and let others know what you think. If you like it, download away. \n\nConclusion: \n\nI am sure this is not an official copy so Boot the Bootleggers! Liberated bootleg, I bought, I share. I am happy to give back to this community. Be sure to seed as much as possible. My uploads are slow, no telling how long I can keep it going. Thanks!\t","torrent":{"xt":"urn:btih:f7880430d4fd21dfc7527d97182f70815b6a5dde","amp;dn":"The+Beatles+-+Let+It+Be+%28Deluxe+35mm+Widescreen%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7880430d4fd21dfc7527d97182f70815b6a5dde","infoHashBuffer":{"type":"Buffer","data":[247,136,4,48,212,253,33,223,199,82,125,151,24,47,112,129,91,106,93,222]},"announce":[],"urlList":[]}}