{"title":"Runtime GetDataBack NTFSFAT v4.30 (32&amp;64bit) with Key [iahq7","uid":7625748,"size":5389572,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f80efab14987601c9f040f3dc0985193e56fe311&amp;dn=Runtime+GetDataBack+NTFSFAT+v4.30+%2832%26amp%3B64bit%29+with+Key+%5Biahq7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":0,"uploader":"TorDigger","files":7,"time":1347427701,"description":"Runtime GetDataBack V4.30\n \nDo-it-yourself Data Recovery Software\n \nRecover your files from an NTFS/FAT drive when the data is no longer accessible due to formatting, fdisk, virus attack, power or software failure. Get everything back even when the drive's partition table, boot record, Master File Table or root directory is lost or corrupt.\n \nGetDataBack is more than an undelete or file recovery program or a system restore. \n\nGetDataBack will recover your data if the hard drive's partition table, boot record, FAT/MFT or root directory are lost or damaged, data was lost due to a virus attack, the drive was formatted, fdisk has been run, a power failure has caused a system crash, files were lost due to a software failure, files were accidentally deleted. GetDataBack can even recover your data when the drive is no longer recognized by Windows. It can likewise be used even if all directory information - not just the root directory- is missing. \n\nGet everything back, The safe and easy way.\n \nAdvanced algorithms make sure that all directories and sub directories are put together as they were, and that long file names are reconstructed correctly. GetDataBack is read-only, meaning the program will never attempt to write to the drive you are about to recover. Our software enables an inexperienced user to conduct their own data recovery by guiding them through three easy to understand steps. If you are an advanced user there are options to adjust the recovery process and improve the results\n \n\nSystem Requirements: \n\nPentium Processor - 32 MB RAM \nWindows 95, 98, ME, NT, 2000, XP, 2003, Vista or Windows 7\n \nHomepage: http://www.runtime.org/data-recovery-software.htm\n \nInstallation Instructions:\n \n1. Install Program as per requirement (FAT or NTFS)\n2. Rnu and merge &quot;Register&quot; Key files to register application according to your system (32 OR 64bit)\n3. Done, Enjoy.\n ","torrent":{"xt":"urn:btih:f80efab14987601c9f040f3dc0985193e56fe311","amp;dn":"Runtime+GetDataBack+NTFSFAT+v4.30+%2832%26amp%3B64bit%29+with+Key+%5Biahq7","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f80efab14987601c9f040f3dc0985193e56fe311","infoHashBuffer":{"type":"Buffer","data":[248,14,250,177,73,135,96,28,159,4,15,61,192,152,81,147,229,111,227,17]},"announce":[],"urlList":[]}}