{"title":"Pillars of Eternity-FLT","uid":11777808,"size":6795460608,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f8eed4d2c734e2e986ae6decb478b6016c7dd141&amp;dn=Pillars+of+Eternity-FLT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":1,"uploader":"extremezone","files":1,"time":1427402296,"description":" &lt;a href=&quot;http://i.imgur.com/C1e1hrj.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://i.imgur.com/C1e1hrj.jpg&lt;/a&gt;\n\nScreenCaps:\n &lt;a href=&quot;\nhttp://i.imgur.com/Fy5kb4W.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/Fy5kb4W.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://i.imgur.com/Lozw8lq.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/Lozw8lq.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://i.imgur.com/2yzfetc.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/2yzfetc.jpg&lt;/a&gt;\n\nPillars of Eternity-FLT\nPillars of Eternity (c) Paradox Interactive\n\nSupplied by: FAIRLIGHT              Release Date: 26/03/2015\nCracked by:  FAIRLIGHT              Game Type:    RPG\nPackaged by: FAIRLIGHT              Image Format: ISO\n\nDISCS: 1                            Protection: -\n\nSystem Requirements : Nobody knows\n\nGame information\n\nPillars  of  Eternity  is  a  role-playing  game  created  by  Obsidian\nEntertainment. The player controls the actions  of  a  hero  traversing  a\nvast, fantastical world alongside a team of  independent  characters.  The\ngame  was  created  with  the  financial  support  gathered  through  the\nKickstarter platform. The creators of  Baldur's  Gate,  Icewind  Dale  and\nFallout,  among  others,  were  involved  in  the  production  process\nProject Eternity is the first completely independent  game  from  Obsidian\nEntertainment. The developers decided to  use  the  experience  gained  in\nBlack Isle Studios and create  a  role-playing  game  combining  the  best\nfeatures of the genre  classics  such  as  Baldur's  Gate,  Icewind  Dale,\nPlanescape Torment,  and  Fallout.  Among  the  developers  are  Tim  Cain\n(Fallout, Arcanum, Temple of Elemental Evil), Josh  Sawyer  (Icewind  Dale\nand  Icewind  Dale  II,  Fallout:  New  Vegas),  Scott  Everts  (Fallout,\nPlanescape: Torment, Icewind Dale, Icewind Dale II, Fallout:  New  Vegas),\nBrian Menze (Planescape: Torment), and Dan Spitzley (Planescape: Torment\n\nThe plot of Project Eternity is set in a vast fantasy world.  The  players\ncan visit a number of  realms,  including  Ruins  of  Eir  Glanfath,  Free\nPalatinate of Dyrwood, Pearl Coast,  and  Lake  of  the  Drow  Tombs.  The\nvarious locations are characterized by considerable  diversity,  including\ndifferent kinds of opponents. While traveling, the  main  character  faces\nmany NPCs, some of which may give him a quest or, in some cases, join  his\nparty\n\nThe game is based on the classic role-playing game  genre  solutions.  The\ncreators decided to include real-time combat with the active pause  option\nwhich allows the players to stop the fight and carefully plan the  actions\ntaken by the party members. The game also features a character development\nsystem  based  on  the  experience  acquired  during  the  game,  and  a\nconsiderable assortment of weapons, armor, and items  that  you  can  buy,\nfind, or acquire\n\nGraphics of Pillars of Eternity refers to the classics of the  genre.  The\ngame offers an isometric view, characteristic of role-playing  games  from\nthe turn of the century (e.g. the Baldur's Gate and Icewind Dale sagas\n\nInstallation Information\n\nBurn or mount\nInstall\nPlay the game\n\nNOTE: As usual, block the game exe in your firewall\n\nNote: We need anything you can offer as early releases,seedboxes, source links,\naccounts, contact us on &lt;a href=&quot; http://torentz.3xforum.ro&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://torentz.3xforum.ro&lt;/a&gt;\nSeed Stats: 20-400 GiB at aprox 10 MiB/sec/20 slots per torrent\n\nHow To Get Your MAXSPEED (uTorrent)\n\nTorrent Client - Preferences - Bandwidth - Number of connections - Set aprox. 500 for each \nTorrent Client - Preferences - BiTorrent - Protocol Encryption - Forced\nBandwidth Allocation - High (Set download/upload limit - Unlimited)\nStop Other Active Torrents - Start downloading and wait for connections.\nEnjoy and Seed for at least 1:1 ratio. Don't forget to say thanks/leave reviews.\nFor more info,crack only,PATCH,serial,keygen,trainers,CRACKFIX,UPDATES,\nsystem requirements,cheats,NFO,gameplay trailers,free downloads,\npc iso,demos,screenshots,visit some RELEASE SITES or official web pages. \nIF the game does not work for you then update drivers, directX, components\nas netframework/redist files/etc, run as administrator, change compatibility\nmode, block/disable access to internet, copy crack/overwrite, other tweaks,upgrade pc,etc\nSearch on scene release websites for any future updates/working status/etc and \nother quality filesharing sites or just use this - other torrent search functions\nStop using stupid av's as AVG reporting false positive viruses-disable or use ESET","torrent":{"xt":"urn:btih:f8eed4d2c734e2e986ae6decb478b6016c7dd141","amp;dn":"Pillars+of+Eternity-FLT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8eed4d2c734e2e986ae6decb478b6016c7dd141","infoHashBuffer":{"type":"Buffer","data":[248,238,212,210,199,52,226,233,134,174,109,236,180,120,182,1,108,125,209,65]},"announce":[],"urlList":[]}}