{"title":"Vittorio De Sica - The Bicycle Thief (1948)","uid":3581092,"size":739992564,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fa08598f21d6a057b68a1537cd423a94936837f3&amp;dn=Vittorio+De+Sica+-+The+Bicycle+Thief+%281948%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"IggyPop","files":4,"time":1166713661,"description":"Ladri di biciclette / The Bicycle Thief\nDirected By : Vittorio De Sica\nLanguage : Italian\nSubtitles : English\n\n\n\nFile Name .............: Ladri di biciclette.avi\nFile Size (in bytes) ..: 734,228,480 bytes\nRuntime (# of frames) .: 01:32:55 (133666 frames)\n\nVideo Codec ...........: XviD\nFrame Size ............: 512x384 () [=] [=1.333]\nFPS ...................: 23.976\nVideo Bitrate .........: 935 kb/s\nBits per Pixel ........: 0.198 bpp\nB-VOP, N-VOP, QPel, GMC ......: [B-VOP]...[]...[]...[]\n\nAudio Codec ...........: 0x0055(MP3, ISO) MPEG-1 Layer 3\nSample Rate ...........: 48000 Hz\nAudio bitrate .........: 110 kb/s [2 channel(s)] VBR audio\nInterleave ............: 42 ms\nNo. of audio streams ..: 1\n\n\n\nAMG Review :\n    This landmark Italian neorealist drama became one of the best-known and most widely acclaimed European movies, including a special Academy Award as &quot;most outstanding foreign film&quot; seven years before that Oscar category existed. Written primarily by neorealist pioneer Cesare Zavattini and directed by Vittorio DeSica, also one of the movement&amp;#039;s main forces, the movie featured all the hallmarks of the neorealist style: a simple story about the lives of ordinary people, outdoor shooting and lighting, non-actors mixed together with actors, and a focus on social problems in the aftermath of World War II. Lamberto Maggiorani plays Antonio, an unemployed man who finds a coveted job that requires a bicycle. When it is stolen on his first day of work, Antonio and his young son Bruno (Enzo Staiola) begin a frantic search, learning valuable lessons along the way. The movie focuses on both the relationship between the father and the son and the larger framework of poverty and unemployment in postwar Italy. As in such other classic films as Shoeshine (1946), Umberto D. (1952), and his late masterpiece The Garden of the Finzi-Continis (1971), DeSica focuses on the ordinary details of ordinary lives as a way to dramatize wider social issues. As a result, The Bicycle Thief works as a sentimental study of a father and son, a historical document, a social statement, and a record of one of the century&amp;#039;s most influential film movements.\n    Though not the first Italian Neo-Realist film seen outside of Italy (or even Vittorio De Sica&amp;#039;s first Neo-Realist work), The Bicycle Thief (1948) is considered the seminal film of the movement, alongside Roberto Rossellini&amp;#039;s Rome, Open City (1945). Following the guiding Neo-Realist precept of drawing stories from the daily life of post-war Italy, De Sica and writer Cesare Zavattini carefully interweave a wider view of Italian culture with a portrait of the bond between a father and son, revealing the impact of poverty and bureaucratic absurdities on one of many struggling families. Shooting on location with non-professional actors in the two leads (well-coached by actor De Sica), De Sica&amp;#039;s mobile camera transforms moments of Antonio&amp;#039;s odyssey into poetic images of isolation and despair, while never losing sight of the gritty hardships of quotidian experience. An even greater international sensation than his first Neo-Realist film (Shoeshine (1946)), The Bicycle Thief earned a special Oscar for Best Foreign Film and became a signature work for a movement that also included Bitter Rice (1948), Luchino Visconti&amp;#039;s La Terra Trema (1948), and De Sica&amp;#039;s Umberto D. (1952). Inspiring filmmakers across the world as an alternative to expensive Hollywood fantasy, The Bicycle Thief revealed the potential power of combining local concerns with an unflinching cinematic style.\n\n\n\n********************************* FREAKYFLICKS **********************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing\ncinematic art in the digital era. Our goal is to disseminate such works of art\nto the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional\nrole in the history of cinema and its progression in becoming a great art. Films\nthat are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate\nin our community. All you need do is include this tag in your upload and join us\nat the forum to announce your release.\n\n\t\t &lt;a href=&quot;\thttp://www.freakyflicks.tk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\thttp://www.freakyflicks.tk&lt;/a&gt;\n\n\t\t &lt;a href=&quot;\thttp://freakyflicks.proboards54.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\thttp://freakyflicks.proboards54.com/&lt;/a&gt;\n\n&amp;#039;If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE&amp;#039;","torrent":{"xt":"urn:btih:fa08598f21d6a057b68a1537cd423a94936837f3","amp;dn":"Vittorio+De+Sica+-+The+Bicycle+Thief+%281948%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa08598f21d6a057b68a1537cd423a94936837f3","infoHashBuffer":{"type":"Buffer","data":[250,8,89,143,33,214,160,87,182,138,21,55,205,66,58,148,147,104,55,243]},"announce":[],"urlList":[]}}