{"title":"Doctor Who (2005) - Season 1-4 - BluRay 1080P-ShortbreHD","uid":9286116,"size":189025468945,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:fa7d516641a8ca1bd671725735b6a667528f183d&amp;dn=Doctor+Who+%282005%29+-+Season+1-4+-+BluRay+1080P-ShortbreHD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":40,"uploader":"UMe2","files":52,"time":1386019705,"description":"Doctor Who is a British science fiction television programme produced by the BBC. The programme depicts the adventures of a mysterious alien time-traveller known as &quot;The Doctor&quot; who travels in his space and time-ship, the TARDIS, which appears from the exterior to be a blue 1950s police box. With his companions, he explores time and space, solving problems, facing monsters and righting wrongs.\n\n_______________\n\nSeason 1 to 4\nResolution: 1920x1080\nSource: BluRay\nAudio: English\nSubtitles: None\nGroup: ShortbreHD\n\nNote: Season 1 though 4 have been produced in 576i 16:9 DTV format. For the BluRay release, the picture has been upscaled to 1080p. This is not a native 1080p production. However, it still looks better than the DVD release, because for the BluRay, a more modern codec has been used to compress the source material (h.264 vs. MPeG 2).\n\nIn my opinion, the 1080p release is to be preferred over the 720p release, since it doesn't make much sense to upscale the picture to 1080p and then back down to 720p (yes, you can see the difference).\n\nEnjoy.\n\nRules you need to accept to be allowed to download:\n1) No childish whining about download speed! It's a huge collection, it will take weeks to download. Deal with your anger and disappointment however you like, but do it quietly. If unable, shut up anyway and seek professional help. Chances are, that you will get this collection faster than you can watch it. If you want it faster, buy the BluRay discs.\n\n2) If you give this release a negative rating, post a comment and give a reason. And no: Negative ratings due to low download speeds are not allowed. Rate the content!\n\n3) Give back what you have taken from others. If you've downloaded 100 GB: Upload 100 GB.\n\nIf you don't accept my rules, don't download this. ","torrent":{"xt":"urn:btih:fa7d516641a8ca1bd671725735b6a667528f183d","amp;dn":"Doctor+Who+%282005%29+-+Season+1-4+-+BluRay+1080P-ShortbreHD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa7d516641a8ca1bd671725735b6a667528f183d","infoHashBuffer":{"type":"Buffer","data":[250,125,81,102,65,168,202,27,214,113,114,87,53,182,166,103,82,143,24,61]},"announce":[],"urlList":[]}}