{"title":"Criticism of the Western Civilization - C.52 (WW-I, WW-II 3)","uid":11750576,"size":206357861,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:faf56d56f9417a1566a97c224fc04d5abe095f50&amp;dn=Criticism+of+the+Western+Civilization+-+C.52+%28WW-I%2C+WW-II+3%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":1,"uploader":"moman73","files":35,"time":1426190625,"description":"Criticism of the Western Civilization - Collection 52 (WW-I, WW-II 3):\n\nWe have 35 titles here. Note that in the Torrent name the word &quot;Collection&quot; is replaced with &quot;C.&quot; because the name length is limited to 62 characters. \n\n-  Baker - Human Smoke; the Beginnings of World War II, the End of Civilization (2008)\n\n-  Bell - The Origins of the Second World War in Europe, 3e (2007)\n\n-  Best - Five Days That Shocked the World; Eyewitness Account from Europe at the End of World War II (2011)\n\n-  Burleigh - Moral Combat; a History of World War II (2010)\n\n-  Chickering et al (Eds.) - A World at Total War; Global Conflict and the Politics of Destruction, 1937-1947 (2005)\n\n-  Clark - The Sleepwalkers; How Europe Went to War in 1914 (2012)\n\n-  Clay - King, Kaiser, Tsar; Three Royal Cousins Who Led the World to War (2006)\n\n-  Deak - Europe on Trial; the Story of Collaboration, Resistance, and Retribution During World War II (2015)\n\n-  Doenecke - Nothing Less Than War; a New History of America's Entry into World War I (2011)\n\n-  Ferguson - The Abyss; World War I and the End of the First Age of Globalization (2012)\n\n-  Freemantle - Gas! Gas! Quick, Boys! How Chemistry Changed the First World War (2012)\n\n-  Furedi - First World War; Still No End in Sight (2014)\n\n-  Gluckstein - A People's History of the Second World War; Resistance Versus Empire (2012)\n\n-  Grimsrud - The Good War That Wasn't, and Why It Matters; World War II's Moral Legacy (2014)\n\n-  Harris - Blitz Diary; Life Under Fire in World War II (2010)\n\n-  Hasting - Inferno; the World at War, 1939-1945 (2011)\n\n-  Jenkins - The Great and Holy War; How World War I Became a Religious Crusade (2014)\n\n-  Kennedy - The Shock of War; Civilian Experience, 1037-1945 (2011)\n\n-  Lambert - Planning Armageddon; British Economic Warfare and the First World War (2012)\n\n-  Longmate - How We Lived Then; a History of Everyday Life During the Second World War (1971)\n\n-  Lowe - Inferno; the Devastation of Hamburg, 1943 (2007)\n\n-  Maiolo - Cry Havoc; How the Arm Race Drove the World to War, 1931-1941 (2010)\n\n-  Martel - The Month That Changed the World, July 1914 (2014)\n\n-  Mayhew - Wounded; a New History of the Western Front in World War I (2014)\n\n-  McMeekin - The Russian Origins of the First World War (2011)\n\n-  Merten - Forgotten Voices; the Expulsion of the Germans from Eastern Europe after World War II (2012)\n\n-  Oxlade - World War I; Secret History (2010)\n\n-  Plunkett - Death by Mustard Gas; How Military Secrecy and Lost Weapons Can Kill (2014)\n\n-  Preston - A Higher Form of Killing; Six Weeks in World War I That Forever Changed the Nature of Warfare (2015)\n\n-  Reynolds - The Long Shadow; the Legacies of the Great War in the Twentieth Century (2014)\n\n-  Shephard - The Long Road Home; the Aftermath of the Second World War (2010)\n\n-  Toland - The Last 100 Years; the Tumultuous and Controversial Story of the Final Days of World War II in Europe (2003)\n\n-  Warner - World War II; the Untold Story (1988)\n\n-  Wawro - A Mad Catastrophe; the Outbreak of World War I and the Collapse of the Habsburg Empire (2014)\n\n-  Zurbrugg (Ed.) - Not Our War; Writings against the First World War (2014)","torrent":{"xt":"urn:btih:faf56d56f9417a1566a97c224fc04d5abe095f50","amp;dn":"Criticism+of+the+Western+Civilization+-+C.52+%28WW-I%2C+WW-II+3%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"faf56d56f9417a1566a97c224fc04d5abe095f50","infoHashBuffer":{"type":"Buffer","data":[250,245,109,86,249,65,122,21,102,169,124,34,79,192,77,90,190,9,95,80]},"announce":[],"urlList":[]}}