{"title":"The Sand Pebbles (1966) (Steve McQueen, Candice Bergen)","uid":3949258,"size":819264649,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fb62f1aa31316501f3769dd6521fc0c838b1f778&amp;dn=The+Sand+Pebbles+%281966%29+%28Steve+McQueen%2C+Candice+Bergen%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":2,"uploader":"JayRay","files":-1,"time":1198735687,"description":"THE SAND PEBBLES - 1966\n\n  Following the success of The Sound of Music, director Robert Wise chose to film Robert McKenna's prize-winning 1962 novel, The Sand Pebbles--an ambitious choice for a director at the peak of his career. Shot in Taiwan and Hong Kong, the film combines historical sweep and intimate human drama in several parallel stories, all revolving around U.S. Navy machinist's mate Jake Holman (Steve McQueen). Holman is a skillful but fiercely independent sailor who joins the &quot;sand pebble&quot; crew of the U.S.S. San Pablo, a Navy gunboat patrolling the Yangtze River on the eve of the Chinese revolution in 1926. The San Pablo's inexperienced captain (Richard Crenna) obsessively defends the Navy's mission--however unnecessary or unwanted--to protect American missionaries and businessmen, blind to the more dangerous implications of American involvement with China's opposing political factions.\n\n  Holman is a defiant voice of humanity in this clash between outmoded values and inevitable change; his final line of dialogue (&quot;What the hell happened?&quot;) is a tragic summation of misguided policy, expressing the film's criticism of the Vietnam War. Rather than preach, however, Wise lets McKenna's potent drama emerge from finely-drawn relationships--between Holman and a young American teacher (19-year-old Candice Bergen, in her second film); between Holman and the Chinese &quot;coolie&quot; (Mako) whose heartbreaking fate transcends all issues of racial or political difference; and between crewmate &quot;Frenchy&quot; Burgoyne (Richard Attenborough) and the Chinese woman he's sworn to love and protect at all costs. Combined with the film's colorful supporting cast, adventurous scope, and climactic battle scenes, these personal dynamics bring substance and spirit to a complex story of good intentions gone awry.\n\n  This film was nominated for 8 Academy Awards, including &quot;Best Picture&quot;.\n\nNOTE: There is a 2 min. musical prelude before the movie actually starts.\n\n  Starring: Steve McQueen, Richard Attenborough, Richard Crenna, Candice Bergen, Emmanuelle Arsan.\n\n  Directed by: Robert Wise.\n\n  Quality: Very Good Xvid from DVD.\n\n  Length: 3hr. 2min.\n\n  Language: English.\n\n  Size: 720 x 336\n","torrent":{"xt":"urn:btih:fb62f1aa31316501f3769dd6521fc0c838b1f778","amp;dn":"The+Sand+Pebbles+%281966%29+%28Steve+McQueen%2C+Candice+Bergen%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb62f1aa31316501f3769dd6521fc0c838b1f778","infoHashBuffer":{"type":"Buffer","data":[251,98,241,170,49,49,101,1,243,118,157,214,82,31,192,200,56,177,247,120]},"announce":[],"urlList":[]}}