{"title":"A Discovery of Witches - Deborah E. Harkness-viny","uid":6424020,"size":1948229,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fb81d011acdc8de454029d5d7b3a14204fd2fb81&amp;dn=A+Discovery+of+Witches+-+Deborah+E.+Harkness-viny&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"daemonx0x","files":-1,"time":1306398886,"description":"A Discovery of Witches - Deborah E. Harkness-viny\n\nA richly inventive novel about a centuries-old vampire, a spellbound witch, and the mysterious manuscript that draws them together.\n\nDeep in the stacks of Oxford's Bodleian Library, young scholar Diana Bishop unwittingly calls up a bewitched alchemical manuscript in the course of her research. Descended from an old and distinguished line of witches, Diana wants nothing to do with sorcery; so after a furtive glance and a few notes, she banishes the book to the stacks. But her discovery sets a fantastical underworld stirring, and a horde of daemons, witches, and vampires soon descends upon the library. Diana has stumbled upon a coveted treasure lost for centuries-and she is the only creature who can break its spell.\n\nDebut novelist Deborah Harkness has crafted a mesmerizing and addictive read, equal parts history and magic, romance and suspense. Diana is a bold heroine who meets her equal in vampire geneticist Matthew Clairmont, and gradually warms up to him as their alliance deepens into an intimacy that violates age-old taboos. This smart, sophisticated story harks back to the novels of Anne Rice, but it is as contemporary and sensual as the Twilight series-with an extra serving of historical realism.","torrent":{"xt":"urn:btih:fb81d011acdc8de454029d5d7b3a14204fd2fb81","amp;dn":"A+Discovery+of+Witches+-+Deborah+E.+Harkness-viny","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb81d011acdc8de454029d5d7b3a14204fd2fb81","infoHashBuffer":{"type":"Buffer","data":[251,129,208,17,172,220,141,228,84,2,157,93,123,58,20,32,79,210,251,129]},"announce":[],"urlList":[]}}