{"title":"Batman - No Man's Land (Complete)","uid":4327402,"size":1154807930,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:fb95e92dc518b2829f52a4f092022b7fbc062147&amp;dn=Batman+-+No+Man%5C%27s+Land+%28Complete%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":13,"leechers":3,"uploader":"Wulvaine","files":136,"time":1217856373,"description":"This collection contains the COMPLETE No Man's Land arc, from Cataclysm To No Man's Land, spanning ALL the Batman family books and tie-ins. I did not scan these, many thanks to the original scanners. You people are brilliant.\n\nThe original layout of the torrent was rather messy, gave no indication which of the four segments of the arc came first, and had all the original titles as filenames, with a read order list included in each folder. I numbered the folders and renamed EVERY issue to this format:\n\n\nBatman - Cataclysm 001.cb*     ---     Batman - Cataclysm 018.cb*\n\nBatman - Aftershock 001.cb*     ---     Batman - Aftershock 016.cb*\n\nBatman - Road To No Man's Land 001.cb*     ---     Batman - Road To No Man's Land 012.cb*\n\nBatman - No Man's Land 001.cb*     ---     Batman - No Man's Land 087.cb*\n\n\nSince this was a crossover arc, this means that ALL books, regardless of title or main character, are grouped under the same name for the sake of flow. What was a muddled mess of Azrael #**s and Nightwing (v2) #**s and Shadow Of The Bat #**s is now a neatly organized collection for easy reading purposes. I made it so that when you finish an issue, you don't have to go dig through a read order text file and then muck about in the folder looking for the issue you want. You just read the next issue. If you don't like this, you can go find the original torrent I downloaded that has all original names intact. If you're downloading this for archival and not to read, this will probably annoy you. :)\n\nThe read order is based on four text files included in the original, so numbering is unfortunately entirely at the mercy of the previous uploader. So long as he/she had it all correct, this torrent will be correct. Also, some files in the read order lists were marked with a .5 after their number, like 71, 72.5, 73. THESE HALF-NUMBERS HAVE BECOME FULL ONES. This is because most .cb* readers automatically load the next highest numbered file in the folder.\n\nAs always, if you like it, PLEASE buy the trades. These writers and artists put unbelievable amounts of work into this, and they deserve to be compensated. If that isn't enough for you (in which case you would be a selfish punk), then remember that if it isn't supported it will stop being produced. However, one of the reasons this collections is being provided is that the trades are incomplete; missing about half of the actual comic book issues that comprise the story. We've got it all. ;)","torrent":{"xt":"urn:btih:fb95e92dc518b2829f52a4f092022b7fbc062147","amp;dn":"Batman+-+No+Man%5C%27s+Land+%28Complete%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb95e92dc518b2829f52a4f092022b7fbc062147","infoHashBuffer":{"type":"Buffer","data":[251,149,233,45,197,24,178,130,159,82,164,240,146,2,43,127,188,6,33,71]},"announce":[],"urlList":[]}}