{"title":"Lou Reed - Walk On The Wild Side - The Best Of Lou Reed TQMP","uid":4781086,"size":253525119,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fd22d07e46cf3f9f1ac394704b75a87c842cb696&amp;dn=Lou+Reed+-+Walk+On+The+Wild+Side+-+The+Best+Of+Lou+Reed+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"zootallure","files":22,"time":1237388139,"description":"Lewis Allan &quot;Lou&quot; Reed is an American rock musician best known as the guitarist, vocalist and principal songwriter of The Velvet Underground as well as a successful solo artist whose career has spanned several decades. The band gained little mainstream attention during their career, but became one of the most influential of their era. As the Velvet Underground's main songwriter, Reed analyzed subjects of personal experience that rarely had been examined so openly in rock and roll, including a variety of sexual topics and drug culture and use. As a guitarist, he was a pioneer of many guitar effects including distortion, high volume feedback, and nonstandard tunings.\n\nReed began a long and eclectic solo career in 1971. He had a hit the following year with &quot;Walk on the Wild Side&quot;, though for more than a decade he seemed to wilfully evade the mainstream commercial success its chart status offered him. One of rock's most volatile personalities, Reed's work as a solo artist has frustrated critics wishing for a return of The Velvet Underground. The most notable example is 1975's infamous double LP of recorded feedback loops, Metal Machine Music, upon which Reed later commented: &quot;No one is supposed to be able to do a thing like that and survive.&quot; By the late 1980s, however, he had garnered recognition as an elder statesman of rock.\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health:-)","torrent":{"xt":"urn:btih:fd22d07e46cf3f9f1ac394704b75a87c842cb696","amp;dn":"Lou+Reed+-+Walk+On+The+Wild+Side+-+The+Best+Of+Lou+Reed+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd22d07e46cf3f9f1ac394704b75a87c842cb696","infoHashBuffer":{"type":"Buffer","data":[253,34,208,126,70,207,63,159,26,195,148,112,75,117,168,124,132,44,182,150]},"announce":[],"urlList":[]}}