{"title":"Microsoft Windows 10 Enterprise Technical Preview 6.4.9879 [x64]","uid":11456070,"size":4034815900,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:fd8f32da516a1ee546d577ab81a6eaf2675bcffd&amp;dn=Microsoft+Windows+10+Enterprise+Technical+Preview+6.4.9879+%5Bx64%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":3,"uploader":"OnlyByTheRain","files":2,"time":1415935427,"description":"[b]Microsoft Windows 10 Enterprise Technical Preview 6.4.9879[/b]\n[img]http://i.imgur.com/x6kTfPP.jpg[/img]\n\n[b]Software Version: 6.4 Build 9879 Official \nwebsite: Microsoft \nLanguage: English \nTreatment: not required \n\nSystem requirements:\n\n\n\nProcessor: 1 GHz or faster\n\nRAM: 1 GB (32-bit) or 2 GB (64-bit)\n\nDisk space: 16 GB free space\n\nGraphics card: Microsoft DirectX 9 graphics device, with WDDM driver\n\nScreen resolution: 1024 x 768\n\nA Microsoft account and Internet access\n\nDescription: The new version of the popular operating system from Microsoft called Windows 10, although the previous major release was called Windows 8. Go directly to the Windows 10 reflects the company's desire to distance itself from the not very popular previous version. Owned therefore, was reportedly skipped ninth version: the transition from eighth to tenth immediately called to represent a huge step forward, to a focus on the Internet and mobile users. In Microsoft Windows 10 was called &quot;the most powerful platform in history.&quot; The presenter vice president of Microsoft in operating systems Terry Meyerson said that Windows 10 is installed on a wide variety of devices of different types as compared to previous versions. Some of these devices, according to the presentations, now includes not only desktops, laptops and tablets, but also smart phones, and TVs.\n\nAdditional Information:\nAs expected, Microsoft has taken the path of further unification of software platforms for their devices. Â«Windows 10 is suitable for any device - be it Xbox, computer, phone, tablet, or any other gadget. For all these devices, Microsoft creates a single development platform and a single app store &quot;- the report says the company.\n\nMicrosoft said that Windows 10 is also suitable for devices in the framework of the &quot;Internet of Things&quot; and for enterprise data centers, regardless of the size of the screen and generally the presence of the display as well as the method of data entry. This is a rather unusual decision, as the developers of other popular platforms - in particular, Apple and Google - hold separate approach to operating systems for different types of devices.\n\nAmong the key changes - Returns &quot;Start&quot; menu in the extended version, with which users can view lists of frequently used files and programs, and a new button control tasks, which allows you to see all open applications and files, and quickly switch between them. In a string of problems and &quot;Start&quot; menu search string returned.\n\nApplications from Windows Store is now open in the same format as the usual desktop Windows-software - Microsoft calls this feature &quot;universal windows.&quot; The user can change the size of the windows, move them around the screen and control their activity in a single click.\n\nMicrosoft has also improved the function of multitasking - Snap tool now lets you work with 4 applications simultaneously and tells you how it is better to place on the screen. Company Forecasts and added support for virtual desktops. User can create virtual desktops for different purposes - such as work, school, personal life - and switch between them.\n\nIT-experts will be able to download a preview version of Windows 10 for testing from October 1, and then receive updates as they are released and share their responses with the developers of Microsoft. However, the top manager Joe Belfiore in the video on the technical version of Windows 10 stressed that it &quot;raw&quot; and is not intended for inexperienced users. The final version of the company intends to issue already in 2015\n\nThe main features of Windows 10:\nThe uniform for all Windows devices. Windows 10 will be installed on a wider range of devices than previous versions of OC. Some of these devices include not only personal computers, laptops, tablets, and smart phones, televisions, various boards and industrial devices used for scripting Internet of Things. New OC will also be a single platform for application development and a single channel application delivery through the store.\n\nImproved user interface. The interface of the operating system on the one hand, remained familiar, on the other hand, has gained several new features. \n&quot;Start&quot; menu. Opens when you click on the logo in the lower left corner of the desktop. In the left column of the menu contains shortcuts to the most recent applications running in the right - tile universal applications. The menu also contains the buttons for power management and update the search function to search not only on the local system, but also on the Internet.\n\nUniversal application windows. Now the classic applications for the desktop and the new universal applications run in its own window on the desktop. \nImproved Snap. Work in multiple applications at once it became easier and more convenient. Now Snap feature allows you to open up to 4 applications simultaneously on the screen, and Windows tells what other applications are running and how they can be placed. Windows 10 will help to make better use of the screen unallocated space for other applications.\n\nA lot of desktops. You can create multiple desktops and place them on the application window. You can display all created tables on the screen and switch between them.\n\nMultitasking. On the taskbar, a new button Task View. When you click on it, appear on the screen in a reduced form of the window all the running applications.\n\nSpecial attention to business users and data. When you create a Windows 10, special attention was paid to corporate users. The new OS will be compatible with all conventional control systems that use the organization. The operating system provides new opportunities for the separation of workers and the personal data on devices of all types, which will embody the concept of BYOD in organizations.\n\nMicrosoft has just released the second update for Windows 10 Technical Preview, making new features and Improvements available for registered members WHO for the Windows Insider Program.\n\nJust like it WAS the Case with the first Windows 10 Technical Preview update, the new version is available via Update the integrated system, so no input is required Other, as All Improvements are downloaded and installed automatically. \nJust like it WAS rumored in the Last few days, the new Windows 10 TP build comes with improvements based on consumer feedback and includes options that are supposed to make it easier for users to work on the desktop.\nWhat's new in Windows 10 Technical Preview build 9879:\nFirst and foremost, the new Windows 10 build comes with options to hide and show the Task view and the Search buttons on the taskbar, two of the features that were initially released as part of the original 9841 Technical Preview version in early October.\n\nMicrosoft says that it received plenty of requests in this regard, so users now have dedicated options to disable them by simply right-clicking the taskbar.\n\n&quot;One of your top suggestions really made an impact on our designs for the taskbar,&quot; Microsoft stated, trying to emphasize that consumer feedback played a decisive role this time.\n\nAt the same time, Microsoft also introduced new windows animations that work smoother on all computers, as some complained that the original effects were a bit annoying. A new button for Charms that adopts the &quot;hamburger&quot; design is also available in Metro apps, thus replacing the original three-dot symbol.\n\nOne of the improvements that have already been spotted in internal builds is finger gesture support and with this new release, the feature finally becomes available to everyone. Here are the supported gestures for now:\n3 finger up -&gt; Task View \n3 finger down -&gt; Show Desktop \n3 finger flick to left or right -&gt; switches to previous app (go back 1) \n3 finger move left or right -&gt; Alt-Tab (Task View) pops up and you can select the app you want (remove fingers to select) \n3 finger tap -&gt; Search\nOneDrive also comes with significant improvements, so now you can right-click the OneDrive folder and configure settings such as auto save, folders synced offline and many others.\n\nLast but not least, Microsoft also introduced the smiley-based feedback system in Internet Explorer that was first spotted a few days ago in leaked photos, as well as native MKV support which was already there since build 9860 but with some bugs.\n\nSome new icons are also available, and so are options to pin your favorite folders to the Home section in File Explorer.\n\nMicrosoft also says that it fixed tons of bugs that users found after the release of Windows 10 Technical Preview build 9860, so lots of changes have been made under the hood for better performance.\n\nChecksums:\n9879.0.141103-1722.FBL_RELEASE_CLIENTENTERPRISE_VOL_X86FRE_EN-us.ISO\nCRC32: 79328FB5 MD5: 389B742F790F718519E0EEF68E7425BD SHA-1: 723BC36878E41C91ECED2B12FC667B9DBD101C94\n\n9879.0.141103-1722.FBL_RELEASE_CLIENTENTERPRISE_VOL_X64FRE_en-us.ISO\nCRC32: AD11C6F1 MD5: 4F0BB7D1814B07597C13C39AA70544E3 SHA-1: 9D56F7FBFF03D0C08B053D40E31786C8394E5A4C\n\nProduct Key:\n\nPBHCJ-Q2NYD-2PX34-T2TD6-233PK\n\nThe Trial expires April 15, 2015[/b]\n\n &lt;a href=&quot;\nhttp://savepic.ru/6248228.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://savepic.ru/6248228.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://savepic.ru/6237988.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://savepic.ru/6237988.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://savepic.ru/6235940.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://savepic.ru/6235940.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://savepic.ru/6242084.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://savepic.ru/6242084.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://savepic.ru/6240036.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://savepic.ru/6240036.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:fd8f32da516a1ee546d577ab81a6eaf2675bcffd","amp;dn":"Microsoft+Windows+10+Enterprise+Technical+Preview+6.4.9879+%5Bx64%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd8f32da516a1ee546d577ab81a6eaf2675bcffd","infoHashBuffer":{"type":"Buffer","data":[253,143,50,218,81,106,30,229,70,213,119,171,129,166,234,242,103,91,207,253]},"announce":[],"urlList":[]}}