{"title":"CBT Nuggets - EC-Council Certified Ethical Hacker CEHv8.0 EnCod3","uid":11220327,"size":1041224488,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:fdc32a1fb961d12abc3ee9d58bf78efbafeedaba&amp;dn=CBT+Nuggets+-+EC-Council+Certified+Ethical+Hacker+CEHv8.0+EnCod3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":12,"leechers":5,"uploader":"metal.run","files":33,"time":1413331280,"description":"This Certified Ethical Hacker v8.0 video training course with James Conrad covers how to legally protect against hacker security breaches, including virtualization, reconnaissance, footprinting, social engineering, scanning, sniffing, cryptography, and more. \n\nRecommended skills:\nFamiliarity with Windows of all versions back to Windows XP and Windows Server 2003\nFamiliarity with Linux is not necessary but recommended (a video early in the course provides basic Kali Linux training that is sufficient for the learner to complete the course)\n\nRecommended equipment:\nWhatever equipment is being used to view the videos (except a smartphone or tablet) is sufficient to create a basic lab environment in which the learner can mirror demonstrations in the videos. This would also require installation of any virtualization software such as Parallels, VMware, Hyper-V, or VirtualBox.\nHigh-speed internet is recommended to download Kali Linux and some of the additional tools.\n\nRelated certifications:\nNone\n\nRelated job functions:\nNetwork Administrator\nSystems Administrator\nSystems Engineer\nHelp Desk\n\nMost IT professionals are far too busy with daily tasks and projects to commit themselves to a serious study of security. Problem is, hackers are quite serious about your security and how to exploit it. If a security breach occurs at a company, it can cost millions of dollars, the loss of a priceless reputation, private customer information, and the very jobs of the IT professionals who often get blamed for weak security practices. One of the best ways to ensure good security is to know what hackers do to circumvent it. Security concepts and facts alone do not protect your systems. However, knowledge and experience in exactly how hackers exploit weaknesses will help you to potentially avoid embarrassing security breaches in the future. \n\nNote: Buy if you like them\n\nFor more Visit : http://www.cbtnuggets.com/it-training-videos/course/ecc_ehack_v8","torrent":{"xt":"urn:btih:fdc32a1fb961d12abc3ee9d58bf78efbafeedaba","amp;dn":"CBT+Nuggets+-+EC-Council+Certified+Ethical+Hacker+CEHv8.0+EnCod3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fdc32a1fb961d12abc3ee9d58bf78efbafeedaba","infoHashBuffer":{"type":"Buffer","data":[253,195,42,31,185,97,209,42,188,62,233,213,139,247,142,251,175,238,218,186]},"announce":[],"urlList":[]}}