{"title":"Rampant Design Tools-Cinematic Flares","uid":9130190,"size":5653806274,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:fe2b3f64580603d6d2d101a33ad89abc6412ea23&amp;dn=Rampant+Design+Tools-Cinematic+Flares&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":3,"uploader":"gfx3dro","files":101,"time":1383298239,"description":"100 1080P HD (1920Ã—1080) royalty-free Quicktime Movies of flare effects for video. Rampant Cinematic Flares instantly adds a dynamic look to your creations. These elements allow you to effortlessly take your video up a notch. Great for editors, compositors, and motion graphics artists. Drag and Drop Quicktime based Flare Effects, Light Effects and Edge Lighting for Video. Works with all Visual Effects Plugins and Software. Works in all NLEs. Instantly add a flare effect to your video project without rendering. Available for immediate download.\n\nRampant Cinematic Flares is designed to save you time and money. Powerful drag and drop flare effects for editors. Easily add a slick and modern look to your video. Rampant Cinematic Flares consists of 100 Quicktime movie files and is compatible with any Editing or Compositing software that can read Quicktime movies like Adobe After Effects, Adobe Premiere, Final Cut Pro, FCPX, Sony Vegas, Apple Motion, Nuke, Media 100 and many more. Rampant Cinematic Flares is compatible with both Mac and PC Operating Systems running Quicktime. Perfect for editors, motion graphics, compositing, visual effects, titles and more. These 100 High Definition elements offer a modern and easy to use option for busy editors and artists. Instantly add a bold style to your video. With 100 elements to mix and match, The Rampant Cinematic Flares volume has virtually endless possibilities. Rampant Cinematic Flares enhances your video and makes your project stand out.\n\nWATCH DEMO\n &lt;a href=&quot;\nhttp://moevideo.net/video/82657.86ed932a9287056e730df75d48de&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://moevideo.net/video/82657.86ed932a9287056e730df75d48de&lt;/a&gt;","torrent":{"xt":"urn:btih:fe2b3f64580603d6d2d101a33ad89abc6412ea23","amp;dn":"Rampant+Design+Tools-Cinematic+Flares","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe2b3f64580603d6d2d101a33ad89abc6412ea23","infoHashBuffer":{"type":"Buffer","data":[254,43,63,100,88,6,3,214,210,209,1,163,58,216,154,188,100,18,234,35]},"announce":[],"urlList":[]}}