{"title":"[Comics] The Invisibles","uid":4688012,"size":749831386,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:fe8497ae658b637d3b8315168365ca558e48e455&amp;dn=%5BComics%5D+The+Invisibles&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"yobar23","files":69,"time":1233301303,"description":"--------------------------------------------------------------------------------\n\nA collection of Grant Morrison's &quot;The Invisibles&quot; comics. I cleaned up the directories and converted the file names so they are more easily read with CDislpay's Comic Reader for Windows, which can be found here:\n &lt;a href=&quot;\nhttp://www.geocities.com/davidayton/CDisplay&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.geocities.com/davidayton/CDisplay&lt;/a&gt;\n\nThe files can also be viewed as rar (cbr) or zip (cbz) files.\n\n--------------------------------------------------------------------------------------\n\nFrom Rotten.com:\n\nWhat if every conspiracy theory you ever heard was true?\n\nNo, wait, what if every crackpot idea you ever heard, conspiracy or\nnot, was true?\n\nNo, no, wait! What if every idea, period, you ever heard was true?\n\nIf you can stretch your brain around that concept, you would probably\nenjoy comic book auteur Grant Morrison's epic series, &quot;The\nInvisibles.&quot;\n\nThe Invisibles is a mind-blowing mix of drugs, occultism, UFOs,\nvoodoo, sexual excess, Witchcraft, sadomasochism, body modification,\nmovies, government conspiracies, Lovecraftian horror, numerology,\nGnostic cosmologies, anarchy, Mad Science, time travel, superheroes,\nFreemasonry, the Apocalypse, plus some stuff that's just plain weird.\n\nCharacters appearing in the story include (among others):\n\n* A foul-mouthed messiah from Liverpool.\n* A heavily pierced assassin, who moonlights as a horror novelist and ontological terrorist.\n* A Brazilian transvestite Shaman.\n* John Lennon.\n* A clown-faced, red-haired sex goddess.\n* A billionaire playboy who may or may not be Bruce Wayne.\n* The Marquis de Sade.\n* William Butler Yeats.\n* Percy and Mary Shelley (author of Frankenstein).\n* Jesus Christ (sort of).\n* Robert Oppenheimer.\n* The Roswell aliens.\n* A lesbian with an eye patch.\n* A rap-star voodoo houngan.\n* Princess Di.\n\nThe Invisibles is named for the secret society to which our heroes,\nsuch as they are, belong. The comic series was published from 1994 to\n2000, with collected editions coming after. Issues of The Invisibles\nwere kept on the set of The Matrix during filming, a fact which would\nbe apparent to anyone who's familiar with both.\n\nThe story... well, the story is better experienced than summarized,\nbut it has to do with the nature of the universe and the meaning of\nlife. There's kind of a substructure that deals with the whole &quot;good\nvs. evil&quot; dilemma, but not in the usual way. Religion is\ndeconstructed, reality is warped, and it's difficult to tell the good\nguys from the bad guys. The Apocalypse also makes an appearance.\n\nThe Invisibles is also designed to change the reader, so be\nforewarned. If you stick with it, by the end you might find that it's\nless fiction than it is biography... Your biography.\n","torrent":{"xt":"urn:btih:fe8497ae658b637d3b8315168365ca558e48e455","amp;dn":"%5BComics%5D+The+Invisibles","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe8497ae658b637d3b8315168365ca558e48e455","infoHashBuffer":{"type":"Buffer","data":[254,132,151,174,101,139,99,125,59,131,21,22,131,101,202,85,142,72,228,85]},"announce":[],"urlList":[]}}