{"title":"Philip Marlowe Complete Collection - Raymond Chandler","uid":8992544,"size":2501060,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ff1906e64686e767f727d4131bc46490b17b0289&amp;dn=Philip+Marlowe+Complete+Collection+-+Raymond+Chandler&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1380820575,"description":"Raymond Thornton Chandler was an American author of crime stories and novels of immense stylistic influence upon modern crime fiction, especially in the style of the writing and the attitudes now characteristic of the genre. His protagonist, Philip Marlowe, is synonymous with &quot;private detective,&quot; along with Dashiell Hammett's Sam Spade. \nWhen Raymond Chandler died in 1959, he left behind an unfinished Philip Marlowe novel. Now, Poodle Springs has become a complete work, thanks to the inspired writing of Robert B Parker, the foremost contemporary exponent of the Chandler style.\n\n\n\nThe Big Sleep: The novel was an instant success when first published in 1939. It centers around a paralyzed California millionaire with two psychopathic daughters; he involves Marlowe in a case of blackmail that turns into murder.\n\nFarewell, My Lovely: Chandler regarded this as his finest work, it came out one year after The Big Sleep. It has Marlowe dealing with the Los Angeles gambling circuit, a murder he stumbles upon, and three very beautiful but potentially deadly women.\n\nThe High Window: Raymond Chandler's gripping novel is set in the California underworld, where Philip Marlowe searches for a priceless gold coin and finds himself deep in the tangled affairs of a dead coin collector.\n\nThe Lady in the Lake: Private detective Philip Marlowe is looking for the missing wife of Derace Kingsley. Is she dead or not? And is she the lady in the lake?\n\nThe Little Sister: Chandler's fifth novel has Philip Marlowe going to Hollywood as he explores the underworld of glitter capital, trying to find a sweet young thing's missing brother. In deep with a rising movie star, her blackmailing brother, agents, prostitutes, and studio heads, Marlowe sardonically takes on the interlocking levels of Hollywood society.\n\nThe Simple Art of Murder: An essay on detective fiction accompanies eight stories about a politician's murder, a hotel detective, missing pearls, and gangsters.\n\nThe Long Goodbye: Raymond Chandler's ingenious novel finds Philip Marlowe constantly on the move with a case involving a war scarred drunk and his nymphomaniac wife. A psychotic gangster's on his trail; he's in trouble with the cops, and an unequaled number of corpses turns up.\n\nPlayback: Philip Marlowe receives a mysterious assignment to meet the Super Chief and follow one of its passengers, but the case soon leads to murder.\n\nPoodle Springs (with Robert B Parker): Philip Marlowe marries a rich, beautiful society lady who wants him to settle down. But old habits die hard, and Marlowe soon is back in business, enmeshed in a case involving pornography, bigamy, and murder. ","torrent":{"xt":"urn:btih:ff1906e64686e767f727d4131bc46490b17b0289","amp;dn":"Philip+Marlowe+Complete+Collection+-+Raymond+Chandler","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff1906e64686e767f727d4131bc46490b17b0289","infoHashBuffer":{"type":"Buffer","data":[255,25,6,230,70,134,231,103,247,39,212,19,27,196,100,144,177,123,2,137]},"announce":[],"urlList":[]}}