{"title":"[Divx ITA] Sonatine (Takeshi Kitano)","uid":5177916,"size":727048192,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ff3b395fe644ffaefdb18c34c2bf71ffa756d4fb&amp;dn=%5BDivx+ITA%5D+Sonatine+%28Takeshi+Kitano%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"black mamba TNT","files":-1,"time":1259079517,"description":"Scheda del film:\n\nTitolo originale: Sonatine\nNazionalitÃƒÂ : Giappone\nAnno: 1993\nGenere: Azione\nRegia: Takeshi Kitano\nProduzione: Masayuki Mori, Hisao Nabeshima, Takio Yoshida.\nDistribuzione: Lucky Red\nData di uscita: 23 Giugno 2000 (cinema)\nCast: Takeshi Kitano,\nAya Kokumai,\nTetsu Watanabe,\nRen Osugi,\nTonbo Zushi,\nKenichi Yajima.\n\n\n\nTrama:\n\nStanco della vita da mafioso, Murakawa decide di ritirarsi dagli affari, ma inaspettatamente il suo capo lo costringe ad un ultima missione nell'isola di Okinawa, dove dovrÃƒÂ  regolare un conflitto tra due bande rivali. La missione perÃƒÂ² si rivelerÃƒÂ  una trappola.\n\n\n\nRecensione:\n\nDopo una vita piena di rischi, Murakawa (Takeshi Kitano, &quot;L'estate di Kikujiro&quot;, &quot;Hana - bi&quot;) non ha piÃƒÂ¹ interesse per la vita degli yakuza. PerÃƒÂ² il suo capo Kitajima (Tonbo Zushi) lo convince a partire per regolare un conflitto tra due bande rivali. Murakawa parte portandosi appresso alcuni suoi uomini, ma si accorge presto che non avrebbe dovuto accettare l'incarico; la sua presenza viene accolta come una provocazione dalla gang rivale che con una carica di dinamite uccide subito due del gruppo. Alcuni uomini di Murakawa tornano a casa terrorizzati, mentre durante una sparatoria in un bar il gruppo continua a perdere pezzi. A questo punto Murakawa e i sopravvissuti, rendendosi conto di essere vittime di un complotto, si rifugiano in una casa abbandonata in una spiaggia. Ma proprio quando sembra essere tutto a posto, accade qualcosa...\nPer questo film, peraltro programmato anche in televisione visto che la sua data al cinema risale addirittura al '93 Takeshi Kitano incarna quattro funzioni: protagonista, regista, sceneggiatore e montatore. Quando &quot;Sonatine&quot; era uscito per la prima volta Kitano era stato considerato un geniale autore di film con molta violenza salvo poi apprezzarlo soprattutto per la sua dose di umorismo e per la predilezione per i disperati. Anche in questo film vengono mescolate tenerezza e crudeltÃƒÂ , innocenza infantile e ferocia, vita e morte e il protagonista ÃƒÂ¨ un uomo ripetutamente esortato a farsi avanti, costretto ad evitare una serie di trappole che ostacolano il suo cammino.\nCon &quot;Sonatine&quot; Kitano aveva vinto il festival di Taormina nel '93 e da molti questo ÃƒÂ¨ considerato il suo autentico capolavoro.\n\n\n\nScheda tecnica del DivX:\n\nDimensione: 693 MB (or 710,008 KB or 727,048,192 bytes)\nDurata: 01:28:29\n\nVideo Codec: DivX 5.0\nVideo Bitrate: 965\nRisoluzione: 720 x 384\nFPS (Frames/sec):25.000\nQF (Frame quality): 0.140\n\nAudio Codec: 0x0055(MP3, ISO) MPEG-1 Layer 3 VBR\nAudio Bitrate: 125 kb/s total (2 chnls)\nFreq Audio: 44100Hz\n","torrent":{"xt":"urn:btih:ff3b395fe644ffaefdb18c34c2bf71ffa756d4fb","amp;dn":"%5BDivx+ITA%5D+Sonatine+%28Takeshi+Kitano%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff3b395fe644ffaefdb18c34c2bf71ffa756d4fb","infoHashBuffer":{"type":"Buffer","data":[255,59,57,95,230,68,255,174,253,177,140,52,194,191,113,255,167,86,212,251]},"announce":[],"urlList":[]}}