{"title":"Bellydance for Core Fitness - A Belly Dance Workout","uid":8321945,"size":1151852591,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:ffc078c90e85a350670b0fb5b550cc9ae67bfd1f&amp;dn=Bellydance+for+Core+Fitness+-+A+Belly+Dance+Workout+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":11,"leechers":0,"uploader":"sara_melika","files":3,"time":1364699292,"description":"Bellydance is an amazing art and one of the world's oldest fitness disciplines.Ã‚  Bellydance emphasizes movements of the abdomen and pelvis, and is an ideal way to develop deep abdominal core strength.Ã‚  Passed down from mother to daughter, this ancient celebratory dance became the traditional method for imparting body awareness, techniques of posture and movement, both natural and beneficial to the female body, as well as preparation for and recovery from childbirth. \nIn our age of sedentary lifestyles and stress-induced back pain, the bellydance fitness program developed by New York dancer and dance movement researcher, Ayshe, will help you regain and maintain abdominal core awareness and strength, an important step toward healthy and graceful posture, back pain relief, and safer ways to move your body. \n\nBellydance Core Fitness Workout flows from a warmup and isolations that engage your core muscles, to dance combinations and a beautiful dance routine. \n\nEvery movement in the workout has a name that can be referenced in the tutorial section, where each is carefully explained. The tutorial section contains a 1 hour 40 min. in-depth presentation by Ayshe, explaining the roles of the core muscles in the anatomy of dance movement, and their impact on our health and postural habits. \n\nIn this program we focus on the abdominal core muscles that span the lower spine, pelvis, and legs. Of main importance are the psoas andÃ‚ iliacus (iliopsoas), the key muscles for structural balance in the human body. The balanced fully-functional psoas is crucial for women's health.Ã‚  If the psoas isÃ‚ in a state of contraction or atrophy it will affect the reproductive system by restricting blood supply and disrupting the positioning of the organs within the pelvis.Ã‚  Menstrual cramping is often caused by the psoas exerting pressure on the reproductive organs when they are in a state of tenderness.Ã‚  A healthy, released psoas will bring relief from cramping and lower back pain. \n\n","torrent":{"xt":"urn:btih:ffc078c90e85a350670b0fb5b550cc9ae67bfd1f","amp;dn":"Bellydance+for+Core+Fitness+-+A+Belly+Dance+Workout+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffc078c90e85a350670b0fb5b550cc9ae67bfd1f","infoHashBuffer":{"type":"Buffer","data":[255,192,120,201,14,133,163,80,103,11,15,181,181,80,204,154,230,123,253,31]},"announce":[],"urlList":[]}}